notStoreMangerForComponent=\u30B3\u30F3\u30DD\u30FC\u30CD\u30F3\u30C8 %s \u306B CMP Store Manager \u304C\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
methodNoCmpAccessor=\u30E1\u30BD\u30C3\u30C9\u306F\u65E2\u77E5\u306E CMP \u30D5\u30A3\u30FC\u30EB\u30C9\u30A2\u30AF\u30BB\u30B5\u30FC\u3001CMR \u30D5\u30A3\u30FC\u30EB\u30C9\u30A2\u30AF\u30BB\u30B5\u30FC\u3001\u3042\u308B\u3044\u306F ejbSelect \u30E1\u30BD\u30C3\u30C9\u3067\u306F\u3042\u308A\u307E\u305B\u3093 \: methodName\=%s 
internalInvocationBridgeError=\u547C\u3073\u51FA\u3057\u30D6\u30EA\u30C3\u30B8\u3067\u306E\u5185\u90E8\u30A8\u30E9\u30FC
failedToInvokeRelationshipRequest=\u95A2\u4FC2\u30EA\u30AF\u30A8\u30B9\u30C8\u306E\u547C\u3073\u51FA\u3057\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
missingSetComponentInstanceMethodOnCmpProxy=CmpProxy \u306B setComponentInstance \u30E1\u30BD\u30C3\u30C9\u304C\u5B58\u5728\u3057\u307E\u305B\u3093\u3002
noComponentInstanceSetOnProxy=\u30D7\u30ED\u30AD\u30B7\u306B\u30B3\u30F3\u30DD\u30FC\u30CD\u30F3\u30C8\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u304C\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
noComponentInstanceAssociated=\u30B3\u30F3\u30DD\u30FC\u30CD\u30F3\u30C8\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306B\u30A4\u30F3\u30BF\u30FC\u30BB\u30D7\u30BF\u30FC\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u304C\u95A2\u9023\u4ED8\u3051\u3089\u308C\u3066\u3044\u307E\u305B\u3093\u3002
failedToCreateProxyInstance=%s \u306B\u30D7\u30ED\u30AD\u30B7\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u3092\u4F5C\u6210\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
unknownCmpRelationshipMessage=\u4E0D\u660E\u306A cmp2.0-relationship-message\=%s
primaryKeyNotAssociatedWithInvocation=\u547C\u3073\u51FA\u3057\u304C\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306B\u95A2\u9023\u4ED8\u3051\u3089\u308C\u3066\u304A\u3089\u305A\u3001\u30D7\u30E9\u30A4\u30DE\u30EA\u30AD\u30FC\u306F null \u3067\u3057\u305F\u3002\u307E\u305F\u3001\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u304C\u524A\u9664\u3055\u308C\u3066\u3044\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002
failedToGetCurrentTransaction=\u73FE\u5728\u306E\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u3092\u53D6\u5F97\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
noEntityMetaDataForEntity=EntityBean\u306E\u30A8\u30F3\u30C6\u30A3\u30C6\u30A3\u30E1\u30BF\u30C7\u30FC\u30BF\u304C\u3042\u308A\u307E\u305B\u3093\: %s 
invalidCmpDeployment=\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8 %s \u306F CMP \u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u3068\u3057\u3066\u4E0D\u6B63\u306B\u30DE\u30FC\u30AF\u3055\u308C\u3066\u3044\u307E\u3059\u3002
failedToParse='%s' \u306E\u89E3\u6790\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
noTransactionSync=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u306E\u540C\u671F\u3092\u5229\u7528\u3067\u304D\u307E\u305B\u3093\u3002
pathIsCollectionValued=\u30D1\u30B9\u306F\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u306E\u5024\u3092\u6301\u3064\uFF1A%s \u3067\u3059\u3002
byteArrayBlobIsImmutable=ByteArrayBlob \u306F\u4E0D\u5909\u3067\u3059\u3002
unimplementedMethod=\u30E1\u30BD\u30C3\u30C9\u306F\u5B9F\u88C5\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
couldNotRemoveEntityNoRows=%s \u3092\u524A\u9664\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002\u884C\u306F\u5909\u66F4\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
rowLockingTemplateNotDefinedFor=\u6307\u5B9A\u306E\u30DE\u30C3\u30D4\u30F3\u30B0\u306B\u5BFE\u3057\u3066\u3001\u884C\u30EC\u30D9\u30EB\u30ED\u30C3\u30AD\u30F3\u30B0\u306E\u30C6\u30F3\u30D7\u30EC\u30FC\u30C8\u304C\u5B9A\u7FA9\u3055\u308C\u3066\u3044\u307E\u305B\u3093\: %s
offsetParameterMustBeInt=OFFSET \u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u306F\u6574\u6570\u3067\u306A\u3051\u308C\u3070\u306A\u308A\u307E\u305B\u3093\u3002
limitParameterMustBeInt=LIMIT \u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u306F\u6574\u6570\u3067\u306A\u3051\u308C\u3070\u306A\u308A\u307E\u305B\u3093\u3002
noPathExpressionInSelect=SELECT \u53E5\u306E\u95A2\u6570\u306B\u306F\u3001\u30D1\u30B9\u8868\u73FE\u304C\u542B\u307E\u308C\u3066\u3044\u307E\u305B\u3093\u3002
unexpectedNodeInNull=IS NULL \u53E5\u306B\u4E88\u671F\u305B\u306C\u30CE\u30FC\u30C9\u304C\u3042\u308A\u307E\u3059\: %s
isEmptyCanOnlyBeAppliedToCmr=IS EMPTY \u306F\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u306E\u5024\u3092\u6301\u3064 CMR \u30D5\u30A3\u30FC\u30EB\u30C9\u306B\u306E\u307F\u9069\u7528\u53EF\u80FD\u3067\u3059\u3002
mustNotVisitIdentifierNode=ASTIdentifier \u30CE\u30FC\u30C9\u3078\u30A2\u30AF\u30BB\u30B9\u3057\u3066\u306F\u3044\u3051\u307E\u305B\u3093\u3002
noSecurityDomainForCreatedBy=created-by \u306F\u6307\u5B9A\u3055\u308C\u3066\u3044\u307E\u3059\u304C security-domain \u306F\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
invalidParamMissingCloseParen=\u7121\u52B9\u306A\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC -  '}' \u306E\u7D50\u8A9E\u304C\u629C\u3051\u3066\u3044\u307E\u3059\: %s 
findFailed=\u691C\u7D22\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
failedToReadResultSet=ResultSet \u306E\u8AAD\u307F\u8FBC\u307F\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
failedToObtainCurrentTx=\u73FE\u5728\u306E\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u306E\u53D6\u5F97\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
cannotModifyCollectionWhileIteratorNotExhausted=\u6700\u521D\u306E\u53CD\u5FA9\u5B50\u304C\u4F7F\u7528\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u3092\u5909\u66F4\u3067\u304D\u307E\u305B\u3093\u3002
couldNotCreateEntityCommand=\u30A8\u30F3\u30C6\u30A3\u30C6\u30A3\u30B3\u30DE\u30F3\u30C9\u3092\u4F5C\u6210\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
unknownEntity=\u4E0D\u660E\u306A\u30A8\u30F3\u30C6\u30A3\u30C6\u30A3\: %s
unknownCmpField=\u4E0D\u660E\u306A cmp \u30D5\u30A3\u30FC\u30EB\u30C9\: %s
failedToGetQueryCompiler=\u30AF\u30A8\u30EA\u30B3\u30F3\u30D1\u30A4\u30E9\u30FC \u306E\u53D6\u5F97\u306B\u5931\u6557\u3057\u307E\u3057\u305F - %s 
nullParameter=\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC [%s] \u306F null \u3067\u3059\u3002
errorCompilingEjbQl.0=ejbql \u306E\u30B3\u30F3\u30D1\u30A4\u30EB\u30A8\u30E9\u30FC
pathMustBeCmrField=\u30D1\u30B9\u306F cmr \u30D5\u30A3\u30FC\u30EB\u30C9\u3067\u306A\u3051\u308C\u3070\u306A\u308A\u307E\u305B\u3093\u3002
functionInSelectNoPath=SELECT \u53E5\u306E\u95A2\u6570\u306B\u306F\u3001\u30D1\u30B9\u8868\u73FE\u304C\u542B\u307E\u308C\u3066\u3044\u307E\u305B\u3093\u3002
failedToGetLeftJoinNodes=left-join \u30CE\u30FC\u30C9\u306E\u53D6\u5F97\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
noSuchEntity=\u305D\u306E\u3088\u3046\u306A\u30A8\u30F3\u30C6\u30A3\u30C6\u30A3\u306F\u5B58\u5728\u3057\u307E\u305B\u3093\u3002
moreThanOneEntityMatch=\u8907\u6570\u306E\u30A8\u30F3\u30C6\u30A3\u30C6\u30A3\u304C\u30D5\u30A1\u30A4\u30F3\u30C0\u30FC\u57FA\u6E96\u3068\u30DE\u30C3\u30C1\u3057\u3066\u3044\u307E\u3059\: %s 
resultSetEmpty=ResultSet \u306F\u7A7A\u3067\u3057\u305F\u3002
errorExtractingGeneratedKey=\u751F\u6210\u30AD\u30FC\u306E\u62BD\u51FA\u30A8\u30E9\u30FC
errorCheckingEntityExists=\u30D7\u30EA\u30DE\u30EA\u30FC pk %s \u3092\u6301\u3064\u30A8\u30F3\u30C6\u30A3\u30C6\u30A3\u304C\u5B58\u5728\u3059\u308B\u304B\u30C1\u30A7\u30C3\u30AF\u3059\u308B\u969B\u306E\u30A8\u30E9\u30FC\uFF1ASQL \u306F\u884C\u3092\u8FD4\u3057\u307E\u305B\u3093\u3067\u3057\u305F\u3002
entityWithPKExists=\u30D7\u30EA\u30DE\u30EA\u30FC\u30AD\u30FC %s \u3092\u6301\u3064\u30A8\u30F3\u30C6\u30A3\u30C6\u30A3\u304C\u3059\u3067\u306B\u5B58\u5728\u3057\u307E\u3059\u3002
errorCheckingIfEntityExists=\u30A8\u30F3\u30C6\u30A3\u30C6\u30A3\u304C\u5B58\u5728\u3059\u308B\u304B\u30C1\u30A7\u30C3\u30AF\u3059\u308B\u969B\u306E\u30A8\u30E9\u30FC
entityNotFound=\u30A8\u30F3\u30C6\u30A3\u30C6\u30A3\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F\uFF1AprimaryKey\=%s
entityLoadFailed=\u30ED\u30FC\u30C9\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
loadRelationFailed=\u95A2\u4FC2\u306E\u30ED\u30FC\u30C9\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
qlCompilerNotSpecified=ql-compiler \u304C\u6307\u5B9A\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
compilerConstructorMissingArg=\u30B3\u30F3\u30D1\u30A4\u30E9\u30FC\u30AF\u30E9\u30B9\u306B\u306F %s \u3092\u53D6\u308B\u30B3\u30F3\u30B9\u30C8\u30E9\u30AF\u30BF\u30FC\u304C\u3042\u308A\u307E\u305B\u3093\u3002
failedToCreateCompilerInstance=%s \u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u3092\u4F5C\u6210\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
unknownQueryMethod=\u4E0D\u660E\u306A\u30AF\u30A8\u30EA\: %s
homeInterfaceNoPKMethod.1=Home interface [%s] \u306B\u306F\u3001findByPrimaryKey \u30E1\u30BD\u30C3\u30C9\u304C\u3042\u308A\u307E\u305B\u3093\u3002
instanceAlreadyRemoved.1=\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306F\u3059\u3067\u306B\u524A\u9664\u3055\u308C\u3066\u3044\u307E\u3059\: id\=%s
couldNotRemoveEntity=%s \u3092\u524A\u9664\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
failedToReadClob=CLOB \u6587\u5B57\u30B9\u30C8\u30EA\u30FC\u30E0\u306E\u8AAD\u307F\u8FBC\u307F\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
unableToLoadFromHandle=Handle \u304B\u3089 EJBObject \u518D\u5EA6\u30ED\u30FC\u30C9\u3059\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u305B\u3093\u3002
unableToDeserializeResult=\u30ED\u30FC\u30C9\u3057\u7D50\u679C\u3092\u30C7\u30B7\u30EA\u30A2\u30EB\u5316\u3059\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u305B\u3093\u3002
couldNotSuspendAfterAlterTable=\u30C6\u30FC\u30D6\u30EB\u3092\u5909\u66F4\u3059\u308B\u524D\u306B\u73FE\u5728\u306E\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u3092\u4E00\u6642\u505C\u6B62\u3059\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
errorAlteringTable=%s %s \u30C6\u30FC\u30D6\u30EB\u306E\u5909\u66F4\u4E2D\u306E\u30A8\u30E9\u30FC
couldNotReattachAfterAlterTable=\u30C6\u30FC\u30D6\u30EB\u306E\u5909\u66F4\u5F8C\u3001\u5143\u306E\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u3092\u518D\u5EA6\u95A2\u9023\u4ED8\u3051\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
couldNotSuspendBeforeCreateTable=\u30C6\u30FC\u30D6\u30EB\u3092\u4F5C\u6210\u3059\u308B\u524D\u306B\u73FE\u5728\u306E\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u3092\u4E00\u6642\u505C\u6B62\u3059\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
errorCreatingTable=\u30C6\u30FC\u30D6\u30EB\u4F5C\u6210\u4E2D\u306E\u30A8\u30E9\u30FC\: %s
couldNotReattachAfterCreateTable=\u30C6\u30FC\u30D6\u30EB\u4F5C\u6210\u5F8C\u306B\u5143\u306E\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u3092\u518D\u5EA6\u95A2\u9023\u4ED8\u3051\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
couldNotSuspendBeforeCreateIndex=\u30A4\u30F3\u30C7\u30C3\u30AF\u30B9\u4F5C\u6210\u524D\u306B\u73FE\u5728\u306E\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u3092\u4E00\u6642\u505C\u6B62\u3059\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
couldNotCreateIndex=\u30C6\u30FC\u30D6\u30EB %s \u306B\u30A4\u30F3\u30C7\u30C3\u30AF\u30B9 %s \u3092\u4F5C\u6210\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
couldNotReattachAfterCreateIndex=\u30A4\u30F3\u30C7\u30C3\u30AF\u30B9\u4F5C\u6210\u5F8C\u306B\u5143\u306E\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u3092\u518D\u5EA6\u95A2\u9023\u4ED8\u3051\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
couldNotSuspendBeforeSendingSql=sql \u30B3\u30DE\u30F3\u30C9\u306E\u9001\u4FE1\u524D\u306B\u73FE\u5728\u306E\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u3092\u4E00\u6642\u505C\u6B62\u3059\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
errorInPostTableCreate=post-table-create \u3067 sql \u3092\u767A\u884C\u4E2D\u306E\u30A8\u30E9\u30FC
couldNotReattachAfterPostTableCreate=post-table-create \u306E\u5F8C\u306B\u5143\u306E\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u3092\u518D\u5EA6\u95A2\u9023\u4ED8\u3051\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
autoIncTemplateNotFound=auto-increment \u30C6\u30F3\u30D7\u30EC\u30FC\u30C8\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002
pkConstraintNotAllowed=\u3053\u306E\u578B\u306E\u30C7\u30FC\u30BF\u30B9\u30C8\u30A2\u3067\u306F\u30D7\u30E9\u30A4\u30DE\u30EA\u30AD\u30FC\u5236\u7D04\u306F\u5229\u7528\u3067\u304D\u307E\u305B\u3093\u3002
fkConstraintNotAllowed=\u3053\u306E\u578B\u306E\u30C7\u30FC\u30BF\u30B9\u30C8\u30A2\u3067\u306F\u5916\u90E8\u30AD\u30FC\u5236\u7D04\u306F\u5229\u7528\u3067\u304D\u307E\u305B\u3093\u3002
couldNotSuspendBeforeFk=\u5916\u90E8\u30AD\u30FC\u306E alter-table-create \u524D\u306B\u73FE\u5728\u306E\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u3092\u4E00\u6642\u505C\u6B62\u3059\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
errorAddingFk=\u30C6\u30FC\u30D6\u30EB %s \u306E\u5916\u90E8\u30AD\u30FC\u5236\u7D04\u3092\u8FFD\u52A0\u4E2D\u306B\u30A8\u30E9\u30FC
storeFailed=\u4FDD\u5B58\u5931\u6557
errorGettingTxMap=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306E\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30C7\u30FC\u30BF\u30DE\u30C3\u30D7\u306E\u53D6\u5F97\u30A8\u30E9\u30FC
pkIsNullForCreatedInstance=\u4F5C\u6210\u3057\u305F\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306E\u30D7\u30E9\u30A4\u30DE\u30EA\u30AD\u30FC\u306F null \u3067\u3059\u3002
canNotFindDataSource=\u30A8\u30E9\u30FC\uFF1A\u30C7\u30FC\u30BF\u30BD\u30FC\u30B9\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\: %s 
getterNotFoundForField=\u30A8\u30F3\u30C6\u30A3\u30C6\u30A3 %s \u306E\u30D5\u30A3\u30FC\u30EB\u30C9 %s \u3067\u30BB\u30C3\u30BF\u30FC\u306F\u898B\u3064\u304B\u308A\u307E\u3057\u305F\u304C\u3001\u30B2\u30C3\u30BF\u30FC\u306F\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002
setterNotFoundForField=\u30A8\u30F3\u30C6\u30A3\u30C6\u30A3 %s \u306E\u30D5\u30A3\u30FC\u30EB\u30C9 %s \u3067\u30B2\u30C3\u30BF\u30FC\u306F\u898B\u3064\u304B\u308A\u307E\u3057\u305F\u304C\u3001\u30BB\u30C3\u30BF\u30FC\u306F\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002
failedToStartJdbcStore=JDBCStore \u306E\u8D77\u52D5\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
failedToStateStoreManager=\u30B9\u30C8\u30A2\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u306E\u8D77\u52D5\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
errorGettingColumnValue=\u30AB\u30E9\u30E0\u5024\u306E\u53D6\u5F97\u30A8\u30E9\u30FC
errorSettingColumnValue=\u30AB\u30E9\u30E0\u5024\u306E\u8A2D\u5B9A\u30A8\u30E9\u30FC
failedToCreateFieldStateFactory=\u30B9\u30C6\u30FC\u30C8\u30D5\u30A1\u30AF\u30C8\u30EA\u3092\u4F5C\u6210\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\: %s 
failedToLoadMappedType=\u30DE\u30C3\u30D7\u6E08\u307F\u306E\u578B \u3092\u30ED\u30FC\u30C9\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\: %s
failedToLoadMapperInstance=%s \u306E Mapper \u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306E\u4F5C\u6210\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
failedToCreateParamSetter=param setter %s \u306E\u4F5C\u6210\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
failedToCreateResultReader=result reader %s \u306E\u4F5C\u6210\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
couldNotCreateTypeMapper=\u30DE\u30C3\u30D1\u30FC \u3092\u4F5C\u6210\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\: %s 
couldNotInstantiateClass=%s \u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u5316\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
couldNotLoadClass=\u30AF\u30E9\u30B9\u306E\u30ED\u30FC\u30C9\u306B\u5931\u6557\u3057\u307E\u3057\u305F\: %s 
simpleTypeRequiresOneIndex=JDBCSimpleType \u306F index>0 \u306B\u5BFE\u5FDC\u3057\u3066\u3044\u307E\u305B\u3093\u3002
couldNotGetEjbHandle=EJBObject \u306E Handle \u3092\u53D6\u5F97\u3067\u304D\u307E\u305B\u3093\u3002
canNotSerializeBinaryObject=\u30D0\u30A4\u30CA\u30EA\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u3092\u30B7\u30EA\u30A2\u30EB\u5316\u3067\u304D\u307E\u305B\u3093\u3002
couldNotLoadEjbFromHandle=Handle \u304B\u3089 EJBObject \u518D\u5EA6\u30ED\u30FC\u30C9\u3059\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u305B\u3093\u3002
couldNotDeserializeResult=\u30ED\u30FC\u30C9\u3057\u7D50\u679C\u306E\u30C7\u30B7\u30EA\u30A2\u30EB\u5316\u304C\u3067\u304D\u307E\u305B\u3093\u3002
failedToReadLongString=long \u3092 String \u3068\u3057\u3066\u8AAD\u307F\u8FBC\u3080\u3053\u3068\u304C\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
failedToReadByteArray=\u30D0\u30A4\u30C8\u30A2\u914D\u5217\u306E\u8AAD\u307F\u8FBC\u307F\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
longBinaryNotSupported=\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u578B\u306E\u30ED\u30F3\u30B0\u30D0\u30A4\u30CA\u30EA\u30FC\u306B\u306F\u5BFE\u5FDC\u3057\u3066\u3044\u307E\u305B\u3093\u3002
loadedNullFromPrimitive=\u30D7\u30EA\u30DF\u30C6\u30A3\u30D6\u578B\u306E\u30D5\u30A3\u30FC\u30EB\u30C9\u306B Null \u5024\u3092\u30ED\u30FC\u30C9\u3057\u307E\u3057\u305F\u3002
parameterStringIsEmpty=\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u306E\u6587\u5B57\u5217\u306F\u7A7A\u3067\u3059\u3002
parameterMustBeginWithNumber=\u3053\u306E\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u306F\u6570\u5B57\u3067\u958B\u59CB\u3057\u306A\u3051\u308C\u3070\u306A\u308A\u307E\u305B\u3093\u3002
fieldNameMustBeProvided=\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u304C ejb \u306E\u5834\u5408\u3001\u30D5\u30A3\u30FC\u30EB\u30C9\u540D\u3092\u63D0\u4F9B\u3057\u306A\u3051\u308C\u3070\u306A\u308A\u307E\u305B\u3093\u3002
fieldMustBePrimaryKey=\u6307\u5B9A\u306E\u30D5\u30A3\u30FC\u30EB\u30C9\u306F\u3001\u30D7\u30E9\u30A4\u30DE\u30EA\u30FC\u30AD\u30FC\u30D5\u30A3\u30FC\u30EB\u30C9\u3067\u306A\u3051\u308C\u3070\u306A\u308A\u307E\u305B\u3093\u3002
preloadedValueNotFound=\u30D7\u30EA\u30ED\u30FC\u30C9\u3055\u308C\u305F\u5024\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3002
listCacheMaxIsNegative=list-cache-max \u306F\u8CA0\u306E\u5024\u3068\u306A\u3063\u3066\u3044\u307E\u3059\: %d
entityPrimaryKeyIsNull=\u30A8\u30F3\u30C6\u30A3\u30C6\u30A3\u306E\u30D7\u30E9\u30A4\u30E0\u30AD\u30FC\u306F null \u3067\u3059\u3002
objectIsNull=\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306F null \u3067\u3059\u3002
cmrFieldsWrongType=\u30A8\u30E9\u30FC\uFF1AcmrFields \u306F\u8AA4\u3063\u305F\u578B\u3067\u3059\u3002
errorFixingTableName=\u30C6\u30FC\u30D6\u30EB\u540D\u3092\u4FEE\u6B63\u4E2D\u306E\u30A8\u30E9\u30FC
pkAndFkWrongNumberOfColumns=PK \u3068 FK \u306E\u30AB\u30E9\u30E0\u6570\u304C\u9055\u3044\u307E\u3059\u3002
mismatchedQuoteTableName=\u30C6\u30FC\u30D6\u30EB\u540D\u306E\u5F15\u7528\u304C\u4E00\u81F4\u3057\u307E\u305B\u3093\: %s
errorCheckingIfTableExists=\u30C6\u30FC\u30D6\u30EB\u304C\u3059\u3067\u306B\u5B58\u5728\u3059\u308B\u304B\u3092\u30C1\u30A7\u30C3\u30AF\u3057\u3066\u3044\u308B\u9014\u4E2D\u306E\u30A8\u30E9\u30FC %s
errorGettingColumnNames=\u30AB\u30E9\u30E0\u540D\u53D6\u5F97\u4E2D\u306E\u30A8\u30E9\u30FC
failedToGetDataSourceConnection=\u30C7\u30FC\u30BF\u30BD\u30FC\u30B9\u63A5\u7D9A\u306E\u53D6\u5F97\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
errorDroppingTable=\u30C6\u30FC\u30D6\u30EB %s \u524A\u9664\u4E2D\u306E\u30A8\u30E9\u30FC
fieldIsReadOnly=\u30D5\u30A3\u30FC\u30EB\u30C9\u306F\u8AAD\u307F\u53D6\u308A\u5C02\u7528\u3067\u3059\: fieldName\=%s
errorSettingParameterForField=\u30D5\u30A3\u30FC\u30EB\u30C9 %s \u306B\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u3092\u8A2D\u5B9A\u4E2D\u306E\u5185\u90E8\u30A8\u30E9\u30FC
errorGettingParameterForField=\u30D5\u30A3\u30FC\u30EB\u30C9 %s \u306E\u7D50\u679C\u3092\u53D6\u5F97\u4E2D\u306E\u5185\u90E8\u30A8\u30E9\u30FC
getPrimaryKeyValueNotSupported=getPrimaryKeyValue \u306B\u306F\u5BFE\u5FDC\u3057\u3066\u3044\u307E\u305B\u3093\u3002
cmpFieldNotLoaded=CMP 1.1 \u30D5\u30A3\u30FC\u30EB\u30C9\u306F\u30ED\u30FC\u30C9\u3055\u308C\u3066\u3044\u307E\u305B\u3093\: %s
optimisticLockingNotSupported=\u697D\u89B3\u30ED\u30C3\u30AD\u30F3\u30B0\u306F CMP 1.1 \u3067\u306F\u5BFE\u5FDC\u3057\u3066\u3044\u307E\u305B\u3093\u3002
couldNotLoadField=\u30D5\u30A3\u30FC\u30EB\u30C9\u306E\u5024\u3092\u30ED\u30FC\u30C9\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\: %s 
relatedCmrFieldNotFound=%s.%s \u304B\u3089 %s.%s \u306E\u95A2\u4FC2\u306B\u95A2\u9023\u3059\u308B CMR \u30D5\u30A3\u30FC\u30EB\u30C9\u304C %s \u306B\u306F\u3042\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002
pkNotFoundForKeyField=\u30D7\u30E9\u30A4\u30DE\u30EA\u30AD\u30FC\u306F key-field %s \u3067\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002
primaryKeyNotMapped=\u30D7\u30E9\u30A4\u30DE\u30EA\u30AD\u30FC %s \u306F\u30DE\u30C3\u30D4\u30F3\u30B0\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
errorGettingInstanceValue=\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u5024\u306E\u53D6\u5F97\u30A8\u30E9\u30FC
instanceAlreadyRemoved.0=\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306F\u3059\u3067\u306B\u524A\u9664\u3055\u308C\u3066\u3044\u307E\u3057\u305F\u3002
errorInScheduleCascadeDelete=scheduleForCascadeDelete \u306E\u30A8\u30E9\u30FC
errorInScheduleBatchCascadeDelete=scheduleForBatchCascadeDelete \u306E\u30A8\u30E9\u30FC
errorGetRelatedId=getRelatedId \u306E\u30A8\u30E9\u30FC
errorAddRelation=addRelation \u306E\u30A8\u30E9\u30FC
errorRemoveRelation=removeRelation \u306E\u30A8\u30E9\u30FC
getRelatedOnlyForMuliOfOne=getRelatedId \u306F\u3001\u591A\u5BFE\u4E00\u306E cmr-field \u3067\u306E\u307F\u547C\u3073\u51FA\u3057\u53EF\u80FD\u3067\u3059\u3002
singleValuedFieldHasMultipleValues=\u30C7\u30FC\u30BF\u306B\u8907\u6570\u306E\u5024\u304C\u542B\u307E\u308C\u3066\u3044\u307E\u3059\u304C\u3001\u3053\u306E cmr \u30D5\u30A3\u30FC\u30EB\u30C9\u306F %s \u306E\u5358\u4E00\u5024\u3068\u306A\u3063\u3066\u3044\u307E\u3059\u3002
cmrFieldNoForeignKeySet=%s CMR \u30D5\u30A3\u30FC\u30EB\u30C9\u306B\u306F\u8A2D\u5B9A\u3059\u3079\u304D\u5916\u90E8\u30AD\u30FC\u306F\u3042\u308A\u307E\u305B\u3093\u3002
errorSettingFk=\ foreign-key \u30D5\u30A3\u30FC\u30EB\u30C9 %s \u8A2D\u5B9A\u4E2D\u306E\u5185\u90E8\u30A8\u30E9\u30FC
setCleanNotSupported=setClean \u30E1\u30BD\u30C3\u30C9\u306B\u5BFE\u5FDC\u3057\u3066\u3044\u307E\u305B\u3093\u3002
errorGettingTxFromManager=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u304B\u3089\u306E\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u53D6\u5F97\u30A8\u30E9\u30FC
noSuchRelatedObject=\u95A2\u9023\u306E FK \u306B\u5BFE\u3057\u3066\u3053\u306E\u3088\u3046\u306A\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306F\u3042\u308A\u307E\u305B\u3093\u3002
cmrFieldNotLoaded=CMR \u30D5\u30A3\u30FC\u30EB\u30C9\u306E\u5024\u306F\u307E\u3060\u30ED\u30FC\u30C9\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
cmrFieldAlreadyLoaded=CMR \u30D5\u30A3\u30FC\u30EB\u30C9\u306E\u5024\u306F\u3059\u3067\u306B\u30ED\u30FC\u30C9\u3055\u308C\u3066\u3044\u307E\u3059\u3002
errorCreatingRelationSet=RelationSet \u4F5C\u6210\u4E2D\u306E\u30A8\u30E9\u30FC
getColumnValueNotSupported=getColumnValue \u306F\u5B9F\u88C5\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
setColumnValueNotSupported=setColumnValue \u306F\u5B9F\u88C5\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
hasMapperNotSupported=hasMapper \u306F\u5B9F\u88C5\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
isSearchableNotSupported=isSearchable \u306F\u5B9F\u88C5\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
getResultSetReadersNotSupported=getResultSetReaders \u306F\u5B9F\u88C5\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
getParamSetterNotSupported=getParamSetter \u306F\u5B9F\u88C5\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
fieldStateIsNull=fieldState \u306F null \u3067\u3059\u3002
getRelationDataNotSupported=getRelationDate \u306F\u5B9F\u88C5\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
errorCreatingPKInstance=\u30D7\u30E9\u30A4\u30DE\u30EA\u30AD\u30FC\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306E\u4F5C\u6210\u30A8\u30E9\u30FC
loadGroupNotDefined=\u30ED\u30FC\u30C9\u30B0\u30EB\u30FC\u30D7 '%s' \u306F\u5B9A\u7FA9\u3055\u308C\u3066\u304A\u3089\u305A\u3001 \u30ED\u30FC\u30C9\u30B0\u30EB\u30FC\u30D7\u304C\u5B9A\u7FA9\u3055\u308C\u307E\u3057\u305F\: %s 
entityStateIsNull=\u30A8\u30F3\u30C6\u30A3\u30C6\u30A3\u306E\u30B9\u30C6\u30FC\u30BF\u30B9\u306F null \u3067\u3059\u3002
noSuchField=\u305D\u306E\u3088\u3046\u306A\u30D5\u30A3\u30FC\u30EB\u30C9\u306F\u3042\u308A\u307E\u305B\u3093\u3002
emptyFieldIteratorImmutable=\u7A7A\u306E\u30D5\u30A3\u30FC\u30EB\u30C9\u53CD\u5FA9\u5B50\u306F\u4E0D\u5909\u3067\u3059\u3002
failedToInitKeyGenerator=KeyGenerator \u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u3092\u4F5C\u6210\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
errorInSelector=%s \u306E\u30A8\u30E9\u30FC
noValueForSingleValuedSelector=\u5358\u4E00\u306E\u5024\u3092\u6301\u3064\u30BB\u30EC\u30AF\u30BF\u30FC\u306B\u306F\u5024\u304C\u3042\u308A\u307E\u305B\u3093\u3002
collectionIsReadOnlySnapshot=\u3053\u306E\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u306F\u8AAD\u307F\u53D6\u308A\u5C02\u7528\u306E\u30B9\u30CA\u30C3\u30D7\u30B7\u30E7\u30C3\u30C8\u3067\u3059\u3002
incorrectInterface.2=\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306F %s \u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u3067\u306A\u3051\u308C\u3070\u306A\u308A\u307E\u305B\u3093\u304C\u3001[%s] \u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u3068\u306A\u3063\u3066\u3044\u307E\u3059\u3002
collectionHasBeenModified=\u57FA\u76E4\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u304C\u5909\u66F4\u3055\u308C\u307E\u3057\u305F\u3002
noSuchLocalObject=\u305D\u306E\u3088\u3046\u306A\u30ED\u30FC\u30AB\u30EB\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306F\u3042\u308A\u307E\u305B\u3093\u3002
securityContextIsNull=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u306F null \u3067\u3059\u3002
getGeneratedKeysEmptyResultSet=getGeneratedKeys \u306F\u7A7A\u306E ResultSet \u3092\u8FD4\u3057\u307E\u3057\u305F\u3002
identityValLocalReturnedEmptyResultsSet=identity_val_local() \u306F\u7A7A\u306E ResultSet \u3092\u8FD4\u3057\u307E\u3057\u305F\u3002
errorExtractingIdentityValLocal=identity_val_local() \u306E\u62BD\u51FA\u30A8\u30E9\u30FC
failedToLoadDriverClass=\u30C9\u30E9\u30A4\u30D0\u30FC\u30AF\u30E9\u30B9\u3092\u30ED\u30FC\u30C9\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\: %s 
driverDoesNotHaveMethod=\u30C9\u30E9\u30A4\u30D0\u30FC %s \u306B\u306F\u30E1\u30BD\u30C3\u30C9\u304C\u3042\u308A\u307E\u305B\u3093\: %s() 
couldNotLoadStatementAccess=org.jboss.resource.adapter.jdbc.StatementAccess \u3092\u30ED\u30FC\u30C9\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
getUnderlyingStatementNotFound=StatementAccess.getUnderlyingStatement \u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002
entityMustHaveKeyFactory=key-generator-factory \u5C5E\u6027\u306F\u3001\u30A8\u30F3\u30C6\u30A3\u30C6\u30A3 %s \u306B\u8A2D\u5B9A\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
invalidKeyFactory=\u7121\u52B9\u306A\u30AD\u30FC\u751F\u6210\u540D\u3002%s \u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002
errorCreatingKeyFactory=\u30A8\u30E9\u30FC\uFF1A\u30AD\u30FC\u751F\u6210\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u3092\u4F5C\u6210\u3067\u304D\u307E\u305B\u3093\u3002\u30AD\u30FC\u751F\u6210\u30D5\u30A1\u30AF\u30C8\u30EA\: %s
sequenceMustBeSpecified=\u30B7\u30FC\u30B1\u30F3\u30B9\u306E\u6307\u5B9A\u306F\u5FC5\u9808\u3067\u3059\u3002
sequenceNameRequired=<entity-command> \u306E\u4E2D\u306Bsequence_name \u5C5E\u6027\u3092\u6307\u5B9A\u3057\u3066\u304F\u3060\u3055\u3044\u3002
pkSqlMustBeSet=pk-sql \u5C5E\u6027\u3092\u30A8\u30F3\u30C6\u30A3\u30C6\u30A3 %s \u306B\u8A2D\u5B9A\u3057\u3066\u304F\u3060\u3055\u3044\u3002
errorFetchingNextPk=\u6B21\u306E\u30D7\u30E9\u30A4\u30DE\u30EA\u30AD\u30FC\u5024\u306E\u30D5\u30A7\u30C3\u30C1\u30A8\u30E9\u30FC\uFF1A\u7D50\u679C\u30BB\u30C3\u30C8\u306B\u306F\u884C\u304C\u542B\u307E\u308C\u3066\u3044\u307E\u305B\u3093\u3002
errorFetchingPkValue=\u6B21\u306E\u30D7\u30E9\u30A4\u30DE\u30EA\u30AD\u30FC\u5024\u306E\u30D5\u30A7\u30C3\u30C1\u30A8\u30E9\u30FC\uFF1A
sequenceSqlReturnedEmptyResultSet=\u30B7\u30FC\u30B1\u30F3\u30B9 sql \u306F\u7A7A\u306E ResultSet \u3092\u8FD4\u3057\u307E\u3057\u305F\u3002
expectedSingleRowButReceivedMore=\u5FC5\u8981\u306A updateCount \u306F 1 \u3067\u3059\u304C\u3001%d \u3092\u53D6\u5F97\u3057\u307E\u3057\u305F\u3002
expectedResultSetReceivedUpdateCount=ResultSet \u304C\u5FC5\u8981\u3067\u3059\u304C\u3001updateCount \u3092\u53D6\u5F97\u3057\u307E\u3057\u305F\u3002NOCOUNT \u304C\u5168\u30C8\u30EA\u30AC\u30FC\u306B\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u307E\u3059\u304B\uFF1F
pkFieldWrongType.0=primkey-field \u306F prim-key-class \u306E\u578B\u3068\u540C\u3058\u3067\u306A\u3051\u308C\u3070\u306A\u308A\u307E\u305B\u3093\u3002
pkFieldWrongType.1=prim-key-class \u306E\u30D5\u30A3\u30FC\u30EB\u30C9 %s \u306F\u540C\u3058\u578B\u3067\u306A\u3051\u308C\u3070\u306A\u308A\u307E\u305B\u3093\u3002
failedToLoadEntityClass=\u30A8\u30F3\u30C6\u30A3\u30C6\u30A3\u30AF\u30E9\u30B9\u306E\u30ED\u30FC\u30C9\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
failedToLoadPkClass=\u30D7\u30E9\u30A4\u30DE\u30EA\u30AD\u30FC\u30AF\u30E9\u30B9\u306E\u30ED\u30FC\u30C9\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
failedToLoadHomeClass=\u30DB\u30FC\u30E0\u30AF\u30E9\u30B9\u306E\u30ED\u30FC\u30C9\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
failedToLoadRemoteClass=\u30EA\u30E2\u30FC\u30C8\u30AF\u30E9\u30B9\u306E\u30ED\u30FC\u30C9\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
failedToLoadLocalHomeClass=\u30ED\u30FC\u30AB\u30EB\u306E\u30DB\u30FC\u30E0\u30AF\u30E9\u30B9\u306E\u30ED\u30FC\u30C9\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
failedToLoadLocalClass=\u30ED\u30FC\u30AB\u30EB\u30AF\u30E9\u30B9\u306E\u30ED\u30FC\u30C9\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
entityMustHaveHome=\u30A8\u30F3\u30C6\u30A3\u30C6\u30A3\u306F\u5C11\u306A\u304F\u3068\u3082\u30DB\u30FC\u30E0\u304B\u3001\u30ED\u30FC\u30AB\u30EB\u30DB\u30FC\u30E0\u3067\u306A\u3051\u308C\u3070\u306A\u308A\u307E\u305B\u3093\: %s 
negativeListCacheMax=\u5148\u8AAD\u307Flist-cache-max '%d' \u306F\u8CA0\u306E\u5024\u3068\u306A\u3063\u3066\u3044\u307E\u3059\u3002
negativeFetchSize=\u30D5\u30A7\u30C3\u30C1\u30B5\u30A4\u30BA fetch-size '%d' \u306F\u8CA0\u306E\u5024\u3068\u306A\u3063\u3066\u3044\u307E\u3059\u3002
cmpFieldNotFound=CMP \u30D5\u30A3\u30FC\u30EB\u30C9\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F\: fieldName\=%s, entity\=%s
unknownLoadGroup=\u4E0D\u660E\u306A\u30ED\u30FC\u30C9\u30B0\u30EB\u30FC\u30D7\: name\=%s
invalidParameterInFunction=function-sql \u306E\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u306F\u7121\u52B9\u3067\u3059\:%s
invalidParameterNumberInFunction=function-sql \u306E\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u6570\u306F\u7121\u52B9\u3067\u3059\: number\=%d sql\=%s
errorParsingFunction=function-sql\u306E\u89E3\u6790\u30A8\u30E9\u30FC\: %s 
unknownLockingStrategy=\u4E88\u671F\u305B\u306C\u30A8\u30E9\u30FC\uFF1A\u30A8\u30F3\u30C6\u30A3\u30C6\u30A3 %s \u306B\u4E0D\u660E\uFF0F\u4E0D\u6B63\u306A\u697D\u89B3\u30ED\u30C3\u30AD\u30F3\u30B0\u304C\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u307E\u3059\u3002--%s
failedToConvertMethodParamsToClasses=\u30E1\u30BD\u30C3\u30C9\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u3092\u30AF\u30E9\u30B9\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\: %s \u306B\u5909\u63DB\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
errorInQueryForMethod=\u30E1\u30BD\u30C3\u30C9 %s \u306B\u5BFE\u3059\u308B\u30AF\u30A8\u30EA\u6307\u5B9A\u30A8\u30E9\u30FC
queryMethodNotFound=\u30AF\u30A8\u30EA\u30E1\u30BD\u30C3\u30C9\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\: %s(%s)
unknownReadAheadStrategy=\u4E0D\u660E\u306A\u5148\u8AAD\u307F\u6226\u7565 '%s'
negativePageSize=\u5148\u8AAD\u307F page-size '%d' \u306F\u8CA0\u306E\u5024\u3068\u306A\u3063\u3066\u3044\u307E\u3059\u3002
datasourceMappingNotFound=jbosscmp-jdbc.xml \u306E\u30A8\u30E9\u30FC \: datasource-mapping %s \u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3002
noEjbRelationRoleNameElement=ejb-relationship-role-name \u8981\u7D20\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002
noEjbRelationshipRole=\u30ED\u30FC\u30EB '%s' \u306B\u5BFE\u3059\u308B ejb-relationship-role \u8981\u7D20\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002
roleNotLeftOrRightRole=\u6307\u5B9A\u306E\u30ED\u30FC\u30EB\u306F\u5DE6\u3067\u3082\u53F3\u306E\u30ED\u30FC\u30EB\u3067\u3082\u3042\u308A\u307E\u305B\u3093\u3002role\=%s
cascadeDeleteInJbossXmlButNoEjbJar=%s/%s \u306Fjbosscmp-jdbc.xml \u306Bbatch-cascade-delete \u3092\u542B\u3093\u3067\u3044\u307E\u3059\u304C\u3001ejb-jar.xml\u306B\u306Fcascade-delete\u304C\u3042\u308A\u307E\u305B\u3093\u3002
batchCascadeDeleteOnlyForFkMapping=relation-table-mapping \u306E\u30B9\u30BF\u30A4\u30EB\u3092\u6301\u3064\u95A2\u4FC2 %s \u306Fbatch-cascade-delete \u7528\u306B\u8A2D\u5B9A\u3055\u308C\u307E\u3057\u305F\u3002batch-cascade-delete \u306F\u5916\u90E8\u30AD\u30FC\u30DE\u30C3\u30D4\u30F3\u30B0\u30B9\u30BF\u30A4\u30EB\u306B\u306E\u307F\u5BFE\u5FDC\u3057\u3066\u3044\u307E\u3059\u3002
cmpFieldNotFoundForRole=\u30A8\u30F3\u30C6\u30A3\u30C6\u30A3 Bean '%s' \u306E\u30ED\u30FC\u30EB '%s'\u3002\u30AD\u30FC\u306E CMP \u30D5\u30A3\u30FC\u30EB\u30C9\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\: field name\='%s'
functionNotDefinedForType=Function %s \u306F %s \u306B\u5B9A\u7FA9\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
invalidNumberFormat=%s \u306E\u6570\u5024\u5F62\u5F0F\u304C\u7121\u52B9\u3067\u3059 - %s
failedToLoadFieldType=\u30D5\u30A3\u30FC\u30EB\u30C9\u578B\u306E\u30ED\u30FC\u30C9\u306B\u5931\u6557\u3057\u307E\u3057\u305F\: %s 
failedToLoadEntityCommand=\u30A8\u30F3\u30C6\u30A3\u30C6\u30A3\u30B3\u30DE\u30F3\u30C9\u30AF\u30E9\u30B9\u306E\u30ED\u30FC\u30C9\u306B\u5931\u6557\u3057\u307E\u3057\u305F \:%s 
failedToLoadCompiler=\u30B3\u30F3\u30D1\u30A4\u30E9\u30FC\u5B9F\u88C5\u306E\u30ED\u30FC\u30C9\u306B\u5931\u6557\u3057\u307E\u3057\u305F\: %s 
failedToLoadValueClass=\u5024\u30AF\u30E9\u30B9\u306E\u30ED\u30FC\u30C9\u306B\u5931\u6557\u3057\u307E\u3057\u305F\: %s 
jdbcTypeCanNotBeNull=jdbc-type \u306F null \u3092\u53D6\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u305B\u3093\u3002
unableToGetNextElement=\u6B21\u306E\u8981\u7D20\u3092\u53D6\u5F97\u3067\u304D\u307E\u305B\u3093\u3002
removeNotSupported=\u524A\u9664\u306B\u5BFE\u5FDC\u3057\u3066\u3044\u307E\u305B\u3093\u3002
moreThanOneInstanceForSingleValueFinder=single-object \u30D5\u30A1\u30A4\u30F3\u30C0\u30FC\u57FA\u6E96\u306B\u4E00\u81F4\u3059\u308B\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u304C\u8907\u6570\u5B58\u5728\u3057\u307E\u3059\: %s 
uniqueKeyViolation=\u4E00\u610F\u306E\u30AD\u30FC\u9055\u53CD\u3042\u308B\u3044\u306F\u7121\u52B9\u306A\u5916\u90E8\u30AD\u30FC\u5024\: pk\=%s
missingClosingCurlyBrace=\u7121\u52B9\u306A\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC -  '}' \u306E\u7D50\u8A9E\u304C\u629C\u3051\u3066\u3044\u307E\u3059\: %s 
errorCompilingJbossQlStatement=JBossQL \u547D\u4EE4\u6587 '%s' \u306E\u30B3\u30F3\u30D1\u30A4\u30EB\u30A8\u30E9\u30FC
parameterIsNull=Parameter[%d] \u306F null \u3067\u3059\u3002
errorCompilingEjbQlStatement=EJBQL \u547D\u4EE4\u6587 '%s' \u306E\u30B3\u30F3\u30D1\u30A4\u30EB\u30A8\u30E9\u30FC
noRowLockingTemplateForMapping=\u30DE\u30C3\u30D4\u30F3\u30B0\u306B\u5BFE\u3057\u3066\u3001\u884C\u30EC\u30D9\u30EB\u30ED\u30C3\u30AD\u30F3\u30B0\u306E\u30C6\u30F3\u30D7\u30EC\u30FC\u30C8\u304C\u5B9A\u7FA9\u3055\u308C\u3066\u3044\u307E\u305B\u3093\: %s 
nullArgumentForFindByPrimaryKey=findByPrimaryKey \u306E\u5F15\u6570\u306F Null \u3067\u3059\u3002
instanceNotFound=\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\:entity\=%s, pk\=%s
errorCompilingJbossQlStatementRuntime=JBossQL \u547D\u4EE4\u6587 '%s' \u306E\u30B3\u30F3\u30D1\u30A4\u30EB\u30A8\u30E9\u30FC
failedToInitStoreManager=\u30B9\u30C8\u30A2\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u306E\u521D\u671F\u5316\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
failedToStartStoreManagerRuntime=\u30B9\u30C8\u30A2\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u306E\u8D77\u52D5\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
entityCommandNotValidClass=\u30A8\u30F3\u30C6\u30A3\u30C6\u30A3\u30B3\u30DE\u30F3\u30C9 %s \u306F %s \u3092\u5B9F\u88C5\u3057\u3066\u3044\u307E\u305B\u3093\u3002
getterButNoSetterForField=\u30B2\u30C3\u30BF\u30FC\u306F\u898B\u3064\u304B\u308A\u307E\u3057\u305F\u304C\u3001\u30BB\u30C3\u30BF\u30FC\u306F\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F\:  %s 
setterButNoGetterForField=\u30BB\u30C3\u30BF\u30FC\u306F\u898B\u3064\u304B\u308A\u307E\u3057\u305F\u304C\u3001\u30B2\u30C3\u30BF\u30FC\u306F\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F\:  %s 
cannotSetNullPk=\u30D7\u30E9\u30A4\u30DE\u30EA\u30AD\u30FC\u306F null \u3067\u3059\u3002
entityCommandCanNotBeUsedWithCompositePk=\u3053\u306E entity-command \u306F\u8907\u5408\u30D7\u30E9\u30A4\u30DE\u30EA\u30AD\u30FC\u3068\u4F75\u7528\u3067\u304D\u307E\u305B\u3093\u3002
pkSqlAttributeNotSet=pk-sql \u5C5E\u6027\u3092\u30A8\u30F3\u30C6\u30A3\u30C6\u30A3 %s \u306B\u8A2D\u5B9A\u3057\u3066\u304F\u3060\u3055\u3044\u3002
pkSqlReturnedNoResults=pk-sql %s \u306F\u4F55\u3082\u7D50\u679C\u3092\u8FD4\u3057\u307E\u305B\u3093\u3067\u3057\u305F\u3002
uniqueKeyViolationInvalidFk=\u4E00\u610F\u306E\u30AD\u30FC\u9055\u53CD\u3042\u308B\u3044\u306F\u7121\u52B9\u306A\u5916\u90E8\u30AD\u30FC\u5024\: pk\=%s
unexpectedReturnType=\u4E88\u671F\u305B\u306C\u623B\u308A\u5024\u578B\: %d
errorSettingInstanceField=\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u30D5\u30A3\u30FC\u30EB\u30C9 %s \u8A2D\u5B9A\u6642\u306E\u5185\u90E8\u30A8\u30E9\u30FC
complexTypesNotSupported=\u8907\u96D1\u578B\u306B\u306F\u5BFE\u5FDC\u3057\u3066\u3044\u307E\u305B\u3093\u3002
errorGettingResultsForField=\u30D5\u30A3\u30FC\u30EB\u30C9\u30E1\u30F3\u30D0\u30FC %s \u306E\u7D50\u679C\u53D6\u5F97\u6642\u306E\u5185\u90E8\u30A8\u30E9\u30FC
methodNotSupported=\u30E1\u30BD\u30C3\u30C9\u306B\u306F\u5BFE\u5FDC\u3057\u3066\u3044\u307E\u305B\u3093\u3002
errorGettingPk=\u30D7\u30E9\u30A4\u30DE\u30EA\u30AD\u30FC\u306E\u30D5\u30A3\u30FC\u30EB\u30C9\u30E1\u30F3\u30D0\u30FC %s \u53D6\u5F97\u6642\u306E\u5185\u90E8\u30A8\u30E9\u30FC
nullNumbersNotSupported=\u3053\u306E\u5B9F\u88C5\u306F null \u30E1\u30F3\u30D0\u30FC\u306B\u306F\u5BFE\u5FDC\u3057\u3066\u3044\u307E\u305B\u3093\u3002
invalidArgumentType=\u5F15\u6570\u306F\u578B %s \u3067\u306A\u3051\u308C\u3070\u306A\u308A\u307E\u305B\u3093\u3002
persistenceContextNotAvailable=\u6C38\u7D9A\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u306F\u5229\u7528\u3067\u304D\u307E\u305B\u3093\u3002CMR \u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u304C\u30A2\u30AF\u30BB\u30B9\u3059\u308B\u306E\u306F\u3001\u3053\u306E\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u3092\u53D6\u5F97\u3057\u305F\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u3067\u3042\u308B\u3088\u3046\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044\u3002
onlyVersionLockingSupported=\u4ECA\u306E\u3068\u3053\u308D\u3001version-column \u697D\u89B3\u30ED\u30C3\u30AD\u30F3\u30B0\u6226\u7565\u306E\u307F\u306B\u5BFE\u5FDC\u3057\u3066\u3044\u307E\u3059\u3002
errorExtractingPk=\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u304B\u3089\u30D7\u30E9\u30A4\u30DE\u30EA\u30AD\u30FC\u3092\u62BD\u51FA\u3057\u3066\u3044\u308B\u969B\u306E\u5185\u90E8\u30A8\u30E9\u30FC
fieldNotFound=\u30A8\u30F3\u30C6\u30A3\u30C6\u30A3%s \u306B\u3066\u30D5\u30A3\u30FC\u30EB\u30C9%s \u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002
failedToLookupDatasource=\u30EB\u30C3\u30AF\u30A2\u30C3\u30D7\u306B\u5931\u6557\u3057\u307E\u3057\u305F\: %s
stillRowsToDelete=\u524A\u9664\u3059\u308B\u884C\u304C\u307E\u3060\u6B8B\u3063\u3066\u3044\u307E\u3059\u3002
rowNotFound=\u884C\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\: pk\=%s
tooManyRowsAffected=\u5FC5\u8981\u306A\u306E\u306F 1 \u3064\u306E\u307F\u3067\u3057\u305F\u304C\u3001%s \u884C\u304C\u5F71\u97FF\u3092\u53D7\u3051\u307E\u3057\u305F\u3002
rowAlreadyRemoved=\u3053\u306E\u884C\u306F\u3059\u3067\u306B\u524A\u9664\u3055\u308C\u3066\u3044\u307E\u3059\: pk\=%s
canNotUpdateState=\u30B9\u30C6\u30FC\u30BF\u30B9\: %d \u306B\u66F4\u65B0\u3067\u304D\u307E\u305B\u3093\u3002
batchCommandFailedExecute=\u30D0\u30C3\u30C1\u5185\u306E\u30B3\u30DE\u30F3\u30C9\u306E\uFF11\u3064\u3092\u5B9F\u884C\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
batchUpdatedTooManyRows=\u30D0\u30C3\u30C1\u306E\u5404\u30B3\u30DE\u30F3\u30C9\u306F 1 \u884C\u306E\u307F\u66F4\u65B0\u3059\u3079\u304D\u3067\u3059\u304C\u3001\u30B3\u30DE\u30F3\u30C9\u306E1\u3064\u304C %d \u884C\u5206\u3001\u66F4\u65B0\u3057\u307E\u3057\u305F\u3002
expectedOneRow.1=\u66F4\u65B0\u306F 1 \u884C\u306E\u307F\u306E\u4E88\u5B9A\u3067\u3057\u305F\u304C\u3001%d \u884C\u66F4\u65B0\u3055\u308C\u3066\u3044\u307E\u3059\u3002
failedToDeleteManyToMany=\u591A\u5BFE\u591A\u306E\u95A2\u4FC2\u3092\u524A\u9664\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
failedToDeleteInstance=\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306E\u524A\u9664\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
failedToCreateInstance.0=\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306E\u4F5C\u6210\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
failedToUpdateInstance=\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306E\u66F4\u65B0\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
failedToCreateManyToMany=\u591A\u5BFE\u591A\u306E\u95A2\u4FC2\u3092\u4F5C\u6210\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
instanceIsLocked=\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306F\u30ED\u30C3\u30AF\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
removeRejected.2=%s \u304C\u539F\u56E0\u3067 %s \u306E\u524A\u9664\u304C\u62D2\u5426\u3055\u308C\u307E\u3057\u305F\u3002\u30A8\u30F3\u30C8\u30EA\u30FC\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002
removeRejected.3=%s \u304C\u539F\u56E0\u3067 %s \u306E\u524A\u9664\u304C\u62D2\u5426\u3055\u308C\u307E\u3057\u305F\u3002%s \u306B\u3088\u308A\u30A8\u30F3\u30C8\u30EA\u30FC\u304C\u30ED\u30C3\u30AF\u3055\u308C\u3066\u3044\u307E\u3059\u3002
failedToSuspendTx=\u73FE\u5728\u306E\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u3092\u4E00\u6642\u505C\u6B62\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
failedToBeginTx=\u65B0\u898F\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u306E\u958B\u59CB\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
failedToResumeTx=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u306E\u518D\u958B\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
sequenceNotInitialized=\u30B5\u30FC\u30D3\u30B9\u8D77\u52D5\u30D5\u30A7\u30FC\u30BA\u3067\u30B7\u30FC\u30B1\u30F3\u30B9\u304C\u521D\u671F\u5316\u3055\u308C\u307E\u305B\u3093\u3067\u3057\u305F\u3002
failedTOStartHiLoKeyGen=HiLoKeyGeneratorFactory \u306E\u8D77\u52D5\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
failedTOStopHiLoKeyGen=HiLoKeyGeneratorFactory \u306E\u505C\u6B62\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
failedToCreateInstance.1=\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306E\u4F5C\u6210\u306B\u5931\u6557\u3057\u307E\u3057\u305F \: pk\=%s
entityCommandIsNull=\u30A8\u30F3\u30C6\u30A3\u30C6\u30A3\u306E\u30B3\u30DE\u30F3\u30C9\u306F null \u3067\u3059\u3002
generationOnlySupportedWithSinglePK=\u5358\u4E00\u306E PK \u30D5\u30A3\u30FC\u30EB\u30C9\u3067\u306E\u307F\u751F\u6210\u306B\u5BFE\u5FDC\u3057\u3066\u3044\u307E\u3059\u3002
creationNotAllowedPKReadOnly=\u30D7\u30E9\u30A4\u30DE\u30EA\u30AD\u30FC\u30D5\u30A3\u30FC\u30EB\u30C9\u306F\u8AAD\u307F\u53D6\u308A\u5C02\u7528\u3067\u3042\u308B\u305F\u3081\u3001\u4F5C\u6210\u3067\u304D\u307E\u305B\u3093\u3002
errorGettingCurrentTransaction=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u3068\u73FE\u5728\u306E\u30B9\u30EC\u30C3\u30C9\u3092\u95A2\u9023\u4ED8\u3051\u3066\u3044\u308B\u9014\u4E2D\u3067\u30A8\u30E9\u30FC\u304C\u767A\u751F\u3057\u307E\u3057\u305F\u3002
instanceEvictedBeforeSync=pk\=%s \u3092\u6301\u3064 %s \u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306F\u3001\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u3067\u30C7\u30FC\u30BF\u306E\u4E0D\u6574\u5408\u304C\u8D77\u3053\u3089\u306A\u3044\u3088\u3046\u306B\u4FDD\u5B58\u3055\u308C\u307E\u305B\u3093\u3067\u3057\u305F\u3002\u3053\u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306F\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u306E\u9014\u4E2D\u3067\u30AD\u30E3\u30C3\u30B7\u30E5\u304B\u3089\u9000\u907F\u3055\u308C\u3001\u3053\u306E\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u306F\u5225\u306E\u30D7\u30ED\u30BB\u30B9\u3067\u66F4\u65B0\u3055\u308C\u305F\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002
failedToStoreEntity=\u30A8\u30F3\u30C6\u30A3\u30C6\u30A3\u306E\u30B9\u30C8\u30A2\u3067\u306E\u4F8B\u5916\: %s 
homeMethodsCanNotAccessCmpFields=CMP \u3042\u308B\u3044\u306F CMR \u30D5\u30A3\u30FC\u30EB\u30C9\u306B\u30A2\u30AF\u30BB\u30B9\u3059\u308B\u306E\u306B\u3001EJB \u30DB\u30FC\u30E0\u30E1\u30BD\u30C3\u30C9\u3092\u5229\u7528\u3067\u304D\u307E\u305B\u3093\: methodName\= %s
batchCascadeDeleteForRoleWithFk=Batch-cascade-delete \u306F\u5916\u90E8\u30AD\u30FC\u3092\u6301\u3064\u30ED\u30FC\u30EB\u7528\u306B\u8A2D\u5B9A\u3055\u308C\u307E\u3057\u305F\uFF1A\u95A2\u4FC2 %s\u3001\u30ED\u30FC\u30EB %s\u3002Batch cascade-delete \u306F\u5916\u90E8\u30AD\u30FC\u3092\u6301\u305F\u306A\u3044\u30ED\u30FC\u30EB\u306E\u307F\u306B\u5BFE\u5FDC\u3057\u3066\u3044\u307E\u3059\u3002
unknownNodeType=\u5185\u90E8\u30A8\u30E9\u30FC\uFF1AEJB-QL \u62BD\u8C61\u69CB\u6587\u30C4\u30EA\u30FC\u3067\u4E0D\u660E\u306A\u30CE\u30FC\u30C9\u578B\u304C\u898B\u3064\u304B\u308A\u307E\u3057\u305F\: node\=%s
shouldBeCollectionValuedPathExpression=ID \u5909\u6570\u3067\u306F\u306A\u304F\u3001\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u306E\u5024\u3092\u6301\u3064\u30D1\u30B9\u8868\u73FE\u304C\u5FC5\u8981\u3067\u3059\u3002
onlyLikeTypesCanBeCompared=Like \u306E\u578B\u306E\u307F\u6BD4\u8F03\u53EF\u80FD\u3067\u3059\:from CMP field\=%s to parameter\=%s
canOnlyVisitCmpNodes=cmp \u5024\u3092\u6301\u3064\u30D1\u30B9\u30CE\u30FC\u30C9\u306B\u306E\u307F\u30A2\u30AF\u30BB\u30B9\u53EF\u80FD\u3067\u3059\u3002\u3088\u308A\u9AD8\u3044\u30EC\u30D9\u30EB\u3067\u51E6\u7406\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3057\u305F\u3002
canNotVisitMultiColumnPath=multi-column \u30D1\u30B9\u30CE\u30FC\u30C9\u306B\u30A2\u30AF\u30BB\u30B9\u3067\u304D\u307E\u305B\u3093\u3002\u3088\u308A\u9AD8\u3044\u30EC\u30D9\u30EB\u3067\u51E6\u7406\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3057\u305F\u3002
canNotVisitMultiColumnParameter=multi-column \u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u30CE\u30FC\u30C9\u306B\u30A2\u30AF\u30BB\u30B9\u3067\u304D\u307E\u305B\u3093\u3002\u3088\u308A\u9AD8\u3044\u30EC\u30D9\u30EB\u3067\u51E6\u7406\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3057\u305F\u3002
canNotVisitAbstractNode=\u62BD\u8C61\u30B9\u30AD\u30FC\u30DE\u30CE\u30FC\u30C9\u306B\u30A2\u30AF\u30BB\u30B9\u3067\u304D\u307E\u305B\u3093\u3002\u3088\u308A\u9AD8\u3044\u30EC\u30D9\u30EB\u3067\u51E6\u7406\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3057\u305F\u3002
expectedOneRow.2=1 \u884C\u306E\u307F\u306E\u4E88\u5B9A\u3067\u3057\u305F\u304C\u3001\u66F4\u65B0\u306B\u3088\u308A id\=%s \u306B %s \u3092\u8FD4\u3057\u307E\u3057\u305F\u3002
couldNotCreateEntity=\u30A8\u30F3\u30C6\u30A3\u30C6\u30A3\u306E\u4F5C\u6210\u304C\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
pathAndFieldListMustBeSameSize=\u30D1\u30B9\u4E00\u89A7\u3068\u30D5\u30A3\u30FC\u30EB\u30C9\u4E00\u89A7\u306F\u540C\u3058\u30B5\u30A4\u30BA\u3067\u306A\u3051\u308C\u3070\u306A\u308A\u307E\u305B\u3093\: pathList.size\=%s fieldList.size\=%s
failedToExecutePkSql=pk sql \u306E\u5B9F\u884C\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
elementNotQueryParam=\u4E00\u89A7\u306E\u8981\u7D20 %s \u306FQueryParameter \u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u3067\u306F\u306A\u304F % \u3067\u3059\u3002
finderReturnedWrongInstance=%s \u3067\u5B9A\u7FA9\u3055\u308C\u305F\u30D5\u30A1\u30A4\u30F3\u30C0\u30FC%s\u306F\u3001%s\u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u3067\u306F\u306A\u304F\u3001%s\u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306B\u3042\u308B\u30AF\u30A8\u30EA\u7D50\u679C\u3092\u8FD4\u3059\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
cmrFieldInJoinNotFound=left-join \u3067cmr-field \u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F\: cmr-field\=%s, entity\=%s
unableToAccessFinder=\u30D5\u30A1\u30A4\u30F3\u30C0\u30FC\u5B9F\u88C5\u306B\u30A2\u30AF\u30BB\u30B9\u3067\u304D\u307E\u305B\u3093\: %s 
illegalFinderArgument=\u30D5\u30A1\u30A4\u30F3\u30C0\u30FC\u5B9F\u88C5\u306E\u5F15\u6570\u306F\u4E0D\u6B63\u3067\u3059\uFF1A %s 
errorInvokingFinder=\u30AB\u30B9\u30BF\u30E0\u30D5\u30A1\u30A4\u30F3\u30C0\u30FC %s \u306E\u547C\u3073\u51FA\u3057\u30A8\u30E9\u30FC
couldNotDeleteRelations=\ %s \u304B\u3089\u95A2\u4FC2\u3092\u524A\u9664\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
errorCompilingEjbQl.2=EJB '%s' \u306B\u5BFE\u3059\u308B EJB-QL \u547D\u4EE4\u6587\u306E\u30B3\u30F3\u30D1\u30A4\u30EB\u30A8\u30E9\u30FC\: %s 
noFinderForMethod=\u3053\u306E\u30E1\u30BD\u30C3\u30C9\u306B\u306F\u30D5\u30A1\u30A4\u30F3\u30C0\u30FC\u304C\u3042\u308A\u307E\u305B\u3093\: %s 
couldNotInsertRelations=%s \u306B\u95A2\u4FC2\u3092\u633F\u5165\u3067\u304D\u307E\u3057\u305F\u3002
rowLockingNotAllowed=\u3053\u306E\u578B\u306E\u30C7\u30FC\u30BF\u30B9\u30C8\u30A2\u306B row-locking \u306F\u5229\u7528\u3067\u304D\u307E\u305B\u3093\u3002
localHomeMissingFindByPrimaryKey=\u30ED\u30FC\u30AB\u30EB\u306E\u30DB\u30FC\u30E0\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u306B\u306F\u3001\u30E1\u30BD\u30C3\u30C9findByPrimaryKey(%s)\u304C\u3042\u308A\u307E\u305B\u3093\u3002
foundWrongClass=%s[cl\=%s]\u3092\u691C\u7D22\u4E2D\u306B%s[cl\=%s + interfaces\=%s, value\=%s] \u3092\u53D6\u5F97\u3057\u307E\u3057\u305F\u3002
pkNotAllowedForDatasource=\u3053\u306E\u578B\u306E\u30C7\u30FC\u30BF\u30B9\u30C8\u30A2\u3067\u306F\u30D7\u30E9\u30A4\u30DE\u30EA\u30AD\u30FC\u5236\u7D04\u306F\u5229\u7528\u3067\u304D\u307E\u305B\u3093\u3002
updateFailedTooManyRowsAffected=\u66F4\u65B0\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002\u5909\u66F4\u4E88\u5B9A\u306E\u884C\u306F1\u884C\u3067\u3057\u305F\uFF1ArowsAffected\=%s, id\=%s
fieldDoesNotHaveProperty=%s \u306B\u306F%s\u3068\u3044\u3046\u540D\u524D\u306E\u30D7\u30ED\u30D1\u30C6\u30A3\u304C\u3042\u308A\u307E\u305B\u3093\u3002
failedToFindConstructor=%s \u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u3092\u5F15\u6570\u3068\u3057\u3066\u53D6\u308B%s \u306B\u304A\u3044\u3066\u3001\u30B3\u30F3\u30B9\u30C8\u30E9\u30AF\u30BF\u30FC\u306E\u691C\u7D22\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
failedToConstructWithArgument=%s \u3092\u6301\u3064%s \u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u3092\u30B3\u30F3\u30B9\u30C8\u30E9\u30AF\u30BF\u30FC\u306E\u5F15\u6570\u3068\u3057\u3066\u4F5C\u6210\u3059\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
invalidPropertyValue=\u30D5\u30A3\u30FC\u30EB\u30C9%s \u306E\u30D7\u30ED\u30D1\u30C6\u30A3%s \u306F\u3001\u5024\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8%s \u306E\u30D7\u30ED\u30D1\u30C6\u30A3\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3002
circularReferenceForProperty=\u5FAA\u74B0\u53C2\u7167\u304C\u30D7\u30ED\u30D1\u30C6\u30A3\u3067\u691C\u51FA\u3055\u308C\u307E\u3057\u305F\: %s 
errorGettingInstanceField=\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u30D5\u30A3\u30FC\u30EB\u30C9 %s \u53D6\u5F97\u6642\u306E\u5185\u90E8\u30A8\u30E9\u30FC
invalidParameterInQueryMethod=\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u30A4\u30F3\u30C7\u30C3\u30AF\u30B9\u306F%s \u3067\u3059\u304C\u3001\u30AF\u30A8\u30EA\u30E1\u30BD\u30C3\u30C9\u306B\u306F%s \u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u3057\u304B\u3042\u308A\u307E\u305B\u3093\u3002
typePropertiesNotAllowed=\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u306F\u3001\u72EC\u7ACB\u3057\u305F\u65E2\u77E5\u306E\u5024\u30AF\u30E9\u30B9\u3067\u306F\u306A\u3044\u305F\u3081\u3001\u30D7\u30ED\u30D1\u30C6\u30A3\u3092\u63D0\u4F9B\u3067\u304D\u307E\u305B\u3093\u3002
typePropertyRequired=\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u306F\u72EC\u7ACB\u3057\u305F\u65E2\u77E5\u306E\u5024\u30AF\u30E9\u30B9\u3067\u3042\u308B\u305F\u3081\u3001\u30D7\u30ED\u30D1\u30C6\u30A3\u3092\u63D0\u4F9B\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
expectedEjbObject=EJBObject \u3042\u308B\u3044\u306F EJBLocalObject \u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u3092\u5FC5\u8981\u3068\u3057\u3066\u3044\u307E\u3057\u305F\u304C\u3001%s \u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u3092\u53D6\u5F97\u3057\u307E\u3057\u305F\u3002
entityNotFoundInCatalog=interface\=%s \u306E\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u30AB\u30BF\u30ED\u30B0\u3067\u30A8\u30F3\u30C6\u30A3\u30C6\u30A3\u306F\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002
errorCreatingJoin=\u30B7\u30FC\u30BF\u7D50\u5408\u53E5\u306E\u4F5C\u6210\u30A8\u30E9\u30FC\:pkField.size()\=%s fkField.size()\=%s
primaryKeyMembersCanOnlyBeSetInCreate=\u30D7\u30E9\u30A4\u30DE\u30EA\u30AD\u30FC\u306E\u30E1\u30F3\u30D0\u30FC\u3067\u3042\u308B CMP \u30D5\u30A3\u30FC\u30EB\u30C9\u306F\u3001ejbCreate \u306B\u306E\u307F\u8A2D\u5B9A\u53EF\u80FD\u3067\u3059[EJB 2.0 Spec. 10.3.5]\u3002
foreignKeyChangedPrimaryKey=\u5916\u90E8\u30AD\u30FC\u30D5\u30A3\u30FC\u30EB\u30C9 %s \u306E\u65B0\u3057\u3044\u5024 [%s] \u306F\u30D7\u30E9\u30A4\u30DE\u30EA\u30AD\u30FC\u30D5\u30A3\u30FC\u30EB\u30C9%s[%s]\u306E\u5024\u3092\u5909\u66F4\u3057\u307E\u3057\u305F\u3002
relatedEntityNotFound=\u95A2\u9023\u306E\u30A8\u30F3\u30C6\u30A3\u30C6\u30A3\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\: entity\=%s, cmrField\=%s, relatedEntity\=%s
findByPrimaryKeyNotFound=findByPrimaryKey(%s pk) \u304C %s \u306B\u3042\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002
cmrFieldCannotBeSetInEjbCreate=CMR \u30D5\u30A3\u30FC\u30EB\u30C9\u306FejbCreate\u3067\u8A2D\u5B9A\u3067\u304D\u307E\u305B\u3093\u3002\u4EE3\u308F\u308A\u306BejbPostCreate \u30E1\u30BD\u30C3\u30C9\u3067\u5B9F\u884C\u3057\u3066\u304F\u3060\u3055\u3044[EJB 2.0 Spec. 10.5.2]\u3002
cmrCollectionFieldsCanNotBeSetToNull=collection-valued cmr-field \u306Bnull \u3092\u5272\u308A\u5F53\u3066\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093 [EJB 2.0 Spec. 10.3.8]\u3002
cannotCreateRelationship=\u95A2\u4FC2\u306E\u4F5C\u6210\u304C\u3067\u304D\u307E\u305B\u3093\uFF1ACMR \u30D5\u30A3\u30FC\u30EB\u30C9%s\u3002%s \u306B\u306F\u3001\u30D7\u30E9\u30A4\u30DE\u30EA\u30FC\u30AD\u30FC\u30AB\u30E9\u30E0\u3078\u30DE\u30C3\u30D4\u30F3\u30B0\u3055\u308C\u308B\u5916\u90E8\u30AD\u30FC\u30D5\u30A3\u30FC\u30EB\u30C9\u304C\u5B58\u5728\u3057\u307E\u3059\u3002\u30D7\u30E9\u30A4\u30DE\u30EA\u30AD\u30FC\u3092ejbCreate \u306B\u8A2D\u5B9A\u3067\u304D\u308B\u306E\u306F1\u56DE\u306E\u307F\u3067\u3059[EJB 2.0 Spec. 10.3.5]\u3002\u30D7\u30E9\u30A4\u30DE\u30EA\u30AD\u30FC\u306E\u5024\u306F%s \u3067\u3001\u30AA\u30FC\u30D0\u30FC\u30E9\u30A4\u30C9\u3059\u308B\u5024\u306F%s \u3067\u3059\u3002
cmrFieldCannotBeSetOrAddedInEjbCreate=ejbCreate\u3067CMR \u30D5\u30A3\u30FC\u30EB\u30C9\u3092\u8A2D\u5B9A\u3001\u3042\u308B\u3044\u306F\u95A2\u4FC2\u306B\u8FFD\u52A0\u3059\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u305B\u3093\u3002\u4EE3\u308F\u308A\u306BejbPostCreate \u30E1\u30BD\u30C3\u30C9\u3067\u5B9F\u884C\u3057\u3066\u304F\u3060\u3055\u3044[EJB 2.0 Spec. 10.5.2]\u3002
invalidCmrFieldValue=\u3053\u306E\u30D5\u30A3\u30FC\u30EB\u30C9\u306E\u5024\u306F %s \u578B\u3067\u306A\u3051\u308C\u3070\u306A\u308A\u307E\u305B\u3093\u3002
onlyCmrFieldsWithFkInLoadGroup=foreign-key \u306E\u3042\u308BCMR \u30D5\u30A3\u30FC\u30EB\u30C9\u306E\u307F\u304C\u30ED\u30FC\u30C9\u30B0\u30EB\u30FC\u30D7\u306E\u30E1\u30F3\u30D0\u30FC\u306B\u306A\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u3059\: fieldName\=%s
singleValuedSelectorMultipleValues=\u5358\u4E00\u306E\u5024\u3092\u6301\u3064\u30BB\u30EC\u30AF\u30BF\u30FC %s \u304C %s \u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u3092\u8FD4\u3057\u307E\u3057\u305F\u3002
returnedNullFromPrimitive=\u30D7\u30EA\u30DF\u30C6\u30A3\u30D6\u623B\u308A\u5024\u578B %s \u3092\u6301\u3064\u30BB\u30EC\u30AF\u30BF\u30FC\u304B\u3089 Null \u5024\u3092\u8FD4\u3057\u307E\u3057\u305F\u3002
cmrFieldUsedOutSideOfCreatingTx=CMR \u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u306F\u3001\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u3092\u4F5C\u6210\u3057\u305F\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u5185\u3067\u306E\u307F\u5229\u7528\u53EF\u80FD\u3067\u3059\u3002
addedNullToCmrRelationship=CMR \u95A2\u4FC2\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u3078 null \u3092\u8FFD\u52A0\u3067\u304D\u307E\u305B\u3093\u3002
incorrectInterface.1=\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306F\u3001%s \u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u3067\u306A\u3051\u308C\u3070\u306A\u308A\u307E\u305B\u3093\u3002
underlyingCollectionModified=\u57FA\u76E4\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u304C\u5909\u66F4\u3055\u308C\u307E\u3057\u305F\u3002
iteratorUsedOutsideOfTx=CMR \u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u306E\u53CD\u5FA9\u5B50\u306F\u3001\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u3092\u4F5C\u6210\u3057\u305F\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u3067\u306E\u307F\u5229\u7528\u53EF\u80FD\u3067\u3059\u3002
entityNotFoundInEjbJarXml=\u30A8\u30F3\u30C6\u30A3\u30C6\u30A3 %s \u306B\u5BFE\u3059\u308B\u8A2D\u5B9A\u304Cjbosscmp-jdbc.xml \u3067\u898B\u3064\u304B\u308A\u307E\u3057\u305F\u304C\u3001bean \u306F ejb-jar.xml \u306B\u3042\u308B jbosscmp-jdbc-managed cmp \u30A8\u30F3\u30C6\u30A3\u30C6\u30A3\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3002
relationNotFoundInEjbJarXml=\u95A2\u4FC2 %s \u306B\u5BFE\u3059\u308B\u8A2D\u5B9A\u304Cjbosscmp-jdbc.xml \u3067\u898B\u3064\u304B\u308A\u307E\u3057\u305F\u304C\u3001\u95A2\u4FC2\u306F ejb-jar.xml \u306B\u3042\u308B jbosscmp-jdbc-managed relation \u30A8\u30F3\u30C6\u30A3\u30C6\u30A3\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3002
noAbstractAccessor='%s' \u3068\u3044\u3046\u540D\u524D\u306E\u30D5\u30A3\u30FC\u30EB\u30C9\u306B\u5BFE\u3059\u308B\u62BD\u8C61\u30A2\u30AF\u30BB\u30B5\u30FC\u304C\u30A8\u30F3\u30C6\u30A3\u30C6\u30A3\u30AF\u30E9\u30B9 %s \u3067\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002
declaredSqlElementNotAllowed=ejbSelect \u30AF\u30A8\u30EA\u306B\u306F\u3001declared-sql select \u306E%s \u8981\u7D20\u306E\u307F\u304C\u5229\u7528\u53EF\u80FD\u3067\u3059\u3002
dynamicQlInvalidParameters=Dynamic-ql \u30E1\u30BD\u30C3\u30C9\u306B\u306FString \u3068 Object[] \u578B\u306E\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC2\u3064\u304C\u306A\u3051\u308C\u3070\u306A\u308A\u307E\u305B\u3093\u3002
eagerLoadGroupNotFound=\u4E00\u62EC\u8AAD\u307F\u8FBC\u307F\u30B0\u30EB\u30FC\u30D7\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\: eager-load-group\=%s
typeMappingNotInitialized=type-mapping \u306F\u521D\u671F\u5316\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002%s \u304C\u30C7\u30D7\u30ED\u30A4\u3055\u308C\u305F\u304B\u3001\u3042\u308B\u3044\u306F type-mapping \u304C\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3067\u3057\u305F\u3002
fieldTypeNotAllowedForColumn=%s \u30AB\u30E9\u30E0\u306B\u306F\u3001field-type \u306F\u5229\u7528\u3067\u304D\u307E\u305B\u3093\u3002\u6697\u9ED9\u7684\u306B%s \u306B\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u307E\u3059\u3002
atLeastOneRelationshipRoleMustHaveField=foreign-key \u3092\u30DE\u30C3\u30D4\u30F3\u30B0\u3057\u305F\u95A2\u4FC2\u306E\u30ED\u30FC\u30EB\u306E\u3046\u3061\u5C11\u306A\u304F\u3068\u30821\u3064\u306B\u3001\u30AD\u30FC\u30D5\u30A3\u30FC\u30EB\u30C9(\u3042\u308B\u3044\u306F <primkey-field> \u304Cejb-jar.xml\u306B\u3042\u308A\u307E\u305B\u3093) \u3092\u6301\u305F\u305B\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\: ejb-relation-name\=%s
bothRolesMustHaveFields=relation-table \u3092\u30DE\u30C3\u30D4\u30F3\u30B0\u3057\u305F\u95A2\u4FC2\u306E\u4E21\u30ED\u30FC\u30EB\u306B\u30AD\u30FC\u30D5\u30A3\u30FC\u30EB\u30C9\u3092\u6301\u305F\u305B\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\: ejb-relation-name\=%s
entityNotFoundForRelation=\u30A8\u30F3\u30C6\u30A3\u30C6\u30A3\uFF1A \u95A2\u4FC2\u306B\u5BFE\u5FDC\u3059\u308B %s \u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F\: %s 
getterNotFoundForValue=\u72EC\u7ACB\u5024\u30AF\u30E9\u30B9 %s \u306E\u30D7\u30ED\u30D1\u30C6\u30A3 %s \u306B\u5BFE\u3059\u308B\u30B2\u30C3\u30BF\u30FC\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3002
setterNotFoundForValue=\u72EC\u7ACB\u5024\u30AF\u30E9\u30B9 %s \u306E\u30D7\u30ED\u30D1\u30C6\u30A3 %s \u306B\u5BFE\u3059\u308B\u30BB\u30C3\u30BF\u30FC\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3002
cannotSetCmrCollectionToNull=\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u306E\u5024\u3092\u6301\u3064 CMR \u30D5\u30A3\u30FC\u30EB\u30C9\u3092 null \u306B\u8A2D\u5B9A\u3067\u304D\u307E\u305B\u3093\: %s.%s
relationshipRoleCanNotHaveKeyFields=\u30ED\u30FC\u30EB\uFF1Aforeign-key \u30DE\u30C3\u30D4\u30F3\u30B0\u3092\u4F7F\u3063\u305F\u591A\u91CD\u5EA6\u304C\u591A\u306E%s \u306Fkey-fields \u3092\u6301\u3064\u3053\u3068\u304C\u3067\u304D\u307E\u305B\u3093\u3002
invalidCascadeDeleteForRelation=%s/%s \u306Fjbosscmp-jdbc.xml \u306Bbatch-cascade-delete \u3092\u542B\u3093\u3067\u3044\u307E\u3059\u304C\u3001ejb-jar.xml\u306B\u306Fcascade-delete\u304C\u3042\u308A\u307E\u305B\u3093\u3002
mappingsNotProvidedForAllFieldsForRole=\u5168\u30D5\u30A3\u30FC\u30EB\u30C9\u306B\u5BFE\u3057\u3066\u30DE\u30C3\u30D4\u30F3\u30B0\u306F\u63D0\u4F9B\u3055\u308C\u307E\u305B\u3093\u3067\u3057\u305F\: unmapped fields\=%s in role\=%s
finderFailed=\u691C\u7D22\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
failedToLoadEntity=pk\=%s \u3067 %s \u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u3092\u30ED\u30FC\u30C9\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
entityCommandClassNotSpecified=entity-command \u30AF\u30E9\u30B9\u540D\u304C\u30A8\u30F3\u30C6\u30A3\u30C6\u30A3 %s\u306B\u6307\u5B9A\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
homeInterfaceNoPKMethod.2=\u30DB\u30FC\u30E0\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9 %s \u306B\u306FfindByPrimaryKey(%s) \u304C\u542B\u307E\u308C\u3066\u3044\u307E\u305B\u3093\u3002
localHomeInterfaceNoPKMethod=\u30ED\u30FC\u30AB\u30EB\u306E\u30DB\u30FC\u30E0\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9 %s \u306B\u306F\u3001findByPrimaryKey(%s) \u304C\u542B\u307E\u308C\u3066\u3044\u307E\u305B\u3093\u3002
unsupportedQueryMetadata=\u672A\u5BFE\u5FDC\u306E\u30AF\u30A8\u30EA\u30E1\u30BF\u30C7\u30FC\u30BF\: method\=%s, metadata\=%s
cannotReturnNullForPrimitive=\u30D7\u30EA\u30DF\u30C6\u30A3\u30D6\u578B %s \u306E\u5024\u3068\u3057\u3066 null \u3092\u8FD4\u3059\u3053\u3068\u304C\u3067\u304D\u307E\u305B\u3093\u3002
attemptToModifyPkThroughFk=\u30D7\u30E9\u30A4\u30DE\u30EA\u30AD\u30FC\u30D5\u30A3\u30FC\u30EB\u30C9\u306B\u30DE\u30C3\u30D4\u30F3\u30B0\u3055\u308C\u305F\u5916\u90E8\u30AD\u30FC\u30D5\u30A3\u30FC\u30EB\u30C9\u3092\u4F7F\u3044\u30D7\u30E9\u30A4\u30DE\u30EA\u30AD\u30FC\u30D5\u30A3\u30FC\u30EB\u30C9\u3092\u5909\u66F4\u3057\u3088\u3046\u3057\u3057\u3066\u3044\u307E\u3059\: %s.%s -> %s.%s, current value\=%s, new value\=%s
singleValuedCmrFieldAlreadyLoaded=%s.%s single-valued CMR \u30D5\u30A3\u30FC\u30EB\u30C9\u306F\u3059\u3067\u306B\u30ED\u30FC\u30C9\u3055\u308C\u3066\u3044\u307E\u3059\u3002\u6574\u5408\u6027\u304C\u3042\u308B\u304B\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044\u3002current value\=%s, loaded value\=%s
collectionValuedCmrFieldAlreadyLoaded=%s.%s collection-valued CMR \u30D5\u30A3\u30FC\u30EB\u30C9\u306F\u3059\u3067\u306B\u30ED\u30FC\u30C9\u3055\u308C\u3066\u3044\u307E\u3059\u3002\u6574\u5408\u6027\u304C\u3042\u308B\u304B\u30C7\u30FC\u30BF\u30D9\u30FC\u30B9\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044\u3002current value\=%s, loaded value\=%s
failedToLoadRelatedRole=\u95A2\u9023\u30ED\u30FC\u30EB\u306E\u30ED\u30FC\u30C9\u306B\u5931\u6557\u3057\u307E\u3057\u305F\: ejb-name\=%s, cmr-field\=%s
unexpectedRowState=\u4E88\u671F\u305B\u306C\u884C\u306E\u30B9\u30C6\u30FC\u30BF\u30B9\: table\=%s, pk\=%s, state\=%s
failedToLoadField=\u30D5\u30A3\u30FC\u30EB\u30C9%s.%s\u306E\u30ED\u30FC\u30C9\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
lockAcquisitionRejected=%s \u306B\u5BFE\u3059\u308B\u30ED\u30C3\u30AF\u53D6\u5F97\u304C\u62D2\u5426\u3055\u308C\u307E\u3057\u305F\u3002%s, id\=%s\u306B\u3088\u308B\u66F4\u65B0\u7528\u306B\u30A8\u30F3\u30C8\u30EA\u304C\u30ED\u30C3\u30AF\u3055\u308C\u3066\u3044\u307E\u3059\u3002
lockReleaseRejected=%s \u306E\u30ED\u30C3\u30AF\u89E3\u653E\u304C\u5374\u4E0B\u3055\u308C\u307E\u3057\u305F\u3002%s, id\=%s\u306B\u3088\u308B\u66F4\u65B0\u7528\u306B\u30A8\u30F3\u30C8\u30EA\u304C\u30ED\u30C3\u30AF\u3055\u308C\u3066\u3044\u307E\u3059\u3002
failedToLoadRow=\u884C\u306E\u30ED\u30FC\u30C9\u306B\u5931\u6557\u3057\u307E\u3057\u305F\: table\=%s, pk\=%s
failedToDeleteView=\u30D3\u30E5\u30FC\u306E\u524A\u9664\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
failedToUpdateTable=\u66F4\u65B0\u306B\u5931\u6557\u3057\u307E\u3057\u305F\:table\=%s
failedToInsertNewRows=\u65B0\u3057\u3044\u884C\u3092\u633F\u5165\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
instanceAlreadyRemovedLocal=\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306F\u3059\u3067\u306B\u524A\u9664\u3055\u308C\u307E\u3057\u305F\: id\=%s
