# These files are generated via Zanata (https://translate.jboss.org/project/view/jboss_as).
# Please do not update this file as it will be overwritten.

slaveControllerCannotAcceptOtherSlaves=Enregistrement des h\u00F4tes distants n'est pas pris en charge pour les contr\u00F4leurs d'h\u00F4tes esclaves.
adminOnlyModeCannotAcceptSlaves=Le master du contr\u00F4leur d'h\u00F4te ne peut pas enregistrer les contr\u00F4leurs d'h\u00F4te car son mode actuel d'ex\u00E9cution est '%s'
slaveAlreadyRegistered=Il existe d\u00E9j\u00E0 un h\u00F4te enregistr\u00E9 nomm\u00E9 '%s'
requiredChildIsMissing=%s est manquant %s \: %s
unrecognizedChildren=%s reconna\u00EEt %s uniquement en tant qu'enfants \: %s
inSeriesIsMissingGroups=in-series devrait contenir les groupes \: %s
serverGroupExpectsSingleChild=server-group s'attend \u00E0 un et un seul enfant \: %s
unexpectedInSeriesGroup=L'un des groupes ne d\u00E9finit ni le server-group no les concurrent-groups \: %s
unexplainedFailure=\u00C9chec non expliqu\u00E9
operationFailedOrRolledBack=L'op\u00E9ration a \u00E9chou\u00E9 ou \u00E0 \u00E9t\u00E9 renvoy\u00E9e sur tous les serveurs.
interruptedAwaitingResultFromServer=Attente de r\u00E9sultat serveur %s interrompue
exceptionAwaitingResultFromServer=Exception lors de l'attente d'un r\u00E9sultat du serveur %s \: %s
invalidRolloutPlan.2=Plan de lancement non valide. %s n'est pas un enfant de n\u0153ud %s valide
invalidRolloutPlan.1=Plan de lancement non valide. Les op\u00E9rations du plan affectent les groupes de serveur %s qui ne sont pas repr\u00E9sent\u00E9s dans le plan de lancement
invalidRolloutPlanGroupAlreadyExists=Plan de lancement non valide. Le groupe de serveur %s appara\u00EEt plus d'une occasion dans le plan.
invalidRolloutPlanRange=Plan de lancement non valide. Le groupe de serveur %s poss\u00E8de une valeur %s de %s; doit \u00EAtre contenue entre 0 et 100.
invalidRolloutPlanLess=Plan de lancement non valide. Le groupe de serveur a une valeur %s de %s; ne peut pas \u00EAtre inf\u00E9rieure \u00E0 0.
interruptedAwaitingResultFromHost=Interrompu en attendant le r\u00E9sultat de l'h\u00F4te %s
exceptionAwaitingResultFromHost=Exception lors de l'attente d'un r\u00E9sultat de l'h\u00F4te %s \: %s
masterDomainControllerOnlyOperation=L'op\u00E9ration %s pour l'adresse %s ne peut \u00EAtre g\u00E9r\u00E9e que par le Contr\u00F4leur de domaine ma\u00EEtre; cet h\u00F4te n'est pas la Contr\u00F4leur de domaine ma\u00EEtre.
noHandlerForOperation=Pas de handler pour l'op\u00E9ration %s \u00E0 l'adresse %s
invalidOperationTargetHost=L'op\u00E9ration vise l'h\u00F4te %s mais l'h\u00F4te %s n'est pas enregistr\u00E9
caughtExceptionStoringDeploymentContent=%s intercept\u00E9 lors du stockage du contenu de d\u00E9ploiement -- %s
unexpectedInitialPathKey=Cl\u00E9 de chemin d'acc\u00E8s de d\u00E9part %s non attendue
nullStream=Aucun flux \u00E0 l'index %d
invalidByteStream=Flux d'octets non valide
invalidUrlStream=Flux URL non valide
as7431=1 seule portion de contenu est actuellement prise en charge (AS7-431)
noDeploymentContentWithHash=Aucun d\u00E9ploiement ayant pour hachage %s est disponible dans le r\u00E9f\u00E9rentiel de contenu de d\u00E9ploiement.
slaveCannotAcceptUploads=Un contr\u00F4leur de domaine esclave ne peut pas accepter les chargements de contenu de d\u00E9ploiement
noDeploymentContentWithName=Aucun d\u00E9ploiement ayant pour nom %s trouv\u00E9
cannotRemoveDeploymentInUse=Impossible de supprimer le d\u00E9ploiement %s du domaine %s car il est toujours utilis\u00E9 par les groupes de serveurs %s
invalidValue='%s' non valide \: %d, l'index maximum est %d
invalidUrl=%s n'est pas un URL vbalide -- %s
errorObtainingUrlStream=Erreur d'obtention de flux entrant en provenance de URL %s -- %s
invalidContentDeclaration=D\u00E9claration de contenu non valide
nullVar=% est null
cannotUseSameValueForParameters=Impossible d'utiliser %s avec la m\u00EAme valeur pour les param\u00E8tres %s et %s. Utiliser %s pour red\u00E9ployer le m\u00EAme contenu ou %s pour remplacer le contenu avec une nouvelle version du m\u00EAme nom.
deploymentAlreadyStarted=Le d\u00E9ploiement %s a d\u00E9j\u00E0 d\u00E9marr\u00E9
unknown=%s %s Inconnu
unknownServerGroup=Groupe de serveur %s inconnu
unknownServer=Serveur %s inconnu
invalidCode=Code %d non valide
deploymentHashNotFoundInRepository=Le r\u00E9f\u00E9rentiel ne contient aucun d\u00E9ploiement ayant pour hachage %s
expectedOnlyOneDeployment=Un seul d\u00E9ploiement attendu, %d trouv\u00E9
noProfileCalled=Aucun profil attendu \: %s
noDeploymentContentWithHashAtBoot=Aucun contenu de d\u00E9ploiement avec le hachage %s n'est disponible dans le r\u00E9f\u00E9rentiel de contenu de d\u00E9ploiement pour le d\u00E9ploiement de '%s'. Il s'agit d'une erreur fatale de d\u00E9marrage. Pour corriger le probl\u00E8me, soit red\u00E9marrer par admin-only et utiliser CLI pour installer le contenu manquant ou le supprimer de la configuration, ou encore, retirer le d\u00E9ploiement du fichier de configuration xml et red\u00E9marrez.
