slaveControllerCannotAcceptOtherSlaves=Registro de hosts remotos no se soporta en controladores host esclavos
adminOnlyModeCannotAcceptSlaves=El controlador host maestro no puede registrar controladores host esclavos ya que su modo actual de ejecuci\u00F3n es '%s'
slaveAlreadyRegistered=Ya hay un host registrado llamado '%s'
requiredChildIsMissing=%s le falta %s\: %s
unrecognizedChildren=%s reconoce solo %s como hijos\: %s
inSeriesIsMissingGroups=en-serie le faltan grupos\: %s
serverGroupExpectsSingleChild=server-group espera uno y s\u00F3lo un hijo\: %s
unexpectedInSeriesGroup=Uno de los grupos no define server-group ni concurrent-groups\: %s
unexplainedFailure=Falla inexplicable
operationFailedOrRolledBack=Operaci\u00F3n fallida o se deshizo en todos los servidores.
interruptedAwaitingResultFromServer=Interrumpido esperando el resultado del servidor %s
exceptionAwaitingResultFromServer=Excepci\u00F3n al obtener el resultado del servidor %s\: %s
invalidRolloutPlan.2=Plan despliegue inv\u00E1lido. %s no es un hijo v\u00E1lido del nodo %s
invalidRolloutPlan.1=Plan despliegue inv\u00E1lido. Las operaciones del plan afectan los grupos del servidor %s que no se reflejan en el plan rollout
invalidRolloutPlanGroupAlreadyExists=Plan de despliegue inv\u00E1lido. El grupo de servidores %s aparece m\u00E1s de una vez en el plan.
invalidRolloutPlanRange=Plan de despliegue inv\u00E1lido. El grupo de servidores %s tiene un valor %s de %s; debe estar entre 0 y 100.
invalidRolloutPlanLess=Plan de despliegue inv\u00E1lido. El grupo de servidores %s tiene un valor %s de %s; no puede ser menor que 0.
interruptedAwaitingResultFromHost=Interrumpido esperando el resultado del host %s
exceptionAwaitingResultFromHost=Excepci\u00F3n al obtener el resultado del host %s\: %s
masterDomainControllerOnlyOperation=Operaci\u00F3n %s para la direcci\u00F3n %s s\u00F3lo se puede manejar por el controlador del dominio maestro; este host no es el controlador del dominio maestro
noHandlerForOperation=No hay manejador para la operaci\u00F3n %s en la direcci\u00F3n %s
invalidOperationTargetHost=Operaci\u00F3n apunta al host %s pero ese host no est\u00E1 registrado
caughtExceptionStoringDeploymentContent=Atrap\u00F3 %s almacenando el contenido de la implementaci\u00F3n -- %s
unexpectedInitialPathKey=Llave de ruta inicial inesperada %s
nullStream=Flujo nulo en el \u00EDndice %d
invalidByteStream=Flujo inv\u00E1lido de bytes.
invalidUrlStream=Flujo inv\u00E1lido url.
as7431=Actualmente se soporta s\u00F3lo un pedazo de contenido (AS7-431)
noDeploymentContentWithHash=No se encuentra disponible el contenido de implementaci\u00F3n con hash %s en el repositorio de contenido de la implementaci\u00F3n.
slaveCannotAcceptUploads=Un controlador de dominio esclavo no puede aceptar las cargas de contenido de implementaci\u00F3n
noDeploymentContentWithName=No se encontr\u00F3 una implementaci\u00F3n con el nombre %s
cannotRemoveDeploymentInUse=No se puede borrar la implementaci\u00F3n %s del dominio ya que los grupos de servidores todav\u00EDa lo est\u00E1n utilizando %s
invalidValue=Valor inv\u00E1lido '%s'\: %d, el \u00EDndice m\u00E1ximo es %d
invalidUrl=%s no es una URL v\u00E1lida -- %s
errorObtainingUrlStream=Error al obtener el flujo de entrada de URL %s -- %s
invalidContentDeclaration=Declaraci\u00F3n inv\u00E1lida de contenido
nullVar=%s es nulo
cannotUseSameValueForParameters=No se puede utilizar %s con el mismo valor para los par\u00E1metros %s y %s. Use %s para volver a implementar el mismo contenido o %s para reemplazar contenido con una nueva versi\u00F3n con el mismo nombre.
deploymentAlreadyStarted=La implementaci\u00F3n %s ya inici\u00F3
unknown=Desconocido %s %s
unknownServerGroup=Grupo de servidores desconocido %s
unknownServer=Servidor desconocido %s
invalidCode=C\u00F3digo inv\u00E1lido %d
deploymentHashNotFoundInRepository=El repositorio no tiene ninguna implementaci\u00F3n con hash %s
expectedOnlyOneDeployment=Se esperaba s\u00F3lamente una implementaci\u00F3n, se encontr\u00F3 %d
noProfileCalled=No se llam\u00F3 a ning\u00FAn perfil\: %s
noDeploymentContentWithHashAtBoot=No hay disponible ning\u00FAn contenido de implementaci\u00F3n con hash %s en el repositorio de contenido de la implementaci\u00F3n para desplegarlo '%s'. Este es un error fatal de arranque. Para corregir el problema puede re-iniciar con la opci\u00F3n --admin-only y usar el CLI para instalar el contenido que falta o b\u00F3rrelo de la configuraci\u00F3n o borre la implementaci\u00F3n del archivo de configuraci\u00F3n xml y re-inicie.
