slaveControllerCannotAcceptOtherSlaves=O registro de hosts remotos n\u00E3o \u00E9 suportado nos controladores do host subordinado
adminOnlyModeCannotAcceptSlaves=O controlador do host mestre n\u00E3o pode registrar os controladores do host subordinado uma vez que seu modo atual sendo rodado \u00E9 '%s'
slaveAlreadyRegistered=J\u00E1 existe um host registrado nomeado '%s'
requiredChildIsMissing=Falta %s no %s\: %s
unrecognizedChildren=O %s reconhece apenas %s como filho\: %s
inSeriesIsMissingGroups=faltam grupos no in-series\: %s
serverGroupExpectsSingleChild=o server-group espera apenas um filho\: %s
unexpectedInSeriesGroup=Um dos grupos que n\u00E3o define o server-group nem o concurrent-groups\: %s
unexplainedFailure=Falha inexperada
operationFailedOrRolledBack=Falha na opera\u00E7\u00E3o ou ocorreu revers\u00E3o em todos os servidores. 
interruptedAwaitingResultFromServer=Interrup\u00E7\u00E3o na espera de resultado pelo servidor %s
exceptionAwaitingResultFromServer=Exce\u00E7\u00E3o na obten\u00E7\u00E3o do resultado pelo servidor %s\: %s 
invalidRolloutPlan.2=Plano de distribui\u00E7\u00E3o inv\u00E1lido. %s n\u00E3o \u00E9 um filho v\u00E1lido do n\u00F3 %s
invalidRolloutPlan.1=Plano de distribui\u00E7\u00E3o inv\u00E1lido. As opera\u00E7\u00F5es do plano afetam os grupos do servidor %s que n\u00E3o refletem no plano de distribui\u00E7\u00E3o
invalidRolloutPlanGroupAlreadyExists=Plano de distribui\u00E7\u00E3o inv\u00E1lido. O %s do grupo do servidor aparece mais de uma vez no plano.
invalidRolloutPlanRange=Plano de distribui\u00E7\u00E3o inv\u00E1lido. O %s do grupo do servidor possui um %s valor de %s\: deve ser entre 0 e 100.
invalidRolloutPlanLess=Plano de distribui\u00E7\u00E3o inv\u00E1lido. O %s do grupo do servidor possui um %s valor de %s\: n\u00E3o pode ser menor do que 0.
interruptedAwaitingResultFromHost=Interrup\u00E7\u00E3o na espera pelo resultado de um host %s
exceptionAwaitingResultFromHost=Exce\u00E7\u00E3o na obten\u00E7\u00E3o de resultado por um host %s\: %s
masterDomainControllerOnlyOperation=A opera\u00E7\u00E3o %s para o endere\u00E7o %s pode ser manuseada pelo Controlador de Dom\u00EDnio; esse host n\u00E3o \u00E9 o Controlador de Dom\u00EDnio mestre
noHandlerForOperation=Nenhum manuseador para a opera\u00E7\u00E3o %s no endere\u00E7o %s
invalidOperationTargetHost=A opera\u00E7\u00E3o destina-se ao host %s mas aquele host n\u00E3o est\u00E1 registrado
caughtExceptionStoringDeploymentContent=N\u00E3o foi poss\u00EDvel armazenar o conte\u00FAdo da implanta\u00E7\u00E3o -- %s
unexpectedInitialPathKey=Chave de caminho inicial inesperada %s
nullStream=Fluxo nulo no \u00EDndice %d
invalidByteStream=Fluxo de byte inv\u00E1lido.
invalidUrlStream=Fluxo de url inv\u00E1lido.
as7431=Apenas  1 peda\u00E7o do conte\u00FAdo \u00E9 suportado (AS7-431)
noDeploymentContentWithHash=Nenhum conte\u00FAdo de implanta\u00E7\u00E3o com hash %s est\u00E1 dispon\u00EDvel no reposit\u00F3rio do conte\u00FAdo de implanta\u00E7\u00E3o. 
slaveCannotAcceptUploads=O controlador do dom\u00EDnio subordinado n\u00E3o pode aceitar as atualiza\u00E7\u00F5es do conte\u00FAdo da implanta\u00E7\u00E3o
noDeploymentContentWithName=N\u00E3o foi encontrado nenhuma implanta\u00E7\u00E3o com o nome %s
cannotRemoveDeploymentInUse=N\u00E3o foi poss\u00EDvel remover a implanta\u00E7\u00E3o%s do dom\u00EDnio uma vez que ele continua a ser usado por grupos de servidor %s
invalidValue=Valor '%s' inv\u00E1lido\: %d, o \u00EDndice m\u00E1ximo \u00E9 %d
invalidUrl=%s n\u00E3o \u00E9 um URL v\u00E1lido -- %s
errorObtainingUrlStream=Ocorreu um erro ao obter o fluxo de entrada do URL %s -- %s
invalidContentDeclaration=Declara\u00E7\u00E3o de conte\u00FAdo inv\u00E1lido
nullVar=O %s \u00E9 nulo 
cannotUseSameValueForParameters=N\u00E3o foi poss\u00EDvel usar %s com o mesmo valor para os par\u00E2metros %s e %s. Use %s para reimplantar o mesmo conte\u00FAdo ou %s para substituir o conte\u00FAdo por uma nova vers\u00E3o com o mesmo nome.
deploymentAlreadyStarted=A implanta\u00E7\u00E3o %s j\u00E1 foi inicializada
unknown=%s %s desconhecido
unknownServerGroup=%s grupo do servidor desconhecido
unknownServer=Servidor desconhecido %s
invalidCode=C\u00F3digo inv\u00E1lido %d
deploymentHashNotFoundInRepository=O reposit\u00F3rio n\u00E3o cont\u00E9m quaisquer implanta\u00E7\u00F5es com hash %s
expectedOnlyOneDeployment=Apenas uma implanta\u00E7\u00E3o foi aceita, encontrada apenas %d
noProfileCalled=Nenhum perfil foi chamado\: %s
noDeploymentContentWithHashAtBoot=Nenhum conte\u00FAdo de implanta\u00E7\u00E3o com hash %s dispon\u00EDvel no reposit\u00F3rio do conte\u00FAdo de implanta\u00E7\u00E3o para a implanta\u00E7\u00E3o '%s'. Esse \u00E9 um erro de inicializa\u00E7\u00E3o fatal. Para corrigir esse problema, reinicie com a op\u00E7\u00E3o de configura\u00E7\u00E3o --admin-only e use o CLI para instalar o resto do conte\u00FAdo que falta, ou remova-o da configura\u00E7\u00E3o. Alternativamente, remova a implanta\u00E7\u00E3o do arquivo de configura\u00E7\u00E3o xml e reinicie a m\u00E1quina.
