# These files are generated via Zanata (https://translate.jboss.org/project/view/jboss_as).
# Please do not update this file as it will be overwritten.

slaveControllerCannotAcceptOtherSlaves=\u30B9\u30EC\u30FC\u30D6\u306E\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u3067\u30EA\u30E2\u30FC\u30C8\u30DB\u30B9\u30C8\u3092\u767B\u9332\u3067\u304D\u307E\u305B\u3093\u3002
adminOnlyModeCannotAcceptSlaves=\u73FE\u5728\u306E\u7A3C\u50CD\u30E2\u30FC\u30C9\u304C '%s' \u3067\u3042\u308B\u305F\u3081\u3001\u30DE\u30B9\u30BF\u30FC\u306E\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u306F\u30B9\u30EC\u30FC\u30D6\u306E\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u3092\u767B\u9332\u3067\u304D\u307E\u305B\u3093\u3002
slaveAlreadyRegistered='%s' \u3068\u3044\u3046\u540D\u524D\u306E\u767B\u9332\u6E08\u307F\u30DB\u30B9\u30C8\u304C\u5B58\u5728\u3057\u307E\u3059\u3002
requiredChildIsMissing=%1$s \u306B\u306F %2$s \u304C\u3042\u308A\u307E\u305B\u3093\: %3$s
unrecognizedChildren=%1$s \u306F %2$s \u306E\u307F\u3092\u5B50\u3068\u3057\u3066\u8A8D\u8B58\u3057\u307E\u3059\: %3$s
inSeriesIsMissingGroups=in-series \u306B\u30B0\u30EB\u30FC\u30D7\u304C\u3042\u308A\u307E\u305B\u3093\: %s
serverGroupExpectsSingleChild=server-group \u304C\u5FC5\u8981\u306A\u306E\u306F\u5B50 1 \u3064\u306E\u307F\u3067\u3059\: %s
unexpectedInSeriesGroup=\u30B0\u30EB\u30FC\u30D7\u306E 1 \u3064\u306F server-group \u3068 concurrent-groups\u306E\u3044\u305A\u308C\u3082\u5B9A\u7FA9\u3057\u3066\u3044\u307E\u305B\u3093\: %s
unexplainedFailure=\u4E0D\u660E\u306A\u30A8\u30E9\u30FC
operationFailedOrRolledBack=\u64CD\u4F5C\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002\u3042\u308B\u3044\u306F\u5168\u30B5\u30FC\u30D0\u30FC\u4E0A\u3067\u30ED\u30FC\u30EB\u30D0\u30C3\u30AF\u3055\u308C\u307E\u3057\u305F\u3002
interruptedAwaitingResultFromServer=\u30B5\u30FC\u30D0\u30FC %s \u304B\u3089\u306E\u7D50\u679C\u3092\u5F85\u3063\u3066\u3044\u308B\u969B\u306B\u4E2D\u65AD\u3055\u308C\u307E\u3057\u305F\u3002
exceptionAwaitingResultFromServer=\u30B5\u30FC\u30D0\u30FC %1$s \u304B\u3089\u7D50\u679C\u3092\u53D6\u5F97\u6642\u306E\u4F8B\u5916\: %2$s
invalidRolloutPlan.2=\u30ED\u30FC\u30EB\u30A2\u30A6\u30C8\u30D7\u30E9\u30F3\u306F\u7121\u52B9\u3067\u3059\u3002%1$s \u306F\u30CE\u30FC\u30C9 %2$s \u306E\u6709\u52B9\u306A\u5B50\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3002
invalidRolloutPlan.1=\u30ED\u30FC\u30EB\u30A2\u30A6\u30C8\u30D7\u30E9\u30F3\u306F\u7121\u52B9\u3067\u3059\u3002\u3053\u306E\u30ED\u30FC\u30EB\u30A2\u30A6\u30C8\u30D7\u30E9\u30F3\u306B\u53CD\u6620\u3055\u308C\u3066\u3044\u306A\u3044\u30B5\u30FC\u30D0\u30FC\u30B0\u30EB\u30FC\u30D7 %s \u3082\u30D7\u30E9\u30F3\u306E\u64CD\u4F5C\u5BFE\u8C61\u3068\u306A\u3063\u3066\u3044\u307E\u3059\u3002
invalidRolloutPlanGroupAlreadyExists=\u30ED\u30FC\u30EB\u30A2\u30A6\u30C8\u30D7\u30E9\u30F3\u306F\u7121\u52B9\u3067\u3059\u3002\u3053\u306E\u30D7\u30E9\u30F3\u306B\u8907\u6570\u306E\u30B5\u30FC\u30D0\u30FC\u30B0\u30EB\u30FC\u30D7 %s \u304C\u8868\u793A\u3055\u308C\u3066\u3044\u307E\u3059\u3002
invalidRolloutPlanRange=\u30ED\u30FC\u30EB\u30A2\u30A6\u30C8\u30D7\u30E9\u30F3\u306F\u7121\u52B9\u3067\u3059\u3002\u30B5\u30FC\u30D0\u30FC\u30B0\u30EB\u30FC\u30D7 %1$s \u306F %2$s \u306E\u5024 %3$s \u3092\u6301\u3063\u3066\u3044\u307E\u3059\u304C\u3001\u5024\u306F 0 \u304B\u3089 100 \u306E\u9593\u3067\u306A\u3051\u308C\u3070\u306A\u308A\u307E\u305B\u3093\u3002
invalidRolloutPlanLess=\u30ED\u30FC\u30EB\u30A2\u30A6\u30C8\u30D7\u30E9\u30F3\u306F\u7121\u52B9\u3067\u3059\u3002\u30B5\u30FC\u30D0\u30FC\u30B0\u30EB\u30FC\u30D7 %1$s \u306F %2$s \u306E\u5024 %3$s \u3092\u6301\u3063\u3066\u3044\u307E\u3059\u304C\u3001\u5024\u306F 0 \u672A\u6E80\u306B\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
interruptedAwaitingResultFromHost=\u30DB\u30B9\u30C8 %s \u304B\u3089\u7D50\u679C\u3092\u5F85\u6A5F\u4E2D\u306B\u4E2D\u65AD\u3055\u308C\u307E\u3057\u305F\u3002
exceptionAwaitingResultFromHost=\u30DB\u30B9\u30C8 %1$s \u304B\u3089\u7D50\u679C\u3092\u53D6\u5F97\u6642\u306E\u4F8B\u5916\: %2$s
masterDomainControllerOnlyOperation=\u30A2\u30C9\u30EC\u30B9 %2$s \u306B\u5BFE\u3059\u308B\u64CD\u4F5C %1$s \u306F\u30DE\u30B9\u30BF\u30FC\u306E\u30C9\u30E1\u30A4\u30F3\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u3067\u306E\u307F\u51E6\u7406\u53EF\u80FD\u3067\u3059\u3002\u3053\u306E\u30DB\u30B9\u30C8\u306F\u30DE\u30B9\u30BF\u30FC\u306E\u30C9\u30E1\u30A4\u30F3\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3002
noHandlerForOperation=\u30A2\u30C9\u30EC\u30B9 %2$s \u306B\u64CD\u4F5C %1$s \u306B\u5BFE\u3059\u308B\u30CF\u30F3\u30C9\u30E9\u30FC\u306F\u5B58\u5728\u3057\u307E\u305B\u3093\u3002
invalidOperationTargetHost=\u64CD\u4F5C\u306F\u30DB\u30B9\u30C8 %s \u3092\u5BFE\u8C61\u3068\u3057\u307E\u3059\u304C\u3001\u3053\u306E\u30DB\u30B9\u30C8\u306F\u767B\u9332\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
caughtExceptionStoringDeploymentContent=\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30B3\u30F3\u30C6\u30F3\u30C4\u306E\u4FDD\u5B58\u6642\u306B %1$s \u3092\u691C\u51FA\u3057\u307E\u3057\u305F -- %2$s
unexpectedInitialPathKey=\u4E88\u671F\u305B\u306C\u521D\u671F\u306E\u30D1\u30B9\u30AD\u30FC %s
nullStream=\u30A4\u30F3\u30C7\u30C3\u30AF\u30B9 %d \u306E\u30B9\u30C8\u30EA\u30FC\u30E0\u306F null \u3067\u3059\u3002
invalidByteStream=\u30D0\u30A4\u30C8\u30B9\u30C8\u30EA\u30FC\u30E0\u306F\u7121\u52B9\u3067\u3059\u3002
invalidUrlStream=url \u30B9\u30C8\u30EA\u30FC\u30E0\u306F\u7121\u52B9\u3067\u3059\u3002
as7431=\u73FE\u5728\u5BFE\u5FDC\u3057\u3066\u3044\u308B\u306E\u306F\u30B3\u30F3\u30C6\u30F3\u30C4\u306E\u3046\u3061 1 \u3064\u306E\u307F\u3067\u3059\u3002(AS7-431)
noDeploymentContentWithHash=\u30CF\u30C3\u30B7\u30E5 %s \u3092\u6301\u3064\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30B3\u30F3\u30C6\u30F3\u30C4\u306E\u3046\u3061\u3001\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30B3\u30F3\u30C6\u30F3\u30C4\u30EC\u30DD\u30B8\u30C8\u30EA\u3067\u5229\u7528\u3067\u304D\u308B\u3082\u306E\u306F\u3042\u308A\u307E\u305B\u3093\u3002
slaveCannotAcceptUploads=\u30B9\u30EC\u30FC\u30D6\u306E\u30C9\u30E1\u30A4\u30F3\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u306F\u3001\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30B3\u30F3\u30C6\u30F3\u30C4\u306E\u30A2\u30C3\u30D7\u30ED\u30FC\u30C9\u3092\u53D7\u3051\u4ED8\u3051\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u305B\u3093\u3002
noDeploymentContentWithName=%s \u3068\u3044\u3046\u540D\u524D\u306E\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002
cannotRemoveDeploymentInUse=\u30B5\u30FC\u30D0\u30FC\u30B0\u30EB\u30FC\u30D7 %2$s \u304C\u5229\u7528\u3057\u3066\u3044\u308B\u305F\u3081\u3001\u30C9\u30E1\u30A4\u30F3\u304B\u3089\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8 %1$s \u3092\u524A\u9664\u3067\u304D\u307E\u305B\u3093\u3002
invalidValue=\u7121\u52B9\u306A '%1$s' \u5024\: %2$d\u3001\u6700\u5927\u30A4\u30F3\u30C7\u30C3\u30AF\u30B9\u306F %3$d \u3067\u3059\u3002
invalidUrl=%1$s \u306F\u6709\u52B9\u306A URL \u3067\u306F\u3042\u308A\u307E\u305B\u3093 -- %2$s
errorObtainingUrlStream=URL %1$s \u304B\u3089\u306E\u5165\u529B\u30B9\u30C8\u30EA\u30FC\u30E0\u306E\u53D6\u5F97\u30A8\u30E9\u30FC -- %2$s
invalidContentDeclaration=\u30B3\u30F3\u30C6\u30F3\u30C4\u306E\u5BA3\u8A00\u306F\u7121\u52B9\u3067\u3059\u3002
nullVar=%s \u306F null \u3067\u3059\u3002
cannotUseSameValueForParameters=\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC %2$s \u3068 %3$s \u306B\u5BFE\u3057\u3066\u540C\u3058\u5024\u3092\u6301\u3064 %1$s \u3092\u5229\u7528\u3067\u304D\u307E\u305B\u3093\u3002%4$s \u3092\u4F7F\u3044\u540C\u3058\u30B3\u30F3\u30C6\u30F3\u30C4\u3092\u518D\u5EA6\u30C7\u30D7\u30ED\u30A4\u3059\u308B\u304B\u3001%5$s \u3092\u4F7F\u3044\u540C\u3058\u540D\u524D\u3067\u65B0\u3057\u3044\u30D0\u30FC\u30B8\u30E7\u30F3\u306E\u30B3\u30F3\u30C6\u30F3\u30C4\u3068\u7F6E\u304D\u63DB\u3048\u3066\u304F\u3060\u3055\u3044\u3002
deploymentAlreadyStarted=\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8 %s \u306F\u3059\u3067\u306B\u958B\u59CB\u3055\u308C\u3066\u3044\u307E\u3059\u3002
unknown=\u4E0D\u660E\u306A %1$s %2$s
unknownServerGroup=\u4E0D\u660E\u306A\u30B5\u30FC\u30D0\u30FC\u30B0\u30EB\u30FC\u30D7 %s
unknownServer=\u4E0D\u660E\u306A\u30B5\u30FC\u30D0\u30FC %s
invalidCode=\u7121\u52B9\u306A\u30B3\u30FC\u30C9 %d
deploymentHashNotFoundInRepository=\u30EC\u30DD\u30B8\u30C8\u30EA\u306B\u306F\u30CF\u30C3\u30B7\u30E5 %s \u3092\u6301\u3064\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u304C\u542B\u307E\u308C\u3066\u3044\u307E\u305B\u3093\u3002
expectedOnlyOneDeployment=\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C81\u3064\u306E\u307F\u304C\u5FC5\u8981\u3067\u3057\u305F\u304C \u898B\u3064\u304B\u3063\u305F\u306E\u306F %d \u3067\u3057\u305F\u3002
noProfileCalled=\u547C\u3073\u51FA\u3055\u308C\u305F\u30D7\u30ED\u30D5\u30A1\u30A4\u30EB\u306F\u3042\u308A\u307E\u305B\u3093\: %s
noDeploymentContentWithHashAtBoot=\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8 %2$s \u306E\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30B3\u30F3\u30C6\u30F3\u30C4\u30EA\u30DD\u30B8\u30C8\u30EA\u306B\u30CF\u30C3\u30B7\u30E5 %1$s \u3092\u6301\u3064\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30B3\u30F3\u30C6\u30F3\u30C4\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3002\u3053\u308C\u306F\u81F4\u547D\u7684\u306A\u8D77\u52D5\u30A8\u30E9\u30FC\u3067\u3059\u3002\u3053\u306E\u554F\u984C\u3092\u89E3\u6C7A\u3059\u308B\u306B\u306F\u3001--admin-only \u30B9\u30A4\u30C3\u30C1\u30BB\u30C3\u30C8\u3067\u518D\u8D77\u52D5\u3059\u308B\u304B\u3001CLI \u3092\u4F7F\u3044\u8DB3\u308A\u306A\u3044\u30B3\u30F3\u30C6\u30F3\u30C4\u3092\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u3059\u308B\u304B\u3001\u3042\u308B\u3044\u306F\u8A2D\u5B9A\u304B\u3089\u524A\u9664\u3059\u308B\u304B\u3001\u3042\u308B\u3044\u306F xml \u8A2D\u5B9A\u30D5\u30A1\u30A4\u30EB\u304B\u3089\u305D\u306E\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u3092\u524A\u9664\u3057\u518D\u8D77\u52D5\u3057\u3066\u304F\u3060\u3055\u3044\u3002
