# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-jmx/org/jboss/as/jmx/LocalDescriptions, author ldelima@redhat.com
jmx=A configura\u00E7\u00E3o do subsistema JMX.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-jmx/org/jboss/as/jmx/LocalDescriptions, author ldelima@redhat.com
jmx.add=Adiciona o subsistema JMX.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-jmx/org/jboss/as/jmx/LocalDescriptions, author ldelima@redhat.com
jmx.remove=Remove o subsistema JMX.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-jmx/org/jboss/as/jmx/LocalDescriptions, author ldelima@redhat.com
jmx.connector=Conectores para o subsistema JMX.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-jmx/org/jboss/as/jmx/LocalDescriptions, author ldelima@redhat.com
jmx.remoting-connector=Os conectores remoto do JBoss para o subsistema JMX.
expose-model.expression=A configura\u00E7\u00E3o de exposi\u00E7\u00E3o do controlador do modelo de 'express\u00E3o' no MBeanServer. Esta fachada demonstrar\u00E1 todos os atributos simples e par\u00E2metros de opera\u00E7\u00E3o como Sequ\u00EAncia. Isto l\u00EA o retorno da express\u00E3o n\u00E3o resolvida. Voc\u00EA pode usar express\u00F5es quando gravando atributos e determinando os par\u00E2metros de opera\u00E7\u00E3o.
expose-model.expression.add=Adiciona a fachada JMX do controlador do modelo 'express\u00E3o' para o MBeanServer.
expose-model.expression.remove=Remove a fachada JMX do controlador do modelo de 'express\u00E3o' a partir do MBeanServer.
expose-model.expression.domain-name=O nome do dom\u00EDnio para uso da fachada JMX do controlador do modelo de 'express\u00E3o' no MBeanServer.
expose-model.resolved=A configura\u00E7\u00E3o de exposi\u00E7\u00E3o do controlador do modelo 'resolvido' no MBeanServer. Esta fachada demonstrar\u00E1 todos os atributos simples e par\u00E2metros da opera\u00E7\u00E3o conforme o tipo dos mesmos no modelo subjacente. Isto l\u00EA o retorno da express\u00E3o resolvida, caso seja usada, ou o valor bruto. Voc\u00EA pode n\u00E3o usar express\u00F5es quando gravando atributos e configurando par\u00E2metros de opera\u00E7\u00E3o.
expose-model.resolved.add=Adiciona a fachada JMX do controlador do modelo 'resolvido' ao MBeanServer.
expose-model.resolved.remove=Remove a fachada JMX do controlador do modelo 'resolvido' a partir do MBeanServer.
expose-model.resolved.domain-name=O nome do dom\u00EDnio para uso da fachada JMX do controlador do modelo 'resolvido' no MBeanServer.
expose-model.resolved.proper-property-format=Caso falso, os atributos do tipo de PROPRIEDADE s\u00E3o representados como uma sequ\u00EAncia DMR. Esta \u00E9 o comportamento de legacia. Caso verdadeiro, os atributos do tipo de propriedade s\u00E3o representados por um tipo de composi\u00E7\u00E3o onde a chave \u00E9 uma sequ\u00EAncia e o valor possui o mesmo tipo ao da propriedade no modelo subjacente.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-jmx/org/jboss/as/jmx/LocalDescriptions, author ldelima@redhat.com
connector=O conector remoto para o subsistema JMX.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-jmx/org/jboss/as/jmx/LocalDescriptions, author ldelima@redhat.com
connector.add=Adiciona o conector remoto para o subsistema JMX.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-jmx/org/jboss/as/jmx/LocalDescriptions, author ldelima@redhat.com
connector.remove=Remove o conector remoto para o subsistema JMX.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-jmx/org/jboss/as/jmx/LocalDescriptions, author ldelima@redhat.com
connector.registry-binding=O nome do binding de soquete pelo qual os clientes externos ser\u00E3o conectados.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-jmx/org/jboss/as/jmx/LocalDescriptions, author ldelima@redhat.com
connector.server-binding=O nome de um binding de soquete pelo qual o servidor RMI do subsistema JMX e seus objetos RMIConnectionImpl criados ser\u00E3o exportados.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-jmx/org/jboss/as/jmx/LocalDescriptions, author ldelima@redhat.com
remoting-connector=O conector remoto JBoss para o subsistema JMX.
remoting-connector.add=Adiciona o conector para o subsistema JMX.
remoting-connector.remove=Remove o conector para o subsistema JMX.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-jmx/org/jboss/as/jmx/LocalDescriptions, author ldelima@redhat.com
remoting-connector.use-management-endpoint=Caso verdadeiro o conector usar\u00E1 o ponto de extremidade de gerenciamento. Do contr\u00E1rio, isto usar\u00E1 o subsistema remoto.
