# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-jmx/org/jboss/as/jmx/LocalDescriptions, author croe@redhat.com
jmx=La configuration du sous-syst\u00E8me JMX.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-jmx/org/jboss/as/jmx/LocalDescriptions, author croe@redhat.com
jmx.add=Ajoute le sous-syst\u00E8me JMX.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-jmx/org/jboss/as/jmx/LocalDescriptions, author croe@redhat.com
jmx.remove=Supprime le sous-syst\u00E8me JMX.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-jmx/org/jboss/as/jmx/LocalDescriptions, author croe@redhat.com
jmx.show-model=Alias pour l'existence du model controller jmx facade 'resolved'. Pendant l'\u00E9criture, si d\u00E9fini sur 'true' il ajoutera la ressource controller jmx facade du mod\u00E8le 'resolved' avec le nom de domaine par d\u00E9faut.
jmx.non-core-mbean-sensitivity=Indique si les core MBeans, c-a-d les Mbeans qui ne proviennent pas du contr\u00F4leur de mod\u00E8le, doivent \u00EAtre consid\u00E9r\u00E9s comme sensibles.
jmx.expose-model=Expose le contr\u00F4leur de mod\u00E8le dans le MBeanServer. L'expression' child est recommand\u00E9e.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-jmx/org/jboss/as/jmx/LocalDescriptions, author croe@redhat.com
jmx.connector=Connecteurs pour le sous-syst\u00E8me JMX.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-jmx/org/jboss/as/jmx/LocalDescriptions, author croe@redhat.com
jmx.remoting-connector=Connecteurs JBoss distants pour le sous-syst\u00E8me JMX.
jmx.configuration=La configuration du JMX audit logger.
expose-model.expression=La configuration pour exposer l' 'expression' model controller dans le MBeanServer. Cette fa\u00E7ade va exposer tous les param\u00E8tres d'op\u00E9ration et attributs simples comme Strings. Reads renvoie l'expression non r\u00E9solue. Vous pouvez utiliser des expressions quand vous \u00E9crivez des atttributs ou d\u00E9finissez des param\u00E8tres d'op\u1EBFrations.
expose-model.expression.add=Ajoute l' 'expression' model controller JMX facade au MBeanServer.
expose-model.expression.remove=Supprime l' 'expression' model controller JMX facade du MBeanServer.
expose-model.expression.domain-name=Le nom de domaine \u00E0 utiliser pour l'expression model controller jmx facade dans le MBeanServer.
expose-model.resolved=La configuration pour exposer le model controller 'resolved' dans le MBeanServer. Cette fa\u00E7ade va exposer tous les param\u00E8tres d'op\u00E9ration et attributs simples comme leurs types dans le mod\u00E8le sous-jacent. Reads renvoie l'expression r\u00E9solue si utilis\u00E9e, ou bien la valeur raw. Vous pouvez utiliser des expressions quand vous \u00E9crivez des atttributs ou d\u00E9finissez des param\u00E8tres d'op\u1EBFrations.
expose-model.resolved.add=Ajoute le model controller JMX facade 'resolved' au MBeanServer.
expose-model.resolved.remove=Supprime le model controller JMX facade 'resolved' du MBeanServer.
expose-model.resolved.domain-name=Le nom de domaine \u00E0 utiliser pour le model controller jmx facade "resolved' dans le MBeanServer.
expose-model.resolved.proper-property-format=Si false, les attributs de type PROPERTY sont repr\u00E9sent\u00E9s sous forme de string DMR, c'est le comportement h\u00E9rit\u00E9. Si true, les attributs de type PROPERTY sont repr\u00E9sent\u00E9s par un type coposite o\u00F9 la cl\u00E9 est un string, et la valeur a le m\u00EAme type que la propri\u00E9t\u00E9 du mod\u00E8le sous-jacent.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-jmx/org/jboss/as/jmx/LocalDescriptions, author croe@redhat.com
connector=Le connecteur distant pour le sous-syst\u00E8me JMX.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-jmx/org/jboss/as/jmx/LocalDescriptions, author croe@redhat.com
connector.add=Ajoute le connecteur distant pour le sous-syst\u00E8me JMX.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-jmx/org/jboss/as/jmx/LocalDescriptions, author croe@redhat.com
connector.remove=Supprime le connecteur distant pour le sous-syst\u00E8me JMX.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-jmx/org/jboss/as/jmx/LocalDescriptions, author croe@redhat.com
connector.registry-binding=Le nom d'une liaison de socket \u00E0 laquelle les clients de l'ext\u00E9rieur vont se connecter.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-jmx/org/jboss/as/jmx/LocalDescriptions, author croe@redhat.com
connector.server-binding=Le nom d'une liaison de socket sur laquelle le serveur RMI du sous-syst\u00E8me JMX et les objects RMIConncetionImpl qu'il cr\u00E9e seront export\u00E9s.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-jmx/org/jboss/as/jmx/LocalDescriptions, author croe@redhat.com
remoting-connector=Un connecteur distant JBoss pour le sous-syst\u00E8me JMX.
remoting-connector.add=Ajoute le connecteur distant au sous-syst\u00E8me JMX.
remoting-connector.remove=Supprime le connecteur distant au sous-syst\u00E8me JMX.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-jmx/org/jboss/as/jmx/LocalDescriptions, author croe@redhat.com
remoting-connector.use-management-endpoint=Si true, le connecteur utilisera le point de terminaison de gestion, sinon, il utilisera celui du sous-syst\u00E8me distant
audit-log=La ressource d'audit de gestion de niveau sup\u00E9rieur.
audit-log.add=Ajoute la ressource d'audit de gestion de niveau sup\u00E9rieur.
audit-log.remove=Supprime la ressource d'audit de gestion de niveau sup\u00E9rieur.
audit-log.logger=Le service de journalisation d'audit de gestion.
audit-log.logger.add=Ajoute le service de journalisation d'audit de gestion.
audit-log.logger.remove=Supprime le service de journalisation d'audit de gestion.
audit-log.server-logger=Le service de journalisation d'audit de gestion \u00E0 utiliser sur les serveurs g\u00E9r\u00E9s.
audit-log.server-logger.add=Ajoute le service de journalisation d'audit de gestion \u00E0 utiliser sur les serveurs g\u00E9r\u00E9s.
audit-log.server-logger.remove=Supprime le service de journalisation d'audit de gestion \u00E0 utiliser sur les serveurs g\u00E9r\u00E9s.
audit-log.log-boot=Indique si les op\u00E9rations doivent \u00EAtre enregistr\u00E9es au d\u00E9marrage du serveur.
audit-log.log-read-only=Indique si les op\u00E9rations qui ne modifient pas la configuration ou aucun des services de runtime doivent \u00EAtre journalis\u00E9s.
audit-log.enabled=Indique si la journalisation de l'audit des activ\u00E9e.
audit-log.handler=Une r\u00E9f\u00E9rence \u00E0 un fichier ou \u00E0 un handler de syslog audit log. Le nom du handler est d\u00E9fini par la valeur de l'adresse.
# auto translated by TM merge from project: JBoss AS, version: eap6, DocId: org.jboss.as/jboss-as-domain-management/org/jboss/as/domain/management/_private/LocalDescriptions
audit-log.handler.add=Ajoute une r\u00E9f\u00E9rence \u00E0 un fichier ou \u00E0 un handler de syslog audit log.
# auto translated by TM merge from project: JBoss AS, version: eap6, DocId: org.jboss.as/jboss-as-domain-management/org/jboss/as/domain/management/_private/LocalDescriptions
audit-log.handler.remove=Supprime une r\u00E9f\u00E9rence \u00E0 un fichier ou \u00E0 un handler de syslog audit log.
# auto translated by TM merge from project: JBoss AS, version: eap6, DocId: org.jboss.as/jboss-as-domain-management/org/jboss/as/domain/management/_private/LocalDescriptions
audit-log.json-formatter=Formateurs pour les messages de journalisation d'audit utilisant json.
# auto translated by TM merge from project: JBoss AS, version: eap6, DocId: org.jboss.as/jboss-as-domain-management/org/jboss/as/domain/management/_private/LocalDescriptions
audit-log.file-handler=Handlers de fichiers \u00E0 utiliser avec le service de journalisation de l'audit de management.
# auto translated by TM merge from project: JBoss AS, version: eap6, DocId: org.jboss.as/jboss-as-domain-management/org/jboss/as/domain/management/_private/LocalDescriptions
audit-log.syslog-handler=Handlers de syslog \u00E0 utiliser avec le service de journalisation de l'audit de gestion.
