# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-jmx/org/jboss/as/jmx/LocalDescriptions, author croe@redhat.com
jmx=La configuration du sous-syst\u00E8me JMX.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-jmx/org/jboss/as/jmx/LocalDescriptions, author croe@redhat.com
jmx.add=Ajoute le sous-syst\u00E8me JMX.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-jmx/org/jboss/as/jmx/LocalDescriptions, author croe@redhat.com
jmx.remove=Supprime le sous-syst\u00E8me JMX.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-jmx/org/jboss/as/jmx/LocalDescriptions, author croe@redhat.com
jmx.connector=Connecteurs pour le sous-syst\u00E8me JMX.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-jmx/org/jboss/as/jmx/LocalDescriptions, author croe@redhat.com
jmx.remoting-connector=Connecteurs JBoss distants pour le sous-syst\u00E8me JMX.
expose-model.expression=La configuration pour exposer l' 'expression' model controller dans le MBeanServer. Cette fa\u00E7ade va exposer tous les param\u00E8tres d'op\u00E9ration et attributs simples comme Strings. Reads renvoie l'expression non r\u00E9solue. Vous pouvez utiliser des expressions quand vous \u00E9crivez des atttributs ou d\u00E9finissez des param\u00E8tres d'op\u1EBFrations.
expose-model.expression.add=Ajoute l' 'expression' model controller JMX facade au MBeanServer.
expose-model.expression.remove=Supprime l' 'expression' model controller JMX facade du MBeanServer.
expose-model.expression.domain-name=Le nom de domaine \u00E0 utiliser pour l'expression model controller jmx facade dans le MBeanServer.
expose-model.resolved=La configuration pour exposer le model controller 'resolved' dans le MBeanServer. Cette fa\u00E7ade va exposer tous les param\u00E8tres d'op\u00E9ration et attributs simples comme leurs types dans le mod\u00E8le sous-jacent. Reads renvoie l'expression r\u00E9solue si utilis\u00E9e, ou bien la valeur raw. Vous pouvez utiliser des expressions quand vous \u00E9crivez des atttributs ou d\u00E9finissez des param\u00E8tres d'op\u1EBFrations.
expose-model.resolved.add=Ajoute le model controller JMX facade 'resolved' au MBeanServer.
expose-model.resolved.remove=Supprime le model controller JMX facade 'resolved' du MBeanServer.
expose-model.resolved.domain-name=Le nom de domaine \u00E0 utiliser pour le model controller jmx facade "resolved' dans le MBeanServer.
expose-model.resolved.proper-property-format=Si false, les attributs de type PROPERTY sont repr\u00E9sent\u00E9s sous forme de string DMR, c'est le comportement h\u00E9rit\u00E9. Si true, les attributs de type PROPERTY sont repr\u00E9sent\u00E9s par un type coposite o\u00F9 la cl\u00E9 est un string, et la valeur a le m\u00EAme type que la propri\u00E9t\u00E9 du mod\u00E8le sous-jacent.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-jmx/org/jboss/as/jmx/LocalDescriptions, author croe@redhat.com
connector=Le connecteur distant pour le sous-syst\u00E8me JMX.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-jmx/org/jboss/as/jmx/LocalDescriptions, author croe@redhat.com
connector.add=Ajoute le connecteur distant pour le sous-syst\u00E8me JMX.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-jmx/org/jboss/as/jmx/LocalDescriptions, author croe@redhat.com
connector.remove=Supprime le connecteur distant pour le sous-syst\u00E8me JMX.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-jmx/org/jboss/as/jmx/LocalDescriptions, author croe@redhat.com
connector.registry-binding=Le nom d'une liaison de socket \u00E0 laquelle les clients de l'ext\u00E9rieur vont se connecter.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-jmx/org/jboss/as/jmx/LocalDescriptions, author croe@redhat.com
connector.server-binding=Le nom d'une liaison de socket sur laquelle le serveur RMI du sous-syst\u00E8me JMX et les objects RMIConncetionImpl qu'il cr\u00E9e seront export\u00E9s.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-jmx/org/jboss/as/jmx/LocalDescriptions, author croe@redhat.com
remoting-connector=Un connecteur distant JBoss pour le sous-syst\u00E8me JMX.
remoting-connector.add=Ajoute le connecteur distant au sous-syst\u00E8me JMX.
remoting-connector.remove=Supprime le connecteur distant au sous-syst\u00E8me JMX.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-jmx/org/jboss/as/jmx/LocalDescriptions, author croe@redhat.com
remoting-connector.use-management-endpoint=Si true, le connecteur utilisera le point de terminaison de gestion, sinon, il utilisera celui du sous-syst\u00E8me distant
