# These files are generated via Zanata (https://translate.jboss.org/project/view/jboss_as).
# Please do not update this file as it will be overwritten.

argumentExpected=\u30AA\u30D7\u30B7\u30E7\u30F3 %s \u306B\u306F\u5F15\u6570\u304C\u5FC5\u8981\u3067\u3059\u3002
attemptingToSet='%2$s' \u304C\u3059\u3067\u306B\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u308B\u306B\u3082\u95A2\u308F\u3089\u305A\u3001'%1$s' \u3092\u8A2D\u5B9A\u3057\u3088\u3046\u3068\u3057\u3066\u3044\u307E\u3059\u3002
authenticationFailureUnableToConnect=\u8A8D\u8A3C\u306B\u5931\u6557\u3057\u305F\u305F\u3081\u63A5\u7D9A\u3067\u304D\u307E\u305B\u3093\u3002
cannotAccessRemoteFileRepository=\u30DE\u30B9\u30BF\u30FC\u306E\u30C9\u30E1\u30A4\u30F3\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u304B\u3089\u30EA\u30E2\u30FC\u30C8\u306E\u30D5\u30A1\u30A4\u30EB\u30EC\u30DD\u30B8\u30C8\u30EA\u30FC\u306B\u30A2\u30AF\u30BB\u30B9\u3067\u304D\u307E\u305B\u3093\u3002
cannotCreateLocalDirectory=\u30ED\u30FC\u30AB\u30EB\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u3092\u4F5C\u6210\u3067\u304D\u307E\u305B\u3093\: %s 
cannotObtainValidDefaultAddress=%1$s \u3042\u308B\u3044\u306F InetAddress.getLocalHost() \u3092\u4F7F\u3063\u3066ProcessController \u3068\u901A\u4FE1\u3059\u308B\u305F\u3081\u306E\u6709\u52B9\u306A\u30C7\u30D5\u30A9\u30EB\u30C8\u30A2\u30C9\u30EC\u30B9\u3092\u53D6\u5F97\u3067\u304D\u307E\u305B\u3093\u3002\u30B7\u30B9\u30C6\u30E0\u306E\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u8A2D\u5B9A\u3092\u78BA\u8A8D\u3059\u308B\u304B\u3001%2$s \u30B3\u30DE\u30F3\u30C9\u30E9\u30A4\u30F3\u30AA\u30D7\u30B7\u30E7\u30F3\u3092\u4F7F\u3044\u6709\u52B9\u306A\u30A2\u30C9\u30EC\u30B9\u3092\u8A2D\u5B9A\u3057\u3066\u304F\u3060\u3055\u3044\u3002
cannotRestartServer=\u30B5\u30FC\u30D0\u30FC %1$s \u306F\u73FE\u5728\u8D77\u52D5\u3057\u3066\u3044\u306A\u3044\u305F\u3081\u3001\u518D\u8D77\u52D5\u3067\u304D\u307E\u305B\u3093\u3002\u73FE\u5728\u306E\u72B6\u614B\u306F %2$s \u3067\u3059\u3002
cannotStartServersInvalidMode=\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u306E\u4F5C\u52D5\u30E2\u30FC\u30C9\u304C %s \u306E\u5834\u5408\u30B5\u30FC\u30D0\u30FC\u3092\u958B\u59CB\u3067\u304D\u307E\u305B\u3093\u3002
closeShouldBeManagedByService=\u7D42\u4E86\u306B\u3064\u3044\u3066\u306F\u30B5\u30FC\u30D3\u30B9\u304C\u7BA1\u7406\u3059\u308B\u3082\u306E\u3068\u3057\u307E\u3059\u3002
configurationPersisterAlreadyInitialized=\u30C9\u30E1\u30A4\u30F3\u30E2\u30C7\u30EB\u306E Configuration Persister \u306F\u3059\u3067\u306B\u521D\u671F\u5316\u3055\u308C\u3066\u3044\u307E\u3059\u3002
connectionToMasterInterrupted=\u30DE\u30B9\u30BF\u30FC\u306B\u63A5\u7D9A\u8A66\u884C\u4E2D\u306B\u4E2D\u65AD\u3055\u308C\u307E\u3057\u305F\u3002
connectionToMasterTimeout=%2$s \u30DF\u30EA\u79D2\u306E\u9593\u306B %1$d \u56DE\u8A66\u884C\u3057\u307E\u3057\u305F\u304C\u30DE\u30B9\u30BF\u30FC\u306B\u63A5\u7D9A\u3059\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
couldNotGetServerInventory=%1$d %2$s \u3067\u30B5\u30FC\u30D0\u30FC\u30A4\u30F3\u30D9\u30F3\u30C8\u30EA\u30FC\u3092\u53D6\u5F97\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
didNotReadEntireFile=\u30D5\u30A1\u30A4\u30EB\u5168\u4F53\u3092\u8AAD\u307F\u8FBC\u307F\u307E\u305B\u3093\u3067\u3057\u305F\u3002%d \u304C\u3042\u308A\u307E\u305B\u3093\u3002
errorClosingDownHost=\u30DB\u30B9\u30C8\u306E\u63A5\u7D9A\u89E3\u9664\u4E2D\u306E\u30A8\u30E9\u30FC
failedProfileOperationsRetrieval=\u30C9\u30E1\u30A4\u30F3\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u304B\u3089\u30D7\u30ED\u30D5\u30A1\u30A4\u30EB\u64CD\u4F5C\u306E\u30EA\u30C8\u30EA\u30FC\u30D6\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
failedToGetFileFromRemoteRepository=\u30EA\u30E2\u30FC\u30C8\u30EC\u30DD\u30B8\u30C8\u30EA\u304B\u3089\u30D5\u30A1\u30A4\u30EB\u3092\u53D6\u5F97\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
failedToGetServerStatus=\u30B5\u30FC\u30D0\u30FC\u306E\u30B9\u30C6\u30FC\u30BF\u30B9\u3092\u53D6\u5F97\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
failedToReadAuthenticationKey=\u8A8D\u8A3C\u30AD\u30FC\u306E\u8AAD\u307F\u8FBC\u307F\u306B\u5931\u6557\u3057\u307E\u3057\u305F\: %s
hostNameAlreadyConnected=\u3059\u3067\u306B\u30DB\u30B9\u30C8 %s \u306B\u63A5\u7D9A\u3057\u3066\u3044\u307E\u3059\u3002
insufficientInformationToGenerateHash=\u30CF\u30C3\u30B7\u30E5\u3092\u751F\u6210\u3059\u308B\u306B\u306F\u60C5\u5831\u304C\u4E0D\u8DB3\u3057\u3066\u3044\u307E\u3059\u3002
invalidOption=\u7121\u52B9\u306A\u30AA\u30D7\u30B7\u30E7\u30F3 '%s'
invalidRootId=\u7121\u52B9\u306Aroot id [%d]
invalidValue=%1$s \u306E\u5024\u306F %2$s \u3067\u306F\u3042\u308A\u307E\u305B\u3093 -- %3$s
invocationNotAllowedAfterBoot=HostController \u8D77\u52D5\u306E\u5F8C\u306B %s \u306E\u547C\u3073\u51FA\u3057\u306F\u3067\u304D\u307E\u305B\u3093\u3002
malformedUrl=\u30AA\u30D7\u30B7\u30E7\u30F3 %s \u306B\u63D0\u793A\u3055\u308C\u305F\u5F62\u5F0F\u306E URL \u306F\u4E0D\u6B63\u3067\u3059\u3002
mustInvokeBeforeCheckingSlaveStatus=\u30B9\u30EC\u30FC\u30D6\u306E\u30B9\u30C6\u30FC\u30BF\u30B9\u3092\u78BA\u8A8D\u3059\u308B\u524D\u306B %s \u3092\u547C\u3073\u51FA\u3057\u3066\u304F\u3060\u3055\u3044\u3002
mustInvokeBeforePersisting=\u30C9\u30E1\u30A4\u30F3\u30E2\u30C7\u30EB\u306E\u6C38\u7D9A\u5316\u524D\u306B %s \u3092\u547C\u3073\u51FA\u3059\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
noChannelForHost=\u30DB\u30B9\u30C8 %s \u306B\u5BFE\u3059\u308B\u30C1\u30E3\u30CD\u30EB\u306F\u3042\u308A\u307E\u305B\u3093\u3002
noNameAttributeOnHost=\u30EA\u30E2\u30FC\u30C8\u306E\u30C9\u30E1\u30A4\u30F3\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u3078\u63A5\u7D9A\u3059\u308B\u30DB\u30B9\u30C8\u306B\u306F name \u5C5E\u6027\u30BB\u30C3\u30C8\u304C\u306A\u3051\u308C\u3070\u306A\u308A\u307E\u305B\u3093\u3002
noServerInventory=\u30B5\u30FC\u30D0\u30FC\u30A4\u30F3\u30D9\u30F3\u30C8\u30EA\u30FC\u304C\u3042\u308A\u307E\u305B\u3093\u3002
propertyAlreadyExists=\u30D7\u30ED\u30D1\u30C6\u30A3 %s \u306F\u3059\u3067\u306B\u5B58\u5728\u3057\u307E\u3059\u3002
propertyNotFound=\u30D7\u30ED\u30D1\u30C6\u30A3 %s \u306F\u5B58\u5728\u3057\u307E\u305B\u3093\u3002
propertyValueNull=\u30D7\u30ED\u30D1\u30C6\u30A3 %s \u306E\u5024\u306F null \u3067\u3059\u3002
propertyValueHasNullValue=\u30D7\u30ED\u30D1\u30C6\u30A3 %s \u306E\u5024\u306F null \u3067\u3059\u3002
nullVar=%s \u306F null \u3067\u3059\u3002
serverNameAlreadyRegistered='%s' \u3068\u3044\u3046\u540D\u524D\u306E\u767B\u9332\u6E08\u307F\u30B5\u30FC\u30D0\u30FC\u304C\u5B58\u5728\u3057\u307E\u3059\u3002
serverStillRunning=\u30B5\u30FC\u30D0\u30FC (%s) \u306F\u7A3C\u50CD\u4E2D\u3067\u3059\u3002
unableToGenerateHash=\u30CF\u30C3\u30B7\u30E5\u3092\u751F\u6210\u3067\u304D\u307E\u305B\u3093\u3002
unableToLoadProperties=URL %s \u304B\u3089\u30D7\u30ED\u30D1\u30C6\u30A3\u3092\u30ED\u30FC\u30C9\u3067\u304D\u307E\u305B\u3093\u3002
undefinedSocketBinding=\u30B5\u30FC\u30D0\u30FC %s \u306B\u5BFE\u3057\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u30B0\u30EB\u30FC\u30D7\u304C\u5B9A\u7FA9\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
undefinedSocketBindingGroup=\u542B\u307E\u308C\u3066\u3044\u308B\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u30B0\u30EB\u30FC\u30D7 %s \u306F\u5B9A\u7FA9\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
unexpectedState=\u4E88\u671F\u305B\u306C\u30B9\u30C6\u30FC\u30BF\u30B9 %s
unknown=\u4E0D\u660E\u306A %1$s %2$s
unknownHostValue=%1$s \u306E\u5024\u306F\u4E0D\u660E\u306A\u30DB\u30B9\u30C8\u3067\u3059 -- %2$s
unrecognizedType=\u975E\u8A8D\u8B58\u578B %s
hostAlreadyShutdown=Host-Controller \u306F\u3059\u3067\u306B\u7D42\u4E86\u3057\u3066\u3044\u307E\u3059\u3002
noServerGroupCalled=\u547C\u3073\u51FA\u3055\u308C\u305F server-group \u306F\u3042\u308A\u307E\u305B\u3093\: %s
noSocketBindingGroupCalled=\u547C\u3073\u51FA\u3055\u308C\u305F socket-binding-group \u306F\u3042\u308A\u307E\u305B\u3093\: %s
hostControllerSystemPropertyUpdateNotSupported=HostControllerEnvironment \u306F\u30B7\u30B9\u30C6\u30E0\u30D7\u30ED\u30D1\u30C6\u30A3\u306E\u66F4\u65B0\u306B\u5BFE\u5FDC\u3057\u3066\u3044\u307E\u305B\u3093\u3002
cannotIgnoreTypeHost=\u578B %s \u306E\u30EA\u30BD\u30FC\u30B9\u306F\u7121\u8996\u3067\u304D\u307E\u305B\u3093\u3002
duplicateIgnoredResourceType='%1$s' \u8981\u7D20 \u306B\u306F '%2$s' \u5C5E\u6027\u304C\u3059\u3067\u306B\u898B\u3064\u304B\u308A\u307E\u3057\u305F\u3002
cannotAccessJvmInputArgument=JVM \u5165\u529B\u5F15\u6570\u306B\u30A2\u30AF\u30BB\u30B9\u3067\u304D\u306A\u3044\u305F\u3081\u3001\u30B7\u30B9\u30C6\u30E0\u30D7\u30ED\u30D1\u30C6\u30A3\u306F\u3053\u306E\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u306B\u76F4\u63A5\u6E21\u3057\u307E\u3057\u305F\u3002\u30B7\u30B9\u30C6\u30E0\u30D7\u30ED\u30D1\u30C6\u30A3\u306F\u30B5\u30FC\u30D0\u30FC\u30D7\u30ED\u30BB\u30B9\u307E\u3067\u6E21\u3055\u308C\u307E\u305B\u3093\u3002\u554F\u984C\u306E\u539F\u56E0\: %s
missingHomeDirConfiguration=\u8A2D\u5B9A\u5024\u304C\u629C\u3051\u3066\u3044\u307E\u3059\: %s
homeDirectoryDoesNotExist=\u30DB\u30FC\u30E0\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u306F\u5B58\u5728\u3057\u307E\u305B\u3093\: %s
modulesDirectoryDoesNotExist=\u5B9A\u7FA9\u6E08\u307F\u306E\u30E2\u30B8\u30E5\u30FC\u30EB\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u306F\u5B58\u5728\u3057\u307E\u305B\u3093\: %s
domainBaseDirectoryDoesNotExist=\u30C9\u30E1\u30A4\u30F3\u306E\u30D9\u30FC\u30B9\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u306F\u5B58\u5728\u3057\u307E\u305B\u3093\: %s
domainBaseDirectoryIsNotADirectory=\u30C9\u30E1\u30A4\u30F3\u306E\u30D9\u30FC\u30B9\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u306F\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u3067\u306F\u3042\u308A\u307E\u305B\u3093\: %s
configDirectoryDoesNotExist=\u8A2D\u5B9A\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u306F\u5B58\u5728\u3057\u307E\u305B\u3093\: %s
domainDataDirectoryIsNotDirectory=\u30C9\u30E1\u30A4\u30F3\u306E\u30C7\u30FC\u30BF\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u306F\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u3067\u306F\u3042\u308A\u307E\u305B\u3093\: %s
couldNotCreateDomainDataDirectory=\u30C9\u30E1\u30A4\u30F3\u306E\u30C7\u30FC\u30BF\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u3092\u4F5C\u6210\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\: %s 
domainContentDirectoryIsNotDirectory=\u30C9\u30E1\u30A4\u30F3\u306E\u30B3\u30F3\u30C6\u30F3\u30C4\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u306F\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u3067\u306F\u3042\u308A\u307E\u305B\u3093\: %s
couldNotCreateDomainContentDirectory=\u30C9\u30E1\u30A4\u30F3\u306E\u30B3\u30F3\u30C6\u30F3\u30C4\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u3092\u4F5C\u6210\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\: %s 
logDirectoryIsNotADirectory=\u30ED\u30B0\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u306F\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u3067\u306F\u3042\u308A\u307E\u305B\u3093\: %s
couldNotCreateLogDirectory=\u30ED\u30B0\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u3092\u4F5C\u6210\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\: %s 
serversDirectoryIsNotADirectory=\u30B5\u30FC\u30D0\u30FC\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u306F\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u3067\u306F\u3042\u308A\u307E\u305B\u3093\: %s
couldNotCreateServersDirectory=\u30B5\u30FC\u30D0\u30FC\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u3092\u4F5C\u6210\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\: %s 
domainTempDirectoryIsNotADirectory=\u30C9\u30E1\u30A4\u30F3\u306E\u4E00\u6642\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u306F\u5B58\u5728\u3057\u307E\u305B\u3093\: %s
couldNotCreateDomainTempDirectory=\u30C9\u30E1\u30A4\u30F3\u306E\u4E00\u6642\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u3092\u4F5C\u6210\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\: %s 
