cannotConnect=N\u00E3o foi poss\u00EDvel conectar ao controlador de dom\u00EDnio remoto %s\:%d
cannotConnectToMaster=N\u00E3o foi poss\u00EDvel conectar ao mestre. Anulando. O erro era\: %s
creatingHttpManagementService=A cria\u00E7\u00E3o do servi\u00E7o de gerenciamento http usando o (%d) securePort (%d) da porta (%s) de interface da rede
errorRetrievingDomainModel=Erro ao restaurar o modelo do dom\u00EDnio a partir do controlador do dom\u00EDnio remoto %s\:%d\: %s
existingServerWithState=Servidor existente [%s] com status\: %s
failedToCreateServerProcess=Falha ao criar o processo do servidor %s
failedToSendReconnect=Falha ao enviar a mensagem de reconex\u00E3o ao servidor %s
failedToStartServer=Falha ao iniciar o servidor (%s)
failedToStopServer=Falha ao interromper o servidor (%s)
gracefulShutdownNotSupported=O encerramento amig\u00E1vel do servidor %s foi solicitado, mas n\u00E3o \u00E9 suportado no momento. Retornando ao encerramento r\u00E1pido.
ignoringPermGen=Ignorando <permgen> for jvm '%s' type jvm\: %s
noDomainControllerConfigurationProvided=Nenhuma configura\u00E7\u00E3o foi fornecida e o modo de rodagem atual ('%s') requer acesso ao host do Controlador do Dom\u00EDnio. A inicializa\u00E7\u00E3o ser\u00E1 anulada. Use o argumento da linha de comando %s para iniciar em %s, caso voc\u00EA precise iniciar sem a conex\u00E3o do controlador do dom\u00EDnio e use as ferramentas de gerenciamento para configur\u00E1-la.
noSecurityRealmDefined=Nenhum realm de seguran\u00E7a definido para o servi\u00E7o do gerenciamento http, todos os acessos ser\u00E3o restritos.
noServerAvailable=Nenhum servidor chamado %s dispon\u00EDvel
lostRemoteDomainConnection=Conex\u00E3o para o host-controller remoto encerrada. Tente a reconex\u00E3o.
optionAlreadySet=Ignorando <option value\="%s" para jvm '%s' desde que o '%s' foi determinado 
reconnectedToMaster=Reconectado ao mestre
reconnectingServer=Reconectando ao servidor %s
registeredRemoteSlaveHost=Host subordinado remoto registrado "%s", %s
registeringServer=Registrando servidor %s
serverRegistered=Servidor [%s] usando a conex\u00E3o [%s]
serviceShutdownIncomplete=O servi\u00E7o de encerramento n\u00E3o foi finalizado
startingServer=Inciando o servidor %s
stoppingServer=Interrompendo o servidor %s
unexpectedServerState=O servidor %s n\u00E3o est\u00E1 no estado %s esperado
unregisteredRemoteSlaveHost=O host subordinado remoto n\u00E3o registrado "%s"
unregisteringServer=Servidor n\u00E3o registrado %s
registeredAtRemoteHostController=Registrado no controlador do dom\u00EDnio
unregisteredAtRemoteHostController=N\u00E3o registrado no controlador do dom\u00EDnio
lostConnectionToRemoteHost=A conex\u00E3o para o "%s" do host remoto encerrou inesperadamente
invalidRemoteBackupPersisterState=N\u00E3o foi poss\u00EDvel carregar o modelo do dom\u00EDnio usando --backup
invalidCachedPersisterState=N\u00E3o foi poss\u00EDvel armazenar o modelo do dom\u00EDnio usando --cached-dc
caughtExceptionDuringBoot=Foi vista uma exce\u00E7\u00E3o durante a inicializa\u00E7\u00E3o
unsuccessfulBoot=A inicializa\u00E7\u00E3o do Controlador do Host falhou de forma irrecuper\u00E1vel\: existente. Consulte as mensagens anteriores para maiores informa\u00E7\u00F5es.
reportAdminOnlyDomainXmlFailure=A instala\u00E7\u00E3o da configura\u00E7\u00E3o domain-wide falhou. Uma vez que o modo de rodagem do Controlador do Host \u00E9 ADMIN_ONLY, a inicializa\u00E7\u00E3o foi permitida. Caso o modo ADMIN_ONLY n\u00E3o tivesse efeito, o processo seria encerrado devido a uma falha cr\u00EDtica de inicializa\u00E7\u00E3o.
