# These files are generated via Zanata (https://translate.jboss.org/project/view/jboss_as).
# Please do not update this file as it will be overwritten.

cannotConnect=N'a pas pu se connecter au contr\u00F4leur de domaine %s\:%d
cannotConnectToMaster=N'a pas pu se connecter au Master. Abandon. Erreur\: %s
creatingHttpManagementService=Cr\u00E9ation d'un service de gestion internet par l'interface de r\u00E9seau (%s) port (%d) securePort (%d)
errorRetrievingDomainModel=Erreur d'extraction du mod\u00E8le de domaine en provenance su contr\u00F4leur de domaine \u00E0 acc\u00E8s distant %s\:%d\: %s
existingServerWithState=Serveur existant [%s] ayant pour statut \: %s
failedToCreateServerProcess=N'a pas pu cr\u00E9er un processus de serveur %s
failedToSendReconnect=N'a pas pu envoyer le message de reconnexion au serveur %s
failedToStartServer=N'a pas pu d\u00E9marrer le serveur (%)
failedToStopServer=N'a pas pu stopper le serveur %s
gracefulShutdownNotSupported=Fermeture en bonne et due forme du serveur %s demand\u00E9e, mais pas forc\u00E9ment support\u00E9e. Fermeture rapide par d\u00E9faut.
ignoringPermGen=Ignorer <permgen> pour jvm '%s' type jvm\: %s
noDomainControllerConfigurationProvided=Aucune configuration de <domain-controller> n'a \u00E9t\u00E9 fournie et le mode d'ex\u00E9cution actuel ('%s') requiert un acc\u00E8s \u00E0 l'h\u00F4te du Contr\u00F4leur de domaine. Le d\u00E9marrage va \u00EAtre interrompu. Utiliser le ligne de commande %s pour d\u00E9marrer en mode %s si vous avez besoin de d\u00E9marrer sans connexion de contr\u00F4leur de domaine, puis utiliser les outils de gestion pour en configurer une.
noSecurityRealmDefined=Aucun domaine de s\u00E9curit\u00E9 n'a \u00E9t\u00E9 fourni pour le service de gestion http, tous les acc\u00E8s seront illimit\u00E9s.
noServerAvailable=Aucun serveur nomm\u00E9 %s sera disponible
lostRemoteDomainConnection=Connexion au contr\u00F4leur h\u00F4te ferm\u00E9e. Tentative de connexion \u00E0 nouveau.
optionAlreadySet=Ignorer <option value\="%s" for jvm '%s' since '%s' was set
reconnectedToMaster=Reconnect\u00E9 au master
reconnectingServer=Reconnexion du serveur %s
registeredRemoteSlaveHost=H\u00F4te esclave distant enregistr\u00E9 "%s", %s
registeringServer=Enregistrement du serveur %s
serverRegistered=Serveur [%s] enregistr\u00E9 avec la connexion [%s]
serviceShutdownIncomplete=La fermeture du service n'a pas eu lieu
startingServer=D\u00E9marrage du serveur %s
stoppingServer=Interruption du serveur %s
unexpectedServerState=Le serveur %s n'est pas dans l'\u00E9tat %s attendu \: %s
unregisteredRemoteSlaveHost=H\u00F4te esclave distant "%s" non enregistr\u00E9
unregisteringServer=Serveur %s non enregistr\u00E9
registeredAtRemoteHostController=Enregistr\u00E9 dans le contr\u00F4leur du domaine
unregisteredAtRemoteHostController=Non enregistr\u00E9 dans le contr\u00F4leur du domaine
lostConnectionToRemoteHost=La connexion \u00E0 l'h\u00F4te distant "%s" a \u00E9t\u00E9 ferm\u00E9e de fa\u00E7on inattendue
invalidRemoteBackupPersisterState=Impossible de charger le mod\u00E8le de domaine par --backup
invalidCachedPersisterState=Impossible de stocker le mod\u00E8le de domaine par --cached-dc
caughtExceptionDuringBoot=Exception intercept\u00E9e au d\u00E9marrage
unsuccessfulBoot=La phase de d\u00E9marrage (boot) du Host Controller a \u00E9chou\u00E9 de fa\u00E7on irr\u00E9versible; sortie. Voir les messages pr\u00E9c\u00E9dents pour obtenir davantage d'informations.
reportAdminOnlyDomainXmlFailure=L'installation de la configuration dans le domaine a \u00E9chou\u00E9. Comme le mode d'ex\u00E9cution de ce Host Controller est ADMIN_ONLY, le d\u00E9marrage a pu continuer. Si le mode ADMIN_ONLY n'\u00E9tait pas actif, le processus aurait \u00E9t\u00E9 interrompu pour cause d'\u00E9chec critique au d\u00E9marrage (boot).
