argumentExpected=Argumento esperado para a op\u00E7\u00E3o %s
attemptingToSet=Tentativa de configurar '%s' quando o '%s' j\u00E1 havia sido configurado
authenticationFailureUnableToConnect=A conex\u00E3o n\u00E3o foi poss\u00EDvel devido a uma falha de autentica\u00E7\u00E3o.
cannotAccessRemoteFileRepository=N\u00E3o foi poss\u00EDvel acessar um reposit\u00F3rio de arquivo remoto a partir do controlador de dom\u00EDnio mestre
cannotCreateLocalDirectory=N\u00E3o foi poss\u00EDvel criar um diret\u00F3rio local\: %s
cannotObtainValidDefaultAddress=N\u00E3o foi poss\u00EDvel obter um endere\u00E7o padr\u00E3o v\u00E1lido para comunica\u00E7\u00E3o com o ProcessController usando tanto o %s ou InetAddress.getLocalHost(). Por favor verifique sua configura\u00E7\u00E3o da rede de sistema ou use a op\u00E7\u00E3o de linha de comando %s para configurar um endere\u00E7o v\u00E1lido
cannotRestartServer=N\u00E3o foi poss\u00EDvel reiniciar o servidor %s uma vez que ele n\u00E3o est\u00E1 iniciado; ele est\u00E1 %s
cannotStartServersInvalidMode=N\u00E3o foi poss\u00EDvel iniciar os servidores quando o modo de rodagem do Controlador do Host for %s
closeShouldBeManagedByService=O encerramento deve ser gerenciado pelo servi\u00E7o
configurationPersisterAlreadyInitialized=A persist\u00EAncia da configura\u00E7\u00E3o para o modelo do dom\u00EDnio j\u00E1 foi inicializada
connectionToMasterInterrupted=Ocorreu uma interrup\u00E7\u00E3o na tentativa de conectar-se ao mestre
connectionToMasterTimeout=N\u00E3o foi poss\u00EDvel conectar-se ao mestre em %d tentativas com %s mil\u00E9simos de segundos
couldNotGetServerInventory=N\u00E3o foi poss\u00EDvel obter o invent\u00E1rio do servidor no %d %s
didNotReadEntireFile=N\u00E3o foi poss\u00EDvel ler o arquivo inteiro. Falta\: %d
errorClosingDownHost=Erro ao encerrar o host
failedProfileOperationsRetrieval=Falha ao restaurar as opera\u00E7\u00F5es de perfil a partir do controlador do dom\u00EDnio
failedToGetFileFromRemoteRepository=Falha ao obter o arquivo a partir do reposit\u00F3rio remoto
failedToGetServerStatus=Falha ao obter o status do servidor
failedToReadAuthenticationKey=Falha ao ler a chave de autentica\u00E7\u00E3o\: %s
hostNameAlreadyConnected=J\u00E1 possui uma conex\u00E3o para o host %s
insufficientInformationToGenerateHash=Informa\u00E7\u00E3o insuficiente para gerar o hash.
invalidOption=Op\u00E7\u00E3o inv\u00E1lida '%s'
invalidRootId=Id da raiz inv\u00E1lida [%d]
invalidValue=O valor para %s n\u00E3o \u00E9 um %s -- %s
invocationNotAllowedAfterBoot=As invoca\u00E7\u00F5es do %s ap\u00F3s a inicializa\u00E7\u00E3o do HostController n\u00E3o s\u00E3o permitidas
malformedUrl=O URL mal formado fornecido para a op\u00E7\u00E3o %s
mustInvokeBeforeCheckingSlaveStatus=Deve chamar %s antes de checar por status subordin\u00E1rios
mustInvokeBeforePersisting=Deve chamar %s antes de persistir o modelo do dom\u00EDnio
noChannelForHost=Nenhum canal para o host %s
noNameAttributeOnHost=Uma conex\u00E3o do host para o controlador do dom\u00EDnio remoto deve possuir a pr\u00F3pria conex\u00E3o do atributo de nome
noServerInventory=Nenhum invent\u00E1rio do servidor
propertyAlreadyExists=A propriedade %s j\u00E1 existe
propertyNotFound=A propriedade %s n\u00E3o existe
propertyValueNull=O valor para a propriedade %s \u00E9 nulo
propertyValueHasNullValue=A propriedade %s possui um valor nulo
nullVar=O %s \u00E9 nulo
serverNameAlreadyRegistered=J\u00E1 existe um servidor registrado nomeado '%s'
serverStillRunning=O servidor (%s) continua rodando
unableToGenerateHash=N\u00E3o foi poss\u00EDvel gerar o hash
unableToLoadProperties=N\u00E3o foi poss\u00EDvel carregar propriedades a partir do URL %s
undefinedSocketBinding=Grupo de soquete indefinido para o servidor %s
undefinedSocketBindingGroup=O grupo binding de soquete inclu\u00EDdo %s n\u00E3o foi definido
unexpectedState=Estado inesperado %s
unknown=Desconhecido %s %s
unknownHostValue=O valor para %s n\u00E3o \u00E9 um host -- %s conhecido
unrecognizedType=tipo n\u00E3o reconhecido %s
hostAlreadyShutdown=O Host-Controller j\u00E1 foi encerrado.
noServerGroupCalled=Nenhum server-group chamado\: %s
noSocketBindingGroupCalled=Nenhum socket-binding-group chamado\: %s
hostControllerSystemPropertyUpdateNotSupported=O HostControllerEnvironment n\u00E3o suporta as atualiza\u00E7\u00F5es da propriedade de sistema
cannotIgnoreTypeHost=Os recursos do tipo %s n\u00E3o podem ser ignorados
duplicateIgnoredResourceType=Um elemento '%s' cujo atributo '%s' j\u00E1 foi localizado
cannotAccessJvmInputArgument=Os argumentos de entrada JVM n\u00E3o podem ser acessados, de forma que as propriedades do sistema passadas diretamente a este Host Controller JVM, n\u00E3o ser\u00E3o passadas atrav\u00E9s dos processos do servidor. A causa do problema\: %s
missingHomeDirConfiguration=Falta o valor da configura\u00E7\u00E3o para\: %s
homeDirectoryDoesNotExist=O diret\u00F3rio principal n\u00E3o existe\: %s
modulesDirectoryDoesNotExist=O diret\u00F3rio dos m\u00F3dulos determinados n\u00E3o existe\: %s
domainBaseDirectoryDoesNotExist=O diret\u00F3rio base do dom\u00EDnio n\u00E3o existe\: %s
domainBaseDirectoryIsNotADirectory=O diret\u00F3rio base do dom\u00EDnio n\u00E3o \u00E9 um diret\u00F3rio\: %s
configDirectoryDoesNotExist=O diret\u00F3rio de configura\u00E7\u00E3o n\u00E3o existe\: %s
domainDataDirectoryIsNotDirectory=O diret\u00F3rio de dom\u00EDnio n\u00E3o \u00E9 um diret\u00F3rio\: %s
couldNotCreateDomainDataDirectory=N\u00E3o foi poss\u00EDvel criar um diret\u00F3rio de dados do dom\u00EDnio\: %s
domainContentDirectoryIsNotDirectory=O diret\u00F3rio do conte\u00FAdo de dom\u00EDnio n\u00E3o \u00E9 um diret\u00F3rio\: %s
couldNotCreateDomainContentDirectory=N\u00E3o foi poss\u00EDvel criar um diret\u00F3rio de conte\u00FAdo do dom\u00EDnio\: %s
logDirectoryIsNotADirectory=O diret\u00F3rio de registro de log n\u00E3o \u00E9 um diret\u00F3rio\: %s
couldNotCreateLogDirectory=N\u00E3o foi poss\u00EDvel criar um diret\u00F3rio de registro de log\: %s
serversDirectoryIsNotADirectory=O diret\u00F3rio n\u00E3o \u00E9 um diret\u00F3rio\: %s
couldNotCreateServersDirectory=N\u00E3o foi poss\u00EDvel criar o diret\u00F3rio dos servidores\: %s
domainTempDirectoryIsNotADirectory=O diret\u00F3rio tempor\u00E1rio do dom\u00EDnio n\u00E3o existe\: %s
couldNotCreateDomainTempDirectory=N\u00E3o foi poss\u00EDvel criar o diret\u00F3rio tempor\u00E1rio do dom\u00EDnio\: %s
