cannotConnect=\u30EA\u30E2\u30FC\u30C8\u306E\u30C9\u30E1\u30A4\u30F3\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC %1$s\:%2$d \u306B\u63A5\u7D9A\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
cannotConnectToMaster=\u30DE\u30B9\u30BF\u30FC\u306B\u63A5\u7D9A\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002\u4E2D\u65AD\u3057\u3066\u3044\u307E\u3059\u3002\u30A8\u30E9\u30FC\: %s \u3002
creatingHttpManagementService=\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9 (%1$s) port (%2$d) securePort (%3$d) \u3092\u4F7F\u3044\u3001http \u7BA1\u7406\u30B5\u30FC\u30D3\u30B9\u3092\u4F5C\u6210\u3057\u3066\u3044\u307E\u3059\u3002
errorRetrievingDomainModel=\u30EA\u30E2\u30FC\u30C8\u306E\u30C9\u30E1\u30A4\u30F3\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC %1$s\:%2$d \u304B\u3089\u30C9\u30E1\u30A4\u30F3\u30E2\u30C7\u30EB\u3092\u53D6\u5F97\u6642\u306E\u30A8\u30E9\u30FC\: %3$s
existingServerWithState=\u65E2\u5B58\u306E\u30B5\u30FC\u30D0\u30FC [%1$s] \u30B9\u30C6\u30FC\u30BF\u30B9\: %2$s
failedToCreateServerProcess=\u30B5\u30FC\u30D0\u30FC\u30D7\u30ED\u30BB\u30B9 %s \u306E\u4F5C\u6210\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
failedToSendReconnect=\u518D\u63A5\u7D9A\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u30B5\u30FC\u30D0\u30FC %s \u3078\u9001\u4FE1\u3059\u308B\u306E\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
failedToStartServer=\u30B5\u30FC\u30D0\u30FC (%s) \u306E\u8D77\u52D5\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
failedToStopServer=\u30B5\u30FC\u30D0\u30FC (%s) \u306E\u505C\u6B62\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
gracefulShutdownNotSupported=\u30B5\u30FC\u30D0\u30FC %s \u306E\u30B0\u30EC\u30FC\u30B9\u30D5\u30EB\u30B7\u30E3\u30C3\u30C8\u30C0\u30A6\u30F3\u304C\u30EA\u30AF\u30A8\u30B9\u30C8\u3055\u308C\u307E\u3057\u305F\u304C\u3001\u73FE\u5728\u5BFE\u5FDC\u3057\u3066\u3044\u307E\u305B\u3093\u3002\u5F37\u5236\u7D42\u4E86\u3055\u308C\u307E\u3059\u3002
ignoringPermGen=jvm '%1$s' type \u306B\u5BFE\u3059\u308B <permgen> \u3092\u7121\u8996\u3057\u307E\u3059\u3002jvm\: %2$s
noDomainControllerConfigurationProvided=<domain-controller> \u8A2D\u5B9A\u304C\u63D0\u793A\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002\u73FE\u5728\u306E\u7A3C\u50CD\u30E2\u30FC\u30C9 ('%1$s') \u3067\u306F\u30C9\u30E1\u30A4\u30F3\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u306E\u30DB\u30B9\u30C8\u3078\u306E\u30A2\u30AF\u30BB\u30B9\u6A29\u9650\u304C\u5FC5\u8981\u3067\u3059\u3002\u8D77\u52D5\u306F\u4E2D\u6B62\u3055\u308C\u307E\u3059\u3002\u30C9\u30E1\u30A4\u30F3\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u63A5\u7D9A\u306A\u3057\u306B\u8D77\u52D5\u3059\u308B\u5FC5\u8981\u304C\u3042\u308B\u5834\u5408\u306F\u3001%2$s \u30B3\u30DE\u30F3\u30C9\u30E9\u30A4\u30F3\u306E\u5F15\u6570\u3092\u4F7F\u3044\u3001%3$s \u30E2\u30FC\u30C9\u3067\u8D77\u52D5\u3057\u7BA1\u7406\u30C4\u30FC\u30EB\u3092\u4F7F\u3044\u8A2D\u5B9A\u3057\u3066\u304F\u3060\u3055\u3044\u3002
noSecurityRealmDefined=http \u7BA1\u7406\u30B5\u30FC\u30D3\u30B9\u306B\u5BFE\u3057\u3066\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30EC\u30EB\u30E0\u304C\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002\u30A2\u30AF\u30BB\u30B9\u5236\u9650\u306F\u3059\u3079\u3066\u306A\u304F\u306A\u308A\u307E\u3059\u3002
noServerAvailable=%s \u3068\u547C\u3070\u308C\u308B\u30B5\u30FC\u30D0\u30FC\u3067\u5229\u7528\u3067\u304D\u308B\u3082\u306E\u306F\u3042\u308A\u307E\u305B\u3093\u3002
lostRemoteDomainConnection=\u30EA\u30E2\u30FC\u30C8\u306E\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u3078\u306E\u63A5\u7D9A\u304C\u9589\u3058\u3089\u308C\u307E\u3057\u305F\u3002\u518D\u63A5\u7D9A\u306E\u8A66\u884C\u4E2D\u3067\u3059\u3002
optionAlreadySet='%3$s' \u304C\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u305F\u305F\u3081\u3001jvm '%2$s' \u306E <option value\\\="%1$s" \u306F\u7121\u8996\u3055\u308C\u307E\u3059\u3002
reconnectedToMaster=\u30DE\u30B9\u30BF\u30FC\u306B\u518D\u63A5\u7D9A\u3057\u307E\u3057\u305F\u3002
reconnectingServer=\u518D\u63A5\u7D9A\u4E2D\u306E\u30B5\u30FC\u30D0\u30FC %s
registeredRemoteSlaveHost=\u30EA\u30E2\u30FC\u30C8\u306E\u30B9\u30EC\u30FC\u30D6\u30DB\u30B9\u30C8 "%1$s", %2$s \u3092\u767B\u9332\u3057\u307E\u3057\u305F\u3002
registeringServer=\u30B5\u30FC\u30D0\u30FC %s \u3092\u767B\u9332\u3057\u3066\u3044\u307E\u3059\u3002
serverRegistered=\u63A5\u7D9A [%2$s] \u3092\u4F7F\u3044\u30B5\u30FC\u30D0\u30FC [%1$s] \u3092\u767B\u9332\u3057\u307E\u3057\u305F\u3002
serviceShutdownIncomplete=\u30B5\u30FC\u30D3\u30B9\u306F\u5B8C\u5168\u306B\u505C\u6B62\u3055\u308C\u307E\u305B\u3093\u3067\u3057\u305F\u3002
startingServer=\u30B5\u30FC\u30D0\u30FC %s \u3092\u958B\u59CB\u3057\u3066\u3044\u307E\u3059\u3002
stoppingServer=\u30B5\u30FC\u30D0\u30FC %s \u3092\u505C\u6B62\u3057\u3066\u3044\u307E\u3059\u3002
unexpectedServerState=\u30B5\u30FC\u30D0\u30FC %1$s \u306F\u671F\u5F85\u3059\u308B\u30B9\u30C6\u30FC\u30BF\u30B9 %2$s \u3067\u306F\u3042\u308A\u307E\u305B\u3093\: %3$s
unregisteredRemoteSlaveHost=\u30EA\u30E2\u30FC\u30C8\u306E\u30B9\u30EC\u30FC\u30D6\u30DB\u30B9\u30C8 "%s" \u306E\u767B\u9332\u3092\u89E3\u9664\u3057\u307E\u3057\u305F\u3002
unregisteringServer=\u30B5\u30FC\u30D0\u30FC %s \u306E\u767B\u9332\u3092\u89E3\u9664\u3057\u3066\u3044\u307E\u3059\u3002
registeredAtRemoteHostController=\u30C9\u30E1\u30A4\u30F3\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u3067\u767B\u9332\u3057\u307E\u3057\u305F\u3002
unregisteredAtRemoteHostController=\u30C9\u30E1\u30A4\u30F3\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u3067\u767B\u9332\u3092\u89E3\u9664\u3057\u307E\u3057\u305F\u3002
lostConnectionToRemoteHost=\u30EA\u30E2\u30FC\u30C8\u30DB\u30B9\u30C8 "%s" \u3078\u306E\u63A5\u7D9A\u304C\u4E88\u671F\u305B\u305A\u9589\u3058\u3089\u308C\u307E\u3057\u305F\u3002
invalidRemoteBackupPersisterState=--backup \u3092\u4F7F\u3044\u30C9\u30E1\u30A4\u30F3\u30E2\u30C7\u30EB\u3092\u30ED\u30FC\u30C9\u3067\u304D\u307E\u305B\u3093\u3002
invalidCachedPersisterState=--cached-dc \u3092\u4F7F\u3044\u30C9\u30E1\u30A4\u30F3\u30E2\u30C7\u30EB\u3092\u4FDD\u5B58\u3067\u304D\u307E\u305B\u3093\u3002
caughtExceptionDuringBoot=\u8D77\u52D5\u6642\u306B\u4F8B\u5916\u3092\u691C\u51FA\u3057\u307E\u3057\u305F\u3002
unsuccessfulBoot=\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u306F\u8D77\u52D5\u306B\u5931\u6557\u3057\u30EA\u30AB\u30D0\u30EA\u30FC\u3067\u304D\u307E\u305B\u3093\u3002\u7D42\u4E86\u3057\u307E\u3059\u3002\u8A73\u7D30\u306B\u3064\u3044\u3066\u306F\u4EE5\u524D\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u53C2\u7167\u3057\u3066\u304F\u3060\u3055\u3044\u3002
reportAdminOnlyDomainXmlFailure=\u30C9\u30E1\u30A4\u30F3\u5168\u4F53\u306E\u8A2D\u5B9A\u306E\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002\u3053\u306E\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u306E\u4F5C\u52D5\u30E2\u30FC\u30C9\u306FADMIN_ONLY \u8D77\u52D5\u3067\u3042\u308B\u305F\u3081\u3001\u305D\u306E\u307E\u307E\u8D77\u52D5\u3059\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u3057\u305F\u3002ADMIN_ONLY \u30E2\u30FC\u30C9\u3067\u306A\u3044\u5834\u5408\u306F\u3001\u3053\u306E\u30D7\u30ED\u30BB\u30B9\u306F\u81F4\u547D\u7684\u306A\u8D77\u52D5\u30A8\u30E9\u30FC\u3068\u3057\u3066\u7D42\u4E86\u3055\u308C\u305F\u306F\u305A\u3067\u3059\u3002
