# These files are generated via Zanata (https://translate.jboss.org/project/view/jboss_as).
# Please do not update this file as it will be overwritten.

argumentExpected=Argument attendu pour l'option %s
attemptingToSet=Tentative de d\u00E9finir '%s' alors que '%s' \u00E9tait d\u00E9j\u00E0 d\u00E9fini
authenticationFailureUnableToConnect=N'a pas pu se connecter pour cause d'\u00E9chec d'authentification
cannotAccessRemoteFileRepository=N'a pas pu acc\u00E9der \u00E0 un r\u00E9f\u00E9rentiel de fichier distant \u00E0 partir du contr\u00F4leur du domaine ma\u00EEtre.
cannotCreateLocalDirectory=N'a pas pu cr\u00E9er un r\u00E9pertoire local \: %s
cannotObtainValidDefaultAddress=N'a pas pu obtenir une adresse valide par d\u00E9faut pour communiquer avec le ProcessController en utilisant %s ou InetAddress.getLocalHost(). Veuillez v\u00E9rifier votre configuration r\u00E9seau sur votre syst\u00E8me ou bien utiliser le commutateur de ligne de commande %s pour configurer une adresse valide.
cannotRestartServer=N'a pas pu d\u00E9marrer \u00E0 nouveau le serveur %s car il n'a pas encore d\u00E9marr\u00E9; il est %s
cannotStartServersInvalidMode=N'a pas pu d\u00E9marrer les serveurs quand le mode d'ex\u00E9cution du Host Controller est %s
closeShouldBeManagedByService=La fermeture doit \u00EAtre g\u00E9r\u00E9e par le service
configurationPersisterAlreadyInitialized=Le persisteur de configuration du mod\u00E8le de domaine est d\u00E9j\u00E0 initialis\u00E9
connectionToMasterInterrupted=Interrompu lors de la tentative de connexion au master
connectionToMasterTimeout=N'a pas pu se connecter au master apr\u00E8s %d tentatives pendant %s ms
couldNotGetServerInventory=N'a pas pu obtenir l'inventaire du serveur dans %d %s
didNotReadEntireFile=N'a pas lu le fichier dans son entier. %d Manquant
errorClosingDownHost=Erreur lors de la fermeture de l'h\u00F4te
failedProfileOperationsRetrieval=N'a pas pu extraire les op\u00E9rations de profil du contr\u00F4leur du domaine
failedToGetFileFromRemoteRepository=N'a pas pu obtenir de fichier du r\u00E9f\u00E9rentiel distant
failedToGetServerStatus=N'a pas pu obtenir le statut du serveur
failedToReadAuthenticationKey=N'a pas pu lire la cl\u00E9 d'authentification \: %s
hostNameAlreadyConnected=Poss\u00E8de d\u00E9j\u00E0 une connexion pour l'h\u00F4te %s
insufficientInformationToGenerateHash=Informations insuffisantes pour g\u00E9n\u00E9rer le hachage
invalidOption=Option '%s' non valide
invalidRootId=id root non valide [%d]
invalidValue=La valeur de %s ne correspond pas \u00E0 un %s -- %s
invocationNotAllowedAfterBoot=Les invocations de %s apr\u00E8s le d\u00E9marrage du HostController sont permises
malformedUrl=URL malform\u00E9 fourni pour l'option %s
mustInvokeBeforeCheckingSlaveStatus=Doit appeler %s avant de v\u00E9rifier le statut de l'esclave
mustInvokeBeforePersisting=Doit appeler %s avant de persister le mod\u00E8le du domaine
noChannelForHost=Pas de r\u00E9seau pour l'h\u00F4te %s
noNameAttributeOnHost=Un h\u00F4te se connectant \u00E0 un contr\u00F4leur de domaine \u00E9loign\u00E9 doit avoir son attribut de nom d\u00E9fini
noServerInventory=Pas d'inventaire de serveur
propertyAlreadyExists=La propri\u00E9t\u00E9 %s existe d\u00E9j\u00E0
propertyNotFound=La propri\u00E9t\u00E9 %s n'existe pas
propertyValueNull=La valeur de la propri\u00E9t\u00E9 %s est null
propertyValueHasNullValue=La propri\u00E9t\u00E9 %s a une valeur null
nullVar=% est null
serverNameAlreadyRegistered=Il existe d\u00E9j\u00E0 un serveur enregistr\u00E9 nomm\u00E9 '%s'
serverStillRunning=Le serveur (%s) est en cours d'ex\u00E9cution
unableToGenerateHash=Impossible de g\u00E9n\u00E9rer le hachage
unableToLoadProperties=Impossible de charger les propri\u00E9t\u00E9s de l'URL %s
undefinedSocketBinding=Groupe de liaison de sockets non d\u00E9fini pour le serveur %s
undefinedSocketBindingGroup=Le groupe de liaisons de sockets %s inclus n'est pas d\u00E9fini
unexpectedState=\u00C9tat %s non attendu
unknown=% % Inconnu
unknownHostValue=La valeur de %s n'est pas un h\u00F4te connu -- %s
unrecognizedType=type non reconnu %s
hostAlreadyShutdown=Le Host-Controller est d\u00E9j\u00E0 ferm\u00E9.
noServerGroupCalled=Aucun server-group appel\u00E9 \: %s
noSocketBindingGroupCalled=Aucun socket-binding-group appel\u00E9 \: %s
hostControllerSystemPropertyUpdateNotSupported=HostControllerEnvironment ne prend pas en charge les mises \u00E0 jour de propri\u00E9t\u00E9s syst\u00E8me
cannotIgnoreTypeHost=Les ressources de type %s ne peuvent pas \u00EAtre ignor\u00E9es
duplicateIgnoredResourceType=Un \u00E9l\u00E9ment '%s' dont l'attribut '%s' a d\u00E9j\u00E0 \u00E9t\u00E9 trouv\u00E9
cannotAccessJvmInputArgument=On ne peut pas acc\u00E9der aux arguments entrants JVM, donc les propri\u00E9t\u00E9s syst\u00E8me pass\u00E9es directement \u00E0 ce Host Controller JVM ne seront pas pass\u00E9es aux processus du serveur. Cause du probl\u00E8me \: %s
missingHomeDirConfiguration=Valeur de configuration manquante pour \: %s
homeDirectoryDoesNotExist=Le r\u00E9pertoire d'accueil (home) n'existe pas \: %s
modulesDirectoryDoesNotExist=Le r\u00E9pertoire des modules d\u00E9termin\u00E9s n'existe pas \: %s
domainBaseDirectoryDoesNotExist=Le r\u00E9pertoire de base du domaine n'existe pas \: %s
domainBaseDirectoryIsNotADirectory=Le r\u00E9pertoire de base du domaine n'est pas un r\u00E9pertoire \: %s
configDirectoryDoesNotExist=Le r\u00E9pertoire de configuration n'existe pas \: %s
domainDataDirectoryIsNotDirectory=Le r\u00E9pertoire de donn\u00E9es du domaine n'est pas un r\u00E9pertoire \: %s
couldNotCreateDomainDataDirectory=N'a pas pu cr\u00E9er un r\u00E9pertoire de donn\u00E9es de domaine \: %s
domainContentDirectoryIsNotDirectory=Le r\u00E9pertoire du contenu du domaine n'est pas un r\u00E9pertoire \: %s
couldNotCreateDomainContentDirectory=N'a pas pu cr\u00E9er un r\u00E9pertoire de contenu de domaine \: %s
logDirectoryIsNotADirectory=Le r\u00E9pertoire log n'est pas un r\u00E9pertoire \: %s
couldNotCreateLogDirectory=N'a pas pu cr\u00E9er un r\u00E9pertoire de log \: %s
serversDirectoryIsNotADirectory=Le r\u00E9pertoire des serveurs n'est pas un r\u00E9pertoire \: %s
couldNotCreateServersDirectory=N'a pas pu cr\u00E9er un r\u00E9pertoire de serveurs \: %s
domainTempDirectoryIsNotADirectory=Le r\u00E9pertoire temp du domaine n'existe pas \: %s
couldNotCreateDomainTempDirectory=N'a pas pu cr\u00E9er un r\u00E9pertoire temp de domaine \: %s
