# These files are generated via Zanata (https://translate.jboss.org/project/view/jboss_as).
# Please do not update this file as it will be overwritten.

cannotConnect=No se pudo conectar al controlador de dominio remoto %s\:%d
cannotConnectToMaster=No se pudo conectar al maestro. Cancelando. El error fue\: %s
creatingHttpManagementService=Creando el servicio de administraci\u00F3n http utilizando la interfaz de red (%s) puerto (%d) securePort (%d)
errorRetrievingDomainModel=Error recuperando el modelo de dominio del controlador de dominio remoto %s\:%d\: %s
existingServerWithState=Servidor existente [%s] con estatus\: %s
failedToCreateServerProcess=No logr\u00F3 crear el proceso del servidor %s
failedToSendReconnect=No logr\u00F3 enviar el mensaje de reconexi\u00F3n al servidor %s
failedToStartServer=No logr\u00F3 iniciar el servidor (%s)
failedToStopServer=No logr\u00F3 detener el servidor (%s)
gracefulShutdownNotSupported=Se solicit\u00F3 apagar el servidor de manera apropiada %s pero actualemente esto no se soporta. Utilizando la opci\u00F3n de apagado r\u00E1pido.
ignoringPermGen=Ignorando <permgen> para el tipo jvm '%s' jvm\: %s
noDomainControllerConfigurationProvided=No se proporcion\u00F3 una configuraci\u00F3n <domain-controller> y el modo de ejecuci\u00F3n actual ('%s') requiere acceso al host del controlador de dominio. El inicio se interrumpir\u00E1. Use el argumento de la l\u00EDnea de comandos %s para iniciar en el modo %s si necesita iniciar sin una conexi\u00F3n del controlador de dominio y luego use las herramientas de administraci\u00F3n para configurar uno.
noSecurityRealmDefined=No hay un dominio de seguridad definido para el servicio de administraci\u00F3n http, todo el acceso ser\u00E1 ilimitado.
noServerAvailable=No hay ning\u00FAn servidor llamado %s que est\u00E9 disponible
lostRemoteDomainConnection=Conexi\u00F3n cerrada al controlador host remoto. Tratando de re-conectarse.
optionAlreadySet=Ignorando <option value\="%s" for jvm '%s' since '%s' was set
reconnectedToMaster=Reconectado al maestro
reconnectingServer=Reconectando el servidor %s
registeredRemoteSlaveHost=Host esclavo remoto registrado "%s", %s
registeringServer=Registrando el servidor %s
serverRegistered=Servidor [%s] registrado utilizando la conexi\u00F3n [%s]
serviceShutdownIncomplete=No se complet\u00F3 el apagado del servicio
startingServer=Iniciando el servidor %s
stoppingServer=Deteniendo el servidor %s
unexpectedServerState=Servidor %s no est\u00E1 en el estado %s esperado\: %s
unregisteredRemoteSlaveHost=Host esclavo remoto con el registrado cancelado "%s", %s
unregisteringServer=Cancelando el registro del servidor %s
registeredAtRemoteHostController=Registrado en el controlador de dominio
unregisteredAtRemoteHostController=Registro cancelado en el controlador de dominio
lostConnectionToRemoteHost=Conexi\u00F3n al host remoto "%s" cerrada de manera inesperada
invalidRemoteBackupPersisterState=No puede cargar el modelo de dominio usando --backup
invalidCachedPersisterState=No puede almacenar el modelo de dominio usando --cached-dc
caughtExceptionDuringBoot=Se atrap\u00F3 una excepci\u00F3n durante el arranque
unsuccessfulBoot=El arranque del controlador host ha fallado de manera irrecuperable; saliendo. Vea los mensajes anteriores para obtener mayores detalles.
reportAdminOnlyDomainXmlFailure=La instalaci\u00F3n de la configuraci\u00F3n a nivel de dominio ha fallado. Ya que el modo de ejecuci\u00F3n de este controlador host es ADMIN_ONLY se ha permitido que el arranque proceda. Si el modo ADMIN_ONLY no estuviera en efecto entonces el proceso se terminar\u00EDa debido a una falla cr\u00EDtica del arranque.
