ejb3=The configuration of the ejb3 subsystem.
ejb3.add=Adds the ejb3 subsystem.
ejb3.remove=Removes the ejb3 subsystem.
ejb3.lite=Specifies whether the ejb3 container need only provide the "LITE" profile of the specification. This value should only be false when using the "everything" distro.
ejb3.default-clustered-sfsb-cache=Name of the default stateful bean cache, which will be applicable to all clustered stateful EJBs, unless overridden at the deployment or bean level
ejb3.default-mdb-instance-pool=Name of the default MDB instance pool, which will be applicable to all MDBs, unless overridden at the deployment or bean level
ejb3.default-entity-bean-instance-pool=Name of the default entity bean instance pool, which will be applicable to all entity beans, unless overridden at the deployment or bean level
ejb3.default-entity-bean-optimistic-locking=If set to true entity beans will use optimistic locking by default
ejb3.default-resource-adapter-name=Name of the default resource adapter name that will be used by MDBs, unless overridden at the deployment or bean level
ejb3.default-sfsb-cache=Name of the default stateful bean cache, which will be applicable to all stateful EJBs, unless overridden at the deployment or bean level
ejb3.default-slsb-instance-pool=Name of the default stateless bean instance pool, which will be applicable to all stateless EJBs, unless overridden at the deployment or bean level
ejb3.default-stateful-bean-access-timeout=The default access timeout for stateful beans
ejb3.default-singleton-bean-access-timeout=The default access timeout for singleton beans
ejb3.in-vm-remote-interface-invocation-pass-by-value=If set to false, the parameters to invocations on remote interface of an EJB, will be passed by reference. Else, the parameters will be passed by value.
service=Centrally configurable services that are part of the EJB3 subsystem.
timer-service=The EJB timer service
timer-service.add=Adds the timer service
timer-service.remove=Removes the timer service
timer-service.thread-pool-name=The name of the thread pool used to run timer service invocations
timer-service.path=The directory to store persistent timer information in
timer-service.relative-to=The relative path that is used to resolve the timer data store location
strict-max-bean-instance-pool=A bean instance pool with a strict upper limit
strict-max-bean-instance-pool.add=Adds a bean instance pool which has a strict upper limit for bean instances
strict-max-bean-instance-pool.remove=Removes a specific a bean instance pool which has a strict upper limit for bean instances
strict-max-bean-instance-pool.max-pool-size=The maximum number of bean instances that the pool can hold at a given point in time
strict-max-bean-instance-pool.timeout=The maximum amount of time to wait for a bean instance to be available from the pool
strict-max-bean-instance-pool.timeout-unit=The instance acquisition timeout unit
deployed=Runtime resources exposed by EJBs components included in this deployment.
entity-bean=Entity bean component included in the deployment.
entity-bean.component-class-name=The component's class name.
entity-bean.security-domain=The security domain for this EJB component.
entity-bean.run-as-role=The run-as role (if any) for this EJB component.
entity-bean.declared-roles=The roles declared (via @DeclareRoles) on this EJB component.
entity-bean.pool-available-count=The number of available (i.e. not in use) instances in the pool.
entity-bean.pool-create-count=The number of bean instances that have been created.
entity-bean.pool-current-size=The current size of the pool.
entity-bean.pool-name=The name of the pool.
entity-bean.pool-remove-count=The number of bean instances that have been removed.
entity-bean.pool-max-size=The maximum size of the pool.
message-driven-bean=Message driven bean component included in the deployment.
message-driven-bean.component-class-name=The component's class name.
message-driven-bean.security-domain=The security domain for this EJB component.
message-driven-bean.run-as-role=The run-as role (if any) for this EJB component.
message-driven-bean.declared-roles=The roles declared (via @DeclareRoles) on this EJB component.
message-driven-bean.pool-available-count=The number of available (i.e. not in use) instances in the pool.
message-driven-bean.pool-create-count=The number of bean instances that have been created.
message-driven-bean.pool-current-size=The current size of the pool.
message-driven-bean.pool-name=The name of the pool.
message-driven-bean.pool-remove-count=The number of bean instances that have been removed.
message-driven-bean.pool-max-size=The maximum size of the pool.
message-driven-bean.timers=Os timers EJB associados com o componente.
message-driven-bean.timers.time-remaining=The number of milliseconds that will elapse before the next scheduled timer expiration, or "undefined" if the timer has no future timeouts, is expired, or has been cancelled.
message-driven-bean.timers.next-timeout=The point in time (in ms since the epoch) at which the next timer expiration is scheduled to occur, or "undefined" if the timer has no future timeouts, is expired, or has been cancelled.
message-driven-bean.timers.calendar-timer=Whether this timer is a calendar-based timer, or "undefined" if the timer has expired or been cancelled.
message-driven-bean.timers.persistent=Whether this timer has persistent semantics, or "undefined" if the timer has expired or been cancelled.
message-driven-bean.timers.schedule=The schedule expression corresponding to this timer, or "undefined" if the timer was not created using a schedule expression, is expired, or has been cancelled.
message-driven-bean.timers.schedule.year=A particular calendar year.
message-driven-bean.timers.schedule.month=One or more months within a year.
message-driven-bean.timers.schedule.day-of-month=One or more days within a month.
message-driven-bean.timers.schedule.day-of-week=One or more days within a week.
message-driven-bean.timers.schedule.hour=One or more hours within a day.
message-driven-bean.timers.schedule.minute=One or more minutes within an hour.
message-driven-bean.timers.schedule.second=One or more seconds within a minute.
message-driven-bean.timers.schedule.timezone=A non-default time zone in whose context the schedule specification is to be evaluated.
message-driven-bean.timers.schedule.start=The start date for the timer, in ms since the epoch.
message-driven-bean.timers.schedule.end=The end date for the timer, in ms since the epoch.
singleton-bean=Singleton bean component included in the deployment.
singleton-bean.component-class-name=The component's class name.
singleton-bean.timers=EJB timers associated with the component.
singleton-bean.security-domain=The security domain for this EJB component.
singleton-bean.run-as-role=The run-as role (if any) for this EJB component.
singleton-bean.declared-roles=The roles declared (via @DeclareRoles) on this EJB component.
singleton-bean.timers.time-remaining=The number of milliseconds that will elapse before the next scheduled timer expiration, or "undefined" if the timer has no future timeouts, is expired, or has been cancelled.
singleton-bean.timers.next-timeout=The point in time (in ms since the epoch) at which the next timer expiration is scheduled to occur, or "undefined" if the timer has no future timeouts, is expired, or has been cancelled.
singleton-bean.timers.calendar-timer=Whether this timer is a calendar-based timer, or "undefined" if the timer has expired or been cancelled.
singleton-bean.timers.persistent=Whether this timer has persistent semantics, or "undefined" if the timer has expired or been cancelled.
singleton-bean.timers.schedule=The schedule expression corresponding to this timer, or "undefined" if the timer was not created using a schedule expression, is expired, or has been cancelled.
singleton-bean.timers.schedule.year=A particular calendar year.
singleton-bean.timers.schedule.month=Um ou mais meses por ano.
singleton-bean.timers.schedule.day-of-month=Um ou mais dias por m\u00EAs.
singleton-bean.timers.schedule.day-of-week=Um ou mais dias por semana.
singleton-bean.timers.schedule.hour=Uma ou mais horas por dia.
singleton-bean.timers.schedule.minute=Um ou mais minutes por hora.
singleton-bean.timers.schedule.second=Um ou mais segundos por minuto.
singleton-bean.timers.schedule.timezone=O fuso hor\u00E1rio que n\u00E3o \u00E9 padr\u00E3o cujo contexto da especifica\u00E7\u00E3o do esquema deve ser avaliado.
singleton-bean.timers.schedule.start=A data de in\u00EDcio para o timer em mil\u00E9simos de segundos desde a \u00E9poca.
singleton-bean.timers.schedule.end=O final da data para o timer, em mil\u00E9simos de segundos desde a \u00E9poca.
stateful-session-bean=O componente do bean de sess\u00E3o com estado incluso na implanta\u00E7\u00E3o.
stateful-session-bean.component-class-name=O nome da classe do componente.
stateful-session-bean.security-domain=O dom\u00EDnio de seguran\u00E7a para o componente EJB.
stateful-session-bean.run-as-role=A fun\u00E7\u00E3o run-as (caso alguma) para esse componente EJB.
stateful-session-bean.declared-roles=As fun\u00E7\u00F5es declaradas (atrav\u00E9s do @DeclareRoles) no componente EJB.
stateless-session-bean=O componente do bean de sess\u00E3o inclu\u00EDdo na implanta\u00E7\u00E3o.
stateless-session-bean.component-class-name=O nome da classe do componente.
stateless-session-bean.security-domain=O dom\u00EDnio da seguran\u00E7a para esse componente EJB.
stateless-session-bean.run-as-role=A fun\u00E7\u00E3o run-as (caso alguma) para esse componente EJB.
stateless-session-bean.declared-roles=As fun\u00E7\u00F5es declaradas (atrav\u00E9s do @DeclareRoles) nesse componente EJB.
stateless-session-bean.pool-available-count=O n\u00FAmero de inst\u00E2ncias dispon\u00EDveis (ex.\: que n\u00E3o est\u00E3o em uso) no pool.
stateless-session-bean.pool-create-count=O n\u00FAmero de inst\u00E2ncias que foram criadas.
stateless-session-bean.pool-current-size=O tamanho atual do pool.
stateless-session-bean.pool-name=O nome do pool.
stateless-session-bean.pool-remove-count=O n\u00FAmero das inst\u00E2ncias do bean que foram removidas.
stateless-session-bean.pool-max-size=O tamanho m\u00E1ximo do pool.
stateless-session-bean.timers=Os timers EJB associados com o componente.
stateless-session-bean.timers.time-remaining=O n\u00FAmero de mil\u00E9simos de segundos antes da expira\u00E7\u00E3o do timer programado, ou "indefinido" caso o timer n\u00E3o possua intervalos futuros, tenha expirado ou tenha sido cancelado.
stateless-session-bean.timers.next-timeout=O per\u00EDodo no tempo (em mil\u00E9simos de segundos desde a \u00E9poca) pelo qual a pr\u00F3xima expira\u00E7\u00E3o do timer est\u00E1 programada a ocorrer, ou "indefinida" caso o timer n\u00E3o possua futuros intervalos ou tenha sido cancelado.
stateless-session-bean.timers.calendar-timer=Se \u00E9 que esse timer est\u00E1 baseado no calend\u00E1rio, ou \u00E9 "indefinido" caso o timer tenha sido expirado ou cancelado.
stateless-session-bean.timers.persistent=Se \u00E9 que esse timer tenha sem\u00E2nticas persistentes, ou \u00E9 "indefinido" caso o timer tenha expirado ou tenha sido cancelado.
stateless-session-bean.timers.schedule=A express\u00E3o correspondente a esse timer, ou \u00E9 "indefinida" caso o timer n\u00E3o tenha sido criado usando uma express\u00E3o, tenha expirado ou tenha sido cancelado.
stateless-session-bean.timers.schedule.year=Um calend\u00E1rio particular no ano.
stateless-session-bean.timers.schedule.month=Um ou mais meses no ano.
stateless-session-bean.timers.schedule.day-of-month=Um ou mais dias num m\u00EAs.
stateless-session-bean.timers.schedule.day-of-week=Um ou mais dias na semana.
stateless-session-bean.timers.schedule.hour=Uma ou mais horas num dia.
stateless-session-bean.timers.schedule.minute=Um ou mais minutos numa hora.
stateless-session-bean.timers.schedule.second=Um ou mais segundos num minuto.
stateless-session-bean.timers.schedule.timezone=O fuso hor\u00E1rio cujo o contexto da especifica\u00E7\u00E3o da programa\u00E7\u00E3o deve ser avaliado.
stateless-session-bean.timers.schedule.start=A data de in\u00EDcio do timer, em mil\u00E9simos de segundos desde a \u00E9poca.
stateless-session-bean.timers.schedule.end=A data final do timer, em mil\u00E9simos de segundos desde a \u00E9poca.
remote=O Servi\u00E7o Remoto EJB3
remote.add=Adiciona o servi\u00E7o remoto EJB3
remote.remove=Remove o servi\u00E7o remoto EJB3
remote.connector-ref=O nome do conector pelo qual o canal remoto EJB3 \u00E9 registrado
remote.thread-pool-name=O nome do thread pool que manuseia as invoca\u00E7\u00F5es remotas
remote.client-mappings-cache-container-ref=O nome do recipiente do cache com cluster que ser\u00E1 usado para armazenar/acessar o client-mappings do socket-binding do conector remoto EJB em cada m\u00F3dulo, no cluster
remote.client-mappings-cache-ref=O nome do cache com cluster que ser\u00E1 usado para armazenar/acessar o client-mappings do socket-binding do conector remoto do EJB em cada n\u00F3, no cluster
async=O Servi\u00E7o de Invoca\u00E7\u00E3o Ass\u00EDncrono EJB3
async.add=Adiciona o Servi\u00E7o de Invoca\u00E7\u00E3o Ass\u00EDncrono EJB3
async.remove=Remove o Servi\u00E7o de Invoca\u00E7\u00E3o Ass\u00EDncrono EJB3
async.thread-pool-name=O nome do thread pool que manuseia as invoca\u00E7\u00F5es ass\u00EDncronas
thread-pool=O EJB thread pool
thread-pool.add=Adiciona o thread pool
thread-pool.remove=Remove o thread pool
thread-pool.max-threads=O n\u00FAmero m\u00E1ximo de threads que o thread pool pode conter. O valor padr\u00E3o caso n\u00E3o configurado \u00E9 o n\u00FAmero de processos assim com retornado pelo Runtime.availableProcessors()
thread-pool.core-threads=O n\u00FAmero m\u00EDnimo de threads no thread pool.
thread-pool.keepalive-time=A quantia de tempo em mil\u00E9simos de segundos que um thread ocioso permanecer\u00E1.
iiop=O servi\u00E7o IIOP
iiop.add=Adiciona o suporte IIOP ao sub-sistema EJB3
iiop.remove=Remove o suporte IIOP
iiop.enable-by-default=Caso isso seja verdadeiro, o EJB ser\u00E1 exibido no IIOP por padr\u00E3o, do contr\u00E1rio ele precisa ser ativado no descritor da implanta\u00E7\u00E3o
iiop.use-qualified-name=Caso verdadeiro os nomes EJB ser\u00E3o vinculados no servi\u00E7o de nomea\u00E7\u00E3o com o nome do m\u00F3dulo e aplicativo e nome do m\u00F3dulo prefixado ao nome (ex.\: myapp/mymodule/MyEjb)
cache=O cache SFSB
cache.add=Adiciona o cache
cache.remove=Remove o cache
cache.aliases=Os aliases pelos quais esse cache pode ser tamb\u00E9m referenciado
cache.passivation-store=O armazenamento da passiva\u00E7\u00E3o usado por esse cache
file-passivation-store=O sistema do arquivo baseado no armazenamento da passiva\u00E7\u00E3o
file-passivation-store.add=Adiciona um sistema de arquivo baseado no armazenamento da passiva\u00E7\u00E3o
file-passivation-store.remove=Remove o sistema de arquivo baseado no armazenamento da passiva\u00E7\u00E3o
file-passivation-store.idle-timeout=O intervalo em unidades especificado pelo idle-timeout-unit, pelo qual o bean passivar\u00E1 mais tarde
file-passivation-store.idle-timeout-unit=A unidade do idle-timeout
file-passivation-store.max-size=O n\u00FAmero m\u00E1ximo de beans que esse cache deve armazenar antes de for\u00E7ar beans antigos \u00E0 passiva\u00E7\u00E3o
cluster-passivation-store=O armazenamento de passiva\u00E7\u00E3o com cluster
cluster-passivation-store.add=Adiciona o armazenamento de passiva\u00E7\u00E3o com cluster
cluster-passivation-store.remove=Remove um armazenamento de passiva\u00E7\u00E3o com cluster
cluster-passivation-store.idle-timeout=O intervalo em unidades especificado pelo idle-timeout-unit, pelo qual o bean passivar\u00E1 mais tarde
cluster-passivation-store.idle-timeout-unit=A unidade de idle-timeout
cluster-passivation-store.max-size=O n\u00FAmero m\u00E1ximo de beans que esse cache deve ser armazenado antes de for\u00E7ar beans antigos a serem passivados
cluster-passivation-store.cache-container=O nome do recipiente do cache usado para os caches do client-mappings
cluster-passivation-store.bean-cache=O nome do cache usado para armazenar as inst\u00E2ncias de bean.
cluster-passivation-store.client-mappings-cache=O nome do cache usado para armazenar o  client-mappings do socket-bindings do conector remoto do EJB
cluster-passivation-store.passivate-events-on-replicate=Indica se \u00E9 que a replica\u00E7\u00E3o deve aplicar o trigger nos eventos de passiva\u00E7\u00E3o do bean
