ejb3=A configura\u00E7\u00E3o do sub-sistema ebj3.
ejb3.add=Adiciona o sub-sistema ejb3.
ejb3.remove=Removes o sub-sistema ejb3.
ejb3.lite=Especifica se \u00E9 que o recipiente ejb3 precisa apenas fornecer o perfil "LITE" da especifica\u00E7\u00E3o. O valor deve ser apenas falso quando usando "tudo" do distro. 
ejb3.default-clustered-sfsb-cache=O nome do cache do bean com estado padr\u00E3o, que ser\u00E1 aplic\u00E1vel a todos os EJBs com estado e com cluster, a n\u00E3o ser que substitu\u00EDdos na implanta\u00E7\u00E3o ou ao n\u00EDvel do bean
ejb3.default-mdb-instance-pool=O nome do pool da inst\u00E2ncia MDB padr\u00E3o, que ser\u00E1 aplicado a todos os MDBs, a n\u00E3o que substitu\u00EDdos na implanta\u00E7\u00E3o ou ao n\u00EDvel do bean
ejb3.default-entity-bean-instance-pool=O nome do pool da inst\u00E2ncia do bean de entidade padr\u00E3o, que ser\u00E1 aplicado a todos os MDBs, a n\u00E3o que substitu\u00EDdos na implanta\u00E7\u00E3o ou ao n\u00EDvel do bean
ejb3.default-entity-bean-optimistic-locking=Os beans usar\u00E3o o boqueamento otimista por padr\u00E3o, caso configurados para verdadeiro
ejb3.default-resource-adapter-name=O nome do adaptador de recurso padr\u00E3o que ser\u00E1 usado pelos MDBs, a n\u00E3o ser que substitu\u00EDdos na implanta\u00E7\u00E3o ou n\u00EDvel do bean
ejb3.default-sfsb-cache=O nome do cache de bean com estado padr\u00E3o, que ser\u00E1 aplicado a todos os EJBs com estado, a n\u00E3o ser que substitu\u00EDdos na implanta\u00E7\u00E3o ou n\u00EDvel do bean
ejb3.default-slsb-instance-pool=O nome do pool da inst\u00E2ncia do bean sem estado padr\u00E3o, que ser\u00E1 aplic\u00E1vel a todos os EJBs sem estado, a n\u00E3o ser que substitu\u00EDdos na implanta\u00E7\u00E3o ou n\u00EDvel do bean
ejb3.default-stateful-bean-access-timeout=O intervalo de acesso padr\u00E3o para os beans com estado
ejb3.default-singleton-bean-access-timeout=O intervalo de acesso padr\u00E3o para os beans singleton
ejb3.in-vm-remote-interface-invocation-pass-by-value=Caso falso, os par\u00E2metros para invoca\u00E7\u00F5es na interface remota de um EJB, ser\u00E3o passados pela refer\u00EAncia. Do contr\u00E1rio, os par\u00E2metros ser\u00E3o passados pelo valor.
service=Os servi\u00E7os configur\u00E1veis centralmente que n\u00E3o fazem parte do sub-sistema EJB3.
timer-service=O servi\u00E7o do timer EJB
timer-service.add=Adiciona o servi\u00E7o do timer
timer-service.remove=Remove o servi\u00E7o do timer
timer-service.thread-pool-name=O nome do pool do thread usado para rodar as invoca\u00E7\u00F5es do servi\u00E7o do timer
timer-service.path=O diret\u00F3rio para armazenar a informa\u00E7\u00E3o do timer persistente
timer-service.relative-to=O caminho relativo que \u00E9 usado para resolver a localiza\u00E7\u00E3o do armazenamento de dados
strict-max-bean-instance-pool=O pool da inst\u00E2ncia do bean com um limite super estrito
strict-max-bean-instance-pool.add=Adiciona o pool da inst\u00E2ncia do bean que possui um limite super estrito para as inst\u00E2ncias do bean
strict-max-bean-instance-pool.remove=Remove o pool da inst\u00E2ncia do bean espec\u00EDfico que possui um limite super estrito para as inst\u00E2ncias do bean
strict-max-bean-instance-pool.max-pool-size=O n\u00FAmero m\u00E1ximo de inst\u00E2ncias de bean que o pool pode manter num per\u00EDodo de tempo determinado
strict-max-bean-instance-pool.timeout=O per\u00EDodo m\u00E1ximo de tempo de espera para uma inst\u00E2ncia de bean a ser disponibilizada a partir do pool
strict-max-bean-instance-pool.timeout-unit=A unidade do intervalo de aquisi\u00E7\u00E3o da inst\u00E2ncia
deployed=Os recursos do per\u00EDodo de rodagem expostos pelos componentes EJBs inclu\u00EDdos nesta implanta\u00E7\u00E3o.
entity-bean=O componente do bean de entidade inclu\u00EDdo na implanta\u00E7\u00E3o.
entity-bean.component-class-name=O nome da classe do componente.
entity-bean.security-domain=O dom\u00EDnio de seguran\u00E7a para esse componente EJB.
entity-bean.run-as-role=A fun\u00E7\u00E3o run-as (se alguma) para esse componente EJB.
entity-bean.declared-roles=As fun\u00E7\u00F5es declarativas (atarv\u00E9s do @DeclareRoles) nesse componente EJB.
entity-bean.pool-available-count=O n\u00FAmero de inst\u00E2ncias das vari\u00E1veis (ex.\: que n\u00E3o est\u00E3o em uso) no pool.
entity-bean.pool-create-count=O n\u00FAmero das inst\u00E2ncias do bean que foram criadas.
entity-bean.pool-current-size=O tamanho atual do pool.
entity-bean.pool-name=O nome do pool.
entity-bean.pool-remove-count=O n\u00FAmero de inst\u00E2ncias de bean que foram removidas.
entity-bean.pool-max-size=O tamanho m\u00E1ximo de pool.
message-driven-bean=O componente de bean dirigido de mensagem na implanta\u00E7\u00E3o.
message-driven-bean.component-class-name=O nome da classe do componente.
message-driven-bean.security-domain=O dom\u00EDnio de seguran\u00E7a para esse componente EJB.
message-driven-bean.run-as-role=A fun\u00E7\u00E3o run-as (se alguma) para esse componente EJB.
message-driven-bean.declared-roles=As fun\u00E7\u00F5es declaradas (atrav\u00E9s do @DeclareRoles) neste componente EJB.
message-driven-bean.pool-available-count=O n\u00FAmero de inst\u00E2ncias dispon\u00EDveis (ex.\: que n\u00E3o est\u00E3o em uso) no pool. 
message-driven-bean.pool-create-count=O n\u00FAmero de beans de inst\u00E2ncias que foram criadas.
message-driven-bean.pool-current-size=O tamanho atual do pool.
message-driven-bean.pool-name=O nome do pool.
message-driven-bean.pool-remove-count=O n\u00FAmero de inst\u00E2ncias de bean que foram removidas.
message-driven-bean.pool-max-size=O tamanho m\u00E1ximo do pool.
message-driven-bean.timers=Os timers EJB associados com o componente.
message-driven-bean.timers.time-remaining=O n\u00FAmero de mil\u00E9simos de segundos que ir\u00E3o decorrer antes da pr\u00F3xima expira\u00E7\u00E3o do timer esquematizada, ou "indefinido" caso o timer n\u00E3o possua intervalos futuros, est\u00E1 expirado ou foi cancelado.
message-driven-bean.timers.next-timeout=O per\u00EDodo de tempo (em mil\u00E9simos de segundos) pelo qual a pr\u00F3xima expira\u00E7\u00E3o do timer est\u00E1 esquematizada, ou "indefinido" caso o timer n\u00E3o possua intervalos futuros, esteja expirado ou tenha sido cancelado.
message-driven-bean.timers.calendar-timer=Se \u00E9 que esse timer \u00E9 um timer baseado no calend\u00E1rio, ou "indefinid" caso o tmer tenha expirado ou tenha sido cancelado.
message-driven-bean.timers.persistent=Se \u00E9 que esse timer possui sem\u00E2nticas persistentes, ou \u00E9 "indefinido" caso o timer tenha expirado ou tenha sido cancelado.
message-driven-bean.timers.schedule=A express\u00E3o correspondente a esse timer, ou \u00E9 "indefinido" caso o timer n\u00E3o tenha sido criado usando uma express\u00E3o, tenha expirado ou tenha sido cancelado.
message-driven-bean.timers.schedule.year=Um calend\u00E1rio particular no ano.
message-driven-bean.timers.schedule.month=Um ou mais meses por ano.
message-driven-bean.timers.schedule.day-of-month=Um ou mais dias num m\u00EAs.
message-driven-bean.timers.schedule.day-of-week=Um ou mais dias por semana.
message-driven-bean.timers.schedule.hour=Uma ou mais horas por dia.
message-driven-bean.timers.schedule.minute=Um ou mais minutes por hora.
message-driven-bean.timers.schedule.second=Um ou mais segundos por minuto.
message-driven-bean.timers.schedule.timezone=O fuso hor\u00E1rio n\u00E3o-padr\u00E3o cujo o contexto da especifica\u00E7\u00E3o da programa\u00E7\u00E3o deve ser avaliado.
message-driven-bean.timers.schedule.start=A data de in\u00EDcio para o timer em mil\u00E9simos de segundos desde a \u00E9poca.
message-driven-bean.timers.schedule.end=O final da data para o timer, em mil\u00E9simos de segundos desde a \u00E9poca.
singleton-bean=O componente do bean singleton inclu\u00EDdo na implanta\u00E7\u00E3o.
singleton-bean.component-class-name=O nome da classe do componente.
singleton-bean.timers=Os timers EJB associados com o componente.
singleton-bean.security-domain=O dom\u00EDnio de seguran\u00E7a para esse componente EJB.
singleton-bean.run-as-role=A fun\u00E7\u00E3o run-as (se alguma) para esse componente EJB.
singleton-bean.declared-roles=As fun\u00E7\u00F5es declarativas (atarv\u00E9s do @DeclareRoles) nesse componente EJB.
singleton-bean.timers.time-remaining=O n\u00FAmero de mil\u00E9simos de segundos que ir\u00E3o decorrer antes da pr\u00F3xima expira\u00E7\u00E3o do timer esquematizada, ou "indefinido" caso o timer n\u00E3o possua intervalos futuros, est\u00E1 expirado ou foi cancelado.
singleton-bean.timers.next-timeout=O per\u00EDodo no tempo (em mil\u00E9simos de segundos desde a \u00E9poca) pelo qual a pr\u00F3xima expira\u00E7\u00E3o do timer est\u00E1 programada a ocorrer, ou "indefinido" caso o timer n\u00E3o possua futuros intervalos ou tenha sido cancelado.
singleton-bean.timers.calendar-timer=Se \u00E9 que esse timer est\u00E1 baseado no calend\u00E1rio, ou \u00E9 "indefinido" caso o timer tenha sido expirado ou cancelado.
singleton-bean.timers.persistent=Se \u00E9 que esse timer possui sem\u00E2nticas persistentes, ou \u00E9 "indefinido" caso o timer tenha expirado ou tenha sido cancelado.
singleton-bean.timers.schedule=A express\u00E3o correspondente a esse timer, ou "indefinido" caso o timer n\u00E3o tenha sido criado usando uma express\u00E3o esquematizada, tenha expirado ou tenha sido cancelado.
singleton-bean.timers.schedule.year=Um calend\u00E1rio particular no ano.
singleton-bean.timers.schedule.month=Um ou mais meses por ano.
singleton-bean.timers.schedule.day-of-month=Um ou mais dias por m\u00EAs.
singleton-bean.timers.schedule.day-of-week=Um ou mais dias por semana.
singleton-bean.timers.schedule.hour=Uma ou mais horas por dia.
singleton-bean.timers.schedule.minute=Um ou mais minutes por hora.
singleton-bean.timers.schedule.second=Um ou mais segundos por minuto.
singleton-bean.timers.schedule.timezone=O fuso hor\u00E1rio que n\u00E3o \u00E9 padr\u00E3o cujo contexto da especifica\u00E7\u00E3o do esquema deve ser avaliado.
singleton-bean.timers.schedule.start=A data de in\u00EDcio para o timer em mil\u00E9simos de segundos desde a \u00E9poca.
singleton-bean.timers.schedule.end=O final da data para o timer, em mil\u00E9simos de segundos desde a \u00E9poca.
stateful-session-bean=O componente do bean de sess\u00E3o com estado incluso na implanta\u00E7\u00E3o.
stateful-session-bean.component-class-name=O nome da classe do componente.
stateful-session-bean.security-domain=O dom\u00EDnio de seguran\u00E7a para o componente EJB.
stateful-session-bean.run-as-role=A fun\u00E7\u00E3o run-as (caso alguma) para esse componente EJB.
stateful-session-bean.declared-roles=As fun\u00E7\u00F5es declaradas (atrav\u00E9s do @DeclareRoles) no componente EJB.
stateless-session-bean=O componente do bean de sess\u00E3o inclu\u00EDdo na implanta\u00E7\u00E3o.
stateless-session-bean.component-class-name=O nome da classe do componente.
stateless-session-bean.security-domain=O dom\u00EDnio da seguran\u00E7a para esse componente EJB.
stateless-session-bean.run-as-role=A fun\u00E7\u00E3o run-as (caso alguma) para esse componente EJB.
stateless-session-bean.declared-roles=As fun\u00E7\u00F5es declaradas (atrav\u00E9s do @DeclareRoles) nesse componente EJB.
stateless-session-bean.pool-available-count=O n\u00FAmero de inst\u00E2ncias dispon\u00EDveis (ex.\: que n\u00E3o est\u00E3o em uso) no pool.
stateless-session-bean.pool-create-count=O n\u00FAmero de inst\u00E2ncias que foram criadas.
stateless-session-bean.pool-current-size=O tamanho atual do pool.
stateless-session-bean.pool-name=O nome do pool.
stateless-session-bean.pool-remove-count=O n\u00FAmero das inst\u00E2ncias do bean que foram removidas.
stateless-session-bean.pool-max-size=O tamanho m\u00E1ximo do pool.
stateless-session-bean.timers=Os timers EJB associados com o componente.
stateless-session-bean.timers.time-remaining=O n\u00FAmero de mil\u00E9simos de segundos antes da expira\u00E7\u00E3o do timer programado, ou "indefinido" caso o timer n\u00E3o possua intervalos futuros, tenha expirado ou tenha sido cancelado.
stateless-session-bean.timers.next-timeout=O per\u00EDodo no tempo (em mil\u00E9simos de segundos desde a \u00E9poca) pelo qual a pr\u00F3xima expira\u00E7\u00E3o do timer est\u00E1 programada a ocorrer, ou "indefinida" caso o timer n\u00E3o possua futuros intervalos ou tenha sido cancelado.
stateless-session-bean.timers.calendar-timer=Se \u00E9 que esse timer est\u00E1 baseado no calend\u00E1rio, ou \u00E9 "indefinido" caso o timer tenha sido expirado ou cancelado.
stateless-session-bean.timers.persistent=Se \u00E9 que esse timer tenha sem\u00E2nticas persistentes, ou \u00E9 "indefinido" caso o timer tenha expirado ou tenha sido cancelado.
stateless-session-bean.timers.schedule=A express\u00E3o correspondente a esse timer, ou \u00E9 "indefinida" caso o timer n\u00E3o tenha sido criado usando uma express\u00E3o, tenha expirado ou tenha sido cancelado.
stateless-session-bean.timers.schedule.year=Um calend\u00E1rio particular no ano.
stateless-session-bean.timers.schedule.month=Um ou mais meses no ano.
stateless-session-bean.timers.schedule.day-of-month=Um ou mais dias num m\u00EAs.
stateless-session-bean.timers.schedule.day-of-week=Um ou mais dias na semana.
stateless-session-bean.timers.schedule.hour=Uma ou mais horas num dia.
stateless-session-bean.timers.schedule.minute=Um ou mais minutos numa hora.
stateless-session-bean.timers.schedule.second=Um ou mais segundos num minuto.
stateless-session-bean.timers.schedule.timezone=O fuso hor\u00E1rio cujo o contexto da especifica\u00E7\u00E3o da programa\u00E7\u00E3o deve ser avaliado.
stateless-session-bean.timers.schedule.start=A data de in\u00EDcio do timer, em mil\u00E9simos de segundos desde a \u00E9poca.
stateless-session-bean.timers.schedule.end=A data final do timer, em mil\u00E9simos de segundos desde a \u00E9poca.
remote=O Servi\u00E7o Remoto EJB3
remote.add=Adiciona o servi\u00E7o remoto EJB3
remote.remove=Remove o servi\u00E7o remoto EJB3
remote.connector-ref=O nome do conector pelo qual o canal remoto EJB3 \u00E9 registrado
remote.thread-pool-name=O nome do thread pool que manuseia as invoca\u00E7\u00F5es remotas
remote.client-mappings-cache-container-ref=O nome do recipiente do cache com cluster que ser\u00E1 usado para armazenar/acessar o client-mappings do socket-binding do conector remoto EJB em cada m\u00F3dulo, no cluster
remote.client-mappings-cache-ref=O nome do cache com cluster que ser\u00E1 usado para armazenar/acessar o client-mappings do socket-binding do conector remoto do EJB em cada n\u00F3, no cluster
async=O Servi\u00E7o de Invoca\u00E7\u00E3o Ass\u00EDncrono EJB3
async.add=Adiciona o Servi\u00E7o de Invoca\u00E7\u00E3o Ass\u00EDncrono EJB3
async.remove=Remove o Servi\u00E7o de Invoca\u00E7\u00E3o Ass\u00EDncrono EJB3
async.thread-pool-name=O nome do thread pool que manuseia as invoca\u00E7\u00F5es ass\u00EDncronas
thread-pool=O EJB thread pool
thread-pool.add=Adiciona o thread pool
thread-pool.remove=Remove o thread pool
thread-pool.max-threads=O n\u00FAmero m\u00E1ximo de threads que o thread pool pode conter. O valor padr\u00E3o caso n\u00E3o configurado \u00E9 o n\u00FAmero de processos assim com retornado pelo Runtime.availableProcessors()
thread-pool.core-threads=O n\u00FAmero m\u00EDnimo de threads no thread pool.
thread-pool.keepalive-time=A quantia de tempo em mil\u00E9simos de segundos que um thread ocioso permanecer\u00E1.
iiop=O servi\u00E7o IIOP
iiop.add=Adiciona o suporte IIOP ao sub-sistema EJB3
iiop.remove=Remove o suporte IIOP
iiop.enable-by-default=Caso isso seja verdadeiro, o EJB ser\u00E1 exibido no IIOP por padr\u00E3o, do contr\u00E1rio ele precisa ser ativado no descritor da implanta\u00E7\u00E3o
iiop.use-qualified-name=Caso verdadeiro os nomes EJB ser\u00E3o vinculados no servi\u00E7o de nomea\u00E7\u00E3o com o nome do m\u00F3dulo e aplicativo e nome do m\u00F3dulo prefixado ao nome (ex.\: myapp/mymodule/MyEjb)
cache=O cache SFSB
cache.add=Adiciona o cache
cache.remove=Remove o cache
cache.aliases=Os aliases pelos quais esse cache pode ser tamb\u00E9m referenciado
cache.passivation-store=O armazenamento da passiva\u00E7\u00E3o usado por esse cache
file-passivation-store=O sistema do arquivo baseado no armazenamento da passiva\u00E7\u00E3o
file-passivation-store.add=Adiciona um sistema de arquivo baseado no armazenamento da passiva\u00E7\u00E3o
file-passivation-store.remove=Remove o sistema de arquivo baseado no armazenamento da passiva\u00E7\u00E3o
file-passivation-store.idle-timeout=O intervalo em unidades especificado pelo idle-timeout-unit, pelo qual o bean passivar\u00E1 mais tarde
file-passivation-store.idle-timeout-unit=A unidade do idle-timeout
file-passivation-store.max-size=O n\u00FAmero m\u00E1ximo de beans que esse cache deve armazenar antes de for\u00E7ar beans antigos \u00E0 passiva\u00E7\u00E3o
cluster-passivation-store=O armazenamento de passiva\u00E7\u00E3o com cluster
cluster-passivation-store.add=Adiciona o armazenamento de passiva\u00E7\u00E3o com cluster
cluster-passivation-store.remove=Remove um armazenamento de passiva\u00E7\u00E3o com cluster
cluster-passivation-store.idle-timeout=O intervalo em unidades especificado pelo idle-timeout-unit, pelo qual o bean passivar\u00E1 mais tarde
cluster-passivation-store.idle-timeout-unit=A unidade de idle-timeout
cluster-passivation-store.max-size=O n\u00FAmero m\u00E1ximo de beans que esse cache deve ser armazenado antes de for\u00E7ar beans antigos a serem passivados
cluster-passivation-store.cache-container=O nome do recipiente do cache usado para os caches do client-mappings
cluster-passivation-store.bean-cache=O nome do cache usado para armazenar as inst\u00E2ncias de bean.
cluster-passivation-store.client-mappings-cache=O nome do cache usado para armazenar o  client-mappings do socket-bindings do conector remoto do EJB
cluster-passivation-store.passivate-events-on-replicate=Indica se \u00E9 que a replica\u00E7\u00E3o deve aplicar o trigger nos eventos de passiva\u00E7\u00E3o do bean
