# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/datasources/LocalDescriptions, author ldelima@redhat.com
datasources=O subsistema da fonte de dados, usado para declarar fonte de dados JDBC
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/datasources/LocalDescriptions, author ldelima@redhat.com
datasources.add=Adiciona a subsistema das fontes dados
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/datasources/LocalDescriptions, author ldelima@redhat.com
datasources.remove=Remove o subsistema das fontes de dados
datasources.disable=Desativa a fonte de dados
datasources.enable=Ativa a fonte de dados
datasources.enable.persistent=caso verdadeiro, a ativa\u00E7\u00E3o deste atributo \u00E9 persistida
datasources.flush-all-connection-in-pool=Esvazia todas as conex\u00F5es no pool
datasources.flush-idle-connection-in-pool=Esvazia todas as conex\u00F5es ociosas no pool
datasources.test-connection-in-pool=Testa se a conex\u00E3o pode ser obtida
datasources.jdbc-driver=Servi\u00E7o que disponibiliza  o driver JDBC para uso no per\u00EDodo de rodagem
datasources.jdbc-driver.add=Adiciona um novo driver JDBC
datasources.jdbc-driver.description=Um servi\u00E7o que disponibiliza o driver JDBC para uso no per\u00EDodo de rodagem
datasources.jdbc-driver.module=O nome do m\u00F3dulo que disponibiliza o driver JDBC sob o "java.sql.Driver" do tipo de servi\u00E7o
datasources.jdbc-driver.remove=Remove o driver JDBC
datasources.jdbc-driver.driver-major-version=O n\u00FAmero de vers\u00E3o superior do driver
datasources.jdbc-driver.driver-minor-version=O n\u00FAmero de vers\u00E3o inferior do driver
datasources.jdbc-driver.driver-datasource-class-name=O nome da classe inteiramente qualificada da implementa\u00E7\u00E3o javax.sql.DataSource
datasources.jdbc-driver.driver-xa-datasource-class-name=O nome da classe inteiramente qualificado da implementa\u00E7\u00E3o javax.sql.XADataSource 
datasources.jdbc-driver.driver-class-name=O nome da classe inteiramente qualificada da implementa\u00E7\u00E3o java.sql.Driver
datasources.jdbc-driver.driver-name=Define o driver JDBC que a fonte de dados deve usar. Isto \u00E9 um nome simb\u00F3lico de combina\u00E7\u00E3o ao nome do driver instalado. No caso do driver j\u00E1 ter sido implantado como jar, o nome ser\u00E1 o da unidade de implanta\u00E7\u00E3o
datasources.jdbc-driver.driver-module-name=O nome do m\u00F3dulo pelo qual o driver foi carregado, caso ele tenha sido carregado a partir do caminho do m\u00F3dulo
datasources.jdbc-driver.deployment-name=O nome da unidade da implanta\u00E7\u00E3o pela qual o driver foi carregado
datasources.jdbc-driver.jdbc-compliant=Se \u00E9 que o driver \u00E9 compat\u00EDvel com o JDBC
datasources.jdbc-driver.module-slot=O slot do m\u00F3dulo pelo qual o driver foi carregado, caso ele tenha sido carregado a partir do caminho do m\u00F3dulo
datasources.jdbc-driver.xa-datasource-class=Classe da fonte de dados XA
datasources.get-installed-driver=Obt\u00E9m a descri\u00E7\u00E3o de um driver instalado
datasources.installed-drivers-list=Lista dos drivers JDBC que foram instalados no per\u00EDodo de rodagem
datasources.installed-drivers.installed-driver=Driver JDBC que foi instalado no per\u00EDdo de rodagem
datasources.installed-drivers=Lista dos drivers JDBC que foram instalados no per\u00EDodo de rodagem
datasources.installed-drivers.driver-major-version=O n\u00FAmero de vers\u00E3o superior do driver
datasources.installed-drivers.driver-minor-version=O n\u00FAmero de vers\u00E3o inferior do driver
datasources.installed-drivers.driver-datasource-class-name=O nome da classe inteiramente qualificada da implementa\u00E7\u00E3o do javax.sql.DataSource 
datasources.installed-drivers.driver-xa-datasource-class-name=O nome da classe inteiramente qualificado da implementa\u00E7\u00E3o javax.sql.XADataSource 
datasources.installed-drivers.driver-class-name=O nome da classe inteiramente qualificada da implementa\u00E7\u00E3o java.sql.Driver
datasources.installed-drivers.driver-name=Define o driver JDBC que a fonte de dados deve usar. Isto \u00E9 uma nome simb\u00F3lico de combina\u00E7\u00E3o com o nome do driver instalado. No caso do driver j\u00E1 ter sido instalado como jar, o nome ser\u00E1 o da unidade de implanta\u00E7\u00E3o
datasources.installed-drivers.driver-module-name=O nome do m\u00F3dulo pelo qual o driver foi carregado, caso ele tenha sido carregado a partir do caminho do m\u00F3dulo
datasources.installed-drivers.deployment-name=O nome da unidade da implanta\u00E7\u00E3o pela qual o driver foi carregado
datasources.installed-drivers.jdbc-compliant=Se \u00E9 que o driver \u00E9 compat\u00EDvel com o JDBC
datasources.installed-drivers.module-slot=O slot do m\u00F3dulo pelo qual o driver foi carregado, caso ele tenha sido carregado a partir do caminho do m\u00F3dulo
datasources.installed-drivers.xa-datasource-class=Classe da fonte de dados XA
datasources.data-source=Uma configura\u00E7\u00E3o da fonte de dados JDBC
datasources.data-source.add=Adiciona uma nova fonte de dados
datasources.data-source.remove=Remove a fonte de dados
datasources.data-source.description=Uma configura\u00E7\u00E3o da fonte de dados JDBC
datasources.data-source.clear-statistics=Limpa todos os valores de estat\u00EDsticas para esse recurso
datasources.data-source.connection-url=O URL da conex\u00E3o do driver JDBC
datasources.data-source.driver-name=Define o driver JDBC que a fonte de dados deve usar. Isto \u00E9 um nome simb\u00F3lico de combina\u00E7\u00E3o ao nome do driver instalado. No caso do driver j\u00E1 ter sido implantado como jar, o nome ser\u00E1 o da unidade de implanta\u00E7\u00E3o
datasources.data-source.datasource-class=O nome inteiramente qualificado da classe da fonte de dados JDBC
datasources.data-source.driver-class=O nome inteiramente qualificado da classe do driver JDBC
datasources.data-source.driver=Define o driver JDBC que a fonte de dados deve usar. Isto \u00E9 um nome simb\u00F3lico de combina\u00E7\u00E3o ao nome do driver instalado. No caso do driver j\u00E1 ter sido implantado como jar, o nome ser\u00E1 o da unidade de implanta\u00E7\u00E3o
datasources.data-source.enabled=Especifica se a fonte de dados deve ser ativada
datasources.data-source.exception-sorter-class-name=Um org.jboss.jca.adapters.jdbc.ExceptionSorter que fornece um m\u00E9todo isExceptionFatal(SQLException) para valida\u00E7\u00E3o caso uma exce\u00E7\u00E3o transmita um erro
datasources.data-source.exception-sorter-properties.exception-sorter-class-name=Um org.jboss.jca.adapters.jdbc.ExceptionSorter que fornece um m\u00E9todo isExceptionFatal(SQLException) para valida\u00E7\u00E3o caso uma exce\u00E7\u00E3o transmita um erro
datasources.data-source.exception-sorter-properties=Exce\u00E7\u00E3o das propriedades de classifica\u00E7\u00E3o
datasources.data-source.idle-timeout-minutes=Os elementos idle-timeout-minutes especificam o per\u00EDodo m\u00E1ximo, em minutos, uma cole\u00E7\u00E3o deve ser ociosa antes de ser encerrada. O per\u00EDodo m\u00E1ximo atual depende no per\u00EDodo de verifica\u00E7\u00E3o do IdleRemover, que \u00E9 metade do menor valor do idle-timeout-minutes em qualquer pool. A altera\u00E7\u00E3o desse valor pode ser realizada apenas na desativa\u00E7\u00E3o da fonte de dados, solicitando a reinicializa\u00E7\u00E3o do servidor.
datasources.data-source.interleaving=Um elemento para ativar a intercala\u00E7\u00E3o para conex\u00F5es XA
datasources.data-source.jndi-name=Especifica o nome JNDI para a fonte de dados
datasources.data-source.jta=Ativa a integra\u00E7\u00E3o JTA
datasources.data-source.max-pool-size=O elemento max-pool-size especifica o n\u00FAmero m\u00E1ximo de conex\u00F5es para um pool. N\u00E3o ser\u00E3o mais criadas conex\u00F5es em cada sub-pool
datasources.data-source.min-pool-size=O elemento min-pool-size especifica o n\u00FAmero m\u00EDnimo de conex\u00F5es para um pool
datasources.data-source.new-connection-sql=Especifica a declara\u00E7\u00E3o SQL para executar todo instante em que uma conex\u00E3o \u00E9 adicionada ao pool de conex\u00E3o
datasources.data-source.no-tx-separate-pool=O Oracle n\u00E3o gosta das conex\u00F5es XA usadas tanto dentro como fora da transa\u00E7\u00E3o JTA. Voc\u00EA pode criar sub-pools separados para contextos diferentes como solu\u00E7\u00E3o para este problema
datasources.data-source.pad-xid=No caso do Xid ser preenchido
datasources.data-source.password=Especifica a senha usada na cria\u00E7\u00E3o de uma nova conex\u00E3o
datasources.data-source.pool-name=Especifica o nome do pool para a fonte de dados usada para gerenciamento
datasources.data-source.pool-prefill=No caso do pool ser pr\u00E9-preenchido. A altera\u00E7\u00E3o desse valor pode ser realizada apenas na desativa\u00E7\u00E3o da fonte de dados, do contr\u00E1rio a reinicializa\u00E7\u00E3o do servidor ser\u00E1 solicitada.
datasources.data-source.pool-use-strict-min=Especifica se o min-pool-size deve ser considerado rigorosamente
datasources.data-source.prepared-statements-cache-size=O n\u00FAmero de declara\u00E7\u00F5es preparadas por conex\u00E3o num cache de LRU
datasources.data-source.property-name=O nome da propriedade
datasources.data-source.property-value=O valor da propriedade
datasources.data-source.query-timeout=Qualquer intervalo da consulta configurada em segundos. O intervalo ser\u00E1 determinado, caso n\u00E3o tenha sido fornecido
datasources.data-source.same-rm-override=O elemento is-same-rm-override permite a configura\u00E7\u00E3o incondicional, independente do javax.transaction.xa.XAResource.isSameRM(XAResource) retornar verdadeiro ou falso
datasources.data-source.security-domain=Especifica o dom\u00EDnio de seguran\u00E7a que define o javax.security.auth.Subject que \u00E9 usado para distinguir as conex\u00F5es no pool
datasources.data-source.set-tx-query-timeout=Se \u00E9 que determinar o intervalo de consulta baseado no per\u00EDodo restante at\u00E9 que a transa\u00E7\u00E3o entre em intervalo. Qualquer intervalo de consulta configurado ser\u00E1 usado caso n\u00E3o haja transa\u00E7\u00E3o
datasources.data-source.share-prepared-statements=Se \u00E9 que compartilhar declara\u00E7\u00F5es preparadas, ex.\: se \u00E9 que perguntar pela mesma declara\u00E7\u00E3o duas vezes sem encerrar os usos da mesma declara\u00E7\u00E3o preparada adjacente
datasources.data-source.spy=Ativa a espionagem das declara\u00E7\u00F5es SQL
datasources.data-source.stale-connection-checker-properties.stale-connection-checker-class-name=Um org.jboss.jca.adapters.jdbc.StaleConnectionChecker que fornece um m\u00E9todo isStaleConnection(SQLException), do qual caso retorne verdadeiro, ir\u00E1 envolver a exce\u00E7\u00E3o num org.jboss.jca.adapters.jdbc.StaleConnectionException
datasources.data-source.stale-connection-checker-class-name=Um org.jboss.jca.adapters.jdbc.StaleConnectionChecker que fornece um m\u00E9todo isStaleConnection(SQLException), do qual caso retorne verdadeiro, ir\u00E1 envolver a exce\u00E7\u00E3o num org.jboss.jca.adapters.jdbc.StaleConnectionException
datasources.data-source.stale-connection-checker-properties=As propriedades do checador da conex\u00E3o obsoleta
datasources.data-source.track-statements=Se \u00E9 que checar por declara\u00E7\u00F5es n\u00E3o-encerradas quando a conex\u00E3o for retornada ao pool, os conjuntos de resultado s\u00E3o encerrados, uma declara\u00E7\u00E3o \u00E9 encerrada ou retornada para o cache da declara\u00E7\u00E3o preparada. Os valores v\u00E1lidos s\u00E3o\: "falso" - n\u00E3o rastreie declara\u00E7\u00F5es, "verdadeiro" - declara\u00E7\u00F5es de rastreio, conjuntos de resultado e avisos quando eles n\u00E3o est\u00E3o encerrados, "nowarn" - declara\u00E7\u00E3o de rastreio, mas n\u00E3o h\u00E1 aviso de quando eles forem abertos
datasources.data-source.transaction-isolation=Determina o n\u00EDvel de isola\u00E7\u00E3o da transa\u00E7\u00E3o java.sql.Connection. Os valores v\u00E1lidos s\u00E3o\: TRANSACTION_READ_UNCOMMITTED, TRANSACTION_READ_COMMITTED, TRANSACTION_REPEATABLE_READ, TRANSACTION_SERIALIZABLE e TRANSACTION_NONE
datasources.data-source.url-delimiter=Especifica o delimitador para os URLs no connection-url para as fontes de dados HA
datasources.data-source.url-selector-strategy-class-name=Uma classe que implementa org.jboss.jca.adapters.jdbc.URLSelectorStrategy
datasources.data-source.use-fast-fail=Se \u00E9 que falhar uma aloca\u00E7\u00E3o da conex\u00E3o na primeira tentativa, caso ela seja inv\u00E1lida (verdadeira) ou continuar tentando at\u00E9 que o pool seja esgotado de todas as conex\u00F5es potenciais (falso).
datasources.data-source.use-java-context=A configura\u00E7\u00E3o disto para falso aplicar\u00E1 o bind na fonte de dados no JNDI global
datasources.data-source.use-try-lock=Qualquer intervalo configurado para bloqueios internos nos objetos do adaptador do recurso em segundos
datasources.data-source.user-name=Especifica o nome do usu\u00E1rio usado quando criando uma nova conex\u00E3o
datasources.data-source.valid-connection-checker-class-name=Um org.jboss.jca.adapters.jdbc.ValidConnectionChecker que fornece um m\u00E9todo isValidConnection(Connection) para validar uma conex\u00E3o. Caso uma exce\u00E7\u00E3o seja retornada, isto significa que a conex\u00E3o \u00E9 inv\u00E1lida. Isto substitui o elemento check-valid-connection-sql
datasources.data-source.valid-connection-checker-properties.valid-connection-checker-class-name=Um org.jboss.jca.adapters.jdbc.ValidConnectionChecker que fornece um m\u00E9todo isValidConnection(Connection) para validar uma conex\u00E3o. Caso uma exce\u00E7\u00E3o seja retornada, isto significa que a conex\u00E3o \u00E9 inv\u00E1lida. Isto substitui o elemento check-valid-connection-sql
datasources.data-source.valid-connection-checker-properties=As propriedades do checador da conex\u00E3o v\u00E1lida
datasources.data-source.validate-on-match=O elemento validate-on-match especifica se a valida\u00E7\u00E3o da conex\u00E3o deve ser realizada quando uma cria\u00E7\u00E3o da conex\u00E3o tentar coincidir uma conex\u00E3o gerenciada. Isto \u00E9 normalmente exclusivo ao uso da valida\u00E7\u00E3o de plano de fundo
datasources.data-source.wrap-xa-resource=Quando as inst\u00E2ncias XAResource forem envolvidas numa inst\u00E2ncia org.jboss.tm.XAResourceWrapper
datasources.data-source.xa-datasource-properties=Lista do xa-datasource-property
datasources.data-source.xa-resource-timeout=O valor \u00E9 passado ao XAResource.setTransactionTimeout(), em segundos. O padr\u00E3o \u00E9 zero
datasources.data-source.allocation-retry-wait-millis=A aloca\u00E7\u00E3o de nova tentativa espera mil\u00E9simos de segundos para o elemento especificar a quantia de tempo de espera entre a nova tentativa de alocar uma conex\u00E3o
datasources.data-source.allocation-retry=O elemento de nova tentativa de aloca\u00E7\u00E3o indica o n\u00FAmero de vezes que a aloca\u00E7\u00E3o de uma conex\u00E3o deve ser tentada antes de lan\u00E7ar uma exce\u00E7\u00E3o
datasources.data-source.allow-multiple-users=Especifica se usu\u00E1rios m\u00FAltiplos acessar\u00E3o a fonte de dados atrav\u00E9s do m\u00E9todo getConnection(user, password) caso o tipo de pool interno acesse a conta para esses detalhes.
datasources.data-source.background-validation-millis=O elemento background-validation-millis especifica a quantia de tempo, em mil\u00E9simos de segundos, que a valida\u00E7\u00E3o de fundo ir\u00E1 rodar. A altera\u00E7\u00E3o desse valor pode ser realizada apenas na fonte de dados desativada, requerendo que o servidor seja reiniciado
datasources.data-source.background-validation=Um elemento para especificar que as conex\u00F5es devem ser validadas num thread de fundo versus sendo validado antes do uso. A altera\u00E7\u00E3o desse valor pode ser feita apenas na fonte de dados desativada, requerendo que um servidor seja reiniciado.
datasources.data-source.blocking-timeout-wait-millis=O elemento blocking-timeout-millis especifica o per\u00EDodo m\u00E1ximo, em mil\u00E9simos de segundos, para bloqueio na espera de uma conex\u00E3o antes de lan\u00E7ar uma exce\u00E7\u00E3o. Perceba que esse bloqueio ocorre apenas quando esperando pelo bloqueio de uma conex\u00E3o, e nunca ser\u00E1 lan\u00E7ada uma exce\u00E7\u00E3o. A cria\u00E7\u00E3o de uma nova conex\u00E3o leva um tempo consider\u00E1vel.
datasources.data-source.check-valid-connection-sql=Especifica uma declara\u00E7\u00E3o SQL para checar validade de uma conex\u00E3o do pool. Isto pode ser chamado quando a conex\u00E3o gerenciada \u00E9 obtida a partir de um pool
datasources.data-source.connection-properties.add=Adiciona uma propriedade de conex\u00E3o
datasources.data-source.connection-properties.remove=Remove a propriedade de conex\u00E3o
datasources.data-source.connection-properties.value=Cada propriedade de conex\u00E3o especifica um par de nome/valor de sequ\u00EAncia com o nome da propriedade vindo do atributo do nome e o valor vindo do conte\u00FAdo do elemento
datasources.data-source.connection-properties=O elemento connection-properties permite voc\u00EA passar as propriedades de conex\u00E3o arbrit\u00E1rias ao m\u00E9todo Driver.connect(url, props)
datasources.data-source.reauth-plugin-class-name=O nome da classe inteiramente qualificado de re-autentica\u00E7\u00E3o da implanta\u00E7\u00E3o plugin
datasources.data-source.reauth-plugin-properties.reauth-plugin-class-name=O nome da classe inteiramente qualificado de re-autentica\u00E7\u00E3o da implanta\u00E7\u00E3o plugin
datasources.data-source.reauth-plugin-properties=Propriedades de re-autentica\u00E7\u00E3o do plugin
datasources.data-source.flush-strategy=Especifica como o pool deve ser esvaziado no caso de um erro. Os valores v\u00E1lidos s\u00E3o\: FailingConnectionOnly (default), IdleConnections e EntirePool
datasources.data-source.use-ccm=Ativa o uso de um gerenciador de conex\u00E3o com cache
datasources.data-source.recovery-username=O nome do usu\u00E1rio usado para recupera\u00E7\u00E3o
datasources.data-source.recovery-password=A senha usada para recupera\u00E7\u00E3o
datasources.data-source.recovery-security-domain=O dom\u00EDnio de seguran\u00E7a usado para recupera\u00E7\u00E3o
datasources.data-source.recovery-plugin-properties.recovery-plugin-class-name=O nome da classe inteiramente qualificado da implanta\u00E7\u00E3o do plugin de recupera\u00E7\u00E3o
datasources.data-source.recovery-plugin-class-name=O nome da classe inteiramente qualificado da implanta\u00E7\u00E3o do plugin de recupera\u00E7\u00E3o
datasources.data-source.recovery-plugin-properties=As propriedades do plugin de recupera\u00E7\u00E3o
datasources.data-source.no-recovery=Especifica se o pool de conex\u00E3o deve ser exclu\u00EDdo da recupera\u00E7\u00E3o
datasources.data-source.enable.persistent=caso verdadeiro, a ativa\u00E7\u00E3o deste atributo \u00E9 persistida
datasources.xa-data-source=Uma configura\u00E7\u00E3o da fonte de dados JDBC XA
datasources.xa-data-source.add=Adiciona uma nova fonte de dados XA
datasources.xa-data-source.description=Uma configura\u00E7\u00E3o da fonte de dados JDBC XA
datasources.xa-data-source.disable=Desativa a fonte de dados XA
datasources.xa-data-source.enable=Ativa a fonte de dados XA
datasources.xa-data-source.remove=Remove a fonte de dados XA
datasources.xa-data-source.connection-url=O URL da conex\u00E3o do driver JDBC
datasources.xa-data-source.driver-name=Define o driver JDBC que a fonte de dados deve usar. Isto \u00E9 um nome simb\u00F3lico de combina\u00E7\u00E3o ao nome do driver instalado. No caso do driver j\u00E1 ter sido implantado como jar, o nome ser\u00E1 o da unidade de implanta\u00E7\u00E3o
datasources.xa-data-source.datasource-class=O nome inteiramente qualificado da classe da fonte de dados JDBC
datasources.xa-data-source.driver-class=O nome inteiramente qualificado da classe do driver JDBC
datasources.xa-data-source.driver=Define o driver JDBC que a fonte de dados deve usar. Isto \u00E9 um nome simb\u00F3lico de combina\u00E7\u00E3o ao nome do driver instalado. No caso do driver j\u00E1 ter sido implantado como jar, o nome ser\u00E1 o da unidade de implanta\u00E7\u00E3o
datasources.xa-data-source.enabled=Especifica se a fonte de dados deve ser ativada
datasources.xa-data-source.exception-sorter-class-name=Um org.jboss.jca.adapters.jdbc.ExceptionSorter que fornece um m\u00E9todo isExceptionFatal(SQLException) para valida\u00E7\u00E3o caso uma exce\u00E7\u00E3o transmita um erro
datasources.xa-data-source.exception-sorter-properties.exception-sorter-class-name=Um org.jboss.jca.adapters.jdbc.ExceptionSorter que fornece um m\u00E9todo isExceptionFatal(SQLException) para valida\u00E7\u00E3o caso uma exce\u00E7\u00E3o transmita um erro
datasources.xa-data-source.exception-sorter-properties=Exce\u00E7\u00E3o das propriedades de classifica\u00E7\u00E3o
datasources.xa-data-source.idle-timeout-minutes=Os elementos idle-timeout-minutes especificam o per\u00EDodo m\u00E1ximo, em minutos, uma cole\u00E7\u00E3o deve ser ociosa antes de ser encerrada. O per\u00EDodo m\u00E1ximo atual depende no per\u00EDodo de verifica\u00E7\u00E3o do IdleRemover, que \u00E9 metade do menor valor do idle-timeout-minutes em qualquer pool. A altera\u00E7\u00E3o desse valor pode ser realizada apenas na desativa\u00E7\u00E3o da fonte de dados, solicitando a reinicializa\u00E7\u00E3o do servidor.
datasources.xa-data-source.interleaving=Um elemento para ativar a intercala\u00E7\u00E3o das conex\u00F5es XA
datasources.xa-data-source.jndi-name=Especifica o nome JNDI para a fonte de dados
datasources.xa-data-source.jta=Ativa a integra\u00E7\u00E3o JTA
datasources.xa-data-source.max-pool-size=O elemento max-pool-size especifica o n\u00FAmero m\u00E1ximo de conex\u00F5es para um pool. N\u00E3o ser\u00E1 mais criado conex\u00F5es em cada sub-pool
datasources.xa-data-source.min-pool-size=O elemento min-pool-size especifica o n\u00FAmero m\u00EDnimo de conex\u00F5es para um pool
datasources.xa-data-source.new-connection-sql=Especifica a declara\u00E7\u00E3o SQL para executar todo instante em que uma conex\u00E3o \u00E9 adicionada ao pool de conex\u00E3o
datasources.xa-data-source.no-tx-separate-pool=O Oracle n\u00E3o gosta das conex\u00F5es XA usadas tanto dentro como fora da transa\u00E7\u00E3o JTA. Voc\u00EA pode criar subpools separados para contextos diferentes como solu\u00E7\u00E3o para este problema
datasources.xa-data-source.pad-xid=No caso do Xid ser preenchido
datasources.xa-data-source.password=Especifica a senha usada quando criando uma nova conex\u00E3o
datasources.xa-data-source.pool-name=Especifica o nome do pool para a fonte de dados usada para gerenciamento
datasources.xa-data-source.pool-prefill=No caso do pool ser pr\u00E9-preenchido. A altera\u00E7\u00E3o desse valor pode ser realizada apenas na desativa\u00E7\u00E3o da fonte de dados, do contr\u00E1rio a reinicializa\u00E7\u00E3o do servidor ser\u00E1 solicitada.
datasources.xa-data-source.pool-use-strict-min=Especifica se o min-pool-size deve ser considerado rigorosamente
datasources.xa-data-source.prepared-statements-cache-size=O n\u00FAmero de declara\u00E7\u00F5es preparadas por conex\u00E3o num cache de LRU
datasources.xa-data-source.property-name=O nome da propriedade
datasources.xa-data-source.property-value=O valor da propriedade
datasources.xa-data-source.query-timeout=Qualquer intervalo da consulta configurada em segundos. O intervalo ser\u00E1 determinado, caso n\u00E3o tenha sido fornecido
datasources.xa-data-source.same-rm-override=O elemento is-same-rm-override permite o conjunto incondicional se \u00E9 que o javax.transaction.xa.XAResource.isSameRM(XAResource) retorna verdadeiro ou falso
datasources.xa-data-source.security-domain=Especifica o dom\u00EDnio de seguran\u00E7a que define o javax.security.auth.Subject que \u00E9 usado para distinguir as conex\u00F5es no pool
datasources.xa-data-source.set-tx-query-timeout=Se \u00E9 que determinar o intervalo de consulta baseado no per\u00EDodo restante at\u00E9 que a transa\u00E7\u00E3o entre em intervalo. Qualquer intervalo de consulta configurado ser\u00E1 usado caso n\u00E3o haja transa\u00E7\u00E3o
datasources.xa-data-source.share-prepared-statements=Se \u00E9 que compartilhar declara\u00E7\u00F5es preparadas, ex.\: se \u00E9 que perguntar pela mesma declara\u00E7\u00E3o duas vezes sem encerrar os usos da mesma declara\u00E7\u00E3o preparada adjacente
datasources.xa-data-source.spy=Ativa a espionagem das declara\u00E7\u00F5es SQL
datasources.xa-data-source.stale-connection-checker-properties.stale-connection-checker-class-name=Um org.jboss.jca.adapters.jdbc.StaleConnectionChecker que fornece um m\u00E9todo, do qual caso retorne verdadeiro, ir\u00E1 envolver a exce\u00E7\u00E3o num org.jboss.jca.adapters.jdbc.StaleConnectionException
datasources.xa-data-source.stale-connection-checker-class-name=Um org.jboss.jca.adapters.jdbc.StaleConnectionChecker que fornece um m\u00E9todo, do qual caso retorne verdadeiro, ir\u00E1 envolver a exce\u00E7\u00E3o num org.jboss.jca.adapters.jdbc.StaleConnectionException
datasources.xa-data-source.stale-connection-checker-properties=As propriedades do checador da conex\u00E3o obsoleta
datasources.xa-data-source.track-statements=Se \u00E9 que checar por declara\u00E7\u00F5es n\u00E3o-encerradas quando a conex\u00E3o for retornada ao pool, os conjuntos de resultado s\u00E3o encerrados, uma declara\u00E7\u00E3o \u00E9 encerrada ou retornada para o cache da declara\u00E7\u00E3o preparada. Os valores v\u00E1lidos s\u00E3o\: "falso" - n\u00E3o rastreie declara\u00E7\u00F5es, "verdadeiro" - declara\u00E7\u00F5es de rastreio, conjuntos de resultado e avisos quando eles n\u00E3o est\u00E3o encerrados, "nowarn" - declara\u00E7\u00E3o de rastreio, mas n\u00E3o h\u00E1 aviso de quando eles forem abertos
datasources.xa-data-source.transaction-isolation=Determina o n\u00EDvel de isola\u00E7\u00E3o da transa\u00E7\u00E3o java.sql.Connection. Os valores v\u00E1lidos s\u00E3o\: TRANSACTION_READ_UNCOMMITTED, TRANSACTION_READ_COMMITTED, TRANSACTION_REPEATABLE_READ, TRANSACTION_SERIALIZABLE and TRANSACTION_NONE
datasources.xa-data-source.url-delimiter=Especifica o delimitador para os URLs no connection-url para as fontes de dados HA
datasources.xa-data-source.url-selector-strategy-class-name=A classe que implementa org.jboss.jca.adapters.jdbc.URLSelectorStrategy
datasources.xa-data-source.use-fast-fail=Se \u00E9 que falhar uma aloca\u00E7\u00E3o da conex\u00E3o na primeira tentativa, caso ela seja inv\u00E1lida (verdadeira) ou continuar tentando at\u00E9 que o pool seja esgotado de todas as conex\u00F5es potenciais (falso).
datasources.xa-data-source.use-java-context=A configura\u00E7\u00E3o disto para falso aplicar\u00E1 o bind na fonte de dados no JNDI global
datasources.xa-data-source.use-try-lock=Qualquer intervalo configurado para bloqueios internos nos objetos do adaptador do recurso em segundos
datasources.xa-data-source.user-name=Especifica o nome do usu\u00E1rio usado na cria\u00E7\u00E3o de uma nova conex\u00E3o
datasources.xa-data-source.valid-connection-checker-class-name=Um org.jboss.jca.adapters.jdbc.ValidConnectionChecker que fornece um m\u00E9todo isValidConnection(Connection) para validar uma conex\u00E3o. Caso uma exce\u00E7\u00E3o seja retornada, isto significa que a conex\u00E3o \u00E9 inv\u00E1lida. Isto substitui o elemento check-valid-connection-sql
datasources.xa-data-source.valid-connection-checker-properties.valid-connection-checker-class-name=Um org.jboss.jca.adapters.jdbc.ValidConnectionChecker que fornece um m\u00E9todo isValidConnection(Connection) para validar uma conex\u00E3o. Caso uma exce\u00E7\u00E3o seja retornada, isto significa que a conex\u00E3o \u00E9 inv\u00E1lida. Isto substitui o elemento check-valid-connection-sql
datasources.xa-data-source.valid-connection-checker-properties=As propriedades do checador da conex\u00E3o v\u00E1lida
datasources.xa-data-source.validate-on-match=O elemento validate-on-match especifica se a valida\u00E7\u00E3o da conex\u00E3o deve ser realizada quando uma cria\u00E7\u00E3o da conex\u00E3o tentar coincidir uma conex\u00E3o gerenciada. Isto \u00E9 normalmente exclusivo ao uso da valida\u00E7\u00E3o de plano de fundo
datasources.xa-data-source.wrap-xa-resource=No caso das inst\u00E2ncias XAResource serem envolvidas numa inst\u00E2ncia org.jboss.tm.XAResourceWrapper
datasources.xa-data-source.xa-datasource-class=O nome inteiramente qualificado da implanta\u00E7\u00E3o javax.sql.XADataSource 
datasources.xa-data-source.xa-datasource-properties.add=Adiciona um xa-datasource-property \u00FAnico
datasources.xa-data-source.xa-datasource-properties.remove=Remove o xa-datasource-property
datasources.xa-data-source.xa-datasource-properties.value=Especifica o valor da propriedade a determinar a classe de implanta\u00E7\u00E3o XADataSource. Cada propriedade \u00E9 identificada pelo atributo do nome e o valor da propriedade \u00E9 dado pelo conte\u00FAdo do elemento xa-datasource-property. A propriedade \u00E9 mapeada na implanta\u00E7\u00E3o XADataSource pela busca do m\u00E9todo getter do estilo JavaBeans para o nome da propriedade. Caso encontrado, o valor da propriedade \u00E9 determinado usando o JavaBeans setter com o texto do elemento traduzido para o tipo de propriedade verdadeira usando o java.beans.PropertyEditor
datasources.xa-data-source.xa-datasource-properties=Lista do xa-datasource-property
datasources.xa-data-source.xa-resource-timeout=O valor \u00E9 passado ao XAResource.setTransactionTimeout(), em segundos. O padr\u00E3o \u00E9 zero
datasources.xa-data-source.get-installed-driver=Obt\u00E9m a descri\u00E7\u00E3o de um driver instalado
datasources.xa-data-source.allocation-retry-wait-millis=A aloca\u00E7\u00E3o de nova tentativa espera mil\u00E9simos de segundos para o elemento especificar a quantia de tempo de espera entre a nova tentativa de alocar uma conex\u00E3o
datasources.xa-data-source.allocation-retry=O elemento da nova tentativa de aloca\u00E7\u00E3o indica o n\u00FAmero de vezes que a aloca\u00E7\u00E3o de uma conex\u00E3o deve ser tentada antes de lan\u00E7ar uma exce\u00E7\u00E3o
datasources.xa-data-source.allow-multiple-users=Especifica se usu\u00E1rios m\u00FAltiplos acessar\u00E3o a fonte de dados atrav\u00E9s do m\u00E9todo getConnection(user, password) caso o tipo de pool interno acesse a conta para esses detalhes.
datasources.xa-data-source.background-validation-millis=O elemento background-validation-millis especifica a quantia de tempo, em mil\u00E9simos de segundos, que a valida\u00E7\u00E3o de fundo ir\u00E1 rodar. A altera\u00E7\u00E3o desse valor pode ser realizada apenas na fonte de dados desativada, requerendo que o servidor seja reiniciado
datasources.xa-data-source.background-validation=Um elemento para especificar que as conex\u00F5es deve ser validadas num thread de fundo versus sendo validado antes do uso. A altera\u00E7\u00E3o desse valor pode ser feita apenas na fonte de dados desativada, requerendo que um servidor seja reiniciado.
datasources.xa-data-source.blocking-timeout-wait-millis=O elemento blocking-timeout-millis especifica o per\u00EDodo m\u00E1ximo, em mil\u00E9simos de segundos, para bloqueio na espera de uma conex\u00E3o antes de lan\u00E7ar uma exce\u00E7\u00E3o. Perceba que esse bloqueio ocorre apenas quando esperando pelo bloqueio de uma conex\u00E3o, e nunca ser\u00E1 lan\u00E7ada uma exce\u00E7\u00E3o. A cria\u00E7\u00E3o de uma nova conex\u00E3o leva um tempo consider\u00E1vel.
datasources.xa-data-source.check-valid-connection-sql=Especifica uma declara\u00E7\u00E3o SQL para checar validade de uma conex\u00E3o do pool. Isto pode ser chamado quando a conex\u00E3o gerenciada \u00E9 obtida a partir de um pool
datasources.xa-data-source.reauth-plugin-class-name=O nome da classe inteiramente qualificado de re-autentica\u00E7\u00E3o da implanta\u00E7\u00E3o plugin
datasources.xa-data-source.reauth-plugin-properties.reauth-plugin-class-name=O nome da classe inteiramente qualificado de re-autentica\u00E7\u00E3o da implanta\u00E7\u00E3o plugin
datasources.xa-data-source.reauth-plugin-properties=Propriedades de re-autentica\u00E7\u00E3o do plugin
datasources.xa-data-source.flush-strategy=Especifica como o pool deve ser esvaziado no caso de um erro. Os valores v\u00E1lidos s\u00E3o\: FailingConnectionOnly (default), IdleConnections e EntirePool
datasources.xa-data-source.use-ccm=Ativa o uso de um gerenciador de conex\u00E3o com cache
datasources.xa-data-source.recovery-username=O nome do usu\u00E1rio usado para recupera\u00E7\u00E3o
datasources.xa-data-source.recovery-password=A senha usada para recupera\u00E7\u00E3o
datasources.xa-data-source.recovery-security-domain=O dom\u00EDnio de seguran\u00E7a usado para recupera\u00E7\u00E3o
datasources.xa-data-source.recovery-plugin-properties.recovery-plugin-class-name=O nome de classe inteiramente qualificado da implanta\u00E7\u00E3o plugin de recupera\u00E7\u00E3o
datasources.xa-data-source.recovery-plugin-class-name=O nome da classe inteiramente qualificado da implanta\u00E7\u00E3o do plugin de recupera\u00E7\u00E3o
datasources.xa-data-source.recovery-plugin-properties=As propriedades do plugin de recupera\u00E7\u00E3o
datasources.xa-data-source.no-recovery=Especifica se a conex\u00E3o do pool deve ser exclu\u00EDda da recupera\u00E7\u00E3o
datasources.jdbc-driver.get-installed-driver.driver-minor-version=Vers\u00E3o Inferior do driver 
datasources.jdbc-driver.get-installed-driver.driver-major-version=Vers\u00E3o superior do driver
datasources.jdbc-driver.get-installed-driver.driver-name=Nome do driver
datasources.jdbc-driver.get-installed-driver.driver-class-name=Nome da classe do driver
datasources.jdbc-driver.get-installed-driver.driver-xa-datasource-class-name=Nome da classe do XA datasource
datasources.jdbc-driver.get-installed-driver.driver-module-name=O nome do m\u00F3dulo pelo qual o driver foi carregado, caso ele tenha sido carregado a partir do caminho do m\u00F3dulo
datasources.jdbc-driver.get-installed-driver.deployment-name=O nome da unidade da implanta\u00E7\u00E3o pela qual o driver foi carregado
datasources.jdbc-driver.get-installed-driver.jdbc-compliant=Se \u00E9 que o driver \u00E9 compat\u00EDvel com o JDBC
datasources.jdbc-driver.get-installed-driver.module-slot=O slot do m\u00F3dulo pelo qual o driver foi carregado, caso ele tenha sido carregado a partir do caminho do m\u00F3dulo
datasources.jdbc-driver.get-installed-driver.xa-datasource-class=Classe do XA datasource
datasources.statistics=As estat\u00EDsticas do per\u00EDodo de rodagem fornecidas pelo adaptador de recurso.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/datasources/LocalDescriptions, author ldelima@redhat.com
statistics=As estat\u00EDsticas do per\u00EDodo de rodagem fornecidas pelo adaptador de recurso.
datasources.clear-statistics=Esvazia os valores de estat\u00EDsticas para esse recurso
datasources.deployed=Os recursos do per\u00EDodo de rodagem pelas fontes de dados inclu\u00EDdas nessa implanta\u00E7\u00E3o.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/datasources/LocalDescriptions, author ldelima@redhat.com
deployed=Os recursos do per\u00EDodo de rodagem pelas fontes de dados inclu\u00EDdas nessa implanta\u00E7\u00E3o.
