datasources=JDBC data-sources \u3092\u5BA3\u8A00\u3059\u308B\u306E\u306B\u5229\u7528\u3059\u308B data-sources \u30B5\u30D6\u30B7\u30B9\u30C6\u30E0
datasources.add=data-sources \u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u306E\u8FFD\u52A0
datasources.remove=data-sources \u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u306E\u524A\u9664
jdbc-driver=\u30E9\u30F3\u30BF\u30A4\u30E0\u6642\u306B JDBC \u30C9\u30E9\u30A4\u30D0\u30FC\u3092\u5229\u7528\u3067\u304D\u308B\u3088\u3046\u306B\u3059\u308B\u30B5\u30FC\u30D3\u30B9
jdbc-driver.add=JDBC \u30C9\u30E9\u30A4\u30D0\u30FC\u306E\u8FFD\u52A0
jdbc-driver.description=\u30E9\u30F3\u30BF\u30A4\u30E0\u6642\u306B JDBC \u30C9\u30E9\u30A4\u30D0\u30FC\u3092\u5229\u7528\u3067\u304D\u308B\u3088\u3046\u306B\u3059\u308B\u30B5\u30FC\u30D3\u30B9
jdbc-driver.module="java.sql.Driver" \u3068\u3044\u3046\u30B5\u30FC\u30D3\u30B9\u578B\u3067 JDBC \u30C9\u30E9\u30A4\u30D0\u30FC\u3092\u5229\u7528\u53EF\u80FD\u306B\u3059\u308B\u30E2\u30B8\u30E5\u30FC\u30EB\u306E\u540D\u79F0
jdbc-driver.remove=JDBC \u30C9\u30E9\u30A4\u30D0\u30FC\u306E\u524A\u9664
data-source=JDBC data-source \u8A2D\u5B9A
data-source.add=\u65B0\u898F data-source \u306E\u8FFD\u52A0
data-source.description=JDBC data-source \u8A2D\u5B9A
data-source.disable=data-source \u306E\u7121\u52B9\u5316
data-source.enable=data-source \u306E\u6709\u52B9\u5316
data-source.flush-all-connection-in-pool=\u30D7\u30FC\u30EB\u5185\u306E\u5168\u63A5\u7D9A\u3092\u30D5\u30E9\u30C3\u30B7\u30E5
data-source.flush-idle-connection-in-pool=\u30D7\u30FC\u30EB\u5185\u306E\u5168\u30A2\u30A4\u30C9\u30EB\u63A5\u7D9A\u3092\u30D5\u30E9\u30C3\u30B7\u30E5
data-source.remove=data-source \u306E\u524A\u9664
data-source.test-connection-in-pool=\u63A5\u7D9A\u53D6\u5F97\u53EF\u80FD\u304B\u3092\u30C6\u30B9\u30C8
data-source.clear-statistics=\u3053\u306E\u30EA\u30BD\u30FC\u30B9\u306B\u5BFE\u3059\u308B\u7D71\u8A08\u5024\u3092\u6D88\u53BB
xa-data-source=JDBC XA data-source \u8A2D\u5B9A
xa-data-source.add=\u65B0\u898F XA data-source \u306E\u8FFD\u52A0
xa-data-source.description=JDBC XA data-source \u8A2D\u5B9A
xa-data-source.disable=XA data-source \u306E\u7121\u52B9\u5316
xa-data-source.enable=XA data-source \u306E\u6709\u52B9\u5316
xa-data-source.remove=XA data-source \u306E\u524A\u9664
allocation-retry-wait-millis=allocation-retry-wait-millis \u8981\u7D20\u306F\u3001\u63A5\u7D9A\u306E\u5272\u308A\u5F53\u3066\u3092\u518D\u8A66\u884C\u3059\u308B\u307E\u3067\u306E\u5F85\u6A5F\u6642\u9593\u3092\u30DF\u30EA\u79D2\u3067\u6307\u5B9A\u3057\u307E\u3059\u3002
allocation-retry=allocation-retry \u8981\u7D20\u306F\u3001\u4F8B\u5916\u3092\u9001\u51FA\u3059\u308B\u524D\u306B\u63A5\u7D9A\u5272\u308A\u5F53\u3066\u3092\u8A66\u884C\u3059\u308B\u56DE\u6570\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002 
background-validation-millis=background-validation-millis \u8981\u7D20\u306F\u3001\u30D0\u30C3\u30AF\u30B0\u30E9\u30A6\u30F3\u30C9\u691C\u8A3C\u3092\u5B9F\u884C\u3059\u308B\u6642\u9593\u3092\u30DF\u30EA\u79D2\u3067\u6307\u5B9A\u3057\u307E\u3059\u3002\u7121\u52B9\u306A datasource \u4E0A\u3067\u306E\u307F\u3053\u306E\u5024\u3092\u5909\u66F4\u3059\u308B\u3053\u3068\u304C\u53EF\u80FD\u3067\u3001\u305D\u3046\u3067\u306A\u3044\u5834\u5408\u306F\u30B5\u30FC\u30D0\u30FC\u306E\u518D\u8D77\u52D5\u304C\u5FC5\u8981\u3068\u306A\u308A\u307E\u3059\u3002
background-validation=\u4F7F\u7528\u524D\u306B\u691C\u8A3C\u3059\u308B\u306E\u3067\u306F\u306A\u304F\u30D0\u30C3\u30AF\u30B0\u30E9\u30A6\u30F3\u30C9\u306E\u30B9\u30EC\u30C3\u30C9\u4E0A\u3067\u63A5\u7D9A\u306E\u691C\u8A3C\u3092\u884C\u3046\u3088\u3046\u6307\u5B9A\u3059\u308B\u8981\u7D20\u3002\u7121\u52B9\u306A datasource \u4E0A\u3067\u306E\u307F\u3053\u306E\u5024\u3092\u5909\u66F4\u3059\u308B\u3053\u3068\u304C\u53EF\u80FD\u3067\u3001\u305D\u3046\u3067\u306A\u3044\u5834\u5408\u306F\u30B5\u30FC\u30D0\u30FC\u306E\u518D\u8D77\u52D5\u304C\u5FC5\u8981\u3068\u306A\u308A\u307E\u3059\u3002
blocking-timeout-wait-millis=blocking-timeout-millis \u8981\u7D20\u306F\u3001\u4F8B\u5916\u9001\u51FA\u307E\u3067\u306E\u5F85\u6A5F\u4E2D\u306B\u30D6\u30ED\u30C3\u30AF\u3059\u308B\u6700\u5927\u6642\u9593\u3092\u30DF\u30EA\u79D2\u3067\u6307\u5B9A\u3057\u307E\u3059\u3002\u63A5\u7D9A\u306E\u30ED\u30C3\u30AF\u3092\u5F85\u6A5F\u3059\u308B\u9593\u306E\u307F\u30D6\u30ED\u30C3\u30AF\u3092\u884C\u3044\u3001\u65B0\u898F\u63A5\u7D9A\u306E\u4F5C\u6210\u306B\u7570\u5E38\u306B\u6642\u9593\u3092\u8981\u3059\u308B\u5834\u5408\u306B\u306F\u4F8B\u5916\u306F\u9001\u51FA\u3055\u308C\u307E\u305B\u3093\u3002
check-valid-connection-sql=\u30D7\u30FC\u30EB\u63A5\u7D9A\u306E\u59A5\u5F53\u6027\u3092\u78BA\u8A8D\u3059\u308B\u305F\u3081\u306ESQL \u30B9\u30C6\u30FC\u30C8\u30E1\u30F3\u30C8\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002\u3053\u308C\u306F\u3001\u7BA1\u7406\u63A5\u7D9A\u304C\u30D7\u30FC\u30EB\u304B\u3089\u53D6\u5F97\u3055\u308C\u305F\u5834\u5408\u306B\u547C\u3073\u51FA\u3055\u308C\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002
connection-properties.add=\u63A5\u7D9A\u30D7\u30ED\u30D1\u30C6\u30A3\u306E\u8FFD\u52A0
connection-properties.remove=\u63A5\u7D9A\u30D7\u30ED\u30D1\u30C6\u30A3\u306E\u524A\u9664
connection-properties.value=\u5404connection-property \u306F\u3001\u30B9\u30C8\u30EA\u30F3\u30B0\u540D/\u5024\u306E\u30DA\u30A2\u3092 name \u5C5E\u6027\u304B\u3089\u306E\u30D7\u30ED\u30D1\u30C6\u30A3\u540D\u3068\u8981\u7D20\u30B3\u30F3\u30C6\u30F3\u30C4\u304B\u3089\u306E\u5024\u3067\u6307\u5B9A\u3057\u307E\u3059\u3002
connection-properties=connection-properties \u8981\u7D20\u306B\u3088\u308A\u3001\u4EFB\u610F\u306E\u63A5\u7D9A\u30D7\u30ED\u30D1\u30C6\u30A3\u3092Driver.connect(url, props) \u30E1\u30BD\u30C3\u30C9\u306B\u6E21\u3059\u3053\u3068\u304C\u3067\u304D\u307E\u3059\u3002
connection-url=JDBC \u30C9\u30E9\u30A4\u30D0\u30FC\u63A5\u7D9A URL
datasource-class=JDBC \u30C7\u30FC\u30BF\u30BD\u30FC\u30B9\u30AF\u30E9\u30B9\u306E\u5B8C\u5168\u4FEE\u98FE\u540D
driver-class=JDBC \u30C7\u30FC\u30BF\u30BD\u30FC\u30B9\u30AF\u30E9\u30B9\u306E\u5B8C\u5168\u4FEE\u98FE\u540D
driver-name=\u30C7\u30FC\u30BF\u30BD\u30FC\u30B9\u304C\u4F7F\u3046\u3079\u304D JDBC \u30C9\u30E9\u30A4\u30D0\u30FC\u3092\u5B9A\u7FA9\u3002\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u3057\u305F\u30C9\u30E9\u30A4\u30D0\u30FC\u540D\u3068\u4E00\u81F4\u3059\u308B\u30B7\u30F3\u30DC\u30EA\u30C3\u30AF\u540D\u3067\u3059\u3002\u30C9\u30E9\u30A4\u30D0\u30FC\u304C jar \u3068\u3057\u3066\u30C7\u30D7\u30ED\u30A4\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u3001\u540D\u524D\u306F\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30E6\u30CB\u30C3\u30C8\u306E\u540D\u79F0\u306B\u306A\u308A\u307E\u3059\u3002
driver=\u30C7\u30FC\u30BF\u30BD\u30FC\u30B9\u304C\u4F7F\u3046\u3079\u304D JDBC \u30C9\u30E9\u30A4\u30D0\u30FC\u3092\u5B9A\u7FA9\u3002\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u3057\u305F\u30C9\u30E9\u30A4\u30D0\u30FC\u540D\u3068\u4E00\u81F4\u3059\u308B\u30B7\u30F3\u30DC\u30EA\u30C3\u30AF\u540D\u3067\u3059\u3002\u30C9\u30E9\u30A4\u30D0\u30FC\u304C jar \u3068\u3057\u3066\u30C7\u30D7\u30ED\u30A4\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u3001\u540D\u524D\u306F\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30E6\u30CB\u30C3\u30C8\u306E\u540D\u79F0\u306B\u306A\u308A\u307E\u3059\u3002
enabled=\u30C7\u30FC\u30BF\u30BD\u30FC\u30B9\u3092\u6709\u52B9\u306B\u3059\u3079\u304D\u304B\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
exception-sorter-class-name=\u4F8B\u5916\u304C\u30A8\u30E9\u30FC\u3092\u9001\u51FA\u3059\u3079\u304D\u304B\u691C\u8A3C\u3059\u308B\u305F\u3081\u306E isExceptionFatal(SQLException) \u30E1\u30BD\u30C3\u30C9\u3092\u63D0\u4F9B\u3059\u308B org.jboss.jca.adapters.jdbc.ExceptionSorter
exception-sorter-properties=\u4F8B\u5916\u30BD\u30FC\u30BF\u30FC\u30D7\u30ED\u30D1\u30C6\u30A3
idle-timeout-minutes=idle-timeout-minutes \u8981\u7D20\u306F\u3001\u63A5\u7D9A\u304C\u9589\u3058\u3089\u308C\u308B\u524D\u306B\u30A2\u30A4\u30C9\u30EB\u3092\u4FDD\u3064\u6700\u5927\u6642\u9593\u3092\u5206\u5358\u4F4D\u3067\u6307\u5B9A\u3057\u307E\u3059\u3002\u5B9F\u969B\u306E\u6700\u5927\u6642\u9593\u306F IdleRemover \u306E\u30B9\u30AD\u30E3\u30F3\u6642\u9593\u306B\u3088\u3063\u3066\u3082\u5909\u5316\u3057\u307E\u3059\u3002\u3053\u306E IdleRemover \u306E\u30B9\u30AD\u30E3\u30F3\u6642\u9593\u306F\u3001\u30D7\u30FC\u30EB\u306E idle-timeout-minutes \u306E\u4E2D\u3067\u6700\u5C0F\u3068\u306A\u308B\u5024\u306E\u534A\u5206\u3068\u306A\u3063\u3066\u3044\u307E\u3059\u3002\u7121\u52B9\u306A datasource \u4E0A\u3067\u306E\u307F\u3053\u306E\u5024\u3092\u5909\u66F4\u3059\u308B\u3053\u3068\u304C\u53EF\u80FD\u3067\u3001\u305D\u3046\u3067\u306A\u3044\u5834\u5408\u306F\u30B5\u30FC\u30D0\u30FC\u306E\u518D\u8D77\u52D5\u304C\u5FC5\u8981\u3068\u306A\u308A\u307E\u3059\u3002
interleaving=XA \u63A5\u7D9A\u306E\u30A4\u30F3\u30BF\u30FC\u30EA\u30FC\u30D6\u3092\u6709\u52B9\u306B\u3059\u308B\u8981\u7D20
jndi-name=\u30C7\u30FC\u30BF\u30BD\u30FC\u30B9\u306E JNDI \u540D\u3092\u6307\u5B9A
jta=JTA \u7D71\u5408\u3092\u6709\u52B9\u5316
max-pool-size=max-pool-size \u8981\u7D20\u306F\u3001\u30D7\u30FC\u30EB\u6BCE\u306E\u6700\u5927\u63A5\u7D9A\u6570\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002\u5404\u30B5\u30D6\u30D7\u30FC\u30EB\u306B\u306F\u3001\u65B0\u898F\u63A5\u7D9A\u306F\u3053\u308C\u4EE5\u4E0A\u4F5C\u6210\u3055\u308C\u307E\u305B\u3093\u3002
min-pool-size=max-pool-size \u8981\u7D20\u306F\u3001\u30D7\u30FC\u30EB\u6BCE\u306E\u6700\u5C0F\u63A5\u7D9A\u6570\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
new-connection-sql=\u63A5\u7D9A\u30D7\u30FC\u30EB\u306B\u63A5\u7D9A\u3092\u8FFD\u52A0\u3059\u308B\u305F\u3073\u306B\u5B9F\u884C\u3055\u308C\u308B\u3088\u3046\u3001 SQL \u30B9\u30C6\u30FC\u30C8\u30E1\u30F3\u30C8\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
no-tx-separate-pool=Oracle \u3067\u306F JTA \u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u5185\u5916\u3092\u554F\u308F\u305A\u3001XA \u63A5\u7D9A\u306E\u5229\u7528\u306F\u9069\u3057\u3066\u3044\u307E\u305B\u3093\u3002\u3053\u306E\u554F\u984C\u3092\u56DE\u907F\u3059\u308B\u306B\u306F\u3001\u5404\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u306B\u5BFE\u3057\u3066\u5225\u306E\u30B5\u30D6\u30D7\u30FC\u30EB\u3092\u4F5C\u6210\u3057\u3066\u304F\u3060\u3055\u3044\u3002
pad-xid=Xid \u3092\u57CB\u3081\u8FBC\u3080\u3079\u304D\u304B
password=\u65B0\u898F\u63A5\u7D9A\u306E\u4F5C\u6210\u6642\u306B\u4F7F\u3046\u30D1\u30B9\u30EF\u30FC\u30C9\u3092\u6307\u5B9A
pool-name=\u7BA1\u7406\u306B\u5229\u7528\u3059\u308B\u30C7\u30FC\u30BF\u30BD\u30FC\u30B9\u306E\u30D7\u30FC\u30EB\u540D\u3092\u6307\u5B9A
pool-prefill=\u30D7\u30FC\u30EB\u3092\u4E8B\u524D\u5165\u529B\u3059\u3079\u304D\u304B\u3002\u7121\u52B9\u306A datasource \u4E0A\u3067\u306E\u307F\u3053\u306E\u5024\u3092\u5909\u66F4\u3059\u308B\u3053\u3068\u304C\u53EF\u80FD\u3067\u3001\u305D\u3046\u3067\u306A\u3044\u5834\u5408\u306F\u30B5\u30FC\u30D0\u30FC\u306E\u518D\u8D77\u52D5\u304C\u5FC5\u8981\u3068\u306A\u308A\u307E\u3059\u3002
pool-use-strict-min=min-pool-size \u3092\u53B3\u5BC6\u306B\u8003\u616E\u3059\u3079\u304D\u304B\u6307\u5B9A\u3057\u307E\u3059\u3002
prepared-statements-cache-size=LRU \u30AD\u30E3\u30C3\u30B7\u30E5\u5185\u306B\u3042\u308B\u63A5\u7D9A\u3054\u3068\u306B\u30D7\u30EA\u30DA\u30A2\u30C9\u30B9\u30C6\u30FC\u30C8\u30E1\u30F3\u30C8\u306E\u6570
property-name=\u30D7\u30ED\u30D1\u30C6\u30A3\u540D
property-value=\u30D7\u30ED\u30D1\u30C6\u30A3\u5024
query-timeout=\u8A2D\u5B9A\u6E08\u307F\u306E\u30AF\u30A8\u30EA\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8 (\u79D2\u5358\u4F4D)\u3002\u3053\u306E\u9805\u76EE\u304C\u306A\u3044\u5834\u5408\u306F\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u306F\u8A2D\u5B9A\u3055\u308C\u307E\u305B\u3093\u3002
same-rm-override=is-same-rm-override \u8981\u7D20\u306B\u3088\u308A\u3001javax.transaction.xa.XAResource.isSameRM(XAResource) \u304C true \u304B false \u3092\u8FD4\u3059\u304B\u3069\u3046\u304B\u3092\u7121\u6761\u4EF6\u306B\u8A2D\u5B9A\u3067\u304D\u308B\u3088\u3046\u306B\u306A\u308A\u307E\u3059\u3002
security-domain=javax.security.auth.Subject \u3092\u5B9A\u7FA9\u3059\u308B\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30C9\u30E1\u30A4\u30F3\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002javax.security.auth.Subject \u306F\u30D7\u30FC\u30EB\u5185\u306E\u63A5\u7D9A\u3092\u533A\u5225\u3059\u308B\u306E\u306B\u5229\u7528\u3057\u307E\u3059\u3002
set-tx-query-timeout=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u304C\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u3059\u308B\u307E\u3067\u306E\u6B8B\u308A\u6642\u9593\u3092\u3082\u3068\u306B\u30AF\u30A8\u30EA\u306E\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u3092\u8A2D\u5B9A\u3059\u308B\u304B\u3069\u3046\u304B\u3002\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u304C\u306A\u3044\u5834\u5408\u306F\u3001\u8A2D\u5B9A\u3057\u305F\u30AF\u30A8\u30EA\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u3092\u5229\u7528\u3057\u307E\u3059\u3002
share-prepared-statements=\u30D7\u30EA\u30DA\u30A2\u30C9\u30B9\u30C6\u30FC\u30C8\u30E1\u30F3\u30C8\u3092\u5171\u6709\u3059\u3079\u304D\u304B (\u7D42\u4E86\u305B\u305A\u306B\u540C\u3058\u30B9\u30C6\u30FC\u30C8\u30E1\u30F3\u30C8\u30922\u5EA6\u30EA\u30AF\u30A8\u30B9\u30C8\u3059\u308B\u304B\u3069\u3046\u304B\u3001\u7528\u610F\u3057\u305F\u57FA\u76E4\u30B9\u30C6\u30FC\u30C8\u30E1\u30F3\u30C8\u3067\u540C\u3058\u3082\u306E\u3092\u5229\u7528)\u3002
spy=SQL \u30B9\u30C6\u30FC\u30C8\u30E1\u30F3\u30C8\u306E spy \u3092\u6709\u52B9\u306B\u3057\u307E\u3059\u3002
stale-connection-checker-class-name=isStaleConnection(SQLException) \u30E1\u30BD\u30C3\u30C9\u3092\u63D0\u4F9B\u3059\u308Borg.jboss.jca.adapters.jdbc.StaleConnectionChecker\u3002\u3053\u306E\u30E1\u30BD\u30C3\u30C9\u304C true \u3092\u8FD4\u3059\u3068\u3001org.jboss.jca.adapters.jdbc.StaleConnectionException \u306E\u4F8B\u5916\u3092\u30E9\u30C3\u30D7\u3057\u307E\u3059\u3002
stale-connection-checker-properties=\u671F\u9650\u5207\u308C\u306E\u63A5\u7D9A\u30C1\u30A7\u30C3\u30AB\u30FC\u30D7\u30ED\u30D1\u30C6\u30A3
track-statements=\u63A5\u7D9A\u304C\u30D7\u30FC\u30EB\u306B\u8FD4\u3063\u305F\u6642\u3001\u7D50\u679C\u30BB\u30C3\u30C8\u304C\u7D42\u4E86\u3057\u305F\u6642\u3001\u30B9\u30C6\u30FC\u30C8\u30E1\u30F3\u30C8\u304C\u7D42\u4E86\u3057\u305F\u6642\u3001\u3042\u308B\u3044\u306F\u30D7\u30EA\u30DA\u30A2\u30C9\u30B9\u30C6\u30FC\u30C8\u30E1\u30F3\u30C8\u30AD\u30E3\u30C3\u30B7\u30E5\u306B\u8FD4\u3063\u305F\u6642\u306B\u3001\u9589\u3058\u3089\u308C\u3066\u3044\u306A\u3044\u30B9\u30C6\u30FC\u30C8\u30E1\u30F3\u30C8\u306E\u6709\u7121\u3092\u78BA\u8A8D\u3059\u308B\u304B\u3069\u3046\u304B\u3002\u6709\u52B9\u306A\u5024\u306F false (\u30B9\u30C6\u30FC\u30C8\u30E1\u30F3\u30C8\u306E\u8FFD\u8DE1\u3092\u3057\u306A\u3044)\u3001true (\u30B9\u30C6\u30FC\u30C8\u30E1\u30F3\u30C8\u3068\u7D50\u679C\u30BB\u30C3\u30C8\u3092\u8FFD\u8DE1\u3057\u3001\u30B9\u30C6\u30FC\u30C8\u30E1\u30F3\u30C8\u304C\u9589\u3058\u3089\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u8B66\u544A\u3092\u51FA\u3059)\u3001nowarn (\u30B9\u30C6\u30FC\u30C8\u30E1\u30F3\u30C8\u3092\u8FFD\u8DE1\u3059\u308B\u304C\u30B9\u30C6\u30FC\u30C8\u30E1\u30F3\u30C8\u304C\u9589\u3058\u3089\u308C\u3066\u3044\u306A\u304F\u3066\u3082\u8B66\u544A\u3092\u51FA\u3055\u306A\u3044) \u3067\u3059\u3002
transaction-isolation=java.sql.Connection \u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u306E\u5206\u96E2\u30EC\u30D9\u30EB\u3092\u8A2D\u5B9A\u3002\u6709\u52B9\u306A\u5024\u306F\uFF1ATRANSACTION_READ_UNCOMMITTED\u3001TRANSACTION_READ_COMMITTED\u3001TRANSACTION_REPEATABLE_READ\u3001TRANSACTION_SERIALIZABLE\u3001TRANSACTION_NONE \u3067\u3059\u3002
url-delimiter=HA \u30C7\u30FC\u30BF\u30BD\u30FC\u30B9\u306Econnection-url \u306B\u3042\u308BURL\u306B\u5BFE\u3059\u308B\u30C7\u30EA\u30DF\u30BF\u30FC\u3092\u6307\u5B9A
url-selector-strategy-class-name=org.jboss.jca.adapters.jdbc.URLSelectorStrategy \u3092\u5B9F\u88C5\u3059\u308B\u30AF\u30E9\u30B9
use-fast-fail=\u7121\u52B9\u306A\u5834\u5408\u306B\u521D\u56DE\u8A66\u884C\u3067\u63A5\u7D9A\u5272\u308A\u5F53\u3066\u3092\u5931\u6557\u3055\u305B\u308B\u304B (true)\u3001\u30D7\u30FC\u30EB\u304C\u5229\u7528\u53EF\u80FD\u306A\u30D7\u30FC\u30EB\u3092\u6D88\u8CBB\u3059\u308B\u307E\u3067\u8A66\u884C\u3057\u7D9A\u3051\u308B\u304B (false)\u3002
use-java-context=\u3053\u308C\u3092 false \u306B\u8A2D\u5B9A\u3059\u308B\u3068\u30B0\u30ED\u30FC\u30D0\u30EB JNDI \u306B\u30C7\u30FC\u30BF\u30BD\u30FC\u30B9\u3092\u30D0\u30A4\u30F3\u30C9\u3057\u307E\u3059\u3002
use-try-lock=\u30EA\u30BD\u30FC\u30B9\u30A2\u30C0\u30D7\u30BF\u30FC\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306E\u5185\u90E8\u30ED\u30C3\u30AF\u306B\u5BFE\u3057\u3066\u8A2D\u5B9A\u3055\u308C\u305F\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8 (\u79D2\u5358\u4F4D)\u3002
user-name=\u65B0\u898F\u63A5\u7D9A\u306E\u4F5C\u6210\u6642\u306B\u4F7F\u3046\u30D1\u30B9\u30EF\u30FC\u30C9\u3092\u6307\u5B9A
valid-connection-checker-class-name=\u63A5\u7D9A\u3092\u691C\u8A3C\u3059\u308BisValidConnection(Connection) \u30E1\u30BD\u30C3\u30C9\u3092\u63D0\u4F9B\u3059\u308B org.jboss.jca.adapters.jdbc.ValidConnectionChecker\u3002\u4F8B\u5916\u304C\u8FD4\u3055\u308C\u308B\u3068\u3001\u305D\u306E\u63A5\u7D9A\u306F\u7121\u52B9\u3068\u3044\u3046\u610F\u5473\u3067\u3059\u3002\u3053\u308C\u306F\u3001check-valid-connection-sql \u8981\u7D20\u3092\u30AA\u30FC\u30D0\u30FC\u30E9\u30A4\u30C9\u3057\u307E\u3059\u3002
valid-connection-checker-properties=\u6709\u52B9\u306A\u63A5\u7D9A\u30C1\u30A7\u30C3\u30AB\u30FC\u30D7\u30ED\u30D1\u30C6\u30A3
validate-on-match=validate-on-match \u8981\u7D20\u306F\u3001\u63A5\u7D9A\u30D5\u30A1\u30AF\u30C8\u30EA\u304C\u7BA1\u7406\u63A5\u7D9A\u3068\u4E00\u81F4\u3059\u308B\u3082\u306E\u306E\u691C\u7D22\u3092\u8A66\u884C\u3057\u305F\u5834\u5408\u306B\u3001\u63A5\u7D9A\u691C\u8A3C\u3092\u884C\u3046\u304B\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002\u901A\u5E38\u3001\u30D0\u30C3\u30AF\u30B0\u30E9\u30A6\u30F3\u30C9\u691C\u8A3C\u3067\u306E\u307F\u5229\u7528\u3057\u307E\u3059\u3002
wrap-xa-resource=XAResource \u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u304Corg.jboss.tm.XAResourceWrapper \u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u3067\u30E9\u30C3\u30D7\u3055\u308C\u308B\u3079\u304D\u304B
xa-datasource-class=javax.sql.XADataSource \u5B9F\u88C5\u306E\u5B8C\u5168\u4FEE\u98FE\u540D
xa-datasource-properties.add=xa-datasource-property \u3092\uFF11\u3064\u8FFD\u52A0
xa-datasource-properties.remove=xa-datasource-property \u306E\u524A\u9664
xa-datasource-properties.value=XADataSource \u5B9F\u88C5\u30AF\u30E9\u30B9\u306B\u5272\u308A\u5F53\u3066\u308B\u305F\u3081\u306E\u30D7\u30ED\u30D1\u30C6\u30A3\u5024\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002\u5404\u30D7\u30ED\u30D1\u30C6\u30A3\u306F name \u5C5E\u6027\u3067\u8B58\u5225\u3055\u308C\u3001\u30D7\u30ED\u30D1\u30C6\u30A3\u5024\u306Fxa-datasource-property \u8981\u7D20\u30B3\u30F3\u30C6\u30F3\u30C4\u306B\u3088\u308A\u6E21\u3055\u308C\u307E\u3059\u3002\u3053\u306E\u30D7\u30ED\u30D1\u30C6\u30A3\u306F\u3001\u30D7\u30ED\u30D1\u30C6\u30A3\u540D\u306B\u5BFE\u3059\u308B JavaBeans \u5F62\u5F0F\u306E getter \u30E1\u30BD\u30C3\u30C9\u3092\u691C\u7D22\u3059\u308B\u3053\u3068\u3067\u3001XADataSource \u5B9F\u88C5\u306B\u30DE\u30C3\u30D4\u30F3\u30B0\u3055\u308C\u307E\u3059\u3002\u898B\u3064\u304B\u3063\u305F\u5834\u5408 JavaBeans setter \u3092\u4F7F\u3044\u3001\u30D7\u30ED\u30D1\u30C6\u30A3\u306E\u5024\u304C\u8A2D\u5B9A\u3055\u308C\u3001\u8981\u7D20\u306E\u30C6\u30AD\u30B9\u30C8\u306F java.beans.PropertyEditor \u3092\u4F7F\u3044\u6B63\u3057\u3044\u30D7\u30ED\u30D1\u30C6\u30A3\u30BF\u30A4\u30D7\u3078\u5909\u63DB\u3055\u308C\u307E\u3059\u3002
xa-datasource-properties=xa-datasource-property \u306E\u4E00\u89A7
xa-resource-timeout=\u3053\u306E\u5024\u306F XAResource.setTransactionTimeout() \u3078\u6E21\u3055\u308C\u307E\u3059 (\u79D2\u5358\u4F4D)\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u306F 0 \u3067\u3059\u3002
get-installed-driver=\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u6E08\u307F\u306E\u30C9\u30E9\u30A4\u30D0\u30FC\u306E\u8A73\u7D30\u3092\u53D6\u5F97
installed-drivers=\u30E9\u30F3\u30BF\u30A4\u30E0\u6642\u306B\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u3055\u308C\u305F JDBC \u30C9\u30E9\u30A4\u30D0\u30FC\u306E\u4E00\u89A7
installed-drivers-list=\u30E9\u30F3\u30BF\u30A4\u30E0\u6642\u306B\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u3055\u308C\u305F JDBC \u30C9\u30E9\u30A4\u30D0\u30FC\u306E\u4E00\u89A7
installed-drivers.datasource-class-name=javax.sql.DataSource \u5B9F\u88C5\u306E\u5B8C\u5168\u4FEE\u98FE\u540D
installed-drivers.deployment-name=\u30C9\u30E9\u30A4\u30D0\u30FC\u306E\u8AAD\u307F\u8FBC\u307F\u5143\u3067\u3042\u308B\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30E6\u30CB\u30C3\u30C8\u306E\u540D\u524D
installed-drivers.driver-class=\ java.sql.Driver \u5B9F\u88C5\u306E\u5B8C\u5168\u4FEE\u98FE\u540D
installed-drivers.driver-datasource-class-name=javax.sql.DataSource \u5B9F\u88C5\u306E\u5B8C\u5168\u4FEE\u98FE\u540D
installed-drivers.driver-name=\u30EC\u30B8\u30B9\u30C8\u30EA\u3067\u53C2\u7167\u3059\u308B\u969B\u306B\u5229\u7528\u3059\u308B\u3053\u306E\u30C9\u30E9\u30A4\u30D0\u30FC\u306E\u30B7\u30F3\u30DC\u30EA\u30C3\u30AF\u540D
installed-drivers.driver-xa-datasource-class-name=javax.sql.XADataSource \u5B9F\u88C5\u306E\u5B8C\u5168\u4FEE\u98FE\u540D
installed-drivers.jdbc-compliant=\u3053\u306E\u30C9\u30E9\u30A4\u30D0\u30FC\u304C JDBC \u306B\u6E96\u62E0\u3057\u3066\u3044\u308B\u304B\u3069\u3046\u304B
installed-drivers.major-version=\u30C9\u30E9\u30A4\u30D0\u30FC\u306E\u30E1\u30B8\u30E3\u30FC\u30D0\u30FC\u30B8\u30E7\u30F3\u756A\u53F7
installed-drivers.minor-version=\u30C9\u30E9\u30A4\u30D0\u30FC\u306E\u30DE\u30A4\u30CA\u30FC\u30D0\u30FC\u30B8\u30E7\u30F3\u756A\u53F7
installed-drivers.module-name=\u30E2\u30B8\u30E5\u30FC\u30EB\u30D1\u30B9\u304B\u3089\u30ED\u30FC\u30C9\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u306F\u3001\u30C9\u30E9\u30A4\u30D0\u30FC\u306E\u8AAD\u307F\u8FBC\u307F\u5143\u3067\u3042\u308B\u30E2\u30B8\u30E5\u30FC\u30EB\u306E\u540D\u524D
installed-drivers.module-slot=\u30E2\u30B8\u30E5\u30FC\u30EB\u30D1\u30B9\u304B\u3089\u30ED\u30FC\u30C9\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u306F\u3001\u30C9\u30E9\u30A4\u30D0\u30FC\u306E\u8AAD\u307F\u8FBC\u307F\u5143\u3067\u3042\u308B\u30E2\u30B8\u30E5\u30FC\u30EB\u306E\u30B9\u30ED\u30C3\u30C8
installed-drivers.xa-datasource-class-name=javax.sql.XADataSource \u5B9F\u88C5\u306E\u5B8C\u5168\u4FEE\u98FE\u540D
reauth-plugin-class-name=\u518D\u8A8D\u8A3C\u30D7\u30E9\u30B0\u30A4\u30F3\u5B9F\u88C5\u306E\u5B8C\u5168\u4FEE\u98FE\u540D
reauth-plugin-properties=\u518D\u8A8D\u8A3C\u30D7\u30E9\u30B0\u30A4\u30F3\u306E\u30D7\u30ED\u30D1\u30C6\u30A3
flush-strategy=\u30A8\u30E9\u30FC\u6642\u306B\u3069\u306E\u3088\u3046\u306B\u30D7\u30FC\u30EB\u3092\u30D5\u30E9\u30C3\u30B7\u30E5\u3059\u308B\u304B\u6307\u5B9A\u3002\u6709\u52B9\u306A\u5024\u306F\: FailingConnectionOnly (default)\u3001IdleConnections\u3001EntirePool \u3067\u3059\u3002
use-ccm=\u30AD\u30E3\u30C3\u30B7\u30E5\u6E08\u307F\u306E\u63A5\u7D9A\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u306E\u5229\u7528\u3092\u6709\u52B9\u5316
recovery-username=\u30EA\u30AB\u30D0\u30EA\u306B\u5229\u7528\u3059\u308B\u30E6\u30FC\u30B6\u30FC\u540D
recovery-password=\u30EA\u30AB\u30D0\u30EA\u306B\u5229\u7528\u3059\u308B\u30D1\u30B9\u30EF\u30FC\u30C9
recovery-security-domain=\u30EA\u30AB\u30D0\u30EA\u306B\u5229\u7528\u3059\u308B\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30C9\u30E1\u30A4\u30F3
recovery-plugin-class-name=\u30EA\u30AB\u30D0\u30EA\u30D7\u30E9\u30B0\u30A4\u30F3\u5B9F\u88C5\u306E\u5B8C\u5168\u4FEE\u98FE\u540D
recovery-plugin-properties=\u30EA\u30AB\u30D0\u30EA\u30D7\u30E9\u30B0\u30A4\u30F3\u306E\u30D7\u30ED\u30D1\u30C6\u30A3
no-recovery=\u63A5\u7D9A\u30D7\u30FC\u30EB\u304C\u30EA\u30AB\u30D0\u30EA\u304B\u3089\u9664\u5916\u3055\u308C\u308B\u3079\u304D\u304B\u3092\u6307\u5B9A
persistent=true \u306E\u5834\u5408\u3001\u5C5E\u6027\u306F\u6C38\u7D9A\u5316\u3055\u308C\u307E\u3059\u3002
statistics=\u30EA\u30BD\u30FC\u30B9\u30A2\u30C0\u30D7\u30BF\u30FC\u306B\u3088\u308A\u63D0\u4F9B\u3055\u308C\u308B\u30E9\u30F3\u30BF\u30A4\u30E0\u7D71\u8A08
deployed=\u3053\u306E\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u306B\u542B\u307E\u308C\u308B\u30C7\u30FC\u30BF\u30BD\u30FC\u30B9\u306B\u3088\u308A\u516C\u958B\u3055\u308C\u308B\u30E9\u30F3\u30BF\u30A4\u30E0\u30EA\u30BD\u30FC\u30B9
