# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/datasources/LocalDescriptions, author croe@redhat.com
datasources=Le sous-syst\u00E8me de sources de donn\u00E9es utilis\u00E9 pour d\u00E9clarer les sources de donn\u00E9es JDBC
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/datasources/LocalDescriptions, author croe@redhat.com
datasources.add=Ajoute le sous-syst\u00E8me de sources de donn\u00E9es
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/datasources/LocalDescriptions, author croe@redhat.com
datasources.remove=Supprime le sous-syst\u00E8me de sources de donn\u00E9es
datasources.disable=D\u00E9sactiver la source de donn\u00E9es
datasources.enable=Activer la source de donn\u00E9es
datasources.enable.persistent=Si sur true l'attribut est persist\u00E9
datasources.flush-all-connection-in-pool=Vide toutes les connexions dans le pool de connexion
# auto translated by TM merge from project: JBoss AS, version: master, DocId: org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions
datasources.flush-idle-connection-in-pool=Vide toutes les connexions non actives dans le pool de connexion
# auto translated by TM merge from project: JBoss AS, version: eap6, DocId: org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions
datasources.test-connection-in-pool=Teste si une connexion peut \u00EAtre obtenue
# auto translated by TM merge from project: JBoss AS, version: master, DocId: org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/datasources/LocalDescriptions
datasources.jdbc-driver=Service qui rend un pilote JDBC disponible pour utilisation en cours d'ex\u00E9cution
datasources.jdbc-driver.add=Ajouter un nouveau pilote JDBC
datasources.jdbc-driver.description=Le service qui rend le pilote JDBC disponible pour utilisation en cours d'ex\u00E9cution
datasources.jdbc-driver.module=Le nom du module qui rend le pilote JDBC disponible sous le type de service "java.sql.Driver"
datasources.jdbc-driver.remove=Supprimer un pilote JDBC
datasources.jdbc-driver.driver-major-version=Le num\u00E9ro de version principale du pilote
# auto translated by TM merge from project: JBoss AS, version: master, DocId: org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/datasources/LocalDescriptions
datasources.jdbc-driver.driver-minor-version=Le num\u00E9ro de version mineure du pilote
# auto translated by TM merge from project: JBoss AS, version: master, DocId: org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/datasources/LocalDescriptions
datasources.jdbc-driver.driver-datasource-class-name=Le nom de classe complet de l'impl\u00E9mentation de javax.sql.DataSource
# auto translated by TM merge from project: JBoss AS, version: master, DocId: org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/datasources/LocalDescriptions
datasources.jdbc-driver.driver-xa-datasource-class-name=Le nom de classe complet de l'impl\u00E9mentation javax.sql.XADataSource 
# auto translated by TM merge from project: JBoss AS, version: master, DocId: org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/datasources/LocalDescriptions
datasources.jdbc-driver.driver-class-name=Le nom complet de la classe de l'impl\u00E9mentation java.sql.Driver 
# auto translated by TM merge from project: JBoss AS, version: 7.1.x, DocId: org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/datasources/LocalDescriptions
datasources.jdbc-driver.driver-name=D\u00E9finit le pilote JDBC que la source de donn\u00E9es doit utiliser. Il s'agit d'un nom symbolique qui correspond au nom du pilote install\u00E9. Si le pilote est d\u00E9ploy\u00E9 en tant que jar, le nom sera celui de l'unit\u00E9 de d\u00E9ploiement.
datasources.jdbc-driver.driver-module-name=Le nom du module \u00E0 partir duquel le pilote a \u00E9t\u00E9 charg\u00E9, s'il a \u00E9t\u00E9 charg\u00E9 \u00E0 partir du chemin du module
datasources.jdbc-driver.deployment-name=Le nom de l'unit\u00E9 de d\u00E9ploiement \u00E0 partir de laquelle le pilote a \u00E9t\u00E9 charg\u00E9
datasources.jdbc-driver.jdbc-compliant=Si le pilote JDBC est conforme ou non
datasources.jdbc-driver.module-slot=Le slot du module \u00E0 partir duquel le pilote a \u00E9t\u00E9 charg\u00E9, s'il a \u00E9t\u00E9 charg\u00E9 \u00E0 partir du chemin du module.
datasources.jdbc-driver.xa-datasource-class=Classe de source de donn\u00E9es
datasources.get-installed-driver=Obtenez une description de pilote install\u00E9
datasources.installed-drivers-list=Liste des pilotes JDBC install\u00E9s en cours d'ex\u00E9cution
datasources.installed-drivers.installed-driver=Pilotes JDBC install\u00E9s en cours d'ex\u00E9cution
datasources.installed-drivers=Liste des pilotes JDBC install\u00E9s en cours d'ex\u00E9cution
datasources.installed-drivers.driver-major-version=Le num\u00E9ro de version principale du pilote
datasources.installed-drivers.driver-minor-version=Le num\u00E9ro de version mineure du pilote
datasources.installed-drivers.driver-datasource-class-name=Le nom de classe complet de l'impl\u00E9mentation de javax.sql.DataSource
datasources.installed-drivers.driver-xa-datasource-class-name=Le nom de classe complet de l'impl\u00E9mentation javax.sql.XADataSource  
datasources.installed-drivers.driver-class-name=Le nom complet de la classe de l'impl\u00E9mentation java.sql.Driver 
datasources.installed-drivers.driver-name=D\u00E9finit le pilote JDBC que la source de donn\u00E9es doit utiliser. Il s'agit d'un nom symbolique qui correspond au nom du pilote install\u00E9. Si le pilote est d\u00E9ploy\u00E9 en tant que jar, le nom sera celui de l'unit\u00E9 de d\u00E9ploiement.
datasources.installed-drivers.driver-module-name=Le nom du module \u00E0 partir duquel le pilote a \u00E9t\u00E9 charg\u00E9, s'il a \u00E9t\u00E9 charg\u00E9 \u00E0 partir du chemin du module
datasources.installed-drivers.deployment-name=Le nom de l'unit\u00E9 de d\u00E9ploiement \u00E0 partir de laquelle le pilote a \u00E9t\u00E9 charg\u00E9
datasources.installed-drivers.jdbc-compliant=Si le pilote JDBC est conforme ou non
datasources.installed-drivers.module-slot=Le slot du module \u00E0 partir duquel le pilote a \u00E9t\u00E9 charg\u00E9, s'il a \u00E9t\u00E9 charg\u00E9 \u00E0 partir du chemin du module.
datasources.installed-drivers.xa-datasource-class=Classe de source de donn\u00E9es XA
datasources.data-source=Une configuration de source de donn\u00E9es JDBC
datasources.data-source.add=Ajouter une nouvelle source de donn\u00E9es
datasources.data-source.remove=Supprimer la source de donn\u00E9es XA
datasources.data-source.description=Une configuration de source de donn\u00E9es JDBC
datasources.data-source.clear-statistics=Supprime les statistiques de cette ressource
datasources.data-source.connection-url=URL de connexion de pilote JDBC
datasources.data-source.driver-name=D\u00E9finit le pilote JDBC que la source de donn\u00E9es doit utiliser. Il s'agit d'un nom symbolique qui correspond au nom du pilote install\u00E9. Si le pilote est d\u00E9ploy\u00E9 en tant que jar, le nom correspondra au nom de l'unit\u00E9 de d\u00E9ploiement.
datasources.data-source.datasource-class=Le nom complet de la classe de source de donn\u00E9es JDBC
datasources.data-source.driver-class=Le nom complet de la classe du pilote JDBC
datasources.data-source.driver=D\u00E9finit le pilote JDBC que la source de donn\u00E9es doit utiliser. Il s'agit d'un nom symbolique qui correspond au nom du pilote install\u00E9. Si le pilote est d\u00E9ploy\u00E9 en tant que jar, le nom sera celui de l'unit\u00E9 de d\u00E9ploiement.
datasources.data-source.enabled=Indique si la source de donn\u00E9es doit \u00EAtre activ\u00E9e.
datasources.data-source.exception-sorter-class-name=Un org.jboss.jca.adapters.jdbc.ExceptionSorter qui fournit une m\u00E9thode isExceptionFatal(SQLException) pour valider si une exception doit diffuser une erreur
datasources.data-source.exception-sorter-properties.exception-sorter-class-name=Un org.jboss.jca.adapters.jdbc.ExceptionSorter qui fournit une m\u00E9thode isExceptionFatal(SQLException) pour valider si une exception doit diffuser une erreur
datasources.data-source.exception-sorter-properties=Les propri\u00E9t\u00E9s du trieur d'exceptions
datasources.data-source.idle-timeout-minutes=Les \u00E9l\u00E9ments d'idle-timeout-minutes sp\u00E9cifient le temps maximal, en minutes, pendant lequel une connexion peut \u00EAtre inactive avant d'\u00EAtre ferm\u00E9e. La dur\u00E9e maximale r\u00E9elle d\u00E9pend aussi du temps de balayage de IdleRemover, qui correspond \u00E0 la moiti\u00E9 de la plus petite valeur de idle-timeout-minutes d'un pool de connexions. On ne peut modifier cette valeur que sur une source de donn\u00E9es d\u00E9sactiv\u00E9e, sinon il faut red\u00E9marrer un serveur.
datasources.data-source.interleaving=Un \u00E9l\u00E9ment pour activer l'entrelacement de connexions XA
datasources.data-source.jndi-name=Indique un nom JNDI de source de donn\u00E9es
datasources.data-source.jta=Permet l'int\u00E9gration JTA
datasources.data-source.max-pool-size=L'\u00E9l\u00E9ment max-pool-size indique le nombre maximum de connexions pour un pool de connexion. Aucune autre connexion ne pourra \u00EAtre cr\u00E9\u00E9e dans chaque sous-pool de connexion.
datasources.data-source.min-pool-size=L'\u00E9l\u00E9ment min-pool-size indique le nombre maximum de connexions pour un pool
datasources.data-source.new-connection-sql=Indique un \u00E9nonc\u00E9 SQL \u00E0 ex\u00E9cuter quand une connexion est ajout\u00E9e au pool de connexions
datasources.data-source.no-tx-separate-pool=Oracle n'aime pas que les connexions XA soient utilis\u00E9es \u00E0 l'int\u00E9rieur et \u00E0 l'ext\u00E9rieur d'une transaction JTA. Pour r\u00E9soudre ce probl\u00E8me, vous pouvez cr\u00E9er des sous-pools s\u00E9par\u00E9s pour des contextes diff\u00E9rents.
datasources.data-source.pad-xid=Est-ce que le Xid doit \u00EAtre rempli
datasources.data-source.password=Indique le mot de passe utilis\u00E9 pour cr\u00E9er une nouvelle connexion
datasources.data-source.pool-name=Indique le nom du pool de connexion pour une base de donn\u00E9es utilis\u00E9e pour la gestion
datasources.data-source.pool-prefill=Est-ce que le pool de connexions doit \u00EAtre rempli \u00E0 l'avance. Modifier cette valeur ne peut \u00EAtre fait qu'en d\u00E9sactivant la source de donn\u00E9es, sinon on a besoin d'un red\u00E9marrage du serveur.
datasources.data-source.pool-use-strict-min=Indique si la min-pool-size doit \u00EAtre strictement consid\u00E9r\u00E9e.
datasources.data-source.prepared-statements-cache-size=Le nombre d'\u00E9nonc\u00E9s pr\u00E9par\u00E9s par connexion dans un cache LRU
datasources.data-source.property-name=Le nom de la propri\u00E9t\u00E9
datasources.data-source.property-value=La valeur de la propri\u00E9t\u00E9
datasources.data-source.query-timeout=Tout timeout de requ\u00EAte configur\u00E9 en secondes. Si non fourni, aucun timeout ne sera d\u00E9fini.
datasources.data-source.same-rm-override=L'\u00E9l\u00E9ment in-same-rm-override permet de d\u00E9finir inconditionnellement si le javax.transaction.xa.XAResource.isSameRM(XAResource) retourne true ou false
datasources.data-source.security-domain=Indique le domaine de s\u00E9curit\u00E9 qui d\u00E9finit le javax.security.auth.Subject utilis\u00E9 pour distinguer les connexions dans le pool de connexions.
datasources.data-source.set-tx-query-timeout=Si on d\u00E9finit le timeout de requ\u00EAte sur le temps qui reste jusqu'\u00E0 ce que la transaction soit elaps\u00E9e. Tout timeout de requ\u00EAte configur\u00E9 sera utilis\u00E9 s'il n'y a pas de transaction.
datasources.data-source.share-prepared-statements=Si on doit partager les \u00E9nonc\u00E9s pr\u00E9par\u00E9s, c-a-d si on doit demander un m\u00EAme \u00E9nonc\u00E9 \u00E0 deux reprises sans fermeture, utilise le m\u00EAme \u00E9nonc\u00E9 sous-jacent pr\u00E9par\u00E9.
datasources.data-source.spy=Activer la surveillance des \u00E9nonc\u00E9s SQL
datasources.data-source.stale-connection-checker-properties.stale-connection-checker-class-name=Un org.jboss.jca.adapters.jdbc.StaleConnectionChecker qui fournit une m\u00E9thode isStaleConnection(SQLException) qui, si elle retourne true, encapsulera l'exception dans une org.jboss.jca.adapters.jdbc.StaleConnectionException
datasources.data-source.stale-connection-checker-class-name=Un org.jboss.jca.adapters.jdbc.StaleConnectionChecker qui fournit une m\u00E9thode isStaleConnection(SQLException) qui, si elle retourne true, encapsulera l'exception dans une org.jboss.jca.adapters.jdbc.StaleConnectionException
datasources.data-source.stale-connection-checker-properties=Les propri\u00E9t\u00E9s du v\u00E9rificateur de connexions caduque
datasources.data-source.track-statements=Indique si on doit v\u00E9rifier les \u00E9nonc\u00E9s non ferm\u00E9s quand une connexion est retourn\u00E9e vers le pool, les r\u00E9sultats sont ferm\u00E9s, un \u00E9nonc\u00E9 est ferm\u00E9 ou est retourn\u00E9 dans le cache d'\u00E9nonc\u00E9s pr\u00E9par\u00E9s. Les valeurs valides sont \: "false" - ne pas suivre la piste des \u00E9nonc\u00E9s, "true" - suivre la piste des \u00E9nonc\u00E9s et des r\u00E9sultats, et indiquer quand ils ne sont pas ferm\u00E9s, "nowarn" - suivre la piste des \u00E9nonc\u00E9s, mais ne pas indiquer s'ils ne sont pas ferm\u00E9s.
datasources.data-source.transaction-isolation=D\u00E9finir le niveau d'isolation de la transaction java.sql.Connection. Les valeurs valides sont \: TRANSACTION_READ_UNCOMMITTED, TRANSACTION_READ_COMMITTED, TRANSACTION_REPEATABLE_READ, TRANSACTION_SERIALIZABLE and TRANSACTION_NONE
datasources.data-source.url-delimiter=Indique le d\u00E9limiteur pour les URL en connexion-url pour les sources de donn\u00E9es HA
datasources.data-source.url-selector-strategy-class-name=Une classe qui impl\u00E9mente org.jboss.jca.adapters.jdbc.URLSelectorStrategy
datasources.data-source.use-fast-fail=Si on doit faire \u00E9chouer une allocation de connexion \u00E0 la premi\u00E8re tentative si elle est invalide (true) or si on doit essayer \u00E0 nouveau jusqu'\u00E0 ce que le pool soit d\u00E9nu\u00E9 de toutes les connexions potentielles (false)
datasources.data-source.use-java-context=D\u00E9finir ceci \u00E0 false aura pour effet de relier la source de donn\u00E9es dans le JNDI global
datasources.data-source.use-try-lock=Tout timeout configur\u00E9 pour les verrous internes sur les objets d'adaptateur de ressources en secondes
datasources.data-source.user-name=Indique le nom d'utilisateur utilis\u00E9 quand on cr\u00E9e une nouvelle connexion
datasources.data-source.valid-connection-checker-class-name=Un org.jboss.jca.adapters.jdbc.ValidConnectionChecker qui fournit une m\u00E9thode isValidConnection(Connection) pour valider une connexion. Si une exception est retourn\u00E9e, cela indique qu'elle est non valide. Cela remplace l'\u00E9l\u00E9ment check-valid-connection-sql
datasources.data-source.valid-connection-checker-properties.valid-connection-checker-class-name=Un org.jboss.jca.adapters.jdbc.ValidConnectionChecker qui fournit une m\u00E9thode isValidConnection(Connection) pour valider une connexion. Si une exception est retourn\u00E9e, cela indique qu'elle est non valide. Cela remplace l'\u00E9l\u00E9ment check-valid-connection-sql
datasources.data-source.valid-connection-checker-properties=Les propri\u00E9t\u00E9s du v\u00E9rificateur de connexions
datasources.data-source.validate-on-match=L'\u00E9l\u00E9ment validate-on-match indique si une validation de connexion doit avoir lieu quand une fabrique de connexions tente de trouver une correspondance avec une connexion g\u00E9r\u00E9e. Cela est normalement exclusivement r\u00E9serv\u00E9 aux validations d'arri\u00E8re-plan.
datasources.data-source.wrap-xa-resource=Est-ce que les instances XAResource doivent \u00EAtre encapsul\u00E9es dans l'instance org.jboss.tm.XAResourceWrapper
datasources.data-source.xa-datasource-properties=Liste de xa-datasource-property
datasources.data-source.xa-resource-timeout=La valeur est pass\u00E9e au XAResource.setTransactionTimeout(), en secondes. La valeur par d\u00E9faut est z\u00E9ro
datasources.data-source.allocation-retry-wait-millis=L'\u00E9l\u00E9ment \u00ABallocation retry wait millis\u00BB indique la dur\u00E9e, en millisecondes, d'attente entre les essais d'allocation de connexion
datasources.data-source.allocation-retry=L'\u00E9l\u00E9ment \u00ABallocation retry\u00BB indique le nombre de tentatives d'allocation avant de lancer une exception
datasources.data-source.allow-multiple-users=Indique si des utilisateurs multiples vont acc\u00E9der la source de donn\u00E9es par la m\u00E9thode getConnection (nom d'utilisateur, mot de passe), et donc si le type de pool interne doit prendre ceci en consid\u00E9ration
datasources.data-source.background-validation-millis=L'\u00E9l\u00E9ment \u00ABbackground-validation-millis\u00BB indique la dur\u00E9e, en millisecondes, pendant laquelle la validation d'arri\u00E8re plan va ex\u00E9cuter. Modifier cette valeur ne peut avoir lieu qu'en d\u00E9sactivant la source de donn\u00E9es, sinon, il faut red\u00E9marrer le serveur
datasources.data-source.background-validation=Un \u00E9l\u00E9ment pour indiquer que les connexions doivent \u00EAtre valid\u00E9es dans un thread d'arri\u00E8re-plan au lieu d'\u00EAtre valid\u00E9es avant l'utilisation. On peut changer cette valeur uniquement sur une source de donn\u00E9es d\u00E9sactiv\u00E9e, sinon, on a besoin d'un red\u00E9marrage du serveur. 
datasources.data-source.blocking-timeout-wait-millis=L'\u00E9l\u00E9ment \u00ABblocking-timeout-millis\u00BB indique la dur\u00E9e, en millisecondes, de blocage quand on attend une connexion avant d'envoyer une exception. Notez que cela ne bloque uniquement lors de l'attente de verrouillage d'une connexion, et qu'une exception ne sera jamais lanc\u00E9e si la cr\u00E9ation d'une nouvelle connexion prend prend un temps inconsid\u00E9r\u00E9.
datasources.data-source.check-valid-connection-sql=Indiquer un \u00E9nonc\u00E9 SQL pour v\u00E9rifier la validit\u00E9 d'un pool de connexion. Peut \u00EAtre appel\u00E9 quand la connexion g\u00E9r\u00E9e vient du pool de connexion.
datasources.data-source.connection-properties.add=Ajouter une propri\u00E9t\u00E9 de connexion
datasources.data-source.connection-properties.remove=Supprimer la propri\u00E9t\u00E9 de la connexion
datasources.data-source.connection-properties.value=Chaque propri\u00E9t\u00E9 de connexion indique une paire nom/valeur avec un nom de propri\u00E9t\u00E9 qui vient de l'attribut du nom et une valeur qui vient du contenu de l'\u00E9l\u00E9ment.
datasources.data-source.connection-properties=L'\u00E9l\u00E9ment connection-properties vous permet de passer des propri\u00E9t\u00E9s de connexion arbitraires \u00E0 la m\u00E9thode Driver.connect(url, props)
datasources.data-source.reauth-plugin-class-name=Le nom de classe complet de l'impl\u00E9mentation du plugin de r\u00E9 authentification.
datasources.data-source.reauth-plugin-properties.reauth-plugin-class-name=Le nom de classe complet de l'impl\u00E9mentation du plugin de r\u00E9 authentification.
datasources.data-source.reauth-plugin-properties=Les propri\u00E9t\u00E9s du plugin de r\u00E9-authentification
datasources.data-source.flush-strategy=Indique comment le pool de connexions devrait \u00EAtre vid\u00E9 en cas d'erreur. Les valeurs valides sont \: FailingConnectionOnly (default), IdleConnections et EntirePool
datasources.data-source.use-ccm=Active l'utilisation d'un gestionnaire de connexion en cache
datasources.data-source.recovery-username=Le nom de l'utilisateur pour le recouvrement
datasources.data-source.recovery-password=Le mot de passe utilis\u00E9 pour le recouvrement
datasources.data-source.recovery-security-domain=Le domaine de s\u00E9curit\u00E9 pour le recouvrement
datasources.data-source.recovery-plugin-properties.recovery-plugin-class-name=Le nom de classe complet pour l'impl\u00E9mentation du plugin de recouvrement
datasources.data-source.recovery-plugin-class-name=Le nom de classe complet pour l'impl\u00E9mentation du plugin de recouvrement
datasources.data-source.recovery-plugin-properties=Les propri\u00E9t\u00E9s du plugin de recouvrement
datasources.data-source.no-recovery=Indique si le pool de connexions doit \u00EAtre exclus du recouvrement
datasources.data-source.enable.persistent=Si sur true l'attribut est persist\u00E9
datasources.xa-data-source=Une configuration de source de donn\u00E9es JDBC XA
datasources.xa-data-source.add=Ajouter une nouvelle source de donn\u00E9es XA
datasources.xa-data-source.description=Une configuration de source de donn\u00E9es JDBC XA
datasources.xa-data-source.disable=D\u00E9sactiver la source de donn\u00E9es XA
datasources.xa-data-source.enable=Activer la source de donn\u00E9es XA
datasources.xa-data-source.remove=Supprimer la source de donn\u00E9es XA
datasources.xa-data-source.connection-url=URL de connexion de pilote JDBC
datasources.xa-data-source.driver-name=D\u00E9finit le pilote JDBC que la source de donn\u00E9es doit utiliser. Il s'agit d'un nom symbolique qui correspond au nom du pilote install\u00E9. Si le pilote est d\u00E9ploy\u00E9 en tant que jar, le nom correspondra au nom de l'unit\u00E9 de d\u00E9ploiement.
datasources.xa-data-source.datasource-class=Le nom complet de la classe de source de donn\u00E9es JDBC
datasources.xa-data-source.driver-class=Le nom complet de la classe du pilote JDBC
datasources.xa-data-source.driver=D\u00E9finit le pilote JDBC que la source de donn\u00E9es doit utiliser. Il s'agit d'un nom symbolique qui correspond au nom du pilote install\u00E9. Si le pilote est d\u00E9ploy\u00E9 en tant que jar, le nom sera celui de l'unit\u00E9 de d\u00E9ploiement.
datasources.xa-data-source.enabled=Indique si la source de donn\u00E9es doit \u00EAtre activ\u00E9e.
datasources.xa-data-source.exception-sorter-class-name=Un org.jboss.jca.adapters.jdbc.ExceptionSorter qui fournit une m\u00E9thode isExceptionFatal(SQLException) pour valider si une exception doit diffuser une erreur
datasources.xa-data-source.exception-sorter-properties.exception-sorter-class-name=Un org.jboss.jca.adapters.jdbc.ExceptionSorter qui fournit une m\u00E9thode isExceptionFatal(SQLException) pour valider si une exception doit diffuser une erreur
datasources.xa-data-source.exception-sorter-properties=Les propri\u00E9t\u00E9s du trieur d'exceptions
datasources.xa-data-source.idle-timeout-minutes=Les \u00E9l\u00E9ments d'idle-timeout-minutes sp\u00E9cifient le temps maximal, en minutes, pendant lequel une connexion peut \u00EAtre inactive avant d'\u00EAtre ferm\u00E9e. La dur\u00E9e maximale r\u00E9elle d\u00E9pend aussi du temps de balayage de IdleRemover, qui correspond \u00E0 la moiti\u00E9 de la plus petite valeur de idle-timeout-minutes d'un pool de connexions. On ne peut modifier cette valeur que sur une source de donn\u00E9es d\u00E9sactiv\u00E9e, sinon il faut red\u00E9marrer un serveur.
datasources.xa-data-source.interleaving=Un \u00E9l\u00E9ment pour activer l'entrelacement de connexions XA
datasources.xa-data-source.jndi-name=Indique un nom JNDI de source de donn\u00E9es
datasources.xa-data-source.jta=Permet l'int\u00E9gration JTA
datasources.xa-data-source.max-pool-size=L'\u00E9l\u00E9ment max-pool-size indique le nombre maximum de connexions pour un pool de connexions. Aucune autre connexion ne pourra \u00EAtre cr\u00E9\u00E9e dans chaque sous-pool de connexions.
datasources.xa-data-source.min-pool-size=L'\u00E9l\u00E9ment min-pool-size indique le nombre maximum de connexions pour un pool
datasources.xa-data-source.new-connection-sql=Indique un \u00E9nonc\u00E9 SQL \u00E0 ex\u00E9cuter quand une connexion est ajout\u00E9e au pool de connexions
datasources.xa-data-source.no-tx-separate-pool=Oracle n'aime pas que les connexions XA soient utilis\u00E9es \u00E0 l'int\u00E9rieur et \u00E0 l'ext\u00E9rieur d'une transaction JTA. Pour r\u00E9soudre ce probl\u00E8me, vous pouvez cr\u00E9er des sous-pools s\u00E9par\u00E9s pour des contextes diff\u00E9rents.
datasources.xa-data-source.pad-xid=Est-ce que le Xid doit \u00EAtre rempli
datasources.xa-data-source.password=Indique le mot de passe utilis\u00E9 pour cr\u00E9er une nouvelle connexion
datasources.xa-data-source.pool-name=Indique le nom du pool de connexions pour une base de donn\u00E9es utilis\u00E9e pour la gestion
datasources.xa-data-source.pool-prefill=Est-ce que le pool de connexions doit \u00EAtre rempli \u00E0 l'avance. Modifier cette valeur ne peut \u00EAtre fait qu'en d\u00E9sactivant la source de donn\u00E9es, sinon on a besoin d'un red\u00E9marrage du serveur.
datasources.xa-data-source.pool-use-strict-min=Indique si la min-pool-size doit \u00EAtre strictement consid\u00E9r\u00E9e.
datasources.xa-data-source.prepared-statements-cache-size=Le nombre d'\u00E9nonc\u00E9s pr\u00E9par\u00E9s par connexion dans un cache LRU
datasources.xa-data-source.property-name=Le nom de la propri\u00E9t\u00E9
datasources.xa-data-source.property-value=La valeur de la propri\u00E9t\u00E9
datasources.xa-data-source.query-timeout=Tout timeout de requ\u00EAte configur\u00E9 en secondes. Si non fourni, aucun timeout ne sera d\u00E9fini.
datasources.xa-data-source.same-rm-override=L'\u00E9l\u00E9ment in-same-rm-override permet de d\u00E9finir inconditionnellement si le javax.transaction.xa.XAResource.isSameRM(XAResource) retourne true ou false
datasources.xa-data-source.security-domain=Indique le domaine de s\u00E9curit\u00E9 qui d\u00E9finit le javax.security.auth.Subject utilis\u00E9 pour distinguer les connexions dans le pool de connexions.
datasources.xa-data-source.set-tx-query-timeout=Si on d\u00E9finit le timeout de requ\u00EAte sur le temps qui reste jusqu'\u00E0 ce que la transaction soit elaps\u00E9e. Tout timeout de requ\u00EAte configur\u00E9 sera utilis\u00E9 s'il n'y a pas de transaction.
datasources.xa-data-source.share-prepared-statements=Si on doit partager les \u00E9nonc\u00E9s pr\u00E9par\u00E9s, c-a-d si on doit demander un m\u00EAme \u00E9nonc\u00E9 \u00E0 deux reprises sans fermeture, utilise le m\u00EAme \u00E9nonc\u00E9 sous-jacent pr\u00E9par\u00E9.
datasources.xa-data-source.spy=Activer la surveillance des \u00E9nonc\u00E9s SQL
datasources.xa-data-source.stale-connection-checker-properties.stale-connection-checker-class-name=Un org.jboss.jca.adapters.jdbc.StaleConnectionChecker qui fournit une m\u00E9thode isStaleConnection(SQLException) qui, si elle retourne true, encapsulera l'exception dans une org.jboss.jca.adapters.jdbc.StaleConnectionException
datasources.xa-data-source.stale-connection-checker-class-name=Un org.jboss.jca.adapters.jdbc.StaleConnectionChecker qui fournit une m\u00E9thode isStaleConnection(SQLException) qui, si elle retourne true, encapsulera l'exception dans une org.jboss.jca.adapters.jdbc.StaleConnectionException
datasources.xa-data-source.stale-connection-checker-properties=Les propri\u00E9t\u00E9s du v\u00E9rificateur de connexions caduque
datasources.xa-data-source.track-statements=Si on doit v\u00E9rifier les \u00E9nonc\u00E9s non ferm\u00E9s quand une connexion est retourn\u00E9e vers le pool, les r\u00E9sultats sont ferm\u00E9s, un \u00E9nonc\u00E9 est ferm\u00E9 ou est retourn\u00E9 dans le cache d'\u00E9nonc\u00E9s pr\u00E9par\u00E9s. Les valeurs valides sont \: "false" - ne pas suivre la piste des \u00E9nonc\u00E9s, "true" - suivre la piste des \u00E9nonc\u00E9s et des r\u00E9sultats, et indiquer quand ils ne sont pas ferm\u00E9s, "nowarn" - suivre la piste des \u00E9nonc\u00E9s, mais ne pas indiquer s'ils ne sont pas ferm\u00E9s.
datasources.xa-data-source.transaction-isolation=D\u00E9finir le niveau d'isolation de la transaction java.sql.Connection. Les valeurs valides sont \: TRANSACTION_READ_UNCOMMITTED, TRANSACTION_READ_COMMITTED, TRANSACTION_REPEATABLE_READ, TRANSACTION_SERIALIZABLE et TRANSACTION_NONE
datasources.xa-data-source.url-delimiter=Indique le d\u00E9limiteur pour les URL en connexion-url pour les sources de donn\u00E9es HA
datasources.xa-data-source.url-selector-strategy-class-name=Une classe qui impl\u00E9mente org.jboss.jca.adapters.jdbc.URLSelectorStrategy
datasources.xa-data-source.use-fast-fail=Si on doit faire \u00E9chouer une allocation de connexion \u00E0 la premi\u00E8re tentative si elle est invalide (true) or si on doit essayer \u00E0 nouveau jusqu'\u00E0 ce que le pool soit d\u00E9nu\u00E9 de toutes les connexions potentielles (false)
datasources.xa-data-source.use-java-context=D\u00E9finir ceci \u00E0 false aura pour effet de relier la source de donn\u00E9es dans le JNDI global
datasources.xa-data-source.use-try-lock=Tout timeout configur\u00E9 pour les verrous internes sur les objets d'adaptateur de ressources en secondes
datasources.xa-data-source.user-name=Indique le nom d'utilisateur utilis\u00E9 quand on cr\u00E9e une nouvelle connexion
datasources.xa-data-source.valid-connection-checker-class-name=Un org.jboss.jca.adapters.jdbc.ValidConnectionChecker qui fournit une m\u00E9thode isValidConnection(Connection) pour valider une connexion. Si une exception est retourn\u00E9e, cela indique qu'elle est non valide. Cela remplace l'\u00E9l\u00E9ment check-valid-connection-sql
datasources.xa-data-source.valid-connection-checker-properties.valid-connection-checker-class-name=Un org.jboss.jca.adapters.jdbc.ValidConnectionChecker qui fournit une m\u00E9thode isValidConnection(Connection) pour valider une connexion. Si une exception est retourn\u00E9e, cela indique qu'elle est non valide. Cela remplace l'\u00E9l\u00E9ment check-valid-connection-sql
datasources.xa-data-source.valid-connection-checker-properties=Les propri\u00E9t\u00E9s du v\u00E9rificateur de connexions
datasources.xa-data-source.validate-on-match=L'\u00E9l\u00E9ment validate-on-match indique si une validation de connexion doit avoir lieu quand une fabrique de connexions tente de trouver une correspondance avec une connexion g\u00E9r\u00E9e. Cela est normalement exclusivement r\u00E9serv\u00E9 aux validations d'arri\u00E8re-plan.
datasources.xa-data-source.wrap-xa-resource=Est-ce que les instances XAResource doivent \u00EAtre encapsul\u00E9es dans l'instance org.jboss.tm.XAResourceWrapper
datasources.xa-data-source.xa-datasource-class=Le nom complet de l'impl\u00E9mentation javax.sql.XADataSource
datasources.xa-data-source.xa-datasource-properties.add=Ajouter une simple xa-datasource-property
datasources.xa-data-source.xa-datasource-properties.remove=Supprimer xa-datasource-property
datasources.xa-data-source.xa-datasource-properties.value=Indique une valeur de propri\u00E9t\u00E9 \u00E0 assigner \u00E0 la classe d'impl\u00E9mentation de XADataSource. Chaque propri\u00E9t\u00E9 est identifi\u00E9e par l'attribut de nom et la valeur de la propri\u00E9t\u00E9 est donn\u00E9e par le contenu de l'\u00E9l\u00E9ment xa-datasource-property. La propri\u00E9t\u00E9 est mapp\u00E9e dans l'impl\u00E9mentation de XADataSource en cherchant une m\u00E9thode getter de style JavaBeans pour le nom de propri\u00E9t\u00E9. Si trouv\u00E9e, la valeur de la propri\u00E9t\u00E9 sera d\u00E9finie en utilisant le setter JavaBeans avec le texte de l'\u00E9l\u00E9ment repr\u00E9sentant le type de propri\u00E9t\u00E9 true \u00E0 l'aide du java.beans.PropertyEditor
datasources.xa-data-source.xa-datasource-properties=Liste de xa-datasource-property
datasources.xa-data-source.xa-resource-timeout=La valeur est pass\u00E9e au XAResource.setTransactionTimeout(), en secondes. La valeur par d\u00E9faut est z\u00E9ro
datasources.xa-data-source.get-installed-driver=Obtenez une description de pilote install\u00E9
datasources.xa-data-source.allocation-retry-wait-millis=L'\u00E9l\u00E9ment \u00ABallocation retry wait millis\u00BB indique la dur\u00E9e, en millisecondes, d'attente entre les essais d'allocation de connexion
datasources.xa-data-source.allocation-retry=L'\u00E9l\u00E9ment \u00ABallocation retry\u00BB indique le nombre de tentatives d'allocation avant de lancer une exception
datasources.xa-data-source.allow-multiple-users=Indique si des utilisateurs multiples vont acc\u00E9der la source de donn\u00E9es par la m\u00E9thode getConnection (nom d'utilisateur, mot de passe), et donc si le type de pool interne doit prendre ceci en consid\u00E9ration
datasources.xa-data-source.background-validation-millis=L'\u00E9l\u00E9ment \u00ABbackground-validation-millis\u00BB indique la dur\u00E9e, en millisecondes, pendant laquelle la validation d'arri\u00E8re plan va ex\u00E9cuter. Modifier cette valeur ne peut avoir lieu qu'en d\u00E9sactivant la source de donn\u00E9es, sinon, il faut red\u00E9marrer le serveur
datasources.xa-data-source.background-validation=Un \u00E9l\u00E9ment pour indiquer que les connexions doivent \u00EAtre valid\u00E9es dans un thread d'arri\u00E8re-plan au lieu d'\u00EAtre valid\u00E9es avant l'utilisation. On peut changer cette valeur uniquement sur une source de donn\u00E9es d\u00E9sactiv\u00E9e, sinon, on a besoin d'un red\u00E9marrage du serveur. 
datasources.xa-data-source.blocking-timeout-wait-millis=L'\u00E9l\u00E9ment \u00ABblocking-timeout-millis\u00BB indique la dur\u00E9e, en millisecondes, de blocage quand on attend une connexion avant d'envoyer une exception. Notez que cela ne bloque uniquement lors de l'attente de verrouillage d'une connexion, et qu'une exception ne sera jamais lanc\u00E9e si la cr\u00E9ation d'une nouvelle connexion prend un temps inconsid\u00E9r\u00E9.
datasources.xa-data-source.check-valid-connection-sql=Indiquer un \u00E9nonc\u00E9 SQL pour v\u00E9rifier la validit\u00E9 d'un pool de connexion. Peut \u00EAtre appel\u00E9 quand la connexion g\u00E9r\u00E9e vient du pool de connexion.
datasources.xa-data-source.reauth-plugin-class-name=Le nom de classe complet de l'impl\u00E9mentation du plugin de r\u00E9 authentification.
datasources.xa-data-source.reauth-plugin-properties.reauth-plugin-class-name=Le nom de classe complet de l'impl\u00E9mentation du plugin de r\u00E9 authentification.
datasources.xa-data-source.reauth-plugin-properties=Les propri\u00E9t\u00E9s du plugin de r\u00E9-authentification
datasources.xa-data-source.flush-strategy=Indique comment le pool de connexions devrait \u00EAtre vid\u00E9 en cas d'erreur. Les valeurs valides sont \: FailingConnectionOnly (default), IdleConnections et EntirePool
datasources.xa-data-source.use-ccm=Active l'utilisation d'un gestionnaire de connexion en cache
datasources.xa-data-source.recovery-username=Le nom de l'utilisateur pour le recouvrement
datasources.xa-data-source.recovery-password=Le mot de passe utilis\u00E9 pour le recouvrement
datasources.xa-data-source.recovery-security-domain=Le domaine de s\u00E9curit\u00E9 pour le recouvrement
datasources.xa-data-source.recovery-plugin-properties.recovery-plugin-class-name=Le nom de classe complet pour l'impl\u00E9mentation du plugin de recouvrement
datasources.xa-data-source.recovery-plugin-class-name=Le nom de classe complet pour l'impl\u00E9mentation du plugin de recouvrement
datasources.xa-data-source.recovery-plugin-properties=Les propri\u00E9t\u00E9s du plugin de recouvrement
datasources.xa-data-source.no-recovery=Indique si le pool de connexions doit \u00EAtre exclus du recouvrement
datasources.jdbc-driver.get-installed-driver.driver-minor-version=Version mineure de pilote
datasources.jdbc-driver.get-installed-driver.driver-major-version=Version majeure de pilote
datasources.jdbc-driver.get-installed-driver.driver-name=Nom du pilote
datasources.jdbc-driver.get-installed-driver.driver-class-name=Nom de la classe du pilote
datasources.jdbc-driver.get-installed-driver.driver-xa-datasource-class-name=Classe de source de donn\u00E9es XA
datasources.jdbc-driver.get-installed-driver.driver-module-name=Le nom du module \u00E0 partir duquel le pilote a \u00E9t\u00E9 charg\u00E9, s'il a \u00E9t\u00E9 charg\u00E9 \u00E0 partir du chemin du module
datasources.jdbc-driver.get-installed-driver.deployment-name=Le nom de l'unit\u00E9 de d\u00E9ploiement \u00E0 partir de laquelle le pilote a \u00E9t\u00E9 charg\u00E9
datasources.jdbc-driver.get-installed-driver.jdbc-compliant=Si le pilote JDBC est conforme ou non
datasources.jdbc-driver.get-installed-driver.module-slot=Le slot du module \u00E0 partir duquel le pilote a \u00E9t\u00E9 charg\u00E9, s'il a \u00E9t\u00E9 charg\u00E9 \u00E0 partir du chemin du module.
datasources.jdbc-driver.get-installed-driver.xa-datasource-class=Classe de source de donn\u00E9es XA
datasources.statistics=Les statistiques de temps d'ex\u00E9cution fournis par l'adaptateur de ressources.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/datasources/LocalDescriptions, author grossetieg
statistics=Statistiques \u00E0 l'ex\u00E9cution fournis par l'adaptateur de ressources.
datasources.clear-statistics=Supprime les statistiques de cette ressource
datasources.deployed=Ressources \u00E0 l'ex\u00E9cution expos\u00E9es par sources de donn\u00E9es inclus dans ce d\u00E9ploiement.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/datasources/LocalDescriptions, author grossetieg
deployed=Ressources \u00E0 l'ex\u00E9cution expos\u00E9es par sources de donn\u00E9es inclus dans ce d\u00E9ploiement.
