datasources=O sub-sistema da fonte de dados, usado para declarar fonte de dados JDBC
datasources.add=Adiciona a sub-sistema das fontes dados
datasources.remove=Remove o sub-sistema das fontes de dados
jdbc-driver=Servi\u00E7o que disponibiliza  o driver JDBC para uso no per\u00EDodo de rodagem
jdbc-driver.add=Adiciona um novo driver JDBC
jdbc-driver.description=Um servi\u00E7o que disponibiliza o driver JDBC para uso no per\u00EDodo de rodagem
jdbc-driver.module=O nome do m\u00F3dulo que disponibiliza o driver JDBC sob o "java.sql.Driver" do tipo de servi\u00E7o
jdbc-driver.remove=Remove o driver JDBC
data-source=Uma configura\u00E7\u00E3o da fonte de dados JDBC
data-source.add=Adiciona uma nova fonte de dados
data-source.description=Uma configura\u00E7\u00E3o da fonte de dados JDBC
data-source.disable=Desativa a fonte de dados
data-source.enable=Ativa a fonte de dados
data-source.flush-all-connection-in-pool=Libera todas as conex\u00F5es no pool
data-source.flush-idle-connection-in-pool=Libera todas as conex\u00F5es ociosas no pool
data-source.remove=Remove a fonte de dados
data-source.test-connection-in-pool=Testa se a conex\u00E3o pode ser obtida
data-source.clear-statistics=Esvazia os valores de estat\u00EDsticas para esse recurso
xa-data-source=Uma configura\u00E7\u00E3o da fonte de dados JDBC XA
xa-data-source.add=Adiciona uma nova fonte de dados XA
xa-data-source.description=Uma configura\u00E7\u00E3o da fonte de dados 
xa-data-source.disable=Desativa a fonte de dados XA
xa-data-source.enable=Ativa a fonte de dados XA
xa-data-source.remove=Remove a fonte de dados XA
allocation-retry-wait-millis=A aloca\u00E7\u00E3o de nova tentativa espera mil\u00E9simos de segundos para o elemento especificar a quantia de tempo de espera entre a nova tentativa de alocar uma conex\u00E3o
allocation-retry=O elemento da nova tentativa de aloca\u00E7\u00E3o indica o n\u00FAmero de vezes que a aloca\u00E7\u00E3o de uma conex\u00E3o deve ser tentada antes de lan\u00E7ar uma exce\u00E7\u00E3o
background-validation-millis=O elemento background-validation-millis especifica a quantia de tempo, em mil\u00E9simos de segundos, que a valida\u00E7\u00E3o de fundo ir\u00E1 rodar. A altera\u00E7\u00E3o desse valor pode ser realizada apenas na fonte de dados desativada, requerendo que o servidor seja reiniciado
background-validation=Um elemento para especificar que as conex\u00F5es deve ser validadas num thread de fundo versus sendo validado antes do uso. A altera\u00E7\u00E3o desse valor pode ser feita apenas na fonte de dados desativada, requerendo que um servidor seja reiniciado.
blocking-timeout-wait-millis=O elemento blocking-timeout-millis especifica o per\u00EDodo m\u00E1ximo, em mil\u00E9simos de segundos, para bloqueio na espera de uma conex\u00E3o antes de lan\u00E7ar uma exce\u00E7\u00E3o. Perceba que esse bloqueio ocorre apenas quando esperando pelo bloqueio de uma conex\u00E3o, e nunca ser\u00E1 lan\u00E7ada uma exce\u00E7\u00E3o. A cria\u00E7\u00E3o de uma nova conex\u00E3o leva um tempo consider\u00E1vel.
check-valid-connection-sql=Especifica uma declara\u00E7\u00E3o SQL para checar validade de uma conex\u00E3o do pool. Isto pode ser chamado quando a conex\u00E3o gerenciada \u00E9 obtida a partir de um pool
connection-properties.add=Adiciona uma propriedade de conex\u00E3o
connection-properties.remove=Remove a propriedade de conex\u00E3o
connection-properties.value=Cada propriedade de conex\u00E3o especifica um par de nome/valor de sequ\u00EAncia com o nome da propriedade vindo do atributo do nome e o valor vindo do conte\u00FAdo do elemento
connection-properties=O elemento connection-properties permite voc\u00EA passar as propriedades de conex\u00E3o arbrit\u00E1rias ao m\u00E9todo Driver.connect(url, props)
connection-url=O URL da conex\u00E3o do driver JDBC
datasource-class=O nome inteiramente qualificado da classe da fonte de dados JDBC
driver-class=O nome inteiramente qualificado da classe do driver JDBC
driver-name=Define o driver JDBC a fonte de dados deve usar. Isto \u00E9 um nome simb\u00F3lico de combina\u00E7\u00E3o ao nome do driver instalado. No caso do driver j\u00E1 ter sido implantado como jar, o nome ser\u00E1 o da unidade de implanta\u00E7\u00E3o
driver=Define o driver JDBC que a fonte de dados deve usar. Isto \u00E9 uma nome simb\u00F3lico de combina\u00E7\u00E3o com o nome do driver instalado. No caso do driver j\u00E1 ter sido instalado como jar, o nome ser\u00E1 o da unidade de implanta\u00E7\u00E3o
enabled=Especifica se a fonte de dados deve ser ativada
exception-sorter-class-name=Um org.jboss.jca.adapters.jdbc.ExceptionSorter que fornece um m\u00E9todo isExceptionFatal(SQLException) para valida\u00E7\u00E3o caso uma exce\u00E7\u00E3o transmita um erro
exception-sorter-properties=Exce\u00E7\u00E3o das propriedades de classifica\u00E7\u00E3o
idle-timeout-minutes=Os elementos idle-timeout-minutes especificam o per\u00EDodo m\u00E1ximo, em minutos, uma cole\u00E7\u00E3o deve ser ociosa antes de ser encerrada. O per\u00EDodo m\u00E1ximo atual depende no per\u00EDodo de verifica\u00E7\u00E3o do IdleRemover, que \u00E9 metade do menor valor do idle-timeout-minutes em qualquer pool. A altera\u00E7\u00E3o desse valor pode ser realizada apenas na desativa\u00E7\u00E3o da fonte de dados, solicitando a reinicializa\u00E7\u00E3o do servidor.
interleaving=Um elemento para ativar a intercala\u00E7\u00E3o para conex\u00F5es XA
jndi-name=Especifica o nome JNDI para a fonte de dados
jta=Ativa a integra\u00E7\u00E3o JTA
max-pool-size=O elemento max-pool-size especifica o n\u00FAmero m\u00E1ximo de conex\u00F5es para um pool. N\u00E3o ser\u00E1 mais criado conex\u00F5es em cada sub-pool
min-pool-size=O elemento min-pool-size especifica o n\u00FAmero m\u00EDnimo de conex\u00F5es para um pool
new-connection-sql=Especifica a declara\u00E7\u00E3o SQL para executar todo instante em que uma conex\u00E3o \u00E9 adicionada ao pool de conex\u00E3o
no-tx-separate-pool=O Oracle n\u00E3o gosta de conex\u00F5es XA usadas tanto dentro como fora de uma transa\u00E7\u00E3o JTA. Voc\u00EA pode criar sub-pools separados para contextos diferentes como solu\u00E7\u00E3o desse problema.
pad-xid=No caso do Xid ser preenchido
password=Especifica a senha usada na cria\u00E7\u00E3o de uma nova conex\u00E3o
pool-name=Especifica o nome do pool para a fonte de dados usada para gerenciamento
pool-prefill=No caso do pool ser pr\u00E9-preenchido. A altera\u00E7\u00E3o desse valor pode ser realizada apenas na desativa\u00E7\u00E3o da fonte de dados, do contr\u00E1rio a reinicializa\u00E7\u00E3o do servidor ser\u00E1 solicitada.
pool-use-strict-min=Especifica se o min-pool-size deve ser considerado rigidamente
prepared-statements-cache-size=O n\u00FAmero de declara\u00E7\u00F5es preparadas por conex\u00E3o num cache de LRU
property-name=O nome da propriedade
property-value=O valor da propriedade
query-timeout=Qualquer intervalo da consulta configurada em segundos. O intervalo ser\u00E1 determinado, caso n\u00E3o tenha sido fornecido
same-rm-override=O elemento is-same-rm-override permite a configura\u00E7\u00E3o incondicional, independente do javax.transaction.xa.XAResource.isSameRM(XAResource) retornar verdadeiro ou falso
security-domain=Especifica o dom\u00EDnio de seguran\u00E7a que define o javax.security.auth.Subject usada na distin\u00E7\u00E3o das conex\u00F5es do pool
set-tx-query-timeout=Se \u00E9 que configurar ou n\u00E3o o intervalo de consulta no per\u00EDodo restante at\u00E9 que a transa\u00E7\u00E3o entre no intervalo. Qualquer intervalo de consulta configurado ser\u00E1 usado caso n\u00E3o haja transa\u00E7\u00E3o
share-prepared-statements=Se \u00E9 que compartilhar declara\u00E7\u00F5es preparadas, ex.\: se \u00E9 que perguntar pela mesma declara\u00E7\u00E3o duas vezes sem encerrar os usos da mesma declara\u00E7\u00E3o preparada adjacente
spy=Ativa a espionagem das declara\u00E7\u00F5es SQL
stale-connection-checker-class-name=Um org.jboss.jca.adapters.jdbc.StaleConnectionChecker que fornece um m\u00E9todo, do qual caso retorne verdadeiro, ir\u00E1 envolver a exce\u00E7\u00E3o num org.jboss.jca.adapters.jdbc.StaleConnectionException
stale-connection-checker-properties=As propriedades do checador da conex\u00E3o obsoleta
track-statements=Se \u00E9 que checar por declara\u00E7\u00F5es n\u00E3o-encerradas quando a conex\u00E3o for retornada ao pool, os conjuntos de resultado s\u00E3o encerrados, uma declara\u00E7\u00E3o \u00E9 encerrada ou retornada para o cache da declara\u00E7\u00E3o preparada. Os valores v\u00E1lidos s\u00E3o\: "falso" - n\u00E3o rastreie declara\u00E7\u00F5es, "verdadeiro" - declara\u00E7\u00F5es de rastreio, conjuntos de resultado e avisos quando eles n\u00E3o est\u00E3o encerrados, "nowarn" - declara\u00E7\u00E3o de rastreio, mas n\u00E3o h\u00E1 aviso de quando eles forem abertos
transaction-isolation=Determina o n\u00EDvel de isola\u00E7\u00E3o da transa\u00E7\u00E3o java.sql.Connection. Os valores v\u00E1lidos s\u00E3o\: TRANSACTION_READ_UNCOMMITTED, TRANSACTION_READ_COMMITTED, TRANSACTION_REPEATABLE_READ, TRANSACTION_SERIALIZABLE and TRANSACTION_NONE
url-delimiter=Especifica o delimitador para os URLs no connection-url para as fontes de dados HA
url-selector-strategy-class-name=Uma classe que implementa org.jboss.jca.adapters.jdbc.URLSelectorStrategy
use-fast-fail=Se \u00E9 que falhar uma aloca\u00E7\u00E3o da conex\u00E3o na primeira tentativa, caso ela seja inv\u00E1lida (verdadeira) ou continuar tentando at\u00E9 que o pool seja esgotado de todas as conex\u00F5es potenciais (falso).
use-java-context=A configura\u00E7\u00E3o disto para falso aplicar\u00E1 o bind na fonte de dados no JNDI global
use-try-lock=Qualquer intervalo configurado para bloqueios internos nos objetos do adaptador do recurso em segundos
user-name=Especifica o nome do usu\u00E1rio usado na cria\u00E7\u00E3o de uma nova conex\u00E3o
valid-connection-checker-class-name=Um org.jboss.jca.adapters.jdbc.ValidConnectionChecker que fornece um m\u00E9todo isValidConnection(Connection) para validar uma conex\u00E3o. Caso uma exce\u00E7\u00E3o seja retornada, isto significa que a conex\u00E3o \u00E9 inv\u00E1lida. Isto substitui o elemento check-valid-connection-sql
valid-connection-checker-properties=As propriedades do checador da conex\u00E3o v\u00E1lida
validate-on-match=O elemento validate-on-match especifica se a valida\u00E7\u00E3o da conex\u00E3o deve ser realizada quando uma cria\u00E7\u00E3o da conex\u00E3o tentar coincidir uma conex\u00E3o gerenciada. Isto \u00E9 normalmente exclusivo ao uso da valida\u00E7\u00E3o de plano de fundo
wrap-xa-resource=Quando as inst\u00E2ncias XAResource forem envolvidas numa inst\u00E2ncia org.jboss.tm.XAResourceWrapper
xa-datasource-class=O nome inteiramente qualificado da implanta\u00E7\u00E3o javax.sql.XADataSource 
xa-datasource-properties.add=Adiciona um xa-datasource-property \u00FAnico
xa-datasource-properties.remove=Remove o xa-datasource-property
xa-datasource-properties.value=Especifica o valor da propriedade a determinar a classe de implanta\u00E7\u00E3o XADataSource. Cada propriedade \u00E9 identificada pelo atributo do nome e o valor da propriedade \u00E9 dado pelo conte\u00FAdo do elemento xa-datasource-property. A propriedade \u00E9 mapeada na implanta\u00E7\u00E3o XADataSource pela busca do m\u00E9todo getter do estilo JavaBeans para o nome da propriedade. Caso encontrado, o valor da propriedade \u00E9 determinado usando o JavaBeans setter com o texto do elemento traduzido para o tipo de propriedade verdadeira usando o java.beans.PropertyEditor
xa-datasource-properties=Lista do xa-datasource-property
xa-resource-timeout=O valor \u00E9 passado ao XAResource.setTransactionTimeout(), em segundos. O padr\u00E3o \u00E9 zero
get-installed-driver=Obt\u00E9m a descri\u00E7\u00E3o de um driver instalado
installed-drivers=Lista dos drivers JDBC que foram instalados no per\u00EDodo de rodagem
installed-drivers-list=Lista dos drivers JDBC que foram instalados no per\u00EDodo de rodagem
installed-drivers.datasource-class-name=O nome da classe inteiramente qualificada da implanta\u00E7\u00E3o do javax.sql.DataSource 
installed-drivers.deployment-name=O nome da unidade da implanta\u00E7\u00E3o pela qual o driver foi carregado
installed-drivers.driver-class=O nome da classe inteiramente qualificada da implanta\u00E7\u00E3o java.sql.Driver
installed-drivers.driver-datasource-class-name=O nome da classe inteiramente qualificada da implanta\u00E7\u00E3o javax.sql.DataSource
installed-drivers.driver-name=O nome simb\u00F3lico desse driver usado para referenci\u00E1-lo no registro
installed-drivers.driver-xa-datasource-class-name=O nome da classe inteiramente qualificada da implanta\u00E7\u00E3o javax.sql.XADataSource implementation
installed-drivers.jdbc-compliant=Se \u00E9 que o driver \u00E9 compat\u00EDvel com o JDBC
installed-drivers.major-version=O n\u00FAmero de vers\u00E3o superior do driver
installed-drivers.minor-version=O n\u00FAmero de vers\u00E3o inferior do driver
installed-drivers.module-name=O nome do m\u00F3dulo pelo qual o driver foi carregado, caso ele tenha sido carregado a partir do caminho do m\u00F3dulo
installed-drivers.module-slot=O slot do m\u00F3dulo pelo qual o driver foi carregado, caso ele tenha sido carregado a partir do caminho do m\u00F3dulo
installed-drivers.xa-datasource-class-name=O nome da classe inteiramente qualificado da implanta\u00E7\u00E3o javax.sql.XADataSource 
reauth-plugin-class-name=O nome da classe inteiramente qualificado de re-autentica\u00E7\u00E3o da implanta\u00E7\u00E3o plugin
reauth-plugin-properties=Propriedades de re-autentica\u00E7\u00E3o do plugin
flush-strategy=Especifica como o pool deve ser esvaziado no caso de um erro. Os valores v\u00E1lidos s\u00E3o\: FailingConnectionOnly (default), IdleConnections e EntirePool
use-ccm=Ativa o uso de um gerenciador de conex\u00E3o com cache
recovery-username=O nome do usu\u00E1rio usado para recupera\u00E7\u00E3o
recovery-password=A senha usada para recupera\u00E7\u00E3o
recovery-security-domain=O dom\u00EDnio de seguran\u00E7a usado para recupera\u00E7\u00E3o
recovery-plugin-class-name=O nome da classe inteiramente qualificado da implanta\u00E7\u00E3o do plugin de recupera\u00E7\u00E3o
recovery-plugin-properties=As propriedades para o plugin de recupera\u00E7\u00E3o
no-recovery=Especifica se a conex\u00E3o do pool deve ser exclu\u00EDda da recupera\u00E7\u00E3o
persistent=caso o atributo de ativa\u00E7\u00E3o verdadeiro for persistido
statistics=As estat\u00EDsticas do per\u00EDodo de rodagem fornecidas pelo adaptador de recurso.
deployed=Os recursos do per\u00EDodo de rodagem pelas fontes de dados inclu\u00EDdas nessa implanta\u00E7\u00E3o.
