# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author ldelima@redhat.com
resource-adapters=Configura\u00E7\u00E3o do subsistema dos adaptadores de recurso
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author ldelima@redhat.com
resource-adapters.add=Adiciona o subsistema dos adaptadores de recurso
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author ldelima@redhat.com
resource-adapters.remove=Remove o subsistema dos adaptadores de recurso
resource-adapters.resource-adapter=A configura\u00E7\u00E3o dos adaptadores de recurso.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author ldelima@redhat.com
ironjacamar=Modelo representando os adaptadores de recurso ativados pelo arquivo ironjacamar.xml dentro do rar.
ironjacamar.resource-adapter=A configura\u00E7\u00E3o dos adaptadores de recurso.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author ldelima@redhat.com
admin-objects=Especifica o objeto de administra\u00E7\u00E3o
admin-objects.add=Adiciona o objeto de administra\u00E7\u00E3o.
admin-objects.remove=Remove o objeto de administra\u00E7\u00E3o.
admin-objects.class-name=Especifica o nome da classe inteiramente qualificada de um objeti de administra\u00E7\u00E3o.
admin-objects.config-properties=Propriedades personalizadas config definidas.
admin-objects.enabled=Especifica se o objeto de administra\u00E7\u00E3o deve ser ativado.
admin-objects.jndi-name=Especifica o nome JNDI para o objeto de administra\u00E7\u00E3o.
admin-objects.use-java-context=A configura\u00E7\u00E3o disto para falso efetuar\u00E1 o bind no objeto num JNDI global.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author ldelima@redhat.com
resource-adapter=A configura\u00E7\u00E3o do adaptador do recurso.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author ldelima@redhat.com
resource-adapter.add=Adiciona um novo adaptador de recurso.
resource-adapter.remove=Remove o adaptador de recurso.
resource-adapter.activate=For\u00E7a a ativa\u00E7\u00E3o do adaptador de recurso sem o servidor ser recarregado. 
resource-adapter.admin-objects=A configura\u00E7\u00E3o dos objetos de administra\u00E7\u00E3o do adaptador do recurso.
resource-adapter.archive=Especifica o arquivo do adaptador do recurso.
resource-adapter.module=Especifica o m\u00F3dulo pelo qual o adaptador de recurso ser\u00E1 carregado.
resource-adapter.beanvalidationgroups=Especifica os grupos de valida\u00E7\u00E3o do beam que devem ser usados.
resource-adapter.bootstrap-context=Especifica o nome \u00FAnico do contexto brootstrap que deve ser usado.
resource-adapter.connection-definitions=A configura\u00E7\u00E3o destas defini\u00E7\u00F5es de conex\u00E3o do adaptador de recurso.
resource-adapter.config-properties=Propriedades personalizadas config definidas.
resource-adapter.clear-statistics=Esvazia os valores de estat\u00EDsticas para este recurso.
resource-adapter.transaction-support=Especifica o n\u00EDvel de suporte da transa\u00E7\u00E3o para o adapatador de recurso.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author ldelima@redhat.com
deployment-subsystem=A informa\u00E7\u00E3o do per\u00EDodo de rodagem para os adaptadores de recurso. Isto cont\u00E9m estat\u00EDsticas e opera\u00E7\u00F5es, al\u00E9m da informa\u00E7\u00E3o do adaptador de recurso ativado ironjacamar.xml.\n
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author ldelima@redhat.com
statistics=As estat\u00EDsticas fornecidas pelo adaptador de recurso.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author ldelima@redhat.com
config-properties=Propriedades personalizadas config definidas.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author ldelima@redhat.com
config-properties.add=Adiciona uma propriedade personalizada config definida 
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author ldelima@redhat.com
config-properties.remove=Remove a propriedade personalizada config definida.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author ldelima@redhat.com
config-properties.value=Valor da propriedade personalizada config definida.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author ldelima@redhat.com
connection-definitions=Especifica as defini\u00E7\u00F5es da conex\u00E3o.
connection-definitions.add=Adiciona a defini\u00E7\u00E3o da conex\u00E3o.
connection-definitions.remove=Remove a defini\u00E7\u00E3o da conex\u00E3o.
connection-definitions.allocation-retry-wait-millis=A aloca\u00E7\u00E3o de nova tentativa espera mil\u00E9simos de segundos para o elemento especificar a quantia de tempo de espera entre a nova tentativa de alocar uma conex\u00E3o.
connection-definitions.allocation-retry=O elemento de nova tentativa de aloca\u00E7\u00E3o indica o n\u00FAmero de vezes que a aloca\u00E7\u00E3o de uma conex\u00E3o deve ser tentada antes de lan\u00E7ar uma exce\u00E7\u00E3o.
connection-definitions.background-validation-millis=O elemento background-validation-millis especifica a quantia de tempo, em mil\u00E9simos de segundos, que a valida\u00E7\u00E3o do plano de fundo ser\u00E1 rodada. A altera\u00E7\u00E3o deste valor requer a re-inicializa\u00E7\u00E3o do servidor.
connection-definitions.background-validation=Um elemento a ser especificado que as conex\u00F5es devem validar no thread do plano de fundo versus sendo validadas antes do uso. A altera\u00E7\u00E3o deste valor requer a re-inicializa\u00E7\u00E3o do servidor.
connection-definitions.blocking-timeout-wait-millis=O elemento blocking-timeout-millis especifica o per\u00EDodo m\u00E1ximo, em mil\u00E9simos de segundos, para bloqueio na espera de uma conex\u00E3o antes de lan\u00E7ar uma exce\u00E7\u00E3o. Perceba que esse bloqueio ocorre apenas quando esperando pelo bloqueio de uma conex\u00E3o, e nunca ser\u00E1 lan\u00E7ada uma exce\u00E7\u00E3o. A cria\u00E7\u00E3o de uma nova conex\u00E3o leva um tempo consider\u00E1vel.
connection-definitions.class-name=Especifica o nome da classe qualificada de uma cria\u00E7\u00E3o da conex\u00E3o gerenciada ou objeto admin.
connection-definitions.config-properties=Propriedades personalizadas config definidas.
connection-definitions.enabled=Especifica se o adaptador do recurso deve ser ativado.
connection-definitions.flush-all-connection-in-pool=Libera todas as conex\u00F5es no pool.
connection-definitions.flush-idle-connection-in-pool=Libera todas as conex\u00F5es ociosas no pool.
connection-definitions.flush-strategy=Especifica como o pool deve ser esvaziado no caso de um erro. Os valores v\u00E1lidos s\u00E3o\: FailingConnectionOnly (default), IdleConnections e EntirePool.
connection-definitions.idle-timeout-minutes=Os elementos idle-timeout-minutes especificam o per\u00EDodo m\u00E1ximo, em minutos, que uma conex\u00E3o pode ficar ociosa antes de ser encerrada. O per\u00EDodo m\u00E1ximo atual depende do per\u00EDodo de verifica\u00E7\u00E3o do idle-timeout-minutes, que \u00E9 metade do menor valor de qualquer pool. A altera\u00E7\u00E3o desse valor requer a re-inicializa\u00E7\u00E3o do servidor.
connection-definitions.jndi-name=Especifica o nome JNDI para a cria\u00E7\u00E3o da conex\u00E3o.
connection-definitions.interleaving=Um elemento para ativar a intercala\u00E7\u00E3o das conex\u00F5es XA.
connection-definitions.max-pool-size=O elemento max-pool-size especifica o n\u00FAmero m\u00E1ximo de conex\u00F5es para um pool. N\u00E3o ser\u00E1 mais criado conex\u00F5es em cada sub-pool.
connection-definitions.min-pool-size=O elemento min-pool-size especifica o n\u00FAmero m\u00EDnimo de conex\u00F5es para um pool.
connection-definitions.no-recovery=Especifica se a conex\u00E3o do pool deve ser exclu\u00EDda da recupera\u00E7\u00E3o.
connection-definitions.no-tx-separate-pool=O Oracle n\u00E3o gosta das conex\u00F5es XA usadas tanto dentro como fora da transa\u00E7\u00E3o JTA. Voc\u00EA pode criar sub-pools separados para contextos diferentes como solu\u00E7\u00E3o para este problema.
connection-definitions.pad-xid=No caso do Xid ser preenchido.
connection-definitions.password=Especifica a senha usada quando criando uma nova conex\u00E3o.
connection-definitions.pool-name=Especifica o nome do pool para a fonte de dados usada para gerenciamento.
connection-definitions.pool-prefill=No caso do pool ser prepreenchido. A altera\u00E7\u00E3o deste valor requer a re-inicializa\u00E7\u00E3o do servidor.
connection-definitions.pool-use-strict-min=Especifica se o min-pool-size deve ser considerado rigorosamente.
connection-definitions.query-timeout=Qualquer intervalo de consulta configurado em segundos. O padr\u00E3o \u00E9 nenhum intervalo.
connection-definitions.recovery-password=A senha usada para a recupera\u00E7\u00E3o.
connection-definitions.recovery-plugin-class-name=O nome da classe inteiramente qualificado da implanta\u00E7\u00E3o plugin de recupera\u00E7\u00E3o.
connection-definitions.recovery-plugin-properties=As propriedades para o plugin de recupera\u00E7\u00E3o.
connection-definitions.recovery-security-domain=O domain de seguran\u00E7a usado para recupera\u00E7\u00E3o.
connection-definitions.recovery-username=O nome do usu\u00E1rio usado para recupera\u00E7\u00E3o.
connection-definitions.same-rm-override=O elemento permite um is-same-rm-override permite determinar incondicionalmente independente do javax.transaction.xa.XAResource.isSameRM(XAResource) retornar verdadeiro ou falso.
connection-definitions.security-application=Indica se os par\u00E2metros fornecidos do aplicativo (tais como do getConnection(user, pw)) s\u00E3o usados para distiguir conex\u00F5es do pool.
connection-definitions.security-domain=Especifica o dom\u00EDnio de seguran\u00E7a que define o javax.security.auth.Subject que \u00E9 usado para distinguir as conex\u00F5es no pool.
connection-definitions.security-domain-and-application=Indica que ambos aplicativos forneceram par\u00E2metros (tais como getConnection(user, pw)) ou Sujeito (a partir do dom\u00EDnio de seguran\u00E7a) s\u00E3o usados para distinguir conex\u00F5es no pool.
connection-definitions.set-tx-query-timeout=Se \u00E9 que determinar o intervalo de consulta baseado no per\u00EDodo restante at\u00E9 que a transa\u00E7\u00E3o entre em intervalo. Qualquer intervalo de consulta configurado ser\u00E1 usado caso n\u00E3o haja transa\u00E7\u00E3o.
connection-definitions.test-connection-in-pool=Testa se a conex\u00E3o pode ser obtida.
connection-definitions.use-ccm=Ativa o uso de um gerenciador de conex\u00E3o com cache.
connection-definitions.use-fast-fail=Se \u00E9 que falhar uma aloca\u00E7\u00E3o de conex\u00E3o na primeira tentativa, caso ela seja inv\u00E1lida (verdadeira) ou continuar tentando at\u00E9 que o pool seja esgotado de todas as conex\u00F5es potenciais (falso).
connection-definitions.use-java-context=A configura\u00E7\u00E3o disto para falso efetuar\u00E1 o bind no objeto num JNDI global.
connection-definitions.use-try-lock=Qualquer intervalo configurado para bloqueios internos nos objetos do adaptador de recurso em segundos.
connection-definitions.wrap-xa-resource=Quando as inst\u00E2ncias XAResource forem envolvidas numa inst\u00E2ncia org.jboss.tm.XAResourceWrapper.
connection-definitions.xa-resource-timeout=O valor \u00E9 passado ao XAResource.setTransactionTimeout() em segundos. O padr\u00E3o \u00E9 zero.
