# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author Yamamoto Mie
resource-adapters=\u30EA\u30BD\u30FC\u30B9\u30A2\u30C0\u30D7\u30BF\u30FC\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u306E\u8A2D\u5B9A
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author Yamamoto Mie
resource-adapters.add=\u30EA\u30BD\u30FC\u30B9\u30A2\u30C0\u30D7\u30BF\u30FC\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author Yamamoto Mie
resource-adapters.remove=\u30EA\u30BD\u30FC\u30B9\u30A2\u30C0\u30D7\u30BF\u30FC\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u3092\u524A\u9664\u3057\u307E\u3059\u3002
resource-adapters.resource-adapter=\u30EA\u30BD\u30FC\u30B9\u30A2\u30C0\u30D7\u30BF\u30FC\u306E\u8A2D\u5B9A\u3002
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author Yamamoto Mie
ironjacamar=rar \u5185\u306E ironjacamar.xml \u30D5\u30A1\u30A4\u30EB\u306B\u3088\u3063\u3066\u30A2\u30AF\u30C6\u30A3\u30D9\u30FC\u30C8\u3055\u308C\u305F\u30EA\u30BD\u30FC\u30B9\u30A2\u30C0\u30D7\u30BF\u30FC\u3092\u8868\u3059\u30E2\u30C7\u30EB\u3002
ironjacamar.resource-adapter=\u30EA\u30BD\u30FC\u30B9\u30A2\u30C0\u30D7\u30BF\u30FC\u306E\u8A2D\u5B9A\u3002
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author Yamamoto Mie
admin-objects=\u7BA1\u7406\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
admin-objects.add=\u7BA1\u7406\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
admin-objects.remove=\u7BA1\u7406\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u3092\u524A\u9664\u3057\u307E\u3059\u3002
admin-objects.class-name=\u7BA1\u7406\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306E\u5B8C\u5168\u4FEE\u98FE\u30AF\u30E9\u30B9\u540D\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
admin-objects.config-properties=\u30AB\u30B9\u30BF\u30E0\u5B9A\u7FA9\u3055\u308C\u305F\u8A2D\u5B9A\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u3002
admin-objects.enabled=\u7BA1\u7406\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u304C\u6709\u52B9\u3067\u3042\u308B\u3079\u304D\u304B\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
admin-objects.jndi-name=\u7BA1\u7406\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306E JNDI \u540D\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
admin-objects.use-java-context=\u3053\u308C\u3092 false \u306B\u8A2D\u5B9A\u3059\u308B\u3068\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u304C\u30B0\u30ED\u30FC\u30D0\u30EB JNDI \u306B\u30D0\u30A4\u30F3\u30C9\u3055\u308C\u307E\u3059\u3002
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author Yamamoto Mie
resource-adapter=\u30EA\u30BD\u30FC\u30B9\u30A2\u30C0\u30D7\u30BF\u30FC\u306E\u8A2D\u5B9A\u3002
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author Yamamoto Mie
resource-adapter.add=\u65B0\u898F\u30EA\u30BD\u30FC\u30B9\u30A2\u30C0\u30D7\u30BF\u30FC\u3092\u8FFD\u52A0\u3002
resource-adapter.remove=\u30EA\u30BD\u30FC\u30B9\u30A2\u30C0\u30D7\u30BF\u30FC\u3092\u524A\u9664\u3002
resource-adapter.activate=\u30B5\u30FC\u30D0\u30FC\u3092\u518D\u30ED\u30FC\u30C9\u305B\u305A\u306B\u30EA\u30BD\u30FC\u30B9\u30A2\u30C0\u30D7\u30BF\u30FC\u306E\u8A2D\u5B9A\u3092\u5F37\u5236\u7684\u306B\u30A2\u30AF\u30C6\u30A3\u30D9\u30FC\u30C8\u3002
resource-adapter.admin-objects=\u3053\u306E\u30EA\u30BD\u30FC\u30B9\u30A2\u30C0\u30D7\u30BF\u30FC\u306E\u7BA1\u7406\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306E\u8A2D\u5B9A\u3002
resource-adapter.archive=\u30EA\u30BD\u30FC\u30B9\u30A2\u30C0\u30D7\u30BF\u30FC\u30A2\u30FC\u30AB\u30A4\u30D6\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
resource-adapter.module=\u30EA\u30BD\u30FC\u30B9\u30A2\u30C0\u30D7\u30BF\u30FC\u304C\u30ED\u30FC\u30C9\u3055\u308C\u308B\u30E2\u30B8\u30E5\u30FC\u30EB\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
resource-adapter.beanvalidationgroups=\u4F7F\u7528\u3059\u3079\u304D Bean \u691C\u8A3C\u30B0\u30EB\u30FC\u30D7\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
resource-adapter.bootstrap-context=\u4F7F\u7528\u3059\u3079\u304D\u30D6\u30FC\u30C8\u30B9\u30C8\u30E9\u30C3\u30D7\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u306E\u4E00\u610F\u540D\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
resource-adapter.connection-definitions=\u3053\u306E\u30EA\u30BD\u30FC\u30B9\u30A2\u30C0\u30D7\u30BF\u30FC\u306E\u63A5\u7D9A\u5B9A\u7FA9\u306E\u8A2D\u5B9A\u3002
resource-adapter.config-properties=\u30AB\u30B9\u30BF\u30E0\u5B9A\u7FA9\u3055\u308C\u305F\u8A2D\u5B9A\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u3002
resource-adapter.clear-statistics=\u3053\u306E\u30EA\u30BD\u30FC\u30B9\u306E\u7D71\u8A08\u5024\u3092\u6D88\u53BB\u3002
resource-adapter.transaction-support=\u30EA\u30BD\u30FC\u30B9\u30A2\u30C0\u30D7\u30BF\u30FC\u306E\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30B5\u30DD\u30FC\u30C8\u30EC\u30D9\u30EB\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author Yamamoto Mie
deployment-subsystem=\u30EA\u30BD\u30FC\u30B9\u30A2\u30C0\u30D7\u30BF\u30FC\u306E\u30E9\u30F3\u30BF\u30A4\u30E0\u60C5\u5831\u3002\u7D71\u8A08\u3084 ironjacamar.xml \u306B\u3088\u3063\u3066\u30A2\u30AF\u30C6\u30A3\u30D9\u30FC\u30C8\u3055\u308C\u308B resource-adapter \u60C5\u5831\u304A\u3088\u3073\u64CD\u4F5C\u304C\u542B\u307E\u308C\u307E\u3059\u3002
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author Yamamoto Mie
statistics=\u30EA\u30BD\u30FC\u30B9\u30A2\u30C0\u30D7\u30BF\u30FC\u306B\u3088\u308A\u63D0\u4F9B\u3055\u308C\u308B\u30E9\u30F3\u30BF\u30A4\u30E0\u7D71\u8A08
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author Yamamoto Mie
config-properties=\u30AB\u30B9\u30BF\u30E0\u5B9A\u7FA9\u3055\u308C\u305F\u8A2D\u5B9A\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u3002
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author Yamamoto Mie
config-properties.add=\u30AB\u30B9\u30BF\u30E0\u5B9A\u7FA9\u3055\u308C\u305F\u8A2D\u5B9A\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u3092\u8FFD\u52A0\u3002
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author Yamamoto Mie
config-properties.remove=\u30AB\u30B9\u30BF\u30E0\u5B9A\u7FA9\u3055\u308C\u305F\u8A2D\u5B9A\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u3092\u524A\u9664\u3002
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author Yamamoto Mie
config-properties.value=\u30AB\u30B9\u30BF\u30E0\u5B9A\u7FA9\u3055\u308C\u305F\u8A2D\u5B9A\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u306E\u5024\u3002
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author Yamamoto Mie
connection-definitions=\u63A5\u7D9A\u5B9A\u7FA9\u3092\u6307\u5B9A\u3002
connection-definitions.add=\u63A5\u7D9A\u5B9A\u7FA9\u3092\u8FFD\u52A0\u3002
connection-definitions.remove=\u63A5\u7D9A\u5B9A\u7FA9\u3092\u524A\u9664\u3002
connection-definitions.allocation-retry-wait-millis=allocation-retry-wait-millis \u8981\u7D20\u306F\u3001\u63A5\u7D9A\u306E\u5272\u308A\u5F53\u3066\u3092\u518D\u8A66\u884C\u3059\u308B\u307E\u3067\u306E\u5F85\u6A5F\u6642\u9593\u3092\u30DF\u30EA\u79D2\u3067\u6307\u5B9A\u3057\u307E\u3059\u3002
connection-definitions.allocation-retry=allocation-retry \u8981\u7D20\u306F\u3001\u4F8B\u5916\u3092\u30B9\u30ED\u30FC\u3059\u308B\u524D\u306B\u63A5\u7D9A\u5272\u308A\u5F53\u3066\u3092\u8A66\u884C\u3059\u308B\u56DE\u6570\u3092\u793A\u3057\u307E\u3059\u3002
connection-definitions.background-validation-millis=background-validation-millis \u8981\u7D20\u306F\u3001\u30D0\u30C3\u30AF\u30B0\u30E9\u30A6\u30F3\u30C9\u691C\u8A3C\u3092\u5B9F\u884C\u3059\u308B\u671F\u9593\u3092\u30DF\u30EA\u79D2\u3067\u6307\u5B9A\u3057\u307E\u3059\u3002\u3053\u306E\u5024\u306E\u5909\u66F4\u306B\u306F\u3001\u30B5\u30FC\u30D0\u30FC\u306E\u518D\u8D77\u52D5\u304C\u5FC5\u8981\u3068\u306A\u308A\u307E\u3059\u3002
connection-definitions.background-validation=\u4F7F\u7528\u524D\u306B\u691C\u8A3C\u305B\u305A\u306B\u30D0\u30C3\u30AF\u30B0\u30E9\u30A6\u30F3\u30C9\u306E\u30B9\u30EC\u30C3\u30C9\u4E0A\u3067\u63A5\u7D9A\u3092\u691C\u8A3C\u3059\u3079\u304D\u3067\u3042\u308B\u3053\u3068\u3092\u6307\u5B9A\u3059\u308B\u8981\u7D20\u3002\u3053\u306E\u5024\u3092\u5909\u66F4\u3059\u308B\u3068\u30B5\u30FC\u30D0\u30FC\u306E\u518D\u8D77\u52D5\u304C\u5FC5\u8981\u3068\u306A\u308A\u307E\u3059\u3002
connection-definitions.blocking-timeout-wait-millis=blocking-timeout-millis \u8981\u7D20\u306F\u3001\u63A5\u7D9A\u3092\u5F85\u3064\u9593\u30D6\u30ED\u30C3\u30AF\u3059\u308B\u6700\u5927\u6642\u9593\u3092\u30DF\u30EA\u79D2\u3067\u6307\u5B9A\u3057\u307E\u3059\u3002\u3053\u306E\u5024\u3092\u8D8A\u3048\u308B\u3068\u4F8B\u5916\u304C\u30B9\u30ED\u30FC\u3055\u308C\u307E\u3059\u3002\u63A5\u7D9A\u306E\u30ED\u30C3\u30AF\u3092\u5F85\u6A5F\u3059\u308B\u9593\u306E\u307F\u30D6\u30ED\u30C3\u30AF\u3092\u884C\u3044\u3001\u65B0\u898F\u63A5\u7D9A\u306E\u4F5C\u6210\u306B\u6642\u9593\u304C\u304B\u304B\u308A\u3059\u304E\u308B\u5834\u5408\u306F\u4F8B\u5916\u306F\u30B9\u30ED\u30FC\u3055\u308C\u306A\u3044\u3053\u3068\u306B\u6CE8\u610F\u3057\u3066\u304F\u3060\u3055\u3044\u3002
connection-definitions.class-name=\u7BA1\u7406\u3055\u308C\u305F\u63A5\u7D9A\u30D5\u30A1\u30AF\u30C8\u30EA\u307E\u305F\u306F\u7BA1\u7406\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306E\u5B8C\u5168\u4FEE\u98FE\u30AF\u30E9\u30B9\u540D\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
connection-definitions.config-properties=\u30AB\u30B9\u30BF\u30E0\u5B9A\u7FA9\u3055\u308C\u305F\u8A2D\u5B9A\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u3002
connection-definitions.enabled=\u30EA\u30BD\u30FC\u30B9\u30A2\u30C0\u30D7\u30BF\u30FC\u3092\u6709\u52B9\u306B\u3059\u308B\u3079\u304D\u304B\u6307\u5B9A\u3057\u307E\u3059\u3002
connection-definitions.flush-all-connection-in-pool=\u30D7\u30FC\u30EB\u306E\u63A5\u7D9A\u3092\u3059\u3079\u3066\u30D5\u30E9\u30C3\u30B7\u30E5\u3057\u307E\u3059\u3002
connection-definitions.flush-idle-connection-in-pool=\u30D7\u30FC\u30EB\u306E\u30A2\u30A4\u30C9\u30EB\u72B6\u614B\u306E\u63A5\u7D9A\u3092\u3059\u3079\u3066\u30D5\u30E9\u30C3\u30B7\u30E5\u3057\u307E\u3059\u3002
connection-definitions.flush-strategy=\u30A8\u30E9\u30FC\u6642\u306B\u3069\u306E\u3088\u3046\u306B\u30D7\u30FC\u30EB\u3092\u30D5\u30E9\u30C3\u30B7\u30E5\u3059\u308B\u304B\u6307\u5B9A\u3057\u307E\u3059\u3002\u6709\u52B9\u306A\u5024\u306F FailingConnectionOnly (\u30C7\u30D5\u30A9\u30EB\u30C8)\u3001IdleConnections\u3001EntirePool \u3067\u3059\u3002
connection-definitions.idle-timeout-minutes=idle-timeout-minutes \u8981\u7D20\u306F\u3001\u63A5\u7D9A\u304C\u9589\u3058\u3089\u308C\u308B\u524D\u306B\u30A2\u30A4\u30C9\u30EB\u72B6\u614B\u3092\u4FDD\u3064\u6700\u5927\u6642\u9593\u3092\u5206\u5358\u4F4D\u3067\u6307\u5B9A\u3057\u307E\u3059\u3002\u5B9F\u969B\u306E\u6700\u5927\u6642\u9593\u306F IdleRemover \u306E\u30B9\u30AD\u30E3\u30F3\u6642\u9593\u306B\u3088\u3063\u3066\u3082\u7570\u306A\u308A\u307E\u3059\u3002\u3053\u306E IdleRemover \u306E\u30B9\u30AD\u30E3\u30F3\u6642\u9593\u306F\u3001\u30D7\u30FC\u30EB\u306E\u6700\u3082\u5C0F\u3055\u3044 idle-timeout-minutes \u5024\u306E\u534A\u5206\u3068\u306A\u308A\u307E\u3059\u3002\u3053\u306E\u5024\u3092\u5909\u66F4\u3059\u308B\u3068\u30B5\u30FC\u30D0\u30FC\u306E\u518D\u8D77\u52D5\u304C\u5FC5\u8981\u3068\u306A\u308A\u307E\u3059\u3002
connection-definitions.jndi-name=\u63A5\u7D9A\u30D5\u30A1\u30AF\u30C8\u30EA\u306E JNDI \u540D\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
connection-definitions.interleaving=XA \u63A5\u7D9A\u306E\u30A4\u30F3\u30BF\u30FC\u30EA\u30FC\u30D6\u3092\u6709\u52B9\u306B\u3059\u308B\u8981\u7D20\u3002
connection-definitions.max-pool-size=max-pool-size \u8981\u7D20\u306F\u3001\u30D7\u30FC\u30EB\u306E\u6700\u5927\u63A5\u7D9A\u6570\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002\u5404\u30B5\u30D6\u30D7\u30FC\u30EB\u306B\u306F\u3001\u65B0\u898F\u63A5\u7D9A\u306F\u3053\u308C\u4EE5\u4E0A\u4F5C\u6210\u3055\u308C\u307E\u305B\u3093\u3002
connection-definitions.min-pool-size=max-pool-size \u8981\u7D20\u306F\u3001\u30D7\u30FC\u30EB\u306E\u6700\u5C0F\u63A5\u7D9A\u6570\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
connection-definitions.no-recovery=\u63A5\u7D9A\u30D7\u30FC\u30EB\u3092\u30EA\u30AB\u30D0\u30EA\u30FC\u304B\u3089\u9664\u5916\u3059\u3079\u304D\u3067\u3042\u308B\u304B\u3069\u3046\u304B\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
connection-definitions.no-tx-separate-pool=Oracle \u3067\u306F JTA \u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u5185\u5916\u3092\u554F\u308F\u305A\u3001XA \u63A5\u7D9A\u306E\u4F7F\u7528\u306F\u9069\u3057\u3066\u3044\u307E\u305B\u3093\u3002\u3053\u306E\u554F\u984C\u3092\u56DE\u907F\u3059\u308B\u306B\u306F\u3001\u7570\u306A\u308B\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u306B\u5BFE\u3057\u3066\u5225\u306E\u30B5\u30D6\u30D7\u30FC\u30EB\u3092\u4F5C\u6210\u3057\u3066\u304F\u3060\u3055\u3044\u3002
connection-definitions.pad-xid=Xid \u3092\u57CB\u3081\u8FBC\u3080\u3079\u304D\u304B
connection-definitions.password=\u65B0\u3057\u3044\u63A5\u7D9A\u306E\u4F5C\u6210\u6642\u306B\u4F7F\u7528\u3055\u308C\u308B\u30D1\u30B9\u30EF\u30FC\u30C9\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
connection-definitions.pool-name=\u7BA1\u7406\u76EE\u7684\u3067\u4F7F\u7528\u3055\u308C\u308B\u30C7\u30FC\u30BF\u30BD\u30FC\u30B9\u306E\u30D7\u30FC\u30EB\u540D\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
connection-definitions.pool-prefill=\u30D7\u30FC\u30EB\u3092\u4E8B\u524D\u5165\u529B\u3059\u3079\u304D\u304B\u3002\u3053\u306E\u5024\u3092\u5909\u66F4\u3059\u308B\u3068\u30B5\u30FC\u30D0\u30FC\u306E\u518D\u8D77\u52D5\u304C\u5FC5\u8981\u3068\u306A\u308A\u307E\u3059\u3002
connection-definitions.pool-use-strict-min=min-pool-size \u3092\u53B3\u5BC6\u306B\u8003\u616E\u3059\u3079\u304D\u304B\u3069\u3046\u304B\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
connection-definitions.query-timeout=\u8A2D\u5B9A\u6E08\u307F\u306E\u30AF\u30A8\u30EA\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8 (\u79D2\u5358\u4F4D)\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u3067\u306F\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u306E\u8A2D\u5B9A\u306F\u3042\u308A\u307E\u305B\u3093\u3002
connection-definitions.recovery-password=\u30EA\u30AB\u30D0\u30EA\u30FC\u306B\u4F7F\u7528\u3055\u308C\u308B\u30D1\u30B9\u30EF\u30FC\u30C9\u3002
connection-definitions.recovery-plugin-class-name=\u30EA\u30AB\u30D0\u30EA\u30FC\u30D7\u30E9\u30B0\u30A4\u30F3\u5B9F\u88C5\u306E\u5B8C\u5168\u4FEE\u98FE\u30AF\u30E9\u30B9\u540D\u3002
connection-definitions.recovery-plugin-properties=\u30EA\u30AB\u30D0\u30EA\u30FC\u30D7\u30E9\u30B0\u30A4\u30F3\u306E\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u3002
connection-definitions.recovery-security-domain=\u30EA\u30AB\u30D0\u30EA\u30FC\u306B\u4F7F\u7528\u3055\u308C\u308B\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30C9\u30E1\u30A4\u30F3\u3002
connection-definitions.recovery-username=\u30EA\u30AB\u30D0\u30EA\u30FC\u306B\u4F7F\u7528\u3055\u308C\u308B\u30E6\u30FC\u30B6\u30FC\u540D\u3002
connection-definitions.same-rm-override=is-same-rm-override \u8981\u7D20\u306B\u3088\u308A\u3001javax.transaction.xa.XAResource.isSameRM(XAResource) \u304C true \u307E\u305F\u306F false \u3092\u8FD4\u3059\u304B\u3069\u3046\u304B\u3092\u7121\u6761\u4EF6\u306B\u8A2D\u5B9A\u3067\u304D\u307E\u3059\u3002
connection-definitions.security-application=\u30D7\u30FC\u30EB\u306E\u63A5\u7D9A\u3092\u533A\u5225\u3059\u308B\u305F\u3081\u3001\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u63D0\u4F9B\u306E\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC (getConnection(user, pw) \u304B\u3089\u306E\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306A\u3069) \u304C\u4F7F\u7528\u3055\u308C\u308B\u3053\u3068\u3092\u793A\u3057\u307E\u3059\u3002
connection-definitions.security-domain=\u30D7\u30FC\u30EB\u306E\u63A5\u7D9A\u3092\u533A\u5225\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u308B javax.security.auth.Subject \u3092\u5B9A\u7FA9\u3059\u308B\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30C9\u30E1\u30A4\u30F3\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
connection-definitions.security-domain-and-application=\u30D7\u30FC\u30EB\u306E\u63A5\u7D9A\u3092\u533A\u5225\u3059\u308B\u305F\u3081\u3001\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u63D0\u4F9B\u306E\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC (getConnection(user, pw) \u304B\u3089\u306E\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u306A\u3069) \u304B Subject (\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30C9\u30E1\u30A4\u30F3\u304B\u3089) \u306E\u3069\u3061\u3089\u304B\u304C\u4F7F\u7528\u3055\u308C\u308B\u3053\u3068\u3092\u793A\u3057\u307E\u3059\u3002
connection-definitions.set-tx-query-timeout=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u304C\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u3059\u308B\u307E\u3067\u306E\u6B8B\u308A\u6642\u9593\u3092\u57FA\u306B\u3057\u3066\u30AF\u30A8\u30EA\u306E\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u3092\u8A2D\u5B9A\u3059\u308B\u304B\u3069\u3046\u304B\u3002\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u304C\u306A\u3044\u5834\u5408\u306F\u3001\u8A2D\u5B9A\u3055\u308C\u305F\u30AF\u30A8\u30EA\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u304C\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002
connection-definitions.test-connection-in-pool=\u63A5\u7D9A\u304C\u53D6\u5F97\u53EF\u80FD\u304B\u30C6\u30B9\u30C8\u3057\u307E\u3059\u3002
connection-definitions.use-ccm=\u30AD\u30E3\u30C3\u30B7\u30E5\u6E08\u307F\u63A5\u7D9A\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u306E\u4F7F\u7528\u3092\u6709\u52B9\u306B\u3057\u307E\u3059\u3002
connection-definitions.use-fast-fail=\u7121\u52B9\u306A\u5834\u5408\u306B\u521D\u56DE\u8A66\u884C\u3067\u63A5\u7D9A\u5272\u308A\u5F53\u3066\u3092\u5931\u6557\u3055\u305B\u308B\u304B (true)\u3001\u30D7\u30FC\u30EB\u306E\u6F5C\u5728\u7684\u306A\u63A5\u7D9A\u3092\u3059\u3079\u3066\u4F7F\u3044\u679C\u305F\u3059\u307E\u3067\u8A66\u884C\u3057\u7D9A\u3051\u308B\u304B (false)\u3002
connection-definitions.use-java-context=\u3053\u308C\u3092 false \u306B\u8A2D\u5B9A\u3059\u308B\u3068\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u304C\u30B0\u30ED\u30FC\u30D0\u30EB JNDI \u306B\u30D0\u30A4\u30F3\u30C9\u3055\u308C\u307E\u3059\u3002
connection-definitions.use-try-lock=\u30EA\u30BD\u30FC\u30B9\u30A2\u30C0\u30D7\u30BF\u30FC\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306E\u5185\u90E8\u30ED\u30C3\u30AF\u306B\u5BFE\u3057\u3066\u8A2D\u5B9A\u3055\u308C\u305F\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8 (\u79D2\u5358\u4F4D)\u3002
connection-definitions.wrap-xa-resource=XAResource \u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u304C org.jboss.tm.XAResourceWrapper \u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u3067\u30E9\u30C3\u30D7\u3055\u308C\u308B\u3079\u304D\u304B
connection-definitions.xa-resource-timeout=\u3053\u306E\u5024\u306F XAResource.setTransactionTimeout() \u3078\u6E21\u3055\u308C\u307E\u3059 (\u79D2\u5358\u4F4D)\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u306F 0 \u3067\u3059\u3002
