resource-adapters-subsystem=O sub-sistema dos adaptadores de recurso, usado para declarar as implanta\u00E7\u00F5es do adaptador de recurso
resource-adapters=Configura\u00E7\u00E3o do sub-sistema dos adaptadores de recurso
resource-adapters.add=Adiciona o sub-sistema dos adaptadores de recurso
resource-adapters.remove=Remove o sub-sistema dos adaptadores de recurso
resource-adapter=A configura\u00E7\u00E3o do adaptador do recurso
ironjacamar=Modelo representando os adaptadores de recurso ativados pelo arquivo ironjacamar.xml dentro do rar
resource-adapter.add=Adiciona um novo adaptador de recurso
resourceadapter.remove=Remove o adaptador de recurso
resourceadapter.activate=For\u00E7a a ativa\u00E7\u00E3o config do adaptador de recurso sem recarregar o servidor
deployment-subsystem=A informa\u00E7\u00E3o do per\u00EDodo de rodagem para os adaptadores de recurso. Isto cont\u00E9m estat\u00EDsticas e opera\u00E7\u00F5es e  informa\u00E7\u00E3o do adaptador de recurso ativado  ironjacamar.xml.\n
resourceadapter.flush-idle-connection-in-pool=Esvazia todas as conex\u00F5es ociosas no pool
resourceadapter.flush-all-connection-in-pool=Esvazia todas as conex\u00F5es no pool
resourceadapter.test-connection-in-pool=Testa se a conex\u00E3o pode ser obtida
resourceadapter.clear-statistics=Limpa todos os valores de estat\u00EDsticas para esse recurso
config-properties=Propriedades personalizadas config definidas
config-properties.add=Adiciona uma propriedade personalizada config definida 
config-properties.remove=Remove a propriedade personalizada config definida
config-properties.value=Valor da propriedade personalizada config definida
connection-definitions=Especifica as defini\u00E7\u00F5es da conex\u00E3o
connection-definition=Especifica a defini\u00E7\u00E3o da conex\u00E3o
connection-definition.add=Adiciona a defini\u00E7\u00E3o da conex\u00E3o
connection-definition.remove=Remove a defini\u00E7\u00E3o da conex\u00E3o
admin-objects=Especifica os objetos de administra\u00E7\u00E3o
admin-object=Especifica um objeto de administra\u00E7\u00E3o
admin-object.add=Adiciona o objeto de administra\u00E7\u00E3o
admin-object.remove=Remove o objeto de administra\u00E7\u00E3o
allocation-retry-wait-millis=A nova tentativa de aloca\u00E7\u00E3o espera mil\u00E9simos de segundo pelo elemento especificar a quantia de tempo de espera entre a nova tentativa em alocar uma conex\u00E3o
allocation-retry=O elemento de nova tentativa de aloca\u00E7\u00E3o indica o n\u00FAmero de vezes que a aloca\u00E7\u00E3o de uma conex\u00E3o deve ser tentada antes de lan\u00E7ar uma exce\u00E7\u00E3o
archive=Especifica o arquivo do adaptador de recurso
background-validation-millis=O elemento background-validation-millis especifica a quantia de tempo, em mil\u00E9simos de segundos, que a valida\u00E7\u00E3o do plano de fundo ser\u00E1 rodada. A altera\u00E7\u00E3o deste valor requer a re-inicializa\u00E7\u00E3o do servidor
background-validation=Um elemento a ser especificado que as conex\u00F5es devem validar no thread do plano de fundo versus sendo validadas antes do uso. A altera\u00E7\u00E3o deste valor requer a re-inicializa\u00E7\u00E3o do servidor
beanvalidationgroups=Especifica os grupos de valida\u00E7\u00E3o do bean que devem ser usados
blocking-timeout-wait-millis=O elemento blocking-timeout-millis especifica o per\u00EDodo m\u00E1ximo, em mil\u00E9simos de segundos, para bloqueio enquanto esperando por uma conex\u00E3o antes de lan\u00E7ar uma exce\u00E7\u00E3o. Perceba que esse bloqueio ocorre apenas na espera de uma conex\u00E3o, e n\u00E3o ser\u00E1 lan\u00E7ada uma exce\u00E7\u00E3o caso a cria\u00E7\u00E3o de uma nova conex\u00E3o leve um tempo consider\u00E1vel 
bootstrap-context=Especifiica o nome \u00FAnico do contexto bootstrap que deve ser usado.
class-name=Especifica o nome da classe qualificada de uma cria\u00E7\u00E3o da conex\u00E3o gerenciada ou objeto admin
enabled=Especifica se o adaptador de recurso deve ser ativado
flush-strategy=Especifica como o pool deve ser esvaziado no caso de um erro. Os valores v\u00E1lidos s\u00E3o\: FailingConnectionOnly (default), IdleConnections e EntirePool
idle-timeout-minutes=Os elementos idle-timeout-minutes especificam o per\u00EDodo m\u00E1ximo, em minutos, que uma conex\u00E3o pode ficar ociosa antes de ser encerrada. O per\u00EDodo m\u00E1ximo atual depende do per\u00EDodo de verifica\u00E7\u00E3o do idle-timeout-minutes, que \u00E9 metade do menor valor de qualquer pool. A altera\u00E7\u00E3o desse valor requer a re-inicializa\u00E7\u00E3o do servidor.
interleaving=Um elemento para ativar a intercala\u00E7\u00E3o das conex\u00F5es XA
jndi-name=Especifica o nome JNDI para a cria\u00E7\u00E3o da conex\u00E3o ou objeto admin
max-pool-size=O elemento max-pool-size especifica o n\u00FAmero m\u00E1ximo de conex\u00F5es para um pool. N\u00E3o ser\u00E3o mais criadas conex\u00F5es em cada sub-pool
min-pool-size=O elemento min-pool-size especifica o n\u00FAmero m\u00EDnimo de conex\u00F5es para um pool
no-tx-separate-pool=O Oracle n\u00E3o gosta das conex\u00F5es XA usadas tanto dentro como fora da transa\u00E7\u00E3o JTA. Voc\u00EA pode criar sub-pools separados para contextos diferentes como solu\u00E7\u00E3o para este problema
pad-xid=No caso do Xid ser preenchido
password=Especifica a senha usada quando criando uma nova conex\u00E3o
pool-name=Especifica o nome do pool para a fonte de dados usada para gerenciamento
pool-prefill=No caso do pool ser pr\u00E9-preenchido. A altera\u00E7\u00E3o deste valor requer a re-inicializa\u00E7\u00E3o do servidor
pool-use-strict-min=Especifica se o min-pool-size deve ser considerado rigorosamente
query-timeout=Qualquer intervalo de fila configurada em segundos. O padr\u00E3o \u00E9 nenhum intervalo
same-rm-override=O elemento is-same-rm-override permite o conjunto incondicional se \u00E9 que o javax.transaction.xa.XAResource.isSameRM(XAResource) retorna verdadeiro ou falso
security-application=Indica se os par\u00E2metros fornecidos app (tais como getConnection(user, pw)) s\u00E3o usados para distinguir conex\u00F5es no pool
security-domain=Especifica o dom\u00EDnio de seguran\u00E7a que define o javax.security.auth.Subject que \u00E9 usado para distinguir as conex\u00F5es no pool
security-domain-and-application=Indica que tanto os par\u00E2metros fornecidos (tais como getConnection(user, pw)) ou Sujeito (a partir do dom\u00EDnio de seguran\u00E7a) s\u00E3o usados para distinguir conex\u00F5es no pool
set-tx-query-timeout=Se \u00E9 que determinar o intervalo de consulta baseado no per\u00EDodo restante at\u00E9 que a transa\u00E7\u00E3o entre em intervalo. Qualquer intervalo de consulta configurado ser\u00E1 usado caso n\u00E3o haja transa\u00E7\u00E3o
transaction-support=Especifica o n\u00EDvel de suporte da transa\u00E7\u00E3o do adaptador de recurso
use-ccm=Ativa o uso de um gerenciador de conex\u00E3o com cache
use-fast-fail=Se \u00E9 que falhar uma aloca\u00E7\u00E3o de conex\u00E3o na primeira tentativa, caso ela seja inv\u00E1lida (verdadeira) ou continuar tentando at\u00E9 que o pool seja esgotado de todas as conex\u00F5es potenciais (falso)
use-java-context=A configura\u00E7\u00E3o disto para falso aplicar\u00E1 o bind no objeto ao JNDL global
use-try-lock=Qualquer intervalo configurado para bloqueios internos nos objetos do adaptador de recurso em segundos
user-name=Especifica o nome do usu\u00E1rio usado quando criando uma nova conex\u00E3o
wrap-xa-resource=No caso das inst\u00E2ncias XAResource serem envolvidas na inst\u00E2ncia org.jboss.tm.XAResourceWrapper
xa-resource-timeout=O valor \u00E9 passado ao XAResource.setTransactionTimeout(), em segundos. O padr\u00E3o \u00E9 zero
statistics=As estat\u00EDsticas fornecidas pelo adaptador de recurso.
recovery-username=O nome do usu\u00E1rio usado para recupera\u00E7\u00E3o
recovery-password=A senha usada para recupera\u00E7\u00E3o
recovery-security-domain=O dom\u00EDnio de seguran\u00E7a usado para recupera\u00E7\u00E3o
recovery-plugin-class-name=O nome de classe inteiramente qualificado da implanta\u00E7\u00E3o plugin de recupera\u00E7\u00E3o
recovery-plugin-properties=As propriedades do plugin de recupera\u00E7\u00E3o
no-recovery=Especifica se o pool de conex\u00E3o deve ser exclu\u00EDdo da recupera\u00E7\u00E3o
