resource-adapters-subsystem=\u30EA\u30BD\u30FC\u30B9\u30A2\u30C0\u30D7\u30BF\u30FC\u306E\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u3092\u5BA3\u8A00\u3059\u308B\u969B\u306B\u5229\u7528\u3059\u308B\u30EA\u30BD\u30FC\u30B9\u30A2\u30C0\u30D7\u30BF\u30FC\u306E\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0
resource-adapters=\u30EA\u30BD\u30FC\u30B9\u30A2\u30C0\u30D7\u30BF\u30FC\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u306E\u8A2D\u5B9A
resource-adapters.add=\u30EA\u30BD\u30FC\u30B9\u30A2\u30C0\u30D7\u30BF\u30FC\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u306E\u8FFD\u52A0
resource-adapters.remove=\u30EA\u30BD\u30FC\u30B9\u30A2\u30C0\u30D7\u30BF\u30FC\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u306E\u524A\u9664
resource-adapter=\u30EA\u30BD\u30FC\u30B9\u30A2\u30C0\u30D7\u30BF\u30FC\u306E\u8A2D\u5B9A
resource-adapter.add=\u65B0\u898F\u30EA\u30BD\u30FC\u30B9\u30A2\u30C0\u30D7\u30BF\u30FC\u306E\u8FFD\u52A0
resourceadapter.remove=\u30EA\u30BD\u30FC\u30B9\u30A2\u30C0\u30D7\u30BF\u30FC\u306E\u524A\u9664
resourceadapter.activate=\u30B5\u30FC\u30D0\u30FC\u306E\u518D\u8AAD\u307F\u8FBC\u307F\u306A\u3057\u306B\u30EA\u30BD\u30FC\u30B9\u30A2\u30C0\u30D7\u30BF\u30FC\u306E\u8A2D\u5B9A\u3092\u5F37\u5236\u7684\u306B\u6709\u52B9\u5316
resourceadapter.flush-idle-connection-in-pool=\u30D7\u30FC\u30EB\u5185\u306E\u5168\u30A2\u30A4\u30C9\u30EB\u63A5\u7D9A\u3092\u30D5\u30E9\u30C3\u30B7\u30E5
resourceadapter.flush-all-connection-in-pool=\u30D7\u30FC\u30EB\u5185\u306E\u5168\u63A5\u7D9A\u3092\u30D5\u30E9\u30C3\u30B7\u30E5
resourceadapter.test-connection-in-pool=\u63A5\u7D9A\u53D6\u5F97\u53EF\u80FD\u304B\u3092\u30C6\u30B9\u30C8
resourceadapter.clear-statistics=\u3053\u306E\u30EA\u30BD\u30FC\u30B9\u306B\u5BFE\u3059\u308B\u7D71\u8A08\u5024\u3092\u6D88\u53BB
config-properties=\u30AB\u30B9\u30BF\u30E0\u5B9A\u7FA9\u3055\u308C\u305F\u8A2D\u5B9A\u30D7\u30ED\u30D1\u30C6\u30A3
config-properties.add=\u30AB\u30B9\u30BF\u30E0\u5B9A\u7FA9\u3055\u308C\u305F\u8A2D\u5B9A\u30D7\u30ED\u30D1\u30C6\u30A3\u306E\u8FFD\u52A0
config-properties.remove=\u30AB\u30B9\u30BF\u30E0\u5B9A\u7FA9\u3055\u308C\u305F\u8A2D\u5B9A\u30D7\u30ED\u30D1\u30C6\u30A3\u306E\u524A\u9664
config-properties.value=\u30AB\u30B9\u30BF\u30E0\u5B9A\u7FA9\u3055\u308C\u305F\u8A2D\u5B9A\u30D7\u30ED\u30D1\u30C6\u30A3\u306E\u5024
connection-definitions=\u63A5\u7D9A\u5B9A\u7FA9\u306E\u6307\u5B9A
connection-definition=\u63A5\u7D9A\u5B9A\u7FA9\u306E\u6307\u5B9A
connection-definition.add=\u63A5\u7D9A\u5B9A\u7FA9\u306E\u8FFD\u52A0
connection-definition.remove=\u63A5\u7D9A\u5B9A\u7FA9\u306E\u524A\u9664
admin-objects=\u7BA1\u7406\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306E\u6307\u5B9A
admin-object=\u7BA1\u7406\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306E\u6307\u5B9A
admin-object.add=\u7BA1\u7406\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306E\u8FFD\u52A0
admin-object.remove=\u7BA1\u7406\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306E\u524A\u9664
allocation-retry-wait-millis=allocation-retry-wait-millis \u8981\u7D20\u306F\u3001\u63A5\u7D9A\u306E\u5272\u308A\u5F53\u3066\u3092\u518D\u8A66\u884C\u3059\u308B\u307E\u3067\u306E\u5F85\u6A5F\u6642\u9593\u3092\u30DF\u30EA\u79D2\u3067\u6307\u5B9A\u3057\u307E\u3059\u3002
allocation-retry=allocation-retry \u8981\u7D20\u306F\u3001\u4F8B\u5916\u3092\u9001\u51FA\u3059\u308B\u524D\u306B\u63A5\u7D9A\u5272\u308A\u5F53\u3066\u3092\u8A66\u884C\u3059\u308B\u56DE\u6570\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002 
archive=\u30EA\u30BD\u30FC\u30B9\u30A2\u30C0\u30D7\u30BF\u30FC\u306E\u30A2\u30FC\u30AB\u30A4\u30D6\u3092\u6307\u5B9A
background-validation-millis=background-validation-millis \u8981\u7D20\u306F\u3001\u30D0\u30C3\u30AF\u30B0\u30E9\u30A6\u30F3\u30C9\u691C\u8A3C\u3092\u5B9F\u884C\u3059\u308B\u6642\u9593\u3092\u30DF\u30EA\u79D2\u3067\u6307\u5B9A\u3057\u307E\u3059\u3002\u3053\u306E\u5024\u3092\u5909\u66F4\u3059\u308B\u3068\u30B5\u30FC\u30D0\u30FC\u306E\u518D\u8D77\u52D5\u304C\u5FC5\u8981\u3068\u306A\u308A\u307E\u3059\u3002
background-validation=\u4F7F\u7528\u524D\u306B\u691C\u8A3C\u3059\u308B\u306E\u3067\u306F\u306A\u304F\u30D0\u30C3\u30AF\u30B0\u30E9\u30A6\u30F3\u30C9\u306E\u30B9\u30EC\u30C3\u30C9\u4E0A\u3067\u63A5\u7D9A\u306E\u691C\u8A3C\u3092\u884C\u3046\u3079\u304D\u3060\u3068\u6307\u5B9A\u3059\u308B\u8981\u7D20\u3002\u3053\u306E\u5024\u3092\u5909\u66F4\u3059\u308B\u3068\u30B5\u30FC\u30D0\u30FC\u306E\u518D\u8D77\u52D5\u304C\u5FC5\u8981\u3068\u306A\u308A\u307E\u3059\u3002
beanvalidationgroups=\u5229\u7528\u3059\u3079\u304D bean \u691C\u8A3C\u30B0\u30EB\u30FC\u30D7\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
blocking-timeout-wait-millis=blocking-timeout-millis \u8981\u7D20\u306F\u3001\u4F8B\u5916\u9001\u51FA\u307E\u3067\u306E\u5F85\u6A5F\u4E2D\u306B\u30D6\u30ED\u30C3\u30AF\u3059\u308B\u6700\u5927\u6642\u9593\u3092\u30DF\u30EA\u79D2\u3067\u6307\u5B9A\u3057\u307E\u3059\u3002\u63A5\u7D9A\u306E\u30ED\u30C3\u30AF\u3092\u5F85\u6A5F\u3059\u308B\u9593\u306E\u307F\u30D6\u30ED\u30C3\u30AF\u3092\u884C\u3044\u3001\u65B0\u898F\u63A5\u7D9A\u306E\u4F5C\u6210\u306B\u7570\u5E38\u306B\u6642\u9593\u3092\u8981\u3059\u308B\u5834\u5408\u306B\u306F\u4F8B\u5916\u306F\u9001\u51FA\u3055\u308C\u307E\u305B\u3093\u3002
bootstrapcontext=\u5229\u7528\u3059\u3079\u304D\u30D6\u30FC\u30C8\u30B9\u30C8\u30E9\u30C3\u30D7\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u306E\u4E00\u610F\u540D\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
class-name=\u7BA1\u7406\u63A5\u7D9A\u30D5\u30A1\u30AF\u30C8\u30EA\u3042\u308B\u3044\u306F\u7BA1\u7406\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306E\u5B8C\u5168\u4FEE\u98FE\u540D\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
enabled=\u30EA\u30BD\u30FC\u30B9\u30A2\u30C0\u30D7\u30BF\u30FC\u3092\u6709\u52B9\u5316\u3059\u3079\u304D\u304B\u6307\u5B9A\u3057\u307E\u3059\u3002
flush-strategy=\u30A8\u30E9\u30FC\u6642\u306B\u3069\u306E\u3088\u3046\u306B\u30D7\u30FC\u30EB\u3092\u30D5\u30E9\u30C3\u30B7\u30E5\u3059\u308B\u304B\u6307\u5B9A\u3002\u6709\u52B9\u306A\u5024\u306F\: FailingConnectionOnly (default)\u3001IdleConnections\u3001EntirePool \u3067\u3059\u3002
idle-timeout-minutes=idle-timeout-minutes \u8981\u7D20\u306F\u3001\u63A5\u7D9A\u304C\u9589\u3058\u3089\u308C\u308B\u524D\u306B\u30A2\u30A4\u30C9\u30EB\u3092\u4FDD\u3064\u6700\u5927\u6642\u9593\u3092\u5206\u5358\u4F4D\u3067\u6307\u5B9A\u3057\u307E\u3059\u3002\u5B9F\u969B\u306E\u6700\u5927\u6642\u9593\u306F IdleRemover \u306E\u30B9\u30AD\u30E3\u30F3\u6642\u9593\u306B\u3088\u3063\u3066\u3082\u5909\u5316\u3057\u307E\u3059\u3002\u3053\u306E IdleRemover \u306E\u30B9\u30AD\u30E3\u30F3\u6642\u9593\u306F\u3001\u30D7\u30FC\u30EB\u306E idle-timeout-minutes \u306E\u4E2D\u3067\u6700\u5C0F\u3068\u306A\u308B\u5024\u306E\u534A\u5206\u3068\u306A\u3063\u3066\u3044\u307E\u3059\u3002\u3053\u306E\u5024\u3092\u5909\u66F4\u3059\u308B\u3068\u30B5\u30FC\u30D0\u30FC\u306E\u518D\u8D77\u52D5\u304C\u5FC5\u8981\u3068\u306A\u308A\u307E\u3059\u3002
interleaving=XA \u63A5\u7D9A\u306E\u30A4\u30F3\u30BF\u30FC\u30EA\u30FC\u30D6\u3092\u6709\u52B9\u306B\u3059\u308B\u8981\u7D20
jndi-name=\u63A5\u7D9A\u30D5\u30A1\u30AF\u30C8\u30EA\u3042\u308B\u3044\u306F\u7BA1\u7406\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306E JNDI \u540D\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
max-pool-size=max-pool-size \u8981\u7D20\u306F\u3001\u30D7\u30FC\u30EB\u6BCE\u306E\u6700\u5927\u63A5\u7D9A\u6570\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002\u5404\u30B5\u30D6\u30D7\u30FC\u30EB\u306B\u306F\u3001\u65B0\u898F\u63A5\u7D9A\u306F\u3053\u308C\u4EE5\u4E0A\u4F5C\u6210\u3055\u308C\u307E\u305B\u3093\u3002
min-pool-size=max-pool-size \u8981\u7D20\u306F\u3001\u30D7\u30FC\u30EB\u6BCE\u306E\u6700\u5C0F\u63A5\u7D9A\u6570\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
no-tx-separate-pool=Oracle \u3067\u306F JTA \u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u5185\u5916\u3092\u554F\u308F\u305A\u3001XA \u63A5\u7D9A\u306E\u5229\u7528\u306F\u9069\u3057\u3066\u3044\u307E\u305B\u3093\u3002\u3053\u306E\u554F\u984C\u3092\u56DE\u907F\u3059\u308B\u306B\u306F\u3001\u69D8\u3005\u306A\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u306B\u5BFE\u3057\u3066\u5225\u306E\u30B5\u30D6\u30D7\u30FC\u30EB\u3092\u4F5C\u6210\u3057\u3066\u304F\u3060\u3055\u3044\u3002
pad-xid=Xid \u3092\u57CB\u3081\u8FBC\u3080\u3079\u304D\u304B
password=\u65B0\u898F\u63A5\u7D9A\u306E\u4F5C\u6210\u6642\u306B\u4F7F\u3046\u30D1\u30B9\u30EF\u30FC\u30C9\u3092\u6307\u5B9A
pool-name=\u7BA1\u7406\u306B\u5229\u7528\u3059\u308B\u30C7\u30FC\u30BF\u30BD\u30FC\u30B9\u306E\u30D7\u30FC\u30EB\u540D\u3092\u6307\u5B9A
pool-prefill=\u30D7\u30FC\u30EB\u3092\u4E8B\u524D\u5165\u529B\u3059\u3079\u304D\u304B\u3002\u3053\u306E\u5024\u3092\u5909\u66F4\u3059\u308B\u3068\u30B5\u30FC\u30D0\u30FC\u306E\u518D\u8D77\u52D5\u304C\u5FC5\u8981\u3068\u306A\u308A\u307E\u3059\u3002
pool-use-strict-min=min-pool-size \u3092\u53B3\u5BC6\u306B\u8003\u616E\u3059\u3079\u304D\u304B\u6307\u5B9A\u3057\u307E\u3059\u3002
query-timeout=\u8A2D\u5B9A\u6E08\u307F\u306E\u30AF\u30A8\u30EA\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8 (\u79D2\u5358\u4F4D)\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u306F no timeout \u3067\u3059\u3002
same-rm-override=is-same-rm-override \u8981\u7D20\u306B\u3088\u308A\u3001javax.transaction.xa.XAResource.isSameRM(XAResource) \u304C true \u304B false \u3092\u8FD4\u3059\u304B\u3069\u3046\u304B\u3092\u7121\u6761\u4EF6\u306B\u8A2D\u5B9A\u3067\u304D\u308B\u3088\u3046\u306B\u306A\u308A\u307E\u3059\u3002
security-application=app \u63D0\u4F9B\u306E\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC (getConnection(user, pw) \u304B\u3089\u306E\u3082\u306E\u306A\u3069) \u3092\u4F7F\u3044\u30D7\u30FC\u30EB\u5185\u306E\u63A5\u7D9A\u3092\u533A\u5225\u3059\u308B\u3088\u3046\u6307\u5B9A\u3057\u307E\u3059\u3002
security-domain=javax.security.auth.Subject \u3092\u5B9A\u7FA9\u3059\u308B\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30C9\u30E1\u30A4\u30F3\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002javax.security.auth.Subject \u306F\u30D7\u30FC\u30EB\u5185\u306E\u63A5\u7D9A\u3092\u533A\u5225\u3059\u308B\u306E\u306B\u5229\u7528\u3057\u307E\u3059\u3002
security-domain-and-application=app \u63D0\u4F9B\u306E\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC (getConnection(user, pw) \u304B\u3089\u306E\u3082\u306E\u306A\u3069) \u3042\u308B\u3044\u306F Subject (\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30C9\u30E1\u30A4\u30F3\u304B\u3089\u306E\u3082\u306E) \u3092\u4F7F\u3044\u30D7\u30FC\u30EB\u5185\u306E\u63A5\u7D9A\u3092\u533A\u5225\u3059\u308B\u3088\u3046\u6307\u5B9A\u3057\u307E\u3059\u3002
set-tx-query-timeout=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u304C\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u3059\u308B\u307E\u3067\u306E\u6B8B\u308A\u6642\u9593\u3092\u3082\u3068\u306B\u30AF\u30A8\u30EA\u306E\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u3092\u8A2D\u5B9A\u3059\u308B\u304B\u3069\u3046\u304B\u3002\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u304C\u306A\u3044\u5834\u5408\u306F\u3001\u8A2D\u5B9A\u3057\u305F\u30AF\u30A8\u30EA\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u3092\u5229\u7528\u3057\u307E\u3059\u3002
transaction-support=\u30EA\u30BD\u30FC\u30B9\u30A2\u30C0\u30D7\u30BF\u30FC\u306E\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u5BFE\u5FDC\u30EC\u30D9\u30EB\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
use-ccm=\u30AD\u30E3\u30C3\u30B7\u30E5\u6E08\u307F\u306E\u63A5\u7D9A\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u306E\u5229\u7528\u3092\u6709\u52B9\u5316
use-fast-fail=\u7121\u52B9\u306A\u5834\u5408\u306B\u521D\u56DE\u8A66\u884C\u3067\u63A5\u7D9A\u5272\u308A\u5F53\u3066\u3092\u5931\u6557\u3055\u305B\u308B\u304B (true)\u3001\u30D7\u30FC\u30EB\u304C\u5229\u7528\u53EF\u80FD\u306A\u30D7\u30FC\u30EB\u3092\u6D88\u8CBB\u3059\u308B\u307E\u3067\u8A66\u884C\u3057\u7D9A\u3051\u308B\u304B (false)\u3002
use-java-context=\u3053\u308C\u3092 false \u306B\u8A2D\u5B9A\u3059\u308B\u3068\u30B0\u30ED\u30FC\u30D0\u30EB JNDI \u306B\u3053\u306E\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u3092\u30D0\u30A4\u30F3\u30C9\u3057\u307E\u3059\u3002
use-try-lock=\u30EA\u30BD\u30FC\u30B9\u30A2\u30C0\u30D7\u30BF\u30FC\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u3067\u5185\u90E8\u30ED\u30C3\u30AF\u306B\u5BFE\u3057\u3066\u8A2D\u5B9A\u3055\u308C\u305F\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8 (\u79D2\u5358\u4F4D)\u3002
user-name=\u65B0\u898F\u63A5\u7D9A\u306E\u4F5C\u6210\u6642\u306B\u4F7F\u3046\u30D1\u30B9\u30EF\u30FC\u30C9\u3092\u6307\u5B9A
wrap-xa-resource=XAResource \u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u304C org.jboss.tm.XAResourceWrapper \u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u3067\u30E9\u30C3\u30D7\u3055\u308C\u308B\u3079\u304D\u304B
xa-resource-timeout=\u3053\u306E\u5024\u306F XAResource.setTransactionTimeout() \u3078\u6E21\u3055\u308C\u307E\u3059 (\u79D2\u5358\u4F4D)\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u306F 0 \u3067\u3059\u3002
statistics=\u30EA\u30BD\u30FC\u30B9\u30A2\u30C0\u30D7\u30BF\u30FC\u306B\u3088\u308A\u63D0\u4F9B\u3055\u308C\u308B\u30E9\u30F3\u30BF\u30A4\u30E0\u7D71\u8A08
recovery-username=\u30EA\u30AB\u30D0\u30EA\u306B\u5229\u7528\u3059\u308B\u30E6\u30FC\u30B6\u30FC\u540D
recovery-password=\u30EA\u30AB\u30D0\u30EA\u306B\u5229\u7528\u3059\u308B\u30D1\u30B9\u30EF\u30FC\u30C9
recovery-security-domain=\u30EA\u30AB\u30D0\u30EA\u306B\u5229\u7528\u3059\u308B\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30C9\u30E1\u30A4\u30F3
recovery-plugin-class-name=\u30EA\u30AB\u30D0\u30EA\u30D7\u30E9\u30B0\u30A4\u30F3\u5B9F\u88C5\u306E\u5B8C\u5168\u4FEE\u98FE\u540D
recovery-plugin-properties=\u30EA\u30AB\u30D0\u30EA\u30D7\u30E9\u30B0\u30A4\u30F3\u306E\u30D7\u30ED\u30D1\u30C6\u30A3
no-recovery=\u63A5\u7D9A\u30D7\u30FC\u30EB\u304C\u30EA\u30AB\u30D0\u30EA\u304B\u3089\u9664\u5916\u3055\u308C\u308B\u3079\u304D\u304B\u3092\u6307\u5B9A
