# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author croe@redhat.com
resource-adapters=Configuration du sous-syst\u00E8me d'adaptateurs de ressources
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author croe@redhat.com
resource-adapters.add=Ajoute le sous-syst\u00E8me d'adaptateurs de ressources
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author croe@redhat.com
resource-adapters.remove=Supprime le sous-syst\u00E8me d'adaptateurs de ressources
resource-adapters.resource-adapter=La configuration d'adaptateurs de ressources
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author croe@redhat.com
ironjacamar=Mod\u00E8le qui repr\u00E9sente des adaptateurs de ressource activ\u00E9s par le fichier ironjacamar.xml \u00E0 l'int\u00E9rieur de rar.
ironjacamar.resource-adapter=La configuration d'adaptateurs de ressources
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author croe@redhat.com
admin-objects=Indique un objet d'administration
admin-objects.add=Ajouter un objet d'administration
admin-objects.remove=Supprimer l'object d'administration
admin-objects.class-name=Indique le nom de classe complet de l'objet administratif.
admin-objects.config-properties=Propri\u00E9t\u00E9s de configuration d\u00E9finies personnalis\u00E9es
admin-objects.enabled=Indique si l'objet d'administration doit \u00EAtre activ\u00E9.
admin-objects.jndi-name=Indique un nom JNDI de l'objet d'administration.
admin-objects.use-java-context=D\u00E9finir ceci \u00E0 false aura pour effet de relier l'objet dans le JNDI global
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author croe@redhat.com
resource-adapter=La configuration d'un adaptateur de ressources
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author croe@redhat.com
resource-adapter.add=Ajouter un nouvel adaptateur de ressources
resource-adapter.remove=Supprimer l'adaptateur de ressources
resource-adapter.activate=Forcer l'activation de la config d'adaptateur de ressources sans recharger le serveur
resource-adapter.admin-objects=La configuration des objets admin de cet adaptateur de ressources
resource-adapter.archive=Indique l'archivage d'adaptateur de ressources
resource-adapter.module=Indique le module \u00E0 partir duquel l'adaptateur de ressources sera charg\u00E9.
resource-adapter.beanvalidationgroups=Indique les groupes de validation du bean qui doivent \u00EAtre utilis\u00E9s
resource-adapter.bootstrap-context=Indique le nom unique de contexte de bootstrap qui doit \u00EAtre utilis\u00E9
resource-adapter.connection-definitions=La configuration des d\u00E9finitions de connexion de l'adaptateur de ressources
resource-adapter.config-properties=Propri\u00E9t\u00E9s de configuration d\u00E9finies personnalis\u00E9es
resource-adapter.clear-statistics=Supprime les statistiques de cette ressource
resource-adapter.transaction-support=Indique le niveau de support de transaction pour l'adaptateur de ressources
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author croe@redhat.com
deployment-subsystem=Information de runtime des adaptateurs de ressources. Contient des informations et des op\u00E9rations d'adaptateur de ressources activ\u00E9s ironjacamar.xml et des statistiques.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author croe@redhat.com
statistics=Les statistiques de temps d'ex\u00E9cution fournis par l'adaptateur de ressources.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author croe@redhat.com
config-properties=Propri\u00E9t\u00E9s de configuration d\u00E9finies personnalis\u00E9es
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author croe@redhat.com
config-properties.add=Ajouter une propri\u00E9t\u00E9 de configuration d\u00E9finie personnalis\u00E9e
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author croe@redhat.com
config-properties.remove=Supprimer la propri\u00E9t\u00E9 de configuration d\u00E9finie personnalis\u00E9e
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author croe@redhat.com
config-properties.value=Valeur de la propri\u00E9t\u00E9 de configuration d\u00E9finie personnalis\u00E9e
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-connector/org/jboss/as/connector/subsystems/resourceadapters/LocalDescriptions, author croe@redhat.com
connection-definitions=Indique les d\u00E9finitions de connexion
connection-definitions.add=Ajouter une propri\u00E9t\u00E9 de connexion
connection-definitions.remove=Supprimer la propri\u00E9t\u00E9 de la connexion
connection-definitions.allocation-retry-wait-millis=L'\u00E9l\u00E9ment \u00ABallocation retry wait millis\u00BB indique la dur\u00E9e, en millisecondes, d'attente entre les nouvelles tentatives d'allocation de connexion
connection-definitions.allocation-retry=L'\u00E9l\u00E9ment \u00ABallocation retry\u00BB indique le nombre de tentatives d'allocations de connexion avant de lancer une exception.
connection-definitions.background-validation-millis=L'\u00E9l\u00E9ment \u00ABbackground-validation-millis\u00BB indique la dur\u00E9e, en millisecondes, d'ex\u00E9cution de la validation de l'arri\u00E8re-plan. Pour modifier cette valeur, vous aurez besoin de d\u00E9marrer \u00E0 nouveau le serveur.
connection-definitions.background-validation=Un \u00E9l\u00E9ment pour indiquer que les connexions doivent \u00EAtre valid\u00E9es dans un thread d'arri\u00E8re-plan au lieu d'\u00EAtre valid\u00E9s avant d'\u00EAtre utilis\u00E9s. Pour modifier cette valeur, vous aurez besoin d'un nouveau d\u00E9marrage du serveur.
connection-definitions.blocking-timeout-wait-millis=L'\u00E9l\u00E9ment \u00ABblocking-timeout-millis\u00BB indique la dur\u00E9e, en millisecondes, de blocage quand on attend une connexion avant d'envoyer une exception. Notez que cela ne bloque uniquement lors de l'attente de verrouillage d'une connexion, et qu'une exception ne sera jamais lanc\u00E9e si la cr\u00E9ation d'une nouvelle connexion prend prend un temps inconsid\u00E9r\u00E9.
connection-definitions.class-name=Indique le nom de classe complet de la fabrique de connexion g\u00E9r\u00E9e ou de l'objet d'administration
connection-definitions.config-properties=Propri\u00E9t\u00E9s de configuration d\u00E9finies personnalis\u00E9es
connection-definitions.enabled=Indique si l'adaptateur de ressources doit \u00EAtre activ\u00E9.
connection-definitions.flush-all-connection-in-pool=Vide toutes les connexions dans le pool de connexions
connection-definitions.flush-idle-connection-in-pool=Vide toutes les connexions inactives dans le pool de connexions
connection-definitions.flush-strategy=Indique comment le pool de connexions devrait \u00EAtre vid\u00E9 en cas d'erreur. Les valeurs valides sont \: FailingConnectionOnly (default), IdleConnections et EntirePool
connection-definitions.idle-timeout-minutes=Les \u00E9l\u00E9ments idle-timeout-minutes indiquent la dur\u00E9e maximale, en minutes, pendant laquelle une connexion peut rester inactive avant d'\u00EAtre ferm\u00E9e. La dur\u00E9e maximum d\u00E9pend \u00E9galement de la dur\u00E9e de traitement du IdleRemover, qui correspond \u00E0 la moiti\u00E9 de la valeur idle-timeout-minutes la plus petite de n'importe quelle pool. Vous aurez besoin de d\u00E9marrer \u00E0 nouveau le serveur pour modifier cette valeur.
connection-definitions.jndi-name=Indique un nom JNDI de la fabrique de connexions
connection-definitions.interleaving=Un \u00E9l\u00E9ment pour activer l'entrelacement de connexions XA
connection-definitions.max-pool-size=L'\u00E9l\u00E9ment max-pool-size indique le nombre maximum de connexions pour un pool de connexion. Aucune autre connexion ne pourra \u00EAtre cr\u00E9\u00E9e dans chaque sous-pool de connexion.
connection-definitions.min-pool-size=L'\u00E9l\u00E9ment min-pool-size indique le nombre minimum de connexions pour un pool
connection-definitions.no-recovery=Indique si le pool de connexions doit \u00EAtre exclus du recouvrement
connection-definitions.no-tx-separate-pool=Oracle n'aime pas que les connexions XA soient utilis\u00E9es \u00E0 l'int\u00E9rieur et \u00E0 l'ext\u00E9rieur d'une transaction JTA. Pour r\u00E9soudre ce probl\u00E8me, vous pouvez cr\u00E9er des sous-pools s\u00E9par\u00E9es pour des contextes diff\u00E9rents.
connection-definitions.pad-xid=Est-ce que le Xid doit \u00EAtre rempli
connection-definitions.password=Indique le mot de passe utilis\u00E9 pour cr\u00E9er une nouvelle connexion
connection-definitions.pool-name=Indique le nom du pool de connexion pour une base de donn\u00E9es utilis\u00E9e pour la gestion
connection-definitions.pool-prefill=Est-ce que le pool de connexions doit \u00EAtre rempli \u00E0 l'avance. Modifier cette valeur n\u00E9cessite un red\u00E9marrage du serveur.
connection-definitions.pool-use-strict-min=Indique si la min-pool-size doit \u00EAtre strictement consid\u00E9r\u00E9e.
connection-definitions.query-timeout=Tout timeout de requ\u00EAte configur\u00E9 en secondes. Si non fourni, aucun timeout ne sera d\u00E9fini.
connection-definitions.recovery-password=Le mot de passe utilis\u00E9 pour le recouvrement
connection-definitions.recovery-plugin-class-name=Le nom de classe complet pour l'impl\u00E9mentation du plugin de recouvrement
connection-definitions.recovery-plugin-properties=Les propri\u00E9t\u00E9s du plugin de recouvrement
connection-definitions.recovery-security-domain=Le domaine de s\u00E9curit\u00E9 pour le recouvrement
connection-definitions.recovery-username=Le nom de l'utilisateur pour le recouvrement
connection-definitions.same-rm-override=L'\u00E9l\u00E9ment in-same-rm-override permet de d\u00E9finir inconditionnellement si le javax.transaction.xa.XAResource.isSameRM(XAResource) retourne true ou false
connection-definitions.security-application=Indique que des param\u00E9tres fournis d'application (comme ceux de getConnection(user, pw)) sont utilis\u00E9s pour distinguer les connexions du pool.
connection-definitions.security-domain=Indique le domaine de s\u00E9curit\u00E9 qui d\u00E9finit le javax.security.auth.Subject utilis\u00E9 pour distinguer les connexions dans le pool de connexions.
connection-definitions.security-domain-and-application=Indique que des param\u00E8tres fournis d'application (comme ceux de getConnection(user, pw)) ou que le Sujet (en provenance su domaine de s\u00E9curit\u00E9) sont utilis\u00E9s pour distinguer les connexions du pool.
connection-definitions.set-tx-query-timeout=Si on d\u00E9finit le timeout de requ\u00EAte sur le temps qui reste jusqu'\u00E0 ce que la transaction soit elaps\u00E9e. Tout timeout de requ\u00EAte configur\u00E9 sera utilis\u00E9 s'il n'y a pas de transaction.
connection-definitions.test-connection-in-pool=Teste si une connexion peut \u00EAtre obtenue
connection-definitions.use-ccm=Active l'utilisation d'un gestionnaire de connexion en cache
connection-definitions.use-fast-fail=Si on doit faire \u00E9chouer une allocation de connexion \u00E0 la premi\u00E8re tentative si elle est invalide (true) or si on doit essayer \u00E0 nouveau jusqu'\u00E0 ce que le pool soit d\u00E9nu\u00E9 de toutes les connexions potentielles (false)
connection-definitions.use-java-context=D\u00E9finir ceci \u00E0 false aura pour effet de relier l'objet dans le JNDI global
connection-definitions.use-try-lock=Tout timeout configur\u00E9 pour les verrous internes sur les objets d'adaptateur de ressources en secondes
connection-definitions.wrap-xa-resource=Si les instances XaResources sont contenues dans une instance de org.jboss.tm.XAResourceWrapper
connection-definitions.xa-resource-timeout=La valeur est pass\u00E9e au XAResource.setTransactionTimeout(), en secondes. La valeur par d\u00E9faut est z\u00E9ro
