resource-adapters-subsystem=El sub-sistema de adaptadores de recursos utilizado para declarar implementaciones del adaptador de recursos.
resource-adapters=Configuraci\u00F3n del sub-sistema de adaptadores de recursos
resource-adapters.add=Agrega el sub-sistema de adaptadores de recursos
resource-adapters.remove=Borra el sub-sistema de adaptadores de recursos
resource-adapter=La configuraci\u00F3n de un adaptador de recursos
ironjacamar=Modelo representando los adaptadores de recursos activados por el archivo  ironjacamar.xml dentro del rar
resource-adapter.add=Agregar un nuevo adaptador de recursos
resourceadapter.remove=Borrar el adaptador de recursos
resourceadapter.activate=Fuerza la activaci\u00F3n de la configuraci\u00F3n del adaptador de recursos sin recargar el servidor
deployment-subsystem=La informaci\u00F3n del tiempo de ejecuci\u00F3n para los adaptadores de recursos. Contiene estad\u00EDsticas e informaci\u00F3n del adaptador de recursos activada por ironjacamar.xml y operaciones
resourceadapter.flush-idle-connection-in-pool=Vac\u00EDa todas las conexiones inactivas en el pool
resourceadapter.flush-all-connection-in-pool=Vac\u00EDa todas las conexiones en el pool
resourceadapter.test-connection-in-pool=Prueba si una conexi\u00F3n se puede obtener
resourceadapter.clear-statistics=Limpia los valores de estad\u00EDsticas para este recurso
config-properties=Propiedades de configuraci\u00F3n definidas de manera personalizada
config-properties.add=Agrega una propiedad de configuraci\u00F3n definida de manera personalizada
config-properties.remove=Borra la propiedad de configuraci\u00F3n definida de manera personalizada
config-properties.value=Valor de la propiedad de configuraci\u00F3n definida de manera personalizada
connection-definitions=Especifica las definiciones de conexiones
connection-definition=Especifica una definici\u00F3n de conexi\u00F3n
connection-definition.add=Agregar una definici\u00F3n de conexi\u00F3n
connection-definition.remove=Borrar la definici\u00F3n de conexi\u00F3n
admin-objects=Especifica los objetos de administraci\u00F3n 
admin-object=Especifica un objeto de administraci\u00F3n
admin-object.add=Agregar un objeto de administraci\u00F3n
admin-object.remove=Borrar el objeto de administraci\u00F3n
allocation-retry-wait-millis=El elemento  en milisegundos de espera de reintentos de asignaci\u00F3n especifica la cantidad de tiempo a esperar entre re-intentos al asignar una conecci\u00F3n
allocation-retry=El elemento de asignaci\u00F3n de re-intentos indica el n\u00FAmero de veces que se debe intentar el asignar una conexi\u00F3n antes de presentar una excepci\u00F3n
archive=Especifica el fichero adaptador de recursos
background-validation-millis=El elemento background-validation-millis especifica la cantidad de tiempo en milisegundos que la validaci\u00F3n de segundo plano ejecutar\u00E1. El cambiar este valor requiere reiniciar el servidor
background-validation=Un elemento para especificar que las conexiones deben ser validadas en el hilo del segundo plano versus validarlas antes de utilizarlas. El cambiar este valor requiere reiniciar el servidor
beanvalidationgroups=Especifica los grupos de validaci\u00F3n de beans que se deben utilizar
blocking-timeout-wait-millis=El elemento blocking-timeout-millis especifica la cantidad de tiempo m\u00E1xima en milisegundos para bloquear al esperar una conexi\u00F3n antes de presentar una excepci\u00F3n. Note que esto s\u00F3lo bloquea mientras espera para bloquear una conexi\u00F3n y nunca presentar\u00E1 una excepci\u00F3n si el crear una nueva conexi\u00F3n toma mucho tiempo de manera poco habitual
bootstrap-context=Especifica el nombre \u00FAnico del contexto bootstrap que se debe utilizar
class-name=Especifica el nombre del la clase completamente calificada de una f\u00E1brica de conexiones administrada o un objeto admin
enabled=Especifica si el adaptador de recursos se debe habilitar
flush-strategy=Especifica la manera en que el pool se debe vaciar en caso de un error. Los valores v\u00E1lidos son\: FailingConnectionOnly (predeterminado), IdleConnections y EntirePool
idle-timeout-minutes=El elemento idle-timeout-minutes especifica el tiempo m\u00E1ximo en minutos que una conexi\u00F3n puede estar inactiva antes de cerrarla. El tiempo m\u00E1ximo tambi\u00E9n depende del tiempo de escaneo IdleRemover, el cual es la mitad del valor m\u00EDnimo de  idle-timeout-minutes de cualquier pool. El cambiar este valor requiere reiniciar el servidor.
interleaving=Un elemento para habilitar el intercalo para conexiones XA
jndi-name=Especifica el nombre JNDI para la f\u00E1brica de conexiones o un objeto admin
max-pool-size=El elemento max-pool-size especifica el n\u00FAmero m\u00E1ximo de conexiones para un pool. No se crear\u00E1n m\u00E1s conexiones en cada sub-pool
min-pool-size=El elemento min-pool-size especifica el n\u00FAmero m\u00EDnimo de conexiones para un pool
no-tx-separate-pool=A Oracle no le gusta que las conexiones XA se utilicen tanto adentro como afuera de una transacci\u00F3n JTA. Para solucionar este problema puede crear sub-pools separados para los diferentes contextos
pad-xid=Si el Xid debe tener acolchado
password=Especifica la contrase\u00F1a utilizada al crear una nueva conexi\u00F3n
pool-name=Especifica el nombre del pool para la fuente de datos utilizada para la administraci\u00F3n
pool-prefill=Si el pool se debe llenar previamente. El cambiar este valor requiere reiniciar el servidor
pool-use-strict-min=Especifica si el tama\u00F1o m\u00EDnimo del pool se debe considerar de manera estricta
query-timeout=El tiempo de expiraci\u00F3n de una petici\u00F3n configurado en segundos. Por defecto no hay tiempo de expiraci\u00F3n
same-rm-override=El elemento is-same-rm-override le permite establecer de manera incondicional si javax.transaction.xa.XAResource.isSameRM(XAResource) retorna verdadero o falso
security-application=Indica que los par\u00E1metros proporcionados por la aplicaci\u00F3n (tal como  getConnection(user, pw)) se utilizan para distinguir conexiones en el pool
security-domain=Especifica el dominio de seguridad que define el javax.security.auth.Subject que se utiliza para distinguir las conexiones en el pool
security-domain-and-application=Indica que los par\u00E1metros proporcionados por la aplicaci\u00F3n (tal como  getConnection(user, pw)) o Subject (del dominio de seguridad)  se utilizan para distinguir las conexiones en el pool
set-tx-query-timeout=Si debe establecer el tiempo de expiraci\u00F3n de la petici\u00F3n con base en el tiempo que queda hasta que expira la transacci\u00F3n. Se utilizar\u00E1 el tiempo de expiraci\u00F3n de petici\u00F3n configurado si ho hay transacci\u00F3n.
transaction-support=Especifica el nivel de soporte de transacciones del adaptador de recursos
use-ccm=Habilita el uso de un administrador de conexiones en cach\u00E9
use-fast-fail=Si debe fallar la asignaci\u00F3n de una conexi\u00F3n en el primer intento si es inv\u00E1lido (verdadero) o seguir intentando hasta que el pool acabe con todas las potenciales conexiones  (falso)
use-java-context=El configurar esto como falso enlazar\u00E1 el objeto al JNDI global
use-try-lock=El tiempo de expiraci\u00F3n configurado para bloqueos internos en los objetos del adaptador de recursos en segundos
user-name=Especifica el nombre de usuario utilizada al crear una nueva conexi\u00F3n
wrap-xa-resource=Si las instancias XAResource se deben envolver en una instancia org.jboss.tm.XAResourceWrapper
xa-resource-timeout=El valor se pasa a XAResource.setTransactionTimeout(), en segundos. Por defecto es cero
statistics=Estad\u00EDsticas del tiempo de ejecuci\u00F3n que el adaptador de recursos proporciona. 
recovery-username=El nombre de usuario que se utiliza para la recuperaci\u00F3n
recovery-password=La contrase\u00F1a que se utiliza para la recuperaci\u00F3n
recovery-security-domain=El dominio de seguridad que se utiliza para la recuperaci\u00F3n
recovery-plugin-class-name=El nombre completamente calificado de la clase de la implementaci\u00F3n plugin de recuperaci\u00F3n
recovery-plugin-properties=Las propiedades para el plugin de recuperaci\u00F3n 
no-recovery=Especifica si el pool de conexiones se debe excluir de la recuperaci\u00F3n
