threads=El sub-sistema de hilos utilizado para declarar grupos de hilos y recursos. 
threads.add=A\u00F1ade un sub-sistema de hilos.
threads.remove=Borra el sub-sistema de hilos.
threads.thread-factory=Un grupo de f\u00E1bricas de hilos.
threads.blocking-bounded-queue-thread-pool=Un conjunto de grupos de hilos en donde se guardan las tareas en una cola de tama\u00F1o limitado y donde las tareas de env\u00EDo de hilos se bloquear\u00E1n hasta que el espacio est\u00E9 disponible en la cola.  
threads.blocking-queueless-thread-pool=Un conjunto de grupos de hilos donde no hay hilos en cola y en donde las tareas de env\u00EDo se bloquear\u00E1n hasta que un grupo de hilos est\u00E9 disponible para ejecutar la tarea.
threads.bounded-queue-thread-pool=Un conjunto de grupos de hilos en donde se guardan las tareas en una cola de tama\u00F1o limitado y donde no hay espacio disponible en la cola, las tareas se descartar\u00E1n o pasar\u00E1n a otro 'handoff-executor' para ejecuci\u00F3n.  
threads.queueless-thread-pool=Un conjunto de grupos de hilos que no est\u00E1n en cola y en donde no hay un grupo de hilos disponible para administrar una tarea, las tareas se descartar\u00E1n o pasar\u00E1n a otro  'handoff-executor' para ejecuci\u00F3n.  
threads.unbounded-queue-thread-pool=Un conjunto de grupos de hilos en donde se guardan las tareas en una cola sin tama\u00F1o m\u00E1ximo.  
threads.scheduled-thread-pool=Un conjunto de grupos de hilos programados.
thread-factory=Una f\u00E1brica de hilos (que ejecuta  java.util.concurrent.ThreadFactory).
thread-factory.add=Agrega una f\u00E1brica de hilos
thread-factory.name=El nombre de la f\u00E1brica de hilos creada.
thread-factory.group-name=Especifica el nombre de un grupo de hilos a crear para esta f\u00E1brica de hilos.
thread-factory.thread-name-pattern=La plantilla utilizada para crear nombres de hilos.  Los siguientes patrones pueden ser utilizados\:\n\t%% - emite un signo de porcentaje\n\t%t - emite el n\u00FAmero por f\u00E1brica de la secuencia de hilos \n\t%g - emite el n\u00FAmero de la secuencia de hilos global\n\t%f - emite el n\u00FAmero de la secuencia de f\u00E1brica \n\t%i - emite el ID de hilos.
thread-factory.priority=Puede utilizarse para especificar la prioridad de hilos de hilos creados.
thread-factory.remove=Borra una f\u00E1brica de hilos
threadpool.common.name=El nombre del grupo de hilos. 
threadpool.common.thread-factory=Especifica el nombre de una determinada f\u00E1brica de hilos a usar para crear hilos de trabajador. Si no se define, se utilizar\u00E1 una f\u00E1brica de hilos apropiada. 
threadpool.common.max-threads=El tama\u00F1o de grupo de hilos m\u00E1ximo.
threadpool.common.core-threads=Un tama\u00F1o de grupo de hilos de n\u00FAcleo que es menor al tama\u00F1o de grupo m\u00E1ximo. Si es indefinido, el tama\u00F1o del grupo de hilos de n\u00FAcleo ser\u00E1 del mismo tama\u00F1o del grupo de hilos m\u00E1ximo.  
threadpool.common.keepalive-time=Se utiliza para especificar la cantidad de tiempo que los hilos deben mantenerse en ejecuci\u00F3n cuando est\u00E1n detenidos; si no se especifica, entonces los hilos se ejecutar\u00E1n hasta que el ejecutor se apague. 
threadpool.common.keepalive-time.time=El tiempo
threadpool.common.keepalive-time.unit=La unidad de tiempo
threadpool.common.allow-core-timeout=Si los hilos principales pueden expirar.
threadpool.common.handoff-executor=Un ejecutador al cual delegar tareas en el caso en que una tarea no pueda ser aceptada. Si no se especifica, las tareas que no se pueden aceptar se descartar\u00E1n de manera silenciosa.
threadpool.common.queue-length=La longitud de la cola.
threadpool.common.active-count=El n\u00FAmero aproximado de hilos que est\u00E1n activamente ejecutando tareas.
threadpool.common.completed-task-count=El n\u00FAmero total de tareas que han completado la ejecuci\u00F3n.
threadpool.common.current-thread-count=El n\u00FAmero actual de hilos en el grupo.
threadpool.common.largest-thread-count=El mayor n\u00FAmero de hilos que hayan estado alguna vez en forma simult\u00E1nea en el grupo.
threadpool.common.task-count=El n\u00FAmero total aproximado de tareas que alguna vez hayan sido programadas para ejecuci\u00F3n.
blocking-bounded-queue-thread-pool=Un ejecutor del grupo de hilos con una cola limitada en donde los env\u00EDos de hilos de tareas pueden bloquearse. Este grupo de hilos tiene un n\u00FAcleo, un tama\u00F1o m\u00E1ximo y una longitud de la cola especificada. Cuando una tarea es enviada, si el n\u00FAmero de hilos que se ejecutan es menor que el tama\u00F1o del n\u00FAcleo, se crear\u00E1 un nuevo hilo. De lo contrario, si hay espacio en la cola, la tarea se pondr\u00E1 en cola. Por otra parte, si el n\u00FAmero de hilos de ejecuci\u00F3n es menor que el tama\u00F1o m\u00E1ximo, se crear\u00E1 un nuevo hilo. De lo contrario, el llamador se bloquear\u00E1  hasta que haya espacio disponible en la cola.
blocking-bounded-queue-thread-pool.add=A\u00F1ade un grupo de hilos enlazados de una cola bloqueada.
blocking-bounded-queue-thread-pool.remove=Borra un grupo de hilos enlazados de una cola bloqueada.
blocking-bounded-queue-thread-pool.rejected-count=El n\u00FAmero de tareas que se han pasado al 'handoff-executor' (si se especifica uno) o que se han descartado.
bounded-queue-thread-pool=Un ejecutor del pool de hilos con una cola enlazada en donde los env\u00EDos de hilos de tareas no se bloquear\u00E1n. Este grupo de hilos tiene un n\u00FAcleo, un tama\u00F1o m\u00E1ximo y una longitud de la cola especificada. Cuando una tarea es enviada, si el n\u00FAmero de hilos que se ejecutan es menor que el tama\u00F1o del n\u00FAcleo, se crear\u00E1 un nuevo hilo. De lo contrario, si hay espacio en la cola, la tarea se pondr\u00E1 en cola. Por otra parte, si el n\u00FAmero de hilos de ejecuci\u00F3n es menor que el tama\u00F1o m\u00E1ximo se crear\u00E1 un nuevo hilo. De lo contrario, la tarea se entrega al ejecutor de transferencia si se especifica uno. De otra manera la tarea se descarta.
bounded-queue-thread-pool.add=A\u00F1ade un grupo de hilos de colas enlazados.
bounded-queue-thread-pool.remove=Borra un grupo de hilos de colas enlazados.
bounded-queue-thread-pool.rejected-count=El n\u00FAmero de tareas que se han pasado al 'handoff-executor' (si se especifica uno) o que se han  descartado.
blocking-queueless-thread-pool=Un ejecutor de grupo de hilos sin cola donde los hilos de tareas enviados se pueden bloquear. Cuando se env\u00EDa una tarea, si el n\u00FAmero de hilos en ejecuci\u00F3n es menor que el tama\u00F1o m\u00E1ximo, se crea un nuevo hilo. De otra manera, el llamador se bloquea hasta que otro hilo completa su tarea y acepta una nueva.
blocking-queueless-thread-pool.add=A\u00F1ade un grupo de hilos sin colas de bloqueo.
blocking-queueless-thread-pool.remove=Borra un grupo de hilos sin colas de bloqueo.
blocking-queueless-thread-pool.rejected-count=El n\u00FAmero de tareas que se han pasado al 'handoff-executor' (si se especifica uno) o que se han descartado.
queueless-thread-pool=Un ejecutor de grupo de hilos sin cola en donde los env\u00EDos de tareas no se bloquear\u00E1n. Cuando se env\u00EDa una tarea, si el n\u00FAmero de hilos es menor que el tama\u00F1o m\u00E1ximo, se crea un nuevo hilo. De otra manera, la tarea se entrega al ejecutor de transferencia, en caso de que se especifique, si no, la tarea se descarta. 
queueless-thread-pool.add=A\u00F1ade un grupo de hilos sin colas.
queueless-thread-pool.remove=Borra un grupo de hilos sin colas.
queueless-thread-pool.rejected-count=El n\u00FAmero de tareas que se han pasado al 'handoff-executor' (si se especifica uno) o que se han descartado.
scheduled-thread-pool=Un ejecutor de grupo de hilos programados.
scheduled-thread-pool.add=A\u00F1ade un grupo de hilos sin colas.
scheduled-thread-pool.remove=Borra un grupo de hilos sin colas.
unbounded-queue-thread-pool=Un ejecutor del grupo de hilos con una cola ilimitada. Dicho grupo de hilos tiene un tama\u00F1o de n\u00FAcleo y una cola sin l\u00EDmite superior. Cuando una tarea es enviada, si el n\u00FAmero de hilos que se ejecutan es menor que el tama\u00F1o del n\u00FAcleo, se crear\u00E1 un nuevo hilo. De lo contrario, la tarea se pondr\u00E1 en cola. Si demasiadas tareas est\u00E1n autorizadas para enviar a este tipo de ejecutor, se presentar\u00E1 una condici\u00F3n de sin memoria disponible. 
unbounded-queue-thread-pool.add=A\u00F1ade un grupo de hilos de desenlazados.
unbounded-queue-thread-pool.remove=Borra un grupo de hilos de desenlazados.
unbounded-queue-thread-pool.rejected-count=El n\u00FAmero de tareas que se han rechazado.
