threads=\u7EBF\u7A0B\u5B50\u7CFB\u7EDF\uFF0C\u7528\u4E8E\u58F0\u660E\u53EF\u7BA1\u7406\u7684\u7EBF\u7A0B\u6C60\u548C\u8D44\u6E90\u3002
threads.add=\u6DFB\u52A0\u7EBF\u7A0B\u5B50\u7CFB\u7EDF\u3002
threads.remove=\u5220\u9664\u7EBF\u7A0B\u5B50\u7CFB\u7EDF\u3002
threads.thread-factory=\u4E00\u7CFB\u5217\u7EBF\u7A0B\u5DE5\u5382\u3002
threads.blocking-bounded-queue-thread-pool=\u4E00\u7CFB\u5217\u7EBF\u7A0B\u6C60\uFF0C\u4EFB\u52A1\u5B58\u50A8\u5728\u4E00\u4E2A\u7ED1\u5B9A\u5927\u5C0F\u7684\u961F\u5217\u91CC\uFF0C\u800C\u63D0\u4EA4\u4EFB\u52A1\u7684\u7EBF\u7A0B\u5C06\u963B\u585E\u76F4\u81F3\u961F\u5217\u91CC\u6709\u53EF\u7528\u7684\u7A7A\u95F4\u3002
threads.blocking-queueless-thread-pool=\u4E00\u7CFB\u5217\u7EBF\u7A0B\u6C60\uFF0C\u5B83\u4EEC\u6CA1\u6709\u5728\u961F\u5217\u6392\u961F\uFF0C\u800C\u63D0\u4EA4\u4EFB\u52A1\u7684\u7EBF\u7A0B\u5C06\u963B\u585E\u76F4\u81F3\u6709\u53EF\u7528\u7EBF\u7A0B\u6765\u6267\u884C\u4EFB\u52A1\u3002
threads.bounded-queue-thread-pool=\u4E00\u7CFB\u5217\u7EBF\u7A0B\u6C60\uFF0C\u4EFB\u52A1\u5B58\u50A8\u5728\u4E00\u4E2A\u7ED1\u5B9A\u5927\u5C0F\u7684\u961F\u5217\u91CC\uFF0C\u800C\u5982\u679C\u961F\u5217\u91CC\u6709\u53EF\u7528\u7684\u7A7A\u95F4\uFF0C\u4EFB\u52A1\u5C06\u88AB\u629B\u5F03\u6216\u4F20\u5165\u53E6\u5916\u4E00\u4E2A "handoff-executor" \u6765\u6267\u884C\u3002
threads.queueless-thread-pool=\u4E00\u7CFB\u5217\u7EBF\u7A0B\u6C60\uFF0C\u4EFB\u52A1\u5B58\u50A8\u5728\u4E00\u4E2A\u7ED1\u5B9A\u5927\u5C0F\u7684\u961F\u5217\u91CC\uFF0C\u800C\u5982\u679C\u6CA1\u6709\u6C60\u7EBF\u7A0B\u6765\u5904\u7406\u4EFB\u52A1\uFF0C\u8FD9\u4E9B\u4EFB\u52A1\u5C06\u88AB\u629B\u5F03\u6216\u4F20\u5165\u53E6\u5916\u4E00\u4E2A "handoff-executor" \u6765\u6267\u884C\u3002
threads.unbounded-queue-thread-pool=\u4E00\u7CFB\u5217\u7EBF\u7A0B\u6C60\uFF0C\u4EFB\u52A1\u5B58\u50A8\u5728\u4E00\u4E2A\u6CA1\u6709\u8BBE\u5B9A\u6700\u5927\u503C\u7684\u961F\u5217\u91CC\u3002
threads.scheduled-thread-pool=\u4E00\u7CFB\u5217\u5DF2\u8C03\u5EA6\u7684\u7EBF\u7A0B\u6C60\u3002
thread-factory=\u7EBF\u7A0B\u5DE5\u5382\uFF08\u5B9E\u73B0\u4E86 java.util.concurrent.ThreadFactory\uFF09\u3002
thread-factory.add=\u6DFB\u52A0\u7EBF\u7A0B\u5DE5\u5382\u3002
thread-factory.name=\u521B\u5EFA\u7684\u7EBF\u7A0B\u5DE5\u5382\u7684\u540D\u79F0\u3002
thread-factory.group-name=\u6307\u5B9A\u4E3A\u8FD9\u4E2A\u7EBF\u7A0B\u5DE5\u5382\u521B\u5EFA\u7684\u7EBF\u7A0B\u7EC4\u3002
thread-factory.thread-name-pattern=\u7528\u4E8E\u521B\u5EFA\u7EBF\u7A0B\u540D\u79F0\u7684\u6A21\u677F\u3002\u4F60\u53EF\u4EE5\u4F7F\u7528\u4E0B\u9762\u7684\u6A21\u5F0F\uFF1A\n\t%% - \u6307\u5B9A\u767E\u5206\u6BD4\u7B26\u53F7\n\t%t - \u6307\u5B9A\u6BCF\u4E2A\u5DE5\u5382\u7684\u7EBF\u7A0B\u5E8F\u5217\u53F7\n\t%g - \u6307\u5B9A\u5168\u5C40\u7684\u7EBF\u7A0B\u5E8F\u5217\u53F7\n\t%f - \u6307\u5B9A\u5DE5\u5382\u5E8F\u5217\u53F7\n\t%i - \u6307\u5B9A\u7EBF\u7A0B ID.\n
thread-factory.priority=\u53EF\u7528\u6765\u6307\u5B9A\u5DF2\u521B\u5EFA\u7EBF\u7A0B\u7684\u7EBF\u7A0B\u4F18\u5148\u7EA7\u3002
thread-factory.remove=\u5220\u9664\u7EBF\u7A0B\u5DE5\u5382
threadpool.common.name=\u7EBF\u7A0B\u6C60\u7684\u540D\u79F0\u3002
threadpool.common.thread-factory=\u6307\u5B9A\u67D0\u4E2A\u7EBF\u7A0B\u5DE5\u5382\u4EE5\u521B\u5EFA worker \u7EBF\u7A0B\u3002\u5982\u679C\u672A\u6307\u5B9A\uFF0C\u5219\u4F7F\u7528\u7F3A\u7701\u7684\u7EBF\u7A0B\u5DE5\u5382\u3002
threadpool.common.max-threads=\u6700\u5927\u7684\u7EBF\u7A0B\u6C60\u5927\u5C0F\u3002
threadpool.common.core-threads=\u6BD4\u6700\u5927\u503C\u8981\u5C0F\u7684 Core \u7EBF\u7A0B\u6C60\u7684\u5927\u5C0F\u3002\u5982\u679C\u672A\u5B9A\u4E49\uFF0CCore \u7EBF\u7A0B\u6C60\u7684\u5927\u5C0F\u5C31\u548C\u8FD9\u4E2A\u7EBF\u7A0B\u6C60\u7684\u6700\u5927\u503C\u76F8\u7B49\u3002
threadpool.common.keepalive-time=\u7528\u4E8E\u6307\u5B9A\u6C60\u7EBF\u7A0B\u5728\u7A7A\u95F2\u65F6\u5E94\u8BE5\u4FDD\u6301\u8FD0\u884C\u7684\u65F6\u95F4\uFF1B\u5982\u679C\u672A\u6307\u5B9A\uFF0C\u7EBF\u7A0B\u5C06\u8FD0\u884C\u76F4\u81F3 executor \u88AB\u5173\u95ED\u3002
threadpool.common.keepalive-time.time=\u65F6\u95F4
threadpool.common.keepalive-time.unit=\u65F6\u95F4\u5355\u5143
threadpool.common.allow-core-timeout=Core \u7EBF\u7A0B\u662F\u5426\u4F1A\u8D85\u65F6\u3002
threadpool.common.handoff-executor=\u5F53\u4EFB\u52A1\u65E0\u6CD5\u88AB\u63A5\u53D7\u65F6\uFF0C\u63A5\u53D7\u59D4\u6258\u4EFB\u52A1\u7684 executor\u3002\u5982\u679C\u6CA1\u6709\u6307\u5B9A\uFF0C\u65E0\u6CD5\u88AB\u63A5\u53D7\u7684\u4EFB\u52A1\u5C06\u88AB\u9ED8\u9ED8\u5730\u629B\u5F03\u3002
threadpool.common.queue-length=\u961F\u5217\u957F\u5EA6\u3002
threadpool.common.active-count=\u5728\u6D3B\u8DC3\u5730\u6267\u884C\u4EFB\u52A1\u7684\u7EBF\u7A0B\u7684\u5927\u81F4\u6570\u91CF\u3002
threadpool.common.completed-task-count=\u5DF2\u7ECF\u5B8C\u6210\u7684\u4EFB\u52A1\u7684\u5927\u81F4\u6570\u91CF\u3002
threadpool.common.current-thread-count=\u7EBF\u7A0B\u6C60\u91CC\u7684\u5F53\u524D\u7EBF\u7A0B\u6570\u76EE\u3002
threadpool.common.largest-thread-count=\u6C60\u91CC\u66FE\u7ECF\u540C\u65F6\u5B58\u5728\u7684\u7EBF\u7A0B\u7684\u6700\u5927\u6570\u76EE\u3002
threadpool.common.task-count=\u5DF2\u7ECF\u8FDB\u884C\u8C03\u5EA6\u51C6\u5907\u6267\u884C\u7684\u4EFB\u52A1\u7684\u5927\u81F4\u603B\u6570\u3002
blocking-bounded-queue-thread-pool=\u5E26\u6709\u7ED1\u5B9A\u961F\u5217\u7684\u7EBF\u7A0B\u6C60 executor\uFF0C\u63D0\u4EA4\u4EFB\u52A1\u7684\u7EBF\u7A0B\u6709\u53EF\u80FD\u963B\u585E\u3002\u8FD9\u6837\u7684\u7EBF\u7A0B\u6C60\u6709\u4E00\u4E2A\u6838\u5FC3\u5C3A\u5BF8\u4EE5\u53CA\u6307\u5B9A\u7684\u961F\u5217\u957F\u5EA6\u3002\u5F53\u4EFB\u52A1\u88AB\u63D0\u4EA4\u65F6\uFF0C\u5982\u679C\u8FD0\u884C\u7EBF\u7A0B\u7684\u6570\u76EE\u5C0F\u4E8E\u8FD9\u4E2A\u6838\u5FC3\u5C3A\u5BF8\uFF0C\u5C06\u521B\u5EFA\u65B0\u7684\u7EBF\u7A0B\u3002\u5426\u5219\uFF0C\u5982\u679C\u961F\u5217\u91CC\u8FD8\u6709\u7A7A\u95F4\uFF0C\u4EFB\u52A1\u5C06\u653E\u5165\u961F\u5217\u3002\u5982\u679C\u8FD0\u884C\u7EBF\u7A0B\u7684\u6570\u76EE\u5C0F\u4E8E\u6700\u5927\u5C3A\u5BF8\uFF0C\u65B0\u7684\u7EBF\u7A0B\u5C06\u88AB\u521B\u5EFA\u3002\u5426\u5219\uFF0C\u8C03\u7528\u8005\u5C06\u963B\u585E\u76F4\u81F3\u961F\u5217\u91CC\u51FA\u73B0\u53EF\u7528\u7A7A\u95F4\u3002
blocking-bounded-queue-thread-pool.add=\u6DFB\u52A0\u963B\u585E\u7ED1\u5B9A\u7684\u961F\u5217\u7EBF\u7A0B\u6C60\u3002
blocking-bounded-queue-thread-pool.remove=\u5220\u9664\u963B\u585E\u7ED1\u5B9A\u7684\u961F\u5217\u7EBF\u7A0B\u6C60\u3002
blocking-bounded-queue-thread-pool.rejected-count=\u5DF2\u7ECF\u4F20\u9012\u7ED9 handoff-executor\uFF08\u5982\u679C\u6709\u6307\u5B9A\uFF09\u6216\u629B\u5F03\u7684\u4EFB\u52A1\u7684\u4E2A\u6570\u3002
bounded-queue-thread-pool=\u5E26\u6709\u7ED1\u5B9A\u961F\u5217\u7684\u7EBF\u7A0B\u6C60 executor\uFF0C\u63D0\u4EA4\u4EFB\u52A1\u7684\u7EBF\u7A0B\u4E0D\u4F1A\u963B\u585E\u3002\u8FD9\u6837\u7684\u7EBF\u7A0B\u6C60\u6709\u4E00\u4E2A\u6838\u5FC3\u5C3A\u5BF8\u4EE5\u53CA\u6307\u5B9A\u7684\u961F\u5217\u957F\u5EA6\u3002\u5F53\u4EFB\u52A1\u88AB\u63D0\u4EA4\u65F6\uFF0C\u5982\u679C\u8FD0\u884C\u7EBF\u7A0B\u7684\u6570\u76EE\u5C0F\u4E8E\u8FD9\u4E2A\u6838\u5FC3\u5C3A\u5BF8\uFF0C\u5C06\u521B\u5EFA\u65B0\u7684\u7EBF\u7A0B\u3002\u5426\u5219\uFF0C\u5982\u679C\u961F\u5217\u91CC\u8FD8\u6709\u7A7A\u95F4\uFF0C\u4EFB\u52A1\u5C06\u653E\u5165\u961F\u5217\u3002\u5982\u679C\u8FD0\u884C\u7EBF\u7A0B\u7684\u6570\u76EE\u5C0F\u4E8E\u6700\u5927\u5C3A\u5BF8\uFF0C\u65B0\u7684\u7EBF\u7A0B\u5C06\u88AB\u521B\u5EFA\u3002\u5426\u5219\uFF0C\u4EFB\u52A1\u5C06\u4EA4\u7531\u6307\u5B9A\u7684 handoff executor \u5904\u7406\uFF08\u5982\u679C\u6709\u6307\u5B9A\uFF09\uFF0C\u6216\u8005\u88AB\u629B\u5F03\u3002
bounded-queue-thread-pool.add=\u6DFB\u52A0\u7ED1\u5B9A\u7684\u961F\u5217\u7EBF\u7A0B\u6C60\u3002
bounded-queue-thread-pool.remove=\u5220\u9664\u7ED1\u5B9A\u7684\u961F\u5217\u7EBF\u7A0B\u6C60\u3002
bounded-queue-thread-pool.rejected-count=\u5DF2\u7ECF\u4F20\u9012\u7ED9 handoff-executor\uFF08\u5982\u679C\u6709\u6307\u5B9A\uFF09\u6216\u629B\u5F03\u7684\u4EFB\u52A1\u7684\u4E2A\u6570\u3002
blocking-queueless-thread-pool=\u672A\u5E26\u6709\u63D0\u4EA4\u4EFB\u52A1\u7684\u7EBF\u7A0B\u53EF\u80FD\u963B\u585E\u7684\u961F\u5217\u7684\u7EBF\u7A0B\u6C60 executor\u3002\u5F53\u63D0\u4EA4\u4EFB\u52A1\u65F6\uFF0C\u5982\u679C\u8FD0\u884C\u7EBF\u7A0B\u7684\u6570\u76EE\u5C11\u4E8E\u6700\u5927\u6570\u76EE\uFF0C\u65B0\u7684\u7EBF\u7A0B\u5C06\u88AB\u521B\u5EFA\u3002\u5426\u5219\uFF0C\u8C03\u7528\u8005\u5C06\u963B\u585E\uFF0C\u76F4\u81F3\u53E6\u5916\u4E00\u4E2A\u7EBF\u7A0B\u5B8C\u6210\u8FD9\u4E2A\u4EFB\u52A1\u5E76\u63A5\u53D7\u65B0\u7684\u4EFB\u52A1\u3002
blocking-queueless-thread-pool.add=\u6DFB\u52A0\u963B\u585E\u65E0\u961F\u5217\u7EBF\u7A0B\u6C60\u3002
blocking-queueless-thread-pool.remove=\u5220\u9664\u963B\u585E\u65E0\u961F\u5217\u7EBF\u7A0B\u6C60\u3002
blocking-queueless-thread-pool.rejected-count=\u5DF2\u7ECF\u4F20\u9012\u7ED9 handoff-executor\uFF08\u5982\u679C\u6709\u6307\u5B9A\uFF09\u6216\u629B\u5F03\u7684\u4EFB\u52A1\u7684\u4E2A\u6570\u3002
queueless-thread-pool=\u672A\u5E26\u6709\u63D0\u4EA4\u4EFB\u52A1\u7684\u7EBF\u7A0B\u4E0D\u4F1A\u963B\u585E\u7684\u961F\u5217\u7684\u7EBF\u7A0B\u6C60 executor\u3002\u5F53\u63D0\u4EA4\u4EFB\u52A1\u65F6\uFF0C\u5982\u679C\u8FD0\u884C\u7EBF\u7A0B\u7684\u6570\u76EE\u5C11\u4E8E\u6700\u5927\u6570\u76EE\uFF0C\u65B0\u7684\u7EBF\u7A0B\u5C06\u88AB\u521B\u5EFA\u3002\u5426\u5219\uFF0C\u4EFB\u52A1\u5C06\u88AB\u8F6C\u5F80\u6307\u5B9A\u7684 handoff executor\uFF08\u5982\u679C\u6709\u6307\u5B9A\uFF09\u3002\u5426\u5219\uFF0C\u8FD9\u4E2A\u4EFB\u52A1\u5C06\u88AB\u629B\u5F03\u3002
queueless-thread-pool.add=\u6DFB\u52A0\u4E00\u4E2A\u65E0\u961F\u5217\u7684\u7EBF\u7A0B\u6C60\u3002
queueless-thread-pool.remove=\u5220\u9664\u4E00\u4E2A\u65E0\u961F\u5217\u7684\u7EBF\u7A0B\u6C60\u3002
queueless-thread-pool.rejected-count=\u5DF2\u7ECF\u4F20\u9012\u7ED9 handoff-executor\uFF08\u5982\u679C\u6709\u6307\u5B9A\uFF09\u6216\u629B\u5F03\u7684\u4EFB\u52A1\u7684\u4E2A\u6570\u3002
scheduled-thread-pool=\u5DF2\u8C03\u5EA6\u7684\u7EBF\u7A0B\u6C60 executor\u3002
scheduled-thread-pool.add=\u6DFB\u52A0\u4E00\u4E2A\u65E0\u961F\u5217\u7684\u7EBF\u7A0B\u6C60\u3002
scheduled-thread-pool.remove=\u5220\u9664\u4E00\u4E2A\u65E0\u961F\u5217\u7684\u7EBF\u7A0B\u6C60\u3002
unbounded-queue-thread-pool=\u5E26\u6709\u672A\u7ED1\u5B9A\u961F\u5217\u7684\u7EBF\u7A0B\u6C60 executor\u3002\u8FD9\u6837\u7684\u7EBF\u7A0B\u6C60\u6709\u4E00\u4E2A\u6838\u5FC3\u5C3A\u5BF8\u800C\u961F\u5217\u6CA1\u6709\u4E0A\u8FB9\u754C\u3002\u5F53\u4EFB\u52A1\u88AB\u63D0\u4EA4\u65F6\uFF0C\u5982\u679C\u8FD0\u884C\u7EBF\u7A0B\u7684\u6570\u76EE\u5C0F\u4E8E\u8FD9\u4E2A\u6838\u5FC3\u5C3A\u5BF8\uFF0C\u5C06\u521B\u5EFA\u65B0\u7684\u7EBF\u7A0B\u3002\u5426\u5219\uFF0C\u4EFB\u52A1\u5C06\u653E\u5165\u961F\u5217\u3002\u5982\u679C\u5141\u8BB8\u4E86\u5E26\u591A\u7684\u4EFB\u52A1\u63D0\u4EA4\u5230\u8FD9\u79CD\u7C7B\u578B\u7684 executor\uFF0C\u5C31\u53EF\u80FD\u5BFC\u81F4\u5185\u5B58\u6EA2\u51FA\u3002
unbounded-queue-thread-pool.add=\u6DFB\u52A0\u4E00\u4E2A\u4E3A\u7ED1\u5B9A\u7684\u7EBF\u7A0B\u6C60\u3002
unbounded-queue-thread-pool.remove=\u5220\u9664\u672A\u7ED1\u5B9A\u7684\u7EBF\u7A0B\u6C60\u3002
unbounded-queue-thread-pool.rejected-count=\u5DF2\u7ECF\u88AB\u62D2\u7EDD\u7684\u4EFB\u52A1\u6570\u76EE\u3002
