threads=\u30B9\u30EC\u30C3\u30C7\u30A3\u30F3\u30B0\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u3002\u7BA1\u7406\u53EF\u80FD\u306A\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u3084\u30EA\u30BD\u30FC\u30B9\u3092\u5BA3\u8A00\u3059\u308B\u306E\u306B\u5229\u7528\u3057\u307E\u3059\u3002
threads.add=\u30B9\u30EC\u30C3\u30C7\u30A3\u30F3\u30B0\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u306E\u8FFD\u52A0
threads.remove=\u30B9\u30EC\u30C3\u30C7\u30A3\u30F3\u30B0\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u306E\u524A\u9664
threads.thread-factory=\u30B9\u30EC\u30C3\u30C9\u30D5\u30A1\u30AF\u30C8\u30EA
threads.blocking-bounded-queue-thread-pool=\u30BF\u30B9\u30AF\u304C bounded-size \u30AD\u30E5\u30FC\u306B\u683C\u7D0D\u3055\u308C\u3001\u30BF\u30B9\u30AF\u3092\u63D0\u4F9B\u3059\u308B\u30B9\u30EC\u30C3\u30C9\u304C\u30AD\u30E5\u30FC\u5185\u306B\u7A7A\u304D\u304C\u51FA\u308B\u307E\u3067\u30D6\u30ED\u30C3\u30AF\u3059\u308B\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB
threads.blocking-queueless-thread-pool=(\u30BF\u30B9\u30AF\u304C)\u30AD\u30E5\u30FC\u3055\u308C\u305A\u3001\u30D7\u30FC\u30EB\u30B9\u30EC\u30C3\u30C9\u3067\u30BF\u30B9\u30AF\u5B9F\u884C\u53EF\u80FD\u306B\u306A\u308B\u307E\u3067\u30BF\u30B9\u30AF\u63D0\u4F9B\u30B9\u30EC\u30C3\u30C9\u306B\u3088\u308A\u30D6\u30ED\u30C3\u30AF\u3059\u308B\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB
threads.bounded-queue-thread-pool=\u30BF\u30B9\u30AF\u304C bounded-size \u30AD\u30E5\u30FC\u306B\u4FDD\u5B58\u3055\u308C\u3001\u305D\u306E\u30AD\u30E5\u30FC\u306B\u7A7A\u304D\u5BB9\u91CF\u304C\u306A\u3044\u5834\u5408\u306F\u30BF\u30B9\u30AF\u3092\u7834\u68C4\u3059\u308B\u304B\u5225\u306E "handoff-executor" \u306B\u6E21\u3057\u3066\u5B9F\u884C\u3059\u308B\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB
threads.queueless-thread-pool=\uFF08\u30BF\u30B9\u30AF\u304C\uFF09\u30AD\u30E5\u30FC\u3055\u308C\u305A\u3001\u30D7\u30FC\u30EB\u30B9\u30EC\u30C3\u30C9\u3067\u30BF\u30B9\u30AF\u51E6\u7406\u304C\u3067\u304D\u306A\u3044\u5834\u5408\u30BF\u30B9\u30AF\u3092\u7834\u68C4\u3059\u308B\u304B\u5225\u306E "handoff-executor" \u306B\u6E21\u3057\u3066\u5B9F\u884C\u3059\u308B\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB
threads.unbounded-queue-thread-pool=\u6700\u5927\u30B5\u30A4\u30BA\u306A\u3057\u306E\u30AD\u30E5\u30FC\u306B\u30BF\u30B9\u30AF\u3092\u683C\u7D0D\u3059\u308B\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB
threads.scheduled-thread-pool=\u4E88\u7D04\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB
thread-factory=\u30B9\u30EC\u30C3\u30C9\u30D5\u30A1\u30AF\u30C8\u30EA (java.util.concurrent.ThreadFactory \u306E\u5B9F\u88C5)
thread-factory.add=\u30B9\u30EC\u30C3\u30C9\u30D5\u30A1\u30AF\u30C8\u30EA\u306E\u8FFD\u52A0
thread-factory.name=\u4F5C\u6210\u3057\u305F\u30B9\u30EC\u30C3\u30C9\u30D5\u30A1\u30AF\u30C8\u30EA\u306E\u540D\u524D
thread-factory.group-name=\u3053\u306E\u30B9\u30EC\u30C3\u30C9\u30D5\u30A1\u30AF\u30C8\u30EA\u306B\u5BFE\u3057\u3066\u4F5C\u6210\u3059\u308B\u30B9\u30EC\u30C3\u30C9\u30B0\u30EB\u30FC\u30D7\u540D\u3092\u6307\u5B9A
thread-factory.thread-name-pattern=\u30B9\u30EC\u30C3\u30C9\u540D\u3092\u4F5C\u6210\u3059\u308B\u969B\u306B\u5229\u7528\u3059\u308B\u30C6\u30F3\u30D7\u30EC\u30FC\u30C8\u3002\u4EE5\u4E0B\u306E\u30D1\u30BF\u30FC\u30F3\u3092\u5229\u7528\u53EF\u80FD\:\n\t%% - \u30D1\u30FC\u30BB\u30F3\u30C8\u8A18\u53F7\u3092\u751F\u6210\n\t%t - \u30D5\u30A1\u30AF\u30C8\u30EA\u3054\u3068\u306E\u30B9\u30EC\u30C3\u30C9\u30B7\u30FC\u30B1\u30F3\u30B9\u756A\u53F7\u3092\u751F\u6210\n\t%g - \u30B0\u30ED\u30FC\u30D0\u30EB\u30EC\u30D9\u30EB\u306E\u30B9\u30EC\u30C3\u30C9\u30B7\u30FC\u30B1\u30F3\u30B9\u756A\u53F7\u3092\u751F\u6210\n\t%f - \u30D5\u30A1\u30AF\u30C8\u30EA\u30B7\u30FC\u30B1\u30F3\u30B9\u756A\u53F7\u3092\u751F\u6210\n\t%i - \u30B9\u30EC\u30C3\u30C9 ID \u3092\u751F\u6210
thread-factory.priority=\u4F5C\u6210\u6E08\u307F\u306E\u30B9\u30EC\u30C3\u30C9\u306E\u512A\u5148\u9806\u4F4D\u3092\u6307\u5B9A\u3059\u308B\u305F\u3081\u306B\u5229\u7528\u53EF\u80FD
thread-factory.remove=\u30B9\u30EC\u30C3\u30C9\u30D5\u30A1\u30AF\u30C8\u30EA\u306E\u524A\u9664
threadpool.common.name=\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u540D
threadpool.common.thread-factory=\u30EF\u30FC\u30AB\u30FC\u30B9\u30EC\u30C3\u30C9\u3092\u4F5C\u6210\u3059\u308B\u969B\u306B\u5229\u7528\u3059\u308B\u56FA\u6709\u306E\u30B9\u30EC\u30C3\u30C9\u30D5\u30A1\u30AF\u30C8\u30EA\u540D\u3092\u6307\u5B9A\u3002\u5B9A\u7FA9\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u3001\u9069\u5207\u306A\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u30B9\u30EC\u30C3\u30C9\u30D5\u30A1\u30AF\u30C8\u30EA\u3092\u4F7F\u3044\u307E\u3059\u3002
threadpool.common.max-threads=\u6700\u5927\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u30B5\u30A4\u30BA
threadpool.common.core-threads=\u6700\u5927\u30D7\u30FC\u30EB\u30B5\u30A4\u30BA\u3088\u308A\u3082\u5C0F\u3055\u3044\u30B3\u30A2\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u30B5\u30A4\u30BA\u3002\u5B9A\u7FA9\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u3001\u30B3\u30A2\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u30B5\u30A4\u30BA\u306F\u6700\u5927\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u30B5\u30A4\u30BA\u3068\u540C\u3058\u3067\u3059\u3002
threadpool.common.keepalive-time=\u30A2\u30A4\u30C9\u30EB\u6642\u306B\u30D7\u30FC\u30EB\u30B9\u30EC\u30C3\u30C9\u306E\u5B9F\u884C\u3092\u7D99\u7D9A\u3059\u3079\u304D\u6642\u9593\u3092\u6307\u5B9A\u3059\u308B\u969B\u306B\u5229\u7528\u3002\u6307\u5B9A\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u3001\u30B9\u30EC\u30C3\u30C9\u306F\u30A8\u30B0\u30BC\u30AD\u30E5\u30FC\u30BF\u30FC\u304C\u7D42\u4E86\u3059\u308B\u307E\u3067\u5B9F\u884C\u3055\u308C\u307E\u3059\u3002
threadpool.common.keepalive-time.time=\u6642\u9593
threadpool.common.keepalive-time.unit=\u6642\u9593\u5358\u4F4D
threadpool.common.allow-core-timeout=\u30B3\u30A2\u30B9\u30EC\u30C3\u30C9\u304C\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u3059\u308B\u304B\u3069\u3046\u304B
threadpool.common.handoff-executor=\u30BF\u30B9\u30AF\u304C\u53D7\u3051\u5165\u308C\u3089\u308C\u306A\u3044\u5834\u5408\u3001\u30BF\u30B9\u30AF\u3092\u59D4\u8B72\u3059\u308B\u30A8\u30B0\u30BC\u30AD\u30E5\u30FC\u30BF\u30FC\u3002\u6307\u5B9A\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u3001\u53D7\u3051\u5165\u308C\u3089\u308C\u306A\u3044\u30BF\u30B9\u30AF\u306F\u8B66\u544A\u306A\u3057\u306B\u7834\u68C4\u3055\u308C\u307E\u3059\u3002
threadpool.common.queue-length=\u30AD\u30E5\u30FC\u9577
threadpool.common.active-count=\u30BF\u30B9\u30AF\u5B9F\u884C\u4E2D\u306E\u30B9\u30EC\u30C3\u30C9\u6570
threadpool.common.completed-task-count=\u5B9F\u884C\u5B8C\u4E86\u3057\u305F\u30BF\u30B9\u30AF\u306E\u7DCF\u6570
threadpool.common.current-thread-count=\u30D7\u30FC\u30EB\u5185\u306B\u3042\u308B\u73FE\u5728\u306E\u30B9\u30EC\u30C3\u30C9\u6570
threadpool.common.largest-thread-count=\u30D7\u30FC\u30EB\u5185\u306B\u540C\u6642\u306B\u5B58\u5728\u53EF\u80FD\u306A\u6700\u5927\u6570
threadpool.common.task-count=\u5B9F\u884C\u4E88\u7D04\u3055\u308C\u305F\u30BF\u30B9\u30AF\u306E\u7DCF\u6570
blocking-bounded-queue-thread-pool=\u30BF\u30B9\u30AF\u3092\u30B5\u30D6\u30DF\u30C3\u30C8\u3059\u308B\u30B9\u30EC\u30C3\u30C9\u304C\u30D6\u30ED\u30C3\u30AF\u3059\u308B\u53EF\u80FD\u6027\u306E\u3042\u308B\u30D0\u30A4\u30F3\u30C9\u30AD\u30E5\u30FC\u3092\u6301\u3064\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u30A8\u30B0\u30BC\u30AD\u30E5\u30FC\u30BF\u30FC\u3002\u3053\u306E\u3088\u3046\u306A\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u306F\u30B3\u30A2\u6700\u5927\u30B5\u30A4\u30BA\u3001\u6307\u5B9A\u306E\u30AD\u30E5\u30FC\u9577\u3092\u6301\u3061\u307E\u3059\u3002\u30BF\u30B9\u30AF\u304C\u30B5\u30D6\u30DF\u30C3\u30C8\u3055\u308C\u308B\u3068\u3001\u5B9F\u884C\u4E2D\u306E\u30B9\u30EC\u30C3\u30C9\u6570\u304C\u30B3\u30A2\u30B5\u30A4\u30BA\u3088\u308A\u5C0F\u3055\u3044\u5834\u5408\u3001\u65B0\u898F\u30B9\u30EC\u30C3\u30C9\u304C\u4F5C\u6210\u3055\u308C\u307E\u3059\u3002\u30B3\u30A2\u30B5\u30A4\u30BA\u3088\u308A\u5C0F\u3055\u304F\u306A\u304F\u3001\u30AD\u30E5\u30FC\u306B\u7A7A\u304D\u304C\u3042\u308B\u5834\u5408\u306F\u3001\u30BF\u30B9\u30AF\u304C\u30AD\u30E5\u30FC\u306B\u5165\u308C\u3089\u308C\u307E\u3059\u3002\u30AD\u30E5\u30FC\u306B\u7A7A\u304D\u304C\u306A\u304F\u3001\u5B9F\u884C\u30B9\u30EC\u30C3\u30C9\u6570\u304C\u6700\u5927\u30B5\u30A4\u30BA\u3088\u308A\u3082\u5C0F\u3055\u3044\u5834\u5408\u3001\u65B0\u898F\u30B9\u30EC\u30C3\u30C9\u304C\u4F5C\u6210\u3055\u308C\u307E\u3059\u3002\u5B9F\u884C\u30B9\u30EC\u30C3\u30C9\u6570\u304C\u6700\u5927\u30B5\u30A4\u30BA\u3088\u308A\u3082\u5C0F\u3055\u304F\u306A\u3044\u5834\u5408\u306F\u3001\u547C\u3073\u51FA\u3057\u5074\u304C\u30AD\u30E5\u30FC\u306B\u7A7A\u304D\u304C\u3067\u308B\u307E\u3067\u30D6\u30ED\u30C3\u30AF\u3057\u307E\u3059\u3002
blocking-bounded-queue-thread-pool.add=\u30D6\u30ED\u30C3\u30AF\u3057\u3066\u3044\u308B\u30D0\u30A4\u30F3\u30C9\u30AD\u30E5\u30FC\u306E\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u3092\u8FFD\u52A0
blocking-bounded-queue-thread-pool.remove=\u30D6\u30ED\u30C3\u30AF\u3057\u3066\u3044\u308B\u30D0\u30A4\u30F3\u30C9\u30AD\u30E5\u30FC\u306E\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u3092\u524A\u9664
blocking-bounded-queue-thread-pool.rejected-count=handoff-executor (\u6307\u5B9A\u3055\u308C\u3066\u3044\u308B\u5834\u5408) \u306B\u6E21\u3055\u308C\u305F\u304B\u3001\u7834\u68C4\u3055\u308C\u305F\u30BF\u30B9\u30AF\u6570
bounded-queue-thread-pool=\u30BF\u30B9\u30AF\u3092\u30B5\u30D6\u30DF\u30C3\u30C8\u3059\u308B\u30B9\u30EC\u30C3\u30C9\u304C\u30D6\u30ED\u30C3\u30AF\u3057\u306A\u3044\u30D0\u30A4\u30F3\u30C9\u30AD\u30E5\u30FC\u3092\u6301\u3064\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u30A8\u30B0\u30BC\u30AD\u30E5\u30FC\u30BF\u30FC\u3002\u3053\u306E\u3088\u3046\u306A\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u306F\u30B3\u30A2\u6700\u5927\u30B5\u30A4\u30BA\u3001\u6307\u5B9A\u306E\u30AD\u30E5\u30FC\u9577\u3092\u6301\u3061\u307E\u3059\u3002\u30BF\u30B9\u30AF\u304C\u30B5\u30D6\u30DF\u30C3\u30C8\u3055\u308C\u308B\u3068\u3001\u5B9F\u884C\u4E2D\u306E\u30B9\u30EC\u30C3\u30C9\u6570\u304C\u30B3\u30A2\u30B5\u30A4\u30BA\u3088\u308A\u5C0F\u3055\u3044\u5834\u5408\u3001\u65B0\u898F\u30B9\u30EC\u30C3\u30C9\u304C\u4F5C\u6210\u3055\u308C\u307E\u3059\u3002\u30B3\u30A2\u30B5\u30A4\u30BA\u3088\u308A\u5C0F\u3055\u304F\u306A\u304F\u3001\u30AD\u30E5\u30FC\u306B\u7A7A\u304D\u304C\u3042\u308B\u5834\u5408\u306F\u3001\u30BF\u30B9\u30AF\u304C\u30AD\u30E5\u30FC\u306B\u5165\u308C\u3089\u308C\u307E\u3059\u3002\u30AD\u30E5\u30FC\u306B\u7A7A\u304D\u304C\u306A\u304F\u3001\u5B9F\u884C\u30B9\u30EC\u30C3\u30C9\u6570\u304C\u6700\u5927\u30B5\u30A4\u30BA\u3088\u308A\u3082\u5C0F\u3055\u3044\u5834\u5408\u3001\u65B0\u898F\u30B9\u30EC\u30C3\u30C9\u304C\u4F5C\u6210\u3055\u308C\u307E\u3059\u3002\u5B9F\u884C\u30B9\u30EC\u30C3\u30C9\u6570\u304C\u6700\u5927\u30B5\u30A4\u30BA\u3088\u308A\u3082\u5C0F\u3055\u304F\u306A\u304F\u3001\u30CF\u30F3\u30C9\u30AA\u30D5\u30A8\u30B0\u30BC\u30AD\u30E5\u30FC\u30BF\u30FC\u304C\u6307\u5B9A\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u306F\u305D\u3061\u3089\u306B\u6E21\u3055\u308C\u307E\u3059\u3002\u6307\u5B9A\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u7834\u68C4\u3055\u308C\u307E\u3059\u3002
bounded-queue-thread-pool.add=\u30D0\u30A4\u30F3\u30C9\u30AD\u30E5\u30FC\u306E\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u3092\u8FFD\u52A0
bounded-queue-thread-pool.remove=\u30D0\u30A4\u30F3\u30C9\u30AD\u30E5\u30FC\u306E\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u3092\u524A\u9664
bounded-queue-thread-pool.rejected-count=handoff-executor (\u6307\u5B9A\u3055\u308C\u3066\u3044\u308B\u5834\u5408) \u306B\u6E21\u3055\u308C\u305F\u304B\u3001\u7834\u68C4\u3055\u308C\u305F\u30BF\u30B9\u30AF\u6570
blocking-queueless-thread-pool=\u30BF\u30B9\u30AF\u3092\u30B5\u30D6\u30DF\u30C3\u30C8\u3059\u308B\u30B9\u30EC\u30C3\u30C9\u304C\u30D6\u30ED\u30C3\u30AF\u3059\u308B\u53EF\u80FD\u6027\u306E\u3042\u308B\u30AD\u30E5\u30FC\u3092\u6301\u305F\u306A\u3044\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u30A8\u30B0\u30BC\u30AD\u30E5\u30FC\u30BF\u30FC\u3002\u30BF\u30B9\u30AF\u304C\u30B5\u30D6\u30DF\u30C3\u30C8\u3055\u308C\u308B\u3068\u3001\u5B9F\u884C\u30B9\u30EC\u30C3\u30C9\u6570\u304C\u6700\u5927\u30B5\u30A4\u30BA\u3088\u308A\u5C0F\u3055\u3044\u5834\u5408\u3001\u65B0\u898F\u30B9\u30EC\u30C3\u30C9\u304C\u4F5C\u6210\u3055\u308C\u307E\u3059\u3002\u6700\u5927\u30B5\u30A4\u30BA\u3088\u308A\u3082\u5C0F\u3055\u304F\u306A\u3044\u5834\u5408\u3001\u5225\u306E\u30B9\u30EC\u30C3\u30C9\u304C\u305D\u306E\u30BF\u30B9\u30AF\u3092\u5B8C\u4E86\u3057\u65B0\u898F\u306E\u30BF\u30B9\u30AF\u3092\u53D7\u3051\u5165\u308C\u308B\u307E\u3067\u547C\u3073\u51FA\u3057\u5074\u304C\u30D6\u30ED\u30C3\u30AF\u3057\u307E\u3059\u3002
blocking-queueless-thread-pool.add=\u30D6\u30ED\u30C3\u30AF\u3057\u3066\u3044\u308B\u30AD\u30E5\u30FC\u306A\u3057\u306E\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
blocking-queueless-thread-pool.remove=\u30D6\u30ED\u30C3\u30AF\u3057\u3066\u3044\u308B\u30AD\u30E5\u30FC\u306A\u3057\u306E\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u3092\u524A\u9664\u3057\u307E\u3059\u3002
blocking-queueless-thread-pool.rejected-count=handoff-executor (\u6307\u5B9A\u3055\u308C\u3066\u3044\u308B\u5834\u5408) \u306B\u6E21\u3055\u308C\u305F\u304B\u3001\u7834\u68C4\u3055\u308C\u305F\u30BF\u30B9\u30AF\u6570
queueless-thread-pool=\u30BF\u30B9\u30AF\u3092\u30B5\u30D6\u30DF\u30C3\u30C8\u3059\u308B\u30B9\u30EC\u30C3\u30C9\u304C\u30D6\u30ED\u30C3\u30AF\u3057\u306A\u3044\u30AD\u30E5\u30FC\u3092\u6301\u305F\u306A\u3044\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u30A8\u30B0\u30BC\u30AD\u30E5\u30FC\u30BF\u30FC\u3002\u30BF\u30B9\u30AF\u304C\u30B5\u30D6\u30DF\u30C3\u30C8\u3055\u308C\u308B\u3068\u3001\u5B9F\u884C\u30B9\u30EC\u30C3\u30C9\u6570\u304C\u6700\u5927\u30B5\u30A4\u30BA\u3088\u308A\u5C0F\u3055\u3044\u5834\u5408\u3001\u65B0\u898F\u30B9\u30EC\u30C3\u30C9\u304C\u4F5C\u6210\u3055\u308C\u307E\u3059\u3002\u5B9F\u884C\u30B9\u30EC\u30C3\u30C9\u6570\u304C\u6700\u5927\u30B5\u30A4\u30BA\u3088\u308A\u3082\u5C0F\u3055\u304F\u306A\u304F\u3001\u30CF\u30F3\u30C9\u30AA\u30D5\u30A8\u30B0\u30BC\u30AD\u30E5\u30FC\u30BF\u30FC\u304C\u6307\u5B9A\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u306F\u305D\u3061\u3089\u306B\u6E21\u3055\u308C\u307E\u3059\u3002\u6307\u5B9A\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u7834\u68C4\u3055\u308C\u307E\u3059\u3002
queueless-thread-pool.add=\u30AD\u30E5\u30FC\u306E\u306A\u3044\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u3092\u8FFD\u52A0
queueless-thread-pool.remove=\u30AD\u30E5\u30FC\u306E\u306A\u3044\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u3092\u524A\u9664
queueless-thread-pool.rejected-count=handoff-executor (\u6307\u5B9A\u3055\u308C\u3066\u3044\u308B\u5834\u5408) \u306B\u6E21\u3055\u308C\u305F\u304B\u3001\u7834\u68C4\u3055\u308C\u305F\u30BF\u30B9\u30AF\u6570
scheduled-thread-pool=\u4E88\u7D04\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u306E\u30A8\u30B0\u30BC\u30AD\u30E5\u30FC\u30BF\u30FC
scheduled-thread-pool.add=\u30AD\u30E5\u30FC\u306E\u306A\u3044\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u3092\u8FFD\u52A0
scheduled-thread-pool.remove=\u30AD\u30E5\u30FC\u306E\u306A\u3044\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u3092\u524A\u9664
unbounded-queue-thread-pool=\u30D0\u30A4\u30F3\u30C9\u3055\u308C\u3066\u3044\u306A\u3044\u30AD\u30E5\u30FC\u3092\u6301\u3064\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u30A8\u30B0\u30BC\u30AD\u30E5\u30FC\u30BF\u30FC\u3002\u3053\u306E\u3088\u3046\u306A\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u306F\u3001\u4E0A\u9650\u3092\u6301\u305F\u306A\u3044\u30AD\u30E5\u30FC\u304A\u3088\u3073\u30B3\u30A2\u30B5\u30A4\u30BA\u3092\u6301\u3061\u307E\u3059\u3002\u30BF\u30B9\u30AF\u304C\u30B5\u30D6\u30DF\u30C3\u30C8\u3055\u308C\u305F\u6642\u70B9\u3067\u3001\u5B9F\u884C\u30B9\u30EC\u30C3\u30C9\u6570\u304C\u30B3\u30A2\u30B5\u30A4\u30BA\u3088\u308A\u5C0F\u3055\u3044\u5834\u5408\u3001\u65B0\u898F\u30B9\u30EC\u30C3\u30C9\u304C\u4F5C\u6210\u3055\u308C\u307E\u3059\u3002\u30B3\u30A2\u30B5\u30A4\u30BA\u3088\u308A\u3082\u5C0F\u3055\u304F\u306A\u3044\u5834\u5408\u306F\u3001\u30BF\u30B9\u30AF\u306F\u30AD\u30E5\u30FC\u5185\u306B\u7F6E\u304B\u308C\u307E\u3059\u3002\u3053\u306E\u7A2E\u306E\u30A8\u30B0\u30BC\u30AD\u30E5\u30FC\u30BF\u30FC\u306B\u904E\u5270\u306A\u30BF\u30B9\u30AF\u304C\u30B5\u30D6\u30DF\u30C3\u30C8\u3067\u304D\u308B\u3088\u3046\u306B\u3057\u3066\u3044\u308B\u5834\u5408\u3001\u30E1\u30E2\u30EA\u4E0D\u8DB3\u306E\u72B6\u6CC1\u304C\u767A\u751F\u3059\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002
unbounded-queue-thread-pool.add=\u30D0\u30A4\u30F3\u30C9\u3055\u308C\u3066\u3044\u306A\u3044\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u3092\u8FFD\u52A0
unbounded-queue-thread-pool.remove=\u30D0\u30A4\u30F3\u30C9\u3055\u308C\u3066\u3044\u306A\u3044\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u3092\u524A\u9664
unbounded-queue-thread-pool.rejected-count=\u5374\u4E0B\u3055\u308C\u305F\u30BF\u30B9\u30AF\u6570
