threads=O sub-sistema thread, usado para declarar os pools e recursos de thread gerenci\u00E1vel. 
threads.add=Adiciona o sub-sistema thread.
threads.remove=Remove o sub-sistema thread.
threads.thread-factory=Um conjunto de cria\u00E7\u00E3o de thread.
threads.blocking-bounded-queue-thread-pool=Um conjunto de pools de thread onde tarefas s\u00E3o armazenadas numa fila de tamanho-vinculado e onde threads submetendo tarefas ser\u00E3o b\u00E7loqueados at\u00E9 que o espa\u00E7o esteja dispon\u00EDvel na fila.
threads.blocking-queueless-thread-pool=Um conjunto de pools de thread que n\u00E3o s\u00E3o enfileirados e onde os threads submetendo tarefas ser\u00E3o bloqueados at\u00E9 que o thread do pool esteja dispon\u00EDvel para executar a tarefa.
threads.bounded-queue-thread-pool=Um conjunto de pools de thread onde as tarefas s\u00E3o armazenadas numa fila de tamanho vinculado e onde, caso nenhum espa\u00E7o esteja dispon\u00EDvel nas tarefas da fila, ser\u00E3o descartados ou passados a outro 'executor de entrega' para execu\u00E7\u00E3o.
threads.queueless-thread-pool=Um conjunto de pools de thread que n\u00E3o s\u00E3o enfileirados e onde, caso nenhum thread de pool esteja dispon\u00EDvel para manuseio da tarefa, as tarefas ser\u00E3o tanto descartadas ou passadas a outro 'executor de entrega' para execu\u00E7\u00E3o. 
threads.unbounded-queue-thread-pool=Um conjunto de pools onde as tarefas s\u00E3o armazenadas numa fila sem tamanho m\u00E1ximo.
threads.scheduled-thread-pool=Um conjunto de pools de thread esquematizados.
thread-factory=A cria\u00E7\u00E3o de thread (implantando java.util.concurrent.ThreadFactory).
thread-factory.add=Adiciona uma cria\u00E7\u00E3o de thread
thread-factory.name=O nome de cria\u00E7\u00E3o de thread criado.
thread-factory.group-name=Especifica o nome de um grupo de thread para construir essa cria\u00E7\u00E3o de thread.
thread-factory.thread-name-pattern=O modelo usado para criar nomes para threads. Os seguintes padr\u00F5es poder\u00E3o ser usados\:\n       %% - emite o sinal de percentagem\u00B6\n\t%t - emite o n\u00FAmero de sequ\u00EAncia thread por-cria\u00E7\u00E3o\u00B6\n\t%g - emite o n\u00FAmeri de sequ\u00EAncia thread global\u00B6\n\t%f - emite o n\u00FAmero de sequ\u00EAncia de cria\u00E7\u00E3o\u00B6\n\t%i - emite a ID de thread.
thread-factory.priority=Isto pode ser usado para especificar a prioridade do thread dos threads criados.
thread-factory.remove=Remove a cria\u00E7\u00E3o do thread
threadpool.common.name=O nome do pool do thread.
threadpool.common.thread-factory=Especifica o nome de uma cria\u00E7\u00E3o de thread espec\u00EDfica para uso com o objetivo de criar os threads dos trabalhadores. Caso n\u00E3o definido, uma cria\u00E7\u00E3o de thread padr\u00E3o apropriada ser\u00E1 usada.
threadpool.common.max-threads=O tamanho m\u00E1ximo do pool de thread. 
threadpool.common.core-threads=O tamanho do pool do thread principal que \u00E9 menor do que o tamanho m\u00E1ximo de pool. Caso indefinido, o tamanho do pool de thread principal \u00E9 o mesmo ao do tamanho de pool de thread m\u00E1ximo.
threadpool.common.keepalive-time=Usado para especificar a quantia de tempo que os threads de pool devem continuar rodando quando ociosos. Caso n\u00E3o seja especificado, os threads rodar\u00E3o at\u00E9 que o executor seja encerrado.
threadpool.common.keepalive-time.time=O per\u00EDodo
threadpool.common.keepalive-time.unit=A unidade de tempo
threadpool.common.allow-core-timeout=Se \u00E9 que os threads entrar\u00E3o em intervalo.
threadpool.common.handoff-executor=Um executor para delegar as tarefas num evento que a tarefa n\u00E3o pode ser aceita. Caso n\u00E3o especificado, as tarefas que n\u00E3o possam ser aceitas ser\u00E3o descartadas silenciosamente.
threadpool.common.queue-length=O comprimento da fila.
threadpool.common.active-count=O n\u00FAmero aproximado de threads que est\u00E3o executando tarefas ativamente.
threadpool.common.completed-task-count=O n\u00FAmero total aproximado de tarefas que completaram a execu\u00E7\u00E3o. 
threadpool.common.current-thread-count=O n\u00FAmero atual de threads no pool.
threadpool.common.largest-thread-count=O n\u00FAmero m\u00E1ximo de threds que estiveram simultaneamente no pool.
threadpool.common.task-count=O n\u00FAmero total aproximado de tarefas que foram esquematizados para a execu\u00E7\u00E3o.
blocking-bounded-queue-thread-pool=Um executor de pool do thread com a fila vincula onde as tarefas de submiss\u00F5es dos threads podem bloquear. Tal pool de thread possui um core, um tamanho m\u00E1ximo e um comprimento de fila especificado. Quando a tarefa \u00E9 submetida, caso o n\u00FAmero de threads rodando for menor que o tamanho do core, um novo thread ser\u00E1 criado. Do contr\u00E1rio, caso haja espa\u00E7o na fila, a tarefa ser\u00E1 enfileirada. Por outro lado, se um n\u00FAmero de threads rodando for inferior ao tamanho m\u00E1ximo, um novo thread ser\u00E1 criado, sen\u00E3o o chamador bloquear\u00E1 at\u00E9 que jaja espa\u00E7o dispon\u00EDvel na fila.
blocking-bounded-queue-thread-pool.add=Adiciona o pool bloqueado do thread de fila vinculada.
blocking-bounded-queue-thread-pool.remove=Remove o pool bloqueado do thread de fila vinculada.
blocking-bounded-queue-thread-pool.rejected-count=O n\u00FAmero de tarefas que foram passadas ao executor de entrega (caso n\u00E3o especificado) ou descartado.
bounded-queue-thread-pool=Um executor de pool do thread com a fila vinculda onde as tarefas de submiss\u00F5es dos threads n\u00E3o ser\u00E3o bloqueadas. Tal pool de thread possui um core, um tamanho m\u00E1ximo e um comprimento de fila especificado. Quando a tarefa \u00E9 submetida, caso o n\u00FAmero de threads rodando for menor que o tamanho do core, um novo thread ser\u00E1 criado. Do contr\u00E1rio, caso haja espa\u00E7o na fila, a tarefa ser\u00E1 enfileirada. Por outro lado, se um n\u00FAmero de threads rodando for inferior ao tamanho m\u00E1ximo, um novo thread ser\u00E1 criado. Caso contr\u00E1rio, a tarefa \u00E9 entregue ao executor de entrega designado, caso nenhum seja especificado, sen\u00E3o a tarefa ser\u00E1 descartada.
bounded-queue-thread-pool.add=Adiciona o pool do thread vinculado.
bounded-queue-thread-pool.remove=Remove o pool do thread vinculado.
bounded-queue-thread-pool.rejected-count=O n\u00FAmero de tarefas que foram passadas ao executor de entrega (caso seja especificado) ou descartado.
blocking-queueless-thread-pool=O executor do pool do thread sem fila onde as tarefas de submiss\u00F5es dos threads podem bloquear. Quando a tarefa \u00E9 submetida, caso o n\u00FAmero de threads rodando for inferior ao tamanho m\u00E1ximo, um novo thread ser\u00E1 criado. Do contr\u00E1rio, o chamador bloqueia at\u00E9 que outro thread complete sua tarefa e aceita uma nova.
blocking-queueless-thread-pool.add=Adiciona o pool bloqueado do thread sem fila.
blocking-queueless-thread-pool.remove=Remove o pool bloqueado do thread sem fila.
blocking-queueless-thread-pool.rejected-count=O n\u00FAmero de tarefas que foram passadas ao executor de entrega (caso seja especificado) ou descartado.
queueless-thread-pool=O executor do pool do thread sem a fila onde as tarefas de submiss\u00F5es dos threads n\u00E3o ser\u00E3o bloqueadas. Quando a tarefa \u00E9 submetida, caso o n\u00FAmero de threads rodando for inferior ao tamanho m\u00E1ximo, um novo thread ser\u00E1 criado. Do contr\u00E1rio, a tarefa \u00E9 entregue ao executor de entregua designado, caso especificado, ou a tarefa ser\u00E1 descartada.
queueless-thread-pool.add=Adiciona o pool do thread sem fila.
queueless-thread-pool.remove=Remove o pool do thread sem fila.
queueless-thread-pool.rejected-count=O n\u00FAmero de tarefas que foram passadas ao executor de entrega (caso especificado) ou descartado.
scheduled-thread-pool=O executor do pool do thread esquematizado.
scheduled-thread-pool.add=Adiciona o pool do thread sem fila.
scheduled-thread-pool.remove=Remove o pool do thread sem fila.
unbounded-queue-thread-pool=O executor do pool do thread com uma fila desvinculada. Tal pool do thread possui um tamanho core e uma fila sem limite superior. Quando a tarefa \u00E9 submetida, caso o n\u00FAmero de threads rodando for inferior ao tamanho do core, um novo thread ser\u00E1 criado. Do contr\u00E1rio, a tarefa ser\u00E1 posicionada na fila. Caso muitas tarefas forem permitidas \u00E0 submiss\u00E3o deste tipo de executor, um excesso de mem\u00F3ria poder\u00E1 ocorrer.
unbounded-queue-thread-pool.add=Adiciona um pool de thread sem vincula\u00E7\u00E3o.
unbounded-queue-thread-pool.remove=Remove um pool de thread sem vincula\u00E7\u00E3o.
unbounded-queue-thread-pool.rejected-count=O n\u00FAmero de tarefas que foram rejeitadas.
