modcluster=La configuraci\u00F3n del sub-sistema modcluster.
modcluster.add=Operaci\u00F3n de adici\u00F3n del sub-sistema modcluster.
modcluster.remove=Operaci\u00F3n de borrado del sub-sistema modcluster.
modcluster.configuration=La configuraci\u00F3n com\u00FAn del modcluster.
modcluster.proxy-host=El nombre de host del proxy (Apache httpd)
modcluster.proxy-port=Puerto en donde el proxy (Apache httpd) est\u00E1 recibiendo el MCMP
modcluster.proxy-list=Lista de proxies a los cuales est\u00E1 conectado el nodo. Formato (hostname\:port) separado con comas.
modcluster.read-proxies-info=Enviar INFO a httpd y presentar el resultado.
modcluster.proxies-info=Resultado del comando INFO.
modcluster.read-proxies-configuration=Enviar DUMP a httpd y presentar el resultado.
modcluster.proxies-configuration=Resultado del comando DUMP.
modcluster.list-proxies=Leer la lista de httpd conectados al nodo.
modcluster.add-proxy=Agregar el proxy a la lista de httpd conectados al nodo.
modcluster.remove-proxy=Borrar el proxy a la lista de httpd conectados al nodo.
modcluster.refresh=Refrescar el nodo enviando un nuevo mensaje CONFIG a Apache httpd.
modcluster.reset=Re-establecer la conexi\u00F3n del nodo a Apache httpd.
modcluster.virtualhost=Nombre del host virtual que contiene el contexto.
modcluster.context=Contexto (como por ejemplo /myapp).
modcluster.waittime=Cantidad m\u00E1xima de tiempo que modcluster por la operaci\u00F3n STOP. En segundos. Por defecto es 10s 
modcluster.enable-context=Le dice a Apache httpd que el contexto est\u00E1 listo para recibir peticiones.
modcluster.stop-context=Le dice a Apache httpd que el contexto no puede procesar peticiones.
modcluster.disable-context=Le dice a Apache httpd que el contexto no puede procesar nuevas peticiones.
modcluster.enable=Le dice a Apache httpd que todos los contextos del nodo est\u00E1n listos para recibir peticiones.
modcluster.stop=Le dice a Apache httpd que todos los contextos del nodo no pueden procesar peticiones.
modcluster.disable=Le dice a Apache httpd que todos los contextos del nodo no pueden procesar nuevas peticiones.
modcluster.configuration.advertise-socket=Nombre del enlace del socket a utilizar para el socket Advertise.
modcluster.configuration.proxy-list=Lista de proxies, formato (hostname\:port) separado con comas.
modcluster.configuration.proxy-url=URL base para peticiones MCMP.
modcluster.configuration.advertise=Usar la l\u00F3gica Advertise o no.
modcluster.configuration.advertise-security-key=Cadena que contiene la llave de seguridad para la l\u00F3gica Advertise.
modcluster.configuration.excluded-contexts=Lista de contextos que mod_cluster debe ignorar, formato de cadena separado con comas.
modcluster.configuration.auto-enable-contexts=Habilitar los contextos incluso si est\u00E1 inhabilitado en mod_cluster_manger (httpd).
modcluster.configuration.stop-context-timeout=Tiempo m\u00E1ximo a esperar para que el contexto procese peticiones pendientes.
modcluster.configuration.socket-timeout=Tiempo de expiraci\u00F3n para esperar a que httpd responda un mensaje MCMP.
modcluster.configuration.sticky-session=Usar sesiones pegajosas para las peticiones.
modcluster.configuration.sticky-session-remove=Borrar la informaci\u00F3n de sesi\u00F3n en una conmutaci\u00F3n de servidor en caso de fallo.
modcluster.configuration.sticky-session-force=No conmute servidores en caso de fallos de una petici\u00F3n con informaci\u00F3n de la sesi\u00F3n.
modcluster.configuration.ssl=La configuraci\u00F3n SSL a la l\u00F3gica MCMP de cliente.
modcluster.configuration.ssl-add=Agregar una configuraci\u00F3n predeterminada SSL a la l\u00F3gica MCMP de cliente.
modcluster.configuration.ssl-remove=Borra la configuraci\u00F3n SSL de la l\u00F3gica MCMP de cliente.
modcluster.configuration.ssl.key-alias=Alias de llave.
modcluster.configuration.ssl.password=Contrase\u00F1a.
modcluster.configuration.ssl.certificate-key-file=Archivo de llave para el certificado.
modcluster.configuration.ssl.cipher-suite=La cifra permitida de paquete.
modcluster.configuration.ssl.protocol=Los protocolos SSL que est\u00E1n disponibles.
modcluster.configuration.ssl.ca-certificate-file=Autoridad certificadora.
modcluster.configuration.ssl.ca-revocation-url=Lista de revocaci\u00F3n de autoridad certificadora.
modcluster.configuration.worker-timeout=Tiempo de expiraci\u00F3n para esperar en httpd para que un trabajador disponible procesara las peticiones.
modcluster.configuration.max-attempts=N\u00FAmero m\u00E1ximo de intentos para procesar una petici\u00F3n idempotente.
modcluster.configuration.flush-packets=Habilita/inhabilita el vaciado de paquetes en httpd.
modcluster.configuration.flush-wait=Tiempo de espera antes de vaciar los paquetes en httpd.
modcluster.configuration.ping=Tiempo (en segundos) a esperar por una respuesta pong de un ping.
modcluster.configuration.smax=Conteo de m\u00E1ximo flexible de las conexiones inactivas en httpd
modcluster.configuration.ttl=Tiempo de vida (en segundos) para las conexiones inactivas por encima de smax
modcluster.configuration.node-timeout=Tiempo de expiraci\u00F3n (en segundos) para las conexiones proxy a un nodo.
modcluster.configuration.balancer=El nombre del balanceador.
modcluster.configuration.domain=Nombre loadBalancingGroup.
modcluster.configuration.metric.type=Tipo de m\u00E9trica
modcluster.configuration.metric.class=Nombre de la clase de la m\u00E9trica personalizada.
modcluster.configuration.metric.weight=Peso de la m\u00E9trica.
modcluster.configuration.metric.capacity=Capacidad de la m\u00E9trica.
modcluster.configuration.metric.property=Propiedades para la m\u00E9trica.
modcluster.configuration.add-metric=Agregar nueva m\u00E9trica al proveedor del balanceador de carga.
modcluster.configuration.remove-metric=Borrar una m\u00E9trica del proveedor del balanceador de carga.
modcluster.configuration.add-custom-metric=Agregar nueva m\u00E9trica personalizada al proveedor del balanceador de carga.
modcluster.configuration.remove-custom-metric=Borrar una m\u00E9trica personalizada del proveedor del balanceador de carga.
