modcluster=A configura\u00E7\u00E3o do sub-sistema modcluster.
modcluster.add=A opera\u00E7\u00E3o adicionando o sub-sistema modcluster.
modcluster.remove=A opera\u00E7\u00E3o removendo o sub-sistema modcluster.
modcluster.configuration=A configura\u00E7\u00E3o modcluster comum. 
modcluster.proxy-host=O hostname do proxy (Apache httpd)
modcluster.proxy-port=A porta onde o proxy (Apache httpd) est\u00E1 recebendo o MCMP
modcluster.proxy-list=Lista dos proxies onde o n\u00F3 est\u00E1 conectado. O formato (hostname\:port) \u00E9 separado com v\u00EDrgula.
modcluster.read-proxies-info=Envia uma INFO ao httpd e exibe o resultado.
modcluster.proxies-info=Resulta o comando INFO.
modcluster.read-proxies-configuration=Envia um DUMP e exibe o resultado.
modcluster.proxies-configuration=Resultado do comando DUMP.
modcluster.list-proxies=L\u00EA a lista do httpd conectado ao n\u00F3.
modcluster.add-proxy=Adiciona o proxy \u00E0 lista do httpd conectado ao n\u00F3.
modcluster.remove-proxy=Remove o proxy \u00E0 lista do httpd conectado ao n\u00F3.
modcluster.refresh=Atualiza o n\u00F3 enviando uma nova mensagem CONFIG ao Apache httpd.
modcluster.reset=Reinicia a conex\u00E3o do n\u00F3 ao Apache httpd. 
modcluster.virtualhost=O nome do virtual-host contendo o contexto.
modcluster.context=O contexto (ex.\: /myapp).
modcluster.waittime=O tamanho m\u00E1ximo de tempo que o modcluster ENCERRAR\u00C1 a opera\u00E7\u00E3o. Em segundos. O padr\u00E3o \u00E9 10 segundos
modcluster.enable-context=Informa ao Apache httpd que o contexto est\u00E1 pronto para receber mensagens.
modcluster.stop-context=Informa ao Apache httpd que o contexto n\u00E3o pode processar as solicita\u00E7\u00F5es.
modcluster.disable-context=Informa ao Apache httpd que o contexto n\u00E3o pode processar novas solicita\u00E7\u00F5es.
modcluster.enable=Informa ao Apache httpd que todos os contextos do n\u00F3 est\u00E3o prontos para receber solicita\u00E7\u00F5es.
modcluster.stop=Informa ao Apache httpd que todos os contextos do n\u00F3 n\u00E3o podem processar solicita\u00E7\u00F5es.
modcluster.disable=Informa ao Apache httpd que todos os contextos do n\u00E3o n\u00E3o podem processar novas solicita\u00E7\u00F5es.
modcluster.configuration.advertise-socket=O nome do binding do Soquete para uso do soquete anunciante.
modcluster.configuration.proxy-list=Lista os proxies, Formato (hostname\:port) \u00E9 separado por v\u00EDrgula.
modcluster.configuration.proxy-url=URL base para as solicita\u00E7\u00F5es MCMP.
modcluster.configuration.advertise=Usa ou n\u00E3o a l\u00F3gica Anunciante.
modcluster.configuration.advertise-security-key=Sequ\u00EAncia contendo a chave de seguran\u00E7a para a l\u00F3gica Anunciante.
modcluster.configuration.excluded-contexts=Lista de contextos mod_cluster que deve ser ignorada. A Sequ\u00EAncia do Formato \u00E9 separada por v\u00EDrgulas.
modcluster.configuration.auto-enable-contexts=Ativa os contextos mesmo que desativados no mod_cluster_manger (httpd).
modcluster.configuration.stop-context-timeout=O per\u00EDodo m\u00E1ximo de espera para processar as solicita\u00E7\u00F5es pendentes.
modcluster.configuration.socket-timeout=O intervalo de espera para o httpd responder uma mensagem MCMP.
modcluster.configuration.sticky-session=Usa as sess\u00F5es sticky para solicita\u00E7\u00F5es.
modcluster.configuration.sticky-session-remove=Remove a informa\u00E7\u00E3o da sess\u00E3o na falha.
modcluster.configuration.sticky-session-force=N\u00E3o falhe uma solicita\u00E7\u00E3o sem a informa\u00E7\u00E3o da sess\u00E3o.
modcluster.configuration.ssl=A configura\u00E7\u00E3o SSL para a l\u00F3gica MCMP do cliente.
modcluster.configuration.ssl-add=Adiciona a configura\u00E7\u00E3o padr\u00E3o SSL \u00E0 l\u00F3gica MCMP do cliente.
modcluster.configuration.ssl-remove=Remove a configura\u00E7\u00E3o SSL da l\u00F3gica MCMP.
modcluster.configuration.ssl.key-alias=O alias da chave.
modcluster.configuration.ssl.password=Senha.
modcluster.configuration.ssl.certificate-key-file=O arquivo de chave para o certificado.
modcluster.configuration.ssl.cipher-suite=O cipher suite permitido.
modcluster.configuration.ssl.protocol=Os protocolos SSl que est\u00E3o ativados.
modcluster.configuration.ssl.ca-certificate-file=A autoridade do certificado.
modcluster.configuration.ssl.ca-revocation-url=A lista de revoca\u00E7\u00E3o da autoridade do certificado.
modcluster.configuration.worker-timeout=O intervalo de espera no httpd para o trabalhador dispon\u00EDvel ao processo de solicita\u00E7\u00F5es.
modcluster.configuration.max-attempts=Tentativas m\u00E1ximas ao processo de uma solicita\u00E7\u00E3o idempotente.
modcluster.configuration.flush-packets=Ativa/Desativa o esvaziamento do pacote no httpd.
modcluster.configuration.flush-wait=O tempo de espera antes de esvaziar os pacotes no httpd.
modcluster.configuration.ping=O tempo (em segundos) de espera por uma resposta pong a um ping.
modcluster.configuration.smax=A contagem leve da conex\u00E3o ociosa m\u00E1xima no httpd
modcluster.configuration.ttl=O tempo de vida (em segundos) para as conex\u00F5es ociosas acima de smax
modcluster.configuration.node-timeout=O intervalo (em segundos) para as conex\u00F5es proxy a um n\u00F3.
modcluster.configuration.balancer=O nome do balanceador.
modcluster.configuration.domain=O nome loadBalancingGroup.
modcluster.configuration.metric.type=Tipo de m\u00E9trica
modcluster.configuration.metric.class=O nome da classe de m\u00E9trica personalizada.
modcluster.configuration.metric.weight=Peso da m\u00E9trica.
modcluster.configuration.metric.capacity=Capacidade da m\u00E9trica.
modcluster.configuration.metric.property=Propriedades para a m\u00E9trica.
modcluster.configuration.add-metric=Adiciona uma nova m\u00E9trica ao provedor do balanceador de carga.
modcluster.configuration.remove-metric=Remove uma m\u00E9trica do provedor do balanceador de carga.
modcluster.configuration.add-custom-metric=Adiciona uma nova m\u00E9trica personalizada ao provedor do balanceador de carga.
modcluster.configuration.remove-custom-metric=Remove uma m\u00E9trica personalizada do provedor do balanceador de carga.
