modcluster=La configuration du sous-syst\u00E8me modcluster
modcluster.add=Op\u00E9ration ajoutant le sous-syst\u00E8me modcluster
modcluster.remove=Op\u00E9ration supprimant le sous-syst\u00E8me modcluster
modcluster.configuration=La configuration courante du modcluster
modcluster.proxy-host=Nom d'h\u00F4te du proxy (Apache httpd)
modcluster.proxy-port=Port o\u00F9 le proxy (Apache httpd) re\u00E7oit le MCMP
modcluster.proxy-list=Liste des proxies sur lesquels le n\u0153ud est connect\u00E9. Format (nom d'h\u00F4te\:port) s\u00E9par\u00E9 par des virgules.
modcluster.read-proxies-info=Envoi INFO \u00E0 httpd et affiche le r\u00E9sultat.
modcluster.proxies-info=R\u00E9sultat de la commande INFO.
modcluster.read-proxies-configuration=Envoi DUMP \u00E0 httpd et affiche le r\u00E9sultat.
modcluster.proxies-configuration=R\u00E9sultat de la commande DUMP.
modcluster.list-proxies=Lit la liste des httpd connect\u00E9s au n\u0153ud.
modcluster.add-proxy=Ajoute un proxy \u00E0 la liste des httpd connect\u00E9s au n\u0153ud.
modcluster.remove-proxy=Supprime un proxy de la liste des httpd connect\u00E9s au n\u0153ud.
modcluster.refresh=Rafra\u00EEchit le n\u0153ud en envoyant un nouveau message CONFIG \u00E0 Apache httpd.
modcluster.reset=Restaure la connexion du n\u0153ud \u00E0 Apache httpd.
modcluster.virtualhost=Nom de l'h\u00F4te virtuel contenant le contexte.
modcluster.context=Contexte (like /myapp par exemple).
modcluster.waittime=Dur\u00E9e maximum dont le modcluster a besoin pour l'op\u00E9ration STOP. En secondes. Valeur par d\u00E9faut 10s
modcluster.enable-context=Informe Apache httpd que le contexte est pr\u00EAt \u00E0 recevoir des requ\u00EAtes.
modcluster.stop-context=Informe Apache httpd que le contexte ne peut pas traiter les requ\u00EAtes.
modcluster.disable-context=Informe Apache httpd que le contexte ne peut pas traiter les nouvelles requ\u00EAtes.
modcluster.enable=Informe Apache httpd que l'ensemble des contextes du n\u0153ud sont pr\u00EAts \u00E0 recevoir des requ\u00EAtes.
modcluster.stop=Informe Apache httpd que l'ensemble des contextes du n\u0153ud ne peuvent pas traiter les requ\u00EAtes.
modcluster.disable=Informe Apache httpd que l'ensemble des contextes du n\u0153ud ne peuvent pas traiter les nouvelles requ\u00EAtes.
modcluster.configuration.advertise-socket=Nom de la liaison de sockets \u00E0 utiliser pour le socket Advertise.
modcluster.configuration.proxy-list=Liste des proxies, Format (nom d'h\u00F4te\:port) s\u00E9par\u00E9 par des virgules.
modcluster.configuration.proxy-url=URL de base pour les requ\u00EAtes MCMP.
modcluster.configuration.advertise=Utiliser Advertise ou non.
modcluster.configuration.advertise-security-key=Cha\u00EEne qui contient la cl\u00E9 de s\u00E9curit\u00E9 de la logique Advertise.
modcluster.configuration.excluded-contexts=Liste des contextes que mod_cluster doit ignorer, Format String s\u00E9par\u00E9 par des virgules.
modcluster.configuration.auto-enable-contexts=Active les contextes m\u00EAme si d\u00E9sactiv\u00E9s en mod_cluster_manger (httpd).
modcluster.configuration.stop-context-timeout=Dur\u00E9e maximum d'attente avant que le processus g\u00E8re les requ\u00EAtes en attente.
modcluster.configuration.socket-timeout=Dur\u00E9e du timeout avant qu'httpd ne r\u00E9ponde \u00E0 un message MCMP.
modcluster.configuration.sticky-session=Utiliser les sticky sessions pour les requ\u00EAtes.
modcluster.configuration.sticky-session-remove=Supprimer l'information de session sur le basculement.
modcluster.configuration.sticky-session-force=Ne fa\u00EEtes pas basculer une requ\u00EAte avec les informations de session.
modcluster.configuration.ssl=La configuration SSL dans la logique MCMP du client.
modcluster.configuration.ssl-add=Ajouter la configuration SSL par d\u00E9faut dans la logique MCMP du client.
modcluster.configuration.ssl-remove=Supprimer la configuration SSL de la logique MCMP du client.
modcluster.configuration.ssl.key-alias=Alias cl\u00E9.
modcluster.configuration.ssl.password=Mot de passe.
modcluster.configuration.ssl.certificate-key-file=Fichier cl\u00E9 du certificat.
modcluster.configuration.ssl.cipher-suite=Suite chiffr\u00E9e permise.
modcluster.configuration.ssl.protocol=Protocoles SSL activ\u00E9s.
modcluster.configuration.ssl.ca-certificate-file=Autorit\u00E9 du certificat.
modcluster.configuration.ssl.ca-revocation-url=Liste de r\u00E9vocation d'autorit\u00E9 des certificats.
modcluster.configuration.worker-timeout=Dur\u00E9e de timeout dans httpd pour qu'un worker disponible puisse pr\u00E9c\u00E9der les requ\u00EAtes.
modcluster.configuration.max-attempts=Nombre maximum de tentatives de traitement de la requ\u00EAte idempotent.
modcluster.configuration.flush-packets=Activer/d\u00E9sactiver le vidage du paquet dans httpd.
modcluster.configuration.flush-wait=Dur\u00E9e d'attente avant de vider les packets dans httpd.
modcluster.configuration.ping=Dur\u00E9e (en secondes) d'attente pour la r\u00E9ponse d'un pong \u00E0 un ping.
modcluster.configuration.smax=Nombre maximum de connexions souples inactives en httpd
modcluster.configuration.ttl=Dur\u00E9e de vie (en secondes) des connexions inactives au dessus de smax
modcluster.configuration.node-timeout=Timeout (en secondes) pour les connexions de proxy vers un n\u0153ud.
modcluster.configuration.balancer=Le nom de l'\u00E9quilibreur des charges.
modcluster.configuration.domain=Nom du loadBalancingGroup.
modcluster.configuration.metric.type=Type de m\u00E9trique
modcluster.configuration.metric.class=Nom de classe du m\u00E9trique personnalis\u00E9.
modcluster.configuration.metric.weight=Poids du m\u00E9trique.
modcluster.configuration.metric.capacity=Capacit\u00E9 du m\u00E9trique.
modcluster.configuration.metric.property=Propri\u00E9t\u00E9s du m\u00E9trique.
modcluster.configuration.add-metric=Ajouter un nouveau m\u00E9trique au fournisseur de l'\u00E9quilibreur des charges.
modcluster.configuration.remove-metric=Supprimer un m\u00E9trique du fournisseur de l'\u00E9quilibreur des charges.
modcluster.configuration.add-custom-metric=Ajouter un nouveau m\u00E9trique personnalis\u00E9 au fournisseur de l'\u00E9quilibreur des charges.
modcluster.configuration.remove-custom-metric=Supprimer un m\u00E9trique personnalis\u00E9 du fournisseur de l'\u00E9quilibreur des charges.
