# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-clustering-infinispan/org/jboss/as/clustering/infinispan/subsystem/LocalDescriptions, author ldelima@redhat.com
infinispan=A configura\u00E7\u00E3o do subsistema infinispan.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-clustering-infinispan/org/jboss/as/clustering/infinispan/subsystem/LocalDescriptions, author ldelima@redhat.com
infinispan.add=Adiciona o subsistema do infinispan.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-clustering-infinispan/org/jboss/as/clustering/infinispan/subsystem/LocalDescriptions, author ldelima@redhat.com
infinispan.describe=Descreve o subsistema do infinispan
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-clustering-infinispan/org/jboss/as/clustering/infinispan/subsystem/LocalDescriptions, author ldelima@redhat.com
infinispan.remove=Remove o subsistema do infinispan
infinispan.cache-container=A configura\u00E7\u00E3o de um cont\u00EAiner do cache infinispan
infinispan.cache-container.default-cache=O cache infinispan padr\u00E3o
infinispan.cache-container.listener-executor=O executor usado para a fila de replica\u00E7\u00E3o
infinispan.cache-container.eviction-executor=O executor usado para a evidica\u00E7\u00E3o
infinispan.cache-container.replication-queue-executor=O executor usado para as opera\u00E7\u00F5es de cache ass\u00EDncronas
infinispan.cache-container.jndi-name=O nome jndi pelo qual executar o bind neste cont\u00EAiner de cache
infinispan.cache-container.module=O m\u00F3dulo cujo carregador de classe deve ser usado quando construindo esta configura\u00E7\u00E3o do cont\u00EAiner de cache.
infinispan.cache-container.start=O modo de inicializa\u00E7\u00E3o do cont\u00EAiner, que pode ser EAGER (imediatamente inicializado) ou LAZY (inicializado sob solicita\u00E7\u00E3o).
infinispan.cache-container.cache=A lista de caches dispon\u00EDveis ao cont\u00EAiner de cache
infinispan.cache-container.singleton=Um conjunto de elementos de configura\u00E7\u00E3o do cont\u00EAiner de cache.
infinispan.cache-container.aliases=A lista de aliases para este cont\u00EAiner de cache
infinispan.cache-container.aliases.alias=Um alias para este cont\u00EAiner de cache
infinispan.cache-container.alias=Um alias para este cont\u00EAiner de cache
infinispan.cache-container.alias.name=O nome do alias para adi\u00E7\u00E3o ou remo\u00E7\u00E3o
infinispan.cache-container.alias.add-alias=Adiciona um alias para esse cont\u00EAiner do cache
infinispan.cache-container.alias.remove-alias=Remove um alias para esse cont\u00EAiner do cache
infinispan.cache-container.add=Adiciona um cont\u00EAiner do cache ao subsistema infinispan
infinispan.cache-container.remove=Remove um cont\u00EAiner do cache do subsistema infinispan
infinispan.cache-container.transport=Um child de transporte do cont\u00EAiner do cache.
infinispan.cache-container.local-cache=Um child de cache replicado do cont\u00EAiner do cache.
infinispan.cache-container.invalidation-cache=Um child do cache de invalida\u00E7\u00E3o do cont\u00EAiner do cache.
infinispan.cache-container.replicated-cache=Um child replicado do cont\u00EAiner do cache.
infinispan.cache-container.distributed-cache=Um child de cache distribu\u00EDdo do cont\u00EAiner do cache.
infinispan.transport=A descri\u00E7\u00E3o de transporte usada pelo cont\u00EAiner do cache
infinispan.transport.add=Adiciona o transporte ao cont\u00EAiner do cache
infinispan.transport.remove=Remove o transporte do cont\u00EAiner do cache
infinispan.transport.stack=A pilha jgroups para uso do transporte
infinispan.transport.cluster=O nome do cluster de comunica\u00E7\u00E3o do grupo
infinispan.transport.executor=O executor de uso para o transporte
infinispan.transport.lock-timeout=O tempo limite de bloqueio do transporte
infinispan.transport.machine=O identificador da m\u00E1quina para o transporte
infinispan.transport.rack=O indentificador rack para o transporte
infinispan.transport.site=O identificador de site para o transporte
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-clustering-infinispan/org/jboss/as/clustering/infinispan/subsystem/LocalDescriptions, author ldelima@redhat.com
infinispan.cache.name=O nome do cache.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-clustering-infinispan/org/jboss/as/clustering/infinispan/subsystem/LocalDescriptions, author ldelima@redhat.com
infinispan.cache.mode=O modo do cache. Uso interno apenas.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-clustering-infinispan/org/jboss/as/clustering/infinispan/subsystem/LocalDescriptions, author ldelima@redhat.com
infinispan.cache.start=O modo de inicializa\u00E7\u00E3o do cache, que pode ser EAGER (in\u00EDcio imediato) ou LAZY (in\u00EDcio a pedido).
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-clustering-infinispan/org/jboss/as/clustering/infinispan/subsystem/LocalDescriptions, author ldelima@redhat.com
infinispan.cache.batching=Caso ativado, o API de envio de lote da invoca\u00E7\u00E3o estar\u00E1 dispon\u00EDvel para esse cache.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-clustering-infinispan/org/jboss/as/clustering/infinispan/subsystem/LocalDescriptions, author ldelima@redhat.com
infinispan.cache.indexing=Caso ativado, as entradas ser\u00E3o indexadas quando adicionadas ao cache. Os \u00EDndices ser\u00E3o atualizados uma vez que as entradas s\u00E3o alteradas ou removidas.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-clustering-infinispan/org/jboss/as/clustering/infinispan/subsystem/LocalDescriptions, author ldelima@redhat.com
infinispan.cache.jndi-name=O jndi-name a ser vinculado a essa inst\u00E2ncia.
infinispan.cache.module=O m\u00F3dulo cuja carregador de classe deve ser usado na constru\u00E7\u00E3o dessa configura\u00E7\u00E3o do cache.
infinispan.cache.indexing-properties=Propriedades para controle do comportamento de indexa\u00E7\u00E3o
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-clustering-infinispan/org/jboss/as/clustering/infinispan/subsystem/LocalDescriptions, author ldelima@redhat.com
infinispan.cache.remove=Remove o cache desse recipiente.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-clustering-infinispan/org/jboss/as/clustering/infinispan/subsystem/LocalDescriptions, author ldelima@redhat.com
infinispan.clustered-cache.async-marshalling=Caso ativado, isto levar\u00E1 ao empacotamentos das entradas a serem executadas de forma ass\u00EDncrona.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-clustering-infinispan/org/jboss/as/clustering/infinispan/subsystem/LocalDescriptions, author ldelima@redhat.com
infinispan.clustered-cache.mode=Determina o modo do cache com cluster, ASYNC para opera\u00E7\u00E3o ass\u00EDncrona ou SYNC para opera\u00E7\u00E3o s\u00EDncrona.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-clustering-infinispan/org/jboss/as/clustering/infinispan/subsystem/LocalDescriptions, author ldelima@redhat.com
infinispan.clustered-cache.queue-size=No modo ASYNC, esse atributo pode ser usado para aplicar o trigger no esvaziamento da fila quando ele alcan\u00E7ar um limite espec\u00EDfico.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-clustering-infinispan/org/jboss/as/clustering/infinispan/subsystem/LocalDescriptions, author ldelima@redhat.com
infinispan.clustered-cache.queue-flush-interval=No modo ASYNC, esse atributo controla a frequ\u00EAncia em que o thread ass\u00EDncrono usou para esvaziar as rodagens da fila de replica\u00E7\u00E3o. Isto deve ser um n\u00FAmero positivo que representa o per\u00EDodo de despertar do thread em mil\u00E9simos de segundos. 
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-clustering-infinispan/org/jboss/as/clustering/infinispan/subsystem/LocalDescriptions, author ldelima@redhat.com
infinispan.clustered-cache.remote-timeout=No modo SYNC, o intervalo (em mil\u00E9simos de segundos) usado para esperar um reconhecimento na realiza\u00E7\u00E3o de uma chamada remota, ap\u00F3s a chamada ser abortada e uma exce\u00E7\u00E3o ser lan\u00E7ada.
infinispan.local-cache=O cache local
infinispan.local-cache.add=Adiciona o cache local a este cont\u00EAiner do cache
infinispan.local-cache.remove=Remove o cache local a partir deste cont\u00EAiner
infinispan.invalidation-cache=Um cache de invalida\u00E7\u00E3o
infinispan.invalidation-cache.add=Adiciona um cache de invalida\u00E7\u00E3o a este cont\u00EAiner de cache
infinispan.invalidation-cache.remove=Remove um cache de invalida\u00E7\u00E3o a partir deste cont\u00EAiner de cache
infinispan.replicated-cache=O cache replicado
infinispan.replicated-cache.add=Adiciona um cache replicado a este cont\u00EAiner de cache
infinispan.replicated-cache.remove=Remove um cache replicado deste cont\u00EAiner de cache
infinispan.state-transfer=A configura\u00E7\u00E3o de transfer\u00EAncia de estado para distribui\u00E7\u00E3o e caches replicados.
infinispan.state-transfer.enabled=Caso ativado, isto levar\u00E1 o cache a perguntar os caches vizinhos pelo estado quando ele inicia, de forma que o cache come\u00E7a a 'esquentar', embora isto impacte no per\u00EDodo de inicializa\u00E7\u00E3o.
infinispan.state-transfer.timeout=O per\u00EDodo m\u00E1ximo de tempo (ms) de espera do estado dos caches vizinhos, antes de lan\u00E7ar uma exce\u00E7\u00E3o e iniciar a anula\u00E7\u00E3o.
infinispan.state-transfer.chunk-size=O tamanho, em bytes, para transferir em lote as entradas do cache.
infinispan.state-transfer.add=Adiciona a configura\u00E7\u00E3o da transfer\u00EAncia do estado.
infinispan.state-transfer.remove=Remove a configura\u00E7\u00E3o da transfer\u00EAncia do estado.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-clustering-infinispan/org/jboss/as/clustering/infinispan/subsystem/LocalDescriptions, author ldelima@redhat.com
infinispan.distributed-cache=O cache distribu\u00EDdo
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-clustering-infinispan/org/jboss/as/clustering/infinispan/subsystem/LocalDescriptions, author ldelima@redhat.com
infinispan.distributed-cache.owners=N\u00FAmero das r\u00E9plicas do cluster para cada entrada.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-clustering-infinispan/org/jboss/as/clustering/infinispan/subsystem/LocalDescriptions, author ldelima@redhat.com
infinispan.distributed-cache.virtual-nodes=Substiru\u00EDdo. N\u00E3o possui efeito.
infinispan.distributed-cache.virtual-nodes.deprecated=Substiru\u00EDdo. N\u00E3o possui efeito.
infinispan.distributed-cache.segments=Controla o n\u00FAmero de seguementos com espa\u00E7o hash que \u00E9 granulado para a distribui\u00E7\u00E3o da chave no cluster. O valor deve ser estritamente positivo.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-clustering-infinispan/org/jboss/as/clustering/infinispan/subsystem/LocalDescriptions, author ldelima@redhat.com
infinispan.distributed-cache.l1-lifespan=O tempo de vida m\u00E1ximo de uma entrada posicionada no cache de L1. Esse elemento configura o comportamento do cache de L1 nas inst\u00E2ncias de caches 'distribu\u00EDdas'. Esse elemento \u00E9 ignorado em quaisquer outros modos.
infinispan.distributed-cache.add=Adiciona o cache distribu\u00EDdo a este cont\u00EAiner do cache.
infinispan.distributed-cache.remove=Remove o cache distribu\u00EDdo a partir deste cont\u00EAiner do cache.
infinispan.locking=A configura\u00E7\u00E3o de bloqueio do cache.
infinispan.locking.isolation=Determina o n\u00EDvel de isola\u00E7\u00E3o de bloqueio.
infinispan.locking.striping=Caso verdadeiro, o pool de bloqueios compartilhados \u00E9 mantido para todas as entradas que precisam ser bloqueadas. Do contr\u00E1rio, um bloqueio \u00E9 criado por entrada no cache. A distribui\u00E7\u00E3o de bloqueio ajuda a controlar o footprint de mem\u00F3ria, por\u00E9m pode reduzir a simultaneidade no sistema.
infinispan.locking.acquire-timeout=O per\u00EDodo m\u00E1ximo para tentar uma aquisi\u00E7\u00E3o de bloqueio particular.
infinispan.locking.concurrency-level=O n\u00EDvel de simultaneidade para os cont\u00EAiners de bloqueio. Ajuste o valor de acordo com o n\u00FAmero de threads simult\u00E2neos interagindo com o Infinispan.
infinispan.locking.add=Adiciona o elemento de configura\u00E7\u00E3o de bloqueio ao cache.
infinispan.locking.remove=Remove o elemento de configura\u00E7\u00E3o de bloqueio do cache.
infinispan.transaction=A configura\u00E7\u00E3o de transi\u00E7\u00E3o do cache.
infinispan.transaction.mode=Determina o modo de transa\u00E7\u00E3o do cache a um de NONE, NON_XA, NON_DURABLE_XA, FULL_XA.
infinispan.transaction.stop-timeout=Caso houver quaisquer transa\u00E7\u00F5es sendo executadas quando o cache \u00E9 interrompido, o Infinispan espera por transa\u00E7\u00F5es em execu\u00E7\u00E3o remotas e locais sejam encerradas pelo tempo limite de encerramento do cache. 
infinispan.transaction.locking=O modo de bloqueio para este cache, um do OPTIMISTIC ou PESSIMISTIC.
infinispan.transaction.add=Adiciona o elemento de configura\u00E7\u00E3o da transa\u00E7\u00E3o ao cache.
infinispan.transaction.remove=Remove o elemento de configura\u00E7\u00E3o de transa\u00E7\u00E3o do cache.
infinispan.eviction=A configura\u00E7\u00E3o de evidica\u00E7\u00E3o do cache.
infinispan.eviction.strategy=Determina a estrat\u00E9gia de evidica\u00E7\u00E3o do cache. As op\u00E7\u00F5es dispon\u00EDveis s\u00E3o 'UNORDERED', 'FIFO', 'LRU', 'LIRS' e 'NONE' (para desativar a evidica\u00E7\u00E3o).
infinispan.eviction.max-entries=O n\u00FAmero m\u00E1ximo de entradas numa inst\u00E2ncia de cache. Caso o valor selecionado n\u00E3o \u00E9 ao quadrado, o valor atual padronizar\u00E1 ao menor valor ao quadrado do que o selecionado. -1 significa sem limite.
infinispan.eviction.add=Adiciona um elemento de configura\u00E7\u00E3o de evidica\u00E7\u00E3o ao cache.
infinispan.eviction.remove=Remove um elemento dfe configura\u00E7\u00E3o de evidica\u00E7\u00E3o do cache.
infinispan.expiration=A configura\u00E7a\u00F5 de expira\u00E7\u00E3o do cache.
infinispan.expiration.max-idle=O tempo m\u00E1ximo ocioso que uma entrada de cache ser\u00E1 mantida no cache em mil\u00E9simos de segundos. Caso o tempo ocioso exceder, a entrada ser\u00E1 expirada no cluster. -1 significa que as entradas nunca expiram.
infinispan.expiration.lifespan=O lifespan m\u00E1ximo de uma entrada de cache, ap\u00F3s a entrada ser expirada no cluster em mil\u00E9simos de segundos. -1 significa que as entradas nunca expiram.
infinispan.expiration.interval=Intervalo (em mil\u00E9simos de segundos) entre execu\u00E7\u00F5es subsequentes para limpar as entradas expiradas da mem\u00F3ria e quaisquer stores de cache. Caso voc\u00EA deseje desativar o processo de evidica\u00E7\u00E3o per\u00EDodico tamb\u00E9m, configure o wakeupInterval para -1.
infinispan.expiration.add=Adiciona um elemento de configura\u00E7\u00E3o de expira\u00E7\u00E3o ao cache.
infinispan.expiration.remove=Remove um elemento de configura\u00E7\u00E3o de expira\u00E7\u00E3o do cache.
infinispan.store=A configura\u00E7\u00E3o de store do cache.
infinispan.store.add=Adiciona o elemento de configura\u00E7\u00E3o de store do cache b\u00E1sico ao cache.
infinispan.store.remove=Remove o elemento de store do cache do cache.
infinispan.store.shared=Esta configura\u00E7\u00E3o deve ser configurada para verdadeiro quando inst\u00E2ncias de cache m\u00FAltiplas compartilham o mesmo store de cache (ex.\: n\u00F3s m\u00FAltiplos num cluster usando um JDBC baseado no CacheStpre direcionando ao mesmo banco de dados compartilhado. A configura\u00E7\u00E3o disto para verdadeiro evita que inst\u00E2ncias de cache m\u00FAltiplas gravem a mesma modifica\u00E7\u00E3o diversas vezes. Caso ativado, apenas o n\u00F3 onde a modifica\u00E7\u00E3o originou gravar\u00E1 no store do cache. Caso desativado, cada cache individual reage a uma atualiza\u00E7\u00E3o remota potencial aplicando o store nos dados para o store cache.
infinispan.store.preload=Caso verdadeiro, quando o cache inicia, os dados com store ter\u00E3o pr\u00E9-carregados na mem\u00F3ria. Isto \u00E9 particularmente \u00FAtil quando os dados no store do cache s\u00E3o necess\u00E1rios imediatamente ap\u00F3s a inicializa\u00E7\u00E3o e voc\u00EA deseja evitar que as opera\u00E7\u00F5es de cache atrasem como resultado do carregamento vagaroso dos dados. Isto pode ser usado para fornecer um 'warm-cache' na inicializa\u00E7\u00E3o, no entanto existe uma penalidade de desempenho uma vez que a inicializa\u00E7\u00E3o \u00E9 afetada pelo processo.
infinispan.store.passivation=Caso verdadeiro, os dados s\u00E3o apenas gravados ao store do cache quando ele \u00E9 removido da mem\u00F3ria, um fen\u00F4meno conhecido como 'passiva\u00E7\u00E3o'. A pr\u00F3xima vez em que os dados forem solicitados, isto \u00E9 'ativado' significando que os dados ser\u00E3o trazidos \u00E0 mem\u00F3ria e removidos do store de persist\u00EAncia. f falso, o store do cache cont\u00E9m uma c\u00F3pia de conte\u00FAdos na mem\u00F3ria, de forma que a grava\u00E7\u00E3o ao cache resulta na grava\u00E7\u00E3o do store do cache. Isto \u00E9 essencialmente a configura\u00E7\u00E3o 'write-through' (toda grava\u00E7\u00E3o).
infinispan.store.fetch-state=Caso verdadeiro, isto busca pelo estado de persist\u00EAncia quando unindo-se ao um cluster. Caso stores m\u00FAltiplos de cache s\u00E3o encadeados, apenas um deles pode possuir esta propriedade ativada.
infinispan.store.purge=Caso verdadeiro, isto limpa o cache quando ele inicia.
infinispan.store.singleton=Caso verdadeiro, o store do cache do singleton store \u00E9 ativado. O SingletonStore \u00E9 um store de cache de delega\u00E7\u00E3o usado em situa\u00E7\u00F5es onde uma inst\u00E2ncia num cluster deve interagir com o store subjacente.
infinispan.store.class=A classe de implementa\u00E7\u00E3o do store personalizado de uso para este store do cache.
infinispan.store.write-behind=Configura o armazenamento do cache como um write-behind o inv\u00E9s de write-through.
infinispan.store.properties=Uma lista de propriedades de store de cache.
infinispan.store.properties.property=Uma propriedade de store de cache com nome e valor.
infinispan.store.property=Uma propriedade de store de cache com nome e valor.
infinispan.write-behind=Configura o armazenamento do cache como um write-behind o inv\u00E9s de write-through.
infinispan.write-behind.flush-lock-timeout=O tempo limite para adquirir o bloqueio do estado a ser esvaziado ao store do cache periodicamente.
infinispan.write-behind.modification-queue-size=O n\u00FAmero m\u00E1ximo de entradas na fila ass\u00EDncrona. Quando a fila estiver cheia, o store torna-se write-through at\u00E9 que ele possa aceitar novas entradas.
infinispan.write-behind.shutdown-timeout=O tempo limite em mil\u00E9simos de segundos para encerrar o store do cache.
infinispan.write-behind.thread-pool-size=O tamanho do pool thread cujos threads s\u00E3o respons\u00E1veis pela aplica\u00E7\u00E3o das modifica\u00E7\u00F5es ao store do cache.
infinispan.write-behind.add=Adiciona o elemento da configura\u00E7\u00E3o write-behind ao store.
infinispan.write-behind.remove=Remove o elemento de configura\u00E7\u00E3o write-behind do storage.
infinispan.properties=Uma lista de propriedades store do cache.
infinispan.properties.property=Uma propriedade de store do cache com nome e valor.
infinispan.property=Uma propriedade do store do cache com nome e valor.
infinispan.property.value=O valor da propriedade store do cache.
infinispan.property.add=Adiciona a propriedade do store do cache.
infinispan.property.remove=Remove uma propriedade do store do cache.
infinispan.file-store=A configura\u00E7\u00E3o do store do arquivo do cache.
infinispan.file-store.relative-to=Descri\u00E7\u00E3o
infinispan.file-store.path=Descri\u00E7\u00E3o
infinispan.file-store.add=Adiciona o elemento da configura\u00E7\u00E3o do armazenamento do cache de arquivo ao cache.
infinispan.file-store.remove=Remove um elemento de configura\u00E7\u00E3o do storw do arquivo do cache a partir do cache.
infinispan.jdbc-store=A configura\u00E7\u00E3o do store JDBC do cache.
infinispan.jdbc-store.add=Adiciona o elemento de configura\u00E7\u00E3o do store do cache JDBC ao cache.
infinispan.jdbc-store.datasource=A refer\u00EAncia da fonte de dados para esta fonte de dados.
infinispan.jdbc-store.entry-table=A tabela da fonte de dados usada para efetuar o store das entradas do cache.
infinispan.jdbc-store.bucket-table=A tabela do banco de dados usada para efetuar o store nas entradas de cache bin\u00E1rio.
infinispan.jdbc-store.string-keyed-table=A tabela da fonte de dados usada para efetuar o store das entradas do cache.
infinispan.jdbc-store.string-keyed-table.table.prefix=O prefixo para o nome da tabela do banco de dados.
infinispan.jdbc-store.string-keyed-table.table.batch-size=O tamanho do lote determina quantas inser\u00E7\u00F5es s\u00E3o agrupadas em lote nas inser\u00E7\u00F5es DB.
infinispan.jdbc-store.string-keyed-table.table.fetch-size=O tamanho da pesquisa ser\u00E1 usada para determinar o tamanho da pesquisa no ResultSets nas consultas DB.
infinispan.jdbc-store.string-keyed-table.table.id-column=A coluna do banco de dados para manter os ids da entrada do cache.
infinispan.jdbc-store.string-keyed-table.table.data-column=A coluna do banco de dados para manter os dados de entrada do cache.
infinispan.jdbc-store.string-keyed-table.table.timestamp-column=A coluna do banco de dados para manter os timestamps de entrada do cache.
infinispan.jdbc-store.string-keyed-table.table.column.name=O nome da coluna do banco de dados.
infinispan.jdbc-store.string-keyed-table.table.column.type=O tipo da coluna do banco de dados.
infinispan.jdbc-store.binary-keyed-table=A tabela do banco de dados usada para store as entradas do cache bin\u00E1rio.
infinispan.jdbc-store.binary-keyed-table.table.prefix=O prefixo para o nome da tabela do banco de dados.
infinispan.jdbc-store.binary-keyed-table.table.batch-size=O tamanho do lote determina quantas inser\u00E7\u00F5es s\u00E3o agrupadas em lote nas inser\u00E7\u00F5es DB.
infinispan.jdbc-store.binary-keyed-table.table.fetch-size=O tamanho da pesquisa ser\u00E1 usada para determinar o tamanho da pesquisa no ResultSets nas consultas DB.
infinispan.jdbc-store.binary-keyed-table.table.id-column=A coluna do banco de dados para manter os ids da entrada do cache.
infinispan.jdbc-store.binary-keyed-table.table.data-column=A coluna do banco de dados para manter os dados de entrada do cache.
infinispan.jdbc-store.binary-keyed-table.table.timestamp-column=A coluna do banco de dados para manter os timestamps de entrada do cache.
infinispan.jdbc-store.binary-keyed-table.table.column.name=O nome da coluna do banco de dados.
infinispan.jdbc-store.binary-keyed-table.table.column.type=O tipo da coluna do banco de dados.
infinispan.string-keyed-jdbc-store=A configura\u00E7\u00E3o do armazenamento JDBC do cache de sequ\u00EAncia com chave.
infinispan.string-keyed-jdbc-store.string-keyed-table=A tabela do banco de dados usada para store as entradas do cache.
infinispan.string-keyed-jdbc-store.string-keyed-table.table.prefix=O prefixo para o nome da tabela do banco de dados.
infinispan.string-keyed-jdbc-store.string-keyed-table.table.batch-size=O tamanho do lote determina quantas inser\u00E7\u00F5es s\u00E3o agrupadas em lote nas inser\u00E7\u00F5es DB.
infinispan.string-keyed-jdbc-store.string-keyed-table.table.fetch-size=O tamanho da pesquisa ser\u00E1 usada para determinar o tamanho da pesquisa no ResultSets nas consultas DB.
infinispan.string-keyed-jdbc-store.string-keyed-table.table.id-column=A coluna do banco de dados para manter os ids da entrada do cache.
infinispan.string-keyed-jdbc-store.string-keyed-table.table.data-column=A coluna do banco de dados para manter os dados de entrada do cache.
infinispan.string-keyed-jdbc-store.string-keyed-table.table.timestamp-column=A coluna do banco de dados para manter os timestamps de entrada do cache.
infinispan.string-keyed-jdbc-store.string-keyed-table.table.column.name=O nome da coluna do banco de dados.
infinispan.string-keyed-jdbc-store.string-keyed-table.table.column.type=O tipo da coluna do banco de dados.
infinispan.string-keyed-jdbc-store.add=Adiciona o elemento de configura\u00E7\u00E3o do armazenamento do cache ao cache.
infinispan.string-keyed-jdbc-store.remove=Remove o elemento de configura\u00E7\u00E3o do store do cache JDBC.
infinispan.binary-keyed-jdbc-store=A configura\u00E7\u00E3o do armazenamento JDBC do cache bin\u00E1rio com chave.
infinispan.binary-keyed-jdbc-store.binary-keyed-table=A tabela do banco de dados usada para store as entradas do cache bin\u00E1rio.
infinispan.binary-keyed-jdbc-store.binary-keyed-table.table.prefix=O prefixo para o nome da tabela do banco de dados.
infinispan.binary-keyed-jdbc-store.binary-keyed-table.table.batch-size=O tamanho do lote determina quantas inser\u00E7\u00F5es s\u00E3o agrupadas em lote nas inser\u00E7\u00F5es DB.
infinispan.binary-keyed-jdbc-store.binary-keyed-table.table.fetch-size=O tamanho da pesquisa ser\u00E1 usada para determinar o tamanho da pesquisa no ResultSets nas consultas DB.
infinispan.binary-keyed-jdbc-store.binary-keyed-table.table.id-column=A coluna do banco de dados para manter os ids da entrada do cache.
infinispan.binary-keyed-jdbc-store.binary-keyed-table.table.data-column=A coluna do banco de dados para manter os dados de entrada do cache.
infinispan.binary-keyed-jdbc-store.binary-keyed-table.table.timestamp-column=A coluna do banco de dados para manter os timestamps de entrada do cache.
infinispan.binary-keyed-jdbc-store.binary-keyed-table.table.column.name=O nome da coluna do banco de dados.
infinispan.binary-keyed-jdbc-store.binary-keyed-table.table.column.type=O tipo da coluna do banco de dados.
infinispan.binary-keyed-jdbc-store.add=Adiciona o elemento de configura\u00E7\u00E3o do armazenamento do cache ao cache.
infinispan.binary-keyed-jdbc-store.remove=Remove o elemento de configura\u00E7\u00E3o do store do cache JDBC.
infinispan.mixed-keyed-jdbc-store=A configura\u00E7\u00E3o do armazenamento JDBC do cache misto com chave.
infinispan.mixed-keyed-jdbc-store.string-keyed-table=A tabela do banco de dados usada para store as entradas do cache.
infinispan.mixed-keyed-jdbc-store.string-keyed-table.table.prefix=O prefixo para o nome da tabela do banco de dados.
infinispan.mixed-keyed-jdbc-store.string-keyed-table.table.batch-size=O tamanho do lote determina quantas inser\u00E7\u00F5es s\u00E3o agrupadas em lote nas inser\u00E7\u00F5es DB.
infinispan.mixed-keyed-jdbc-store.string-keyed-table.table.fetch-size=O tamanho da pesquisa ser\u00E1 usada para determinar o tamanho da pesquisa no ResultSets nas consultas DB.
infinispan.mixed-keyed-jdbc-store.string-keyed-table.table.id-column=A coluna do banco de dados para manter os ids da entrada do cache.
infinispan.mixed-keyed-jdbc-store.string-keyed-table.table.data-column=A coluna do banco de dados para manter os dados de entrada do cache.
infinispan.mixed-keyed-jdbc-store.string-keyed-table.table.timestamp-column=A coluna do banco de dados para manter os timestamps de entrada do cache.
infinispan.mixed-keyed-jdbc-store.string-keyed-table.table.column.name=O nome da coluna do banco de dados.
infinispan.mixed-keyed-jdbc-store.string-keyed-table.table.column.type=O tipo da coluna do banco de dados.
infinispan.mixed-keyed-jdbc-store.binary-keyed-table=A tabela do banco de dados usada para store as entradas do cache bin\u00E1rio.
infinispan.mixed-keyed-jdbc-store.binary-keyed-table.table.prefix=O prefixo para o nome da tabela do banco de dados.
infinispan.mixed-keyed-jdbc-store.binary-keyed-table.table.batch-size=O tamanho do lote determina quantas inser\u00E7\u00F5es s\u00E3o agrupadas em lote nas inser\u00E7\u00F5es DB.
infinispan.mixed-keyed-jdbc-store.binary-keyed-table.table.fetch-size=O tamanho da pesquisa ser\u00E1 usada para determinar o tamanho da pesquisa no ResultSets nas consultas DB.
infinispan.mixed-keyed-jdbc-store.binary-keyed-table.table.id-column=A coluna do banco de dados para manter os ids da entrada do cache.
infinispan.mixed-keyed-jdbc-store.binary-keyed-table.table.data-column=A coluna do banco de dados para manter os dados de entrada do cache.
infinispan.mixed-keyed-jdbc-store.binary-keyed-table.table.timestamp-column=A coluna do banco de dados para manter os timestamps de entrada do cache.
infinispan.mixed-keyed-jdbc-store.binary-keyed-table.table.column.name=O nome da coluna do banco de dados.
infinispan.mixed-keyed-jdbc-store.binary-keyed-table.table.column.type=O tipo da coluna do banco de dados.
infinispan.mixed-keyed-jdbc-store.add=Adiciona uma configura\u00E7\u00E3o do store JDBC do cache com chave misturada ao cache.
infinispan.mixed-keyed-jdbc-store.remove=Remove uma configura\u00E7\u00E3o do store JDBC do cache com chave misturada do cache.
infinispan.remote-store=A configura\u00E7\u00E3o do armazenamento remoto do cache.
infinispan.remote-store.cache=O nome do cache remoto para uso no armazenamento remoto.
infinispan.remote-store.tcp-no-delay=Um valor TCP_NODELAY para a comunica\u00E7\u00E3o do cache remoto.
infinispan.remote-store.socket-timeout=O intervalo do soquete para a comunica\u00E7\u00E3o do cache remoto.
infinispan.remote-store.remote-servers=Uma lista dos servidores remotos para esse armazenamento de cache.
infinispan.remote-store.remote.servers.remote-server=Um servidor remoto, definido pelo binding do soquete externo.
infinispan.remote-store.remote-servers.remote-server.outbound-socket-binding=Um binding do soquete externo para o servidor remoto.
infinispan.remote-store.add=Adiciona o elemento de configura\u00E7\u00E3o do armazenamento do cache remoto ao cache.
infinispan.remote-store.remove=Remove um elemento de configura\u00E7\u00E3o de store remoto do cache do cache.
