# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-clustering-infinispan/org/jboss/as/clustering/infinispan/subsystem/LocalDescriptions, author croe@redhat.com
infinispan=La configuration du sous-syst\u00E8me Infinispan
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-clustering-infinispan/org/jboss/as/clustering/infinispan/subsystem/LocalDescriptions, author croe@redhat.com
infinispan.add=Ajouter le sous-syst\u00E8me Infinispan
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-clustering-infinispan/org/jboss/as/clustering/infinispan/subsystem/LocalDescriptions, author croe@redhat.com
infinispan.describe=D\u00E9crire le sous-syst\u00E8me Infinispan
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-clustering-infinispan/org/jboss/as/clustering/infinispan/subsystem/LocalDescriptions, author croe@redhat.com
infinispan.remove=Suppression du sous-syst\u00E8me Infinispan
infinispan.cache-container=La configuration d'un conteneur de cache Infinispan
infinispan.cache-container.default-cache=Le cache Infinispan par d\u00E9faut
infinispan.cache-container.listener-executor=Ex\u00E9cuteur utilis\u00E9 pour la file d'attente de r\u00E9plication
# auto translated by TM merge from project: JBoss AS, version: master, DocId: org.jboss.as/jboss-as-clustering-infinispan/org/jboss/as/clustering/infinispan/subsystem/LocalDescriptions
infinispan.cache-container.eviction-executor=Ex\u00E9cuteur programm\u00E9 utilis\u00E9 pour l'\u00E9viction
# auto translated by TM merge from project: JBoss AS, version: master, DocId: org.jboss.as/jboss-as-clustering-infinispan/org/jboss/as/clustering/infinispan/subsystem/LocalDescriptions
infinispan.cache-container.replication-queue-executor=Ex\u00E9cuteur utilis\u00E9 pour les op\u00E9rations cache asynchr\u00F4nes
# auto translated by TM merge from project: JBoss AS, version: master, DocId: org.jboss.as/jboss-as-clustering-infinispan/org/jboss/as/clustering/infinispan/subsystem/LocalDescriptions
infinispan.cache-container.jndi-name=Le nom jndi pour lier ce conteneur de cache
infinispan.cache-container.module=Le module dont le chargeur de classes doit \u00EAtre utilis\u00E9 quand on construit cette configuration de conteneur de cache.
infinispan.cache-container.start=Le mode de d\u00E9marrage du conteneur de cache, qui peut correspondre \u00E0 un EAGER (d\u00E9marrage imm\u00E9diat) ou \u00E0 un LAZY (d\u00E9marrage \u00E0 la demande).
infinispan.cache-container.cache=La liste des caches disponibles pour ce conteneur de cache
infinispan.cache-container.singleton=Un ensemble d'\u00E9l\u00E9ments de configuration d'instances uniques du conteneur de cache.
infinispan.cache-container.aliases=Liste des alias pour ce conteneur de cache
infinispan.cache-container.aliases.alias=Un alias pour ce conteneur de cache
infinispan.cache-container.alias=Un alias pour ce conteneur de cache
infinispan.cache-container.alias.name=Nom d'alias \u00E0 aouter ou \u00E0 supprimer
infinispan.cache-container.alias.add-alias=Ajouter un alias pour ce conteneur de cache
infinispan.cache-container.alias.remove-alias=Supprimer un alias pour ce conteneur de cache
infinispan.cache-container.add=Ajouter un conteneur de cache du sous-syst\u00E8me Infinispan
infinispan.cache-container.remove=Supprimer un conteneur de cache du sous-syst\u00E8me Infinispan
infinispan.cache-container.transport=Transport enfant utilis\u00E9 par ce conteneur de cache
infinispan.cache-container.local-cache=Cache enfant r\u00E9pliqu\u00E9 du conteneur de cache.
infinispan.cache-container.invalidation-cache=Cache d'invalidation enfant du conteneur de cache.
infinispan.cache-container.replicated-cache=Cache enfant r\u00E9pliqu\u00E9 du conteneur de cache.
infinispan.cache-container.distributed-cache=Cache distribu\u00E9 enfant du conteneur de cache.
infinispan.transport=La description du transport utilis\u00E9 par ce conteneur de cache
infinispan.transport.add=Ajouter le transport au conteneur de cache
infinispan.transport.remove=Supprimer le transport du conteneur de cache
infinispan.transport.stack=La pile de jgroups \u00E0 utiliser pour le transport
infinispan.transport.cluster=Le nom du cluster de communication du groupe
infinispan.transport.executor=L'ex\u00E9cuteur \u00E0 utiliser pour le transport
infinispan.transport.lock-timeout=Timeout des verrous pour le transport
infinispan.transport.machine=Identifiant de machine pour le transport
infinispan.transport.rack=Identifiant de rack pour le transport
infinispan.transport.site=Un identifiant de site pour le transport
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-clustering-infinispan/org/jboss/as/clustering/infinispan/subsystem/LocalDescriptions, author croe@redhat.com
infinispan.cache.name=Le nom du cache.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-clustering-infinispan/org/jboss/as/clustering/infinispan/subsystem/LocalDescriptions, author croe@redhat.com
infinispan.cache.mode=Le mode du cache. Utilisation en interne uniquement.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-clustering-infinispan/org/jboss/as/clustering/infinispan/subsystem/LocalDescriptions, author croe@redhat.com
infinispan.cache.start=Le mode de d\u00E9marrage du cache, qui peut correspondre \u00E0 EAGER (d\u00E9marrage imm\u00E9diat) ou \u00E0 LAZY (d\u00E9marrage \u00E0 la demande)
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-clustering-infinispan/org/jboss/as/clustering/infinispan/subsystem/LocalDescriptions, author croe@redhat.com
infinispan.cache.batching=Si activ\u00E9, l'API de traitement par lot des invocations sera disponible pour ce cache.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-clustering-infinispan/org/jboss/as/clustering/infinispan/subsystem/LocalDescriptions, author croe@redhat.com
infinispan.cache.indexing=Si activ\u00E9, les entr\u00E9es seront index\u00E9es au fur et \u00E0 mesure qu'elles sont ajout\u00E9es dans le cache. Les index seront mis \u00E0 jour quand les entr\u00E9es sont modifi\u00E9es ou supprim\u00E9es.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-clustering-infinispan/org/jboss/as/clustering/infinispan/subsystem/LocalDescriptions, author croe@redhat.com
infinispan.cache.jndi-name=Le nom jndi pour lier cette instance de cache
infinispan.cache.module=Le module dont le chargeur de classes doit \u00EAtre utilis\u00E9 quand on construit cette configuration de cache.
infinispan.cache.indexing-properties=Propri\u00E9t\u00E9s pour contr\u00F4ler le comportement d'indexation
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-clustering-infinispan/org/jboss/as/clustering/infinispan/subsystem/LocalDescriptions, author croe@redhat.com
infinispan.cache.remove=Supprimer un cache de ce conteneur.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-clustering-infinispan/org/jboss/as/clustering/infinispan/subsystem/LocalDescriptions, author croe@redhat.com
infinispan.clustered-cache.async-marshalling=Si activ\u00E9, cela entra\u00EEnera le triage des entr\u00E9es \u00E0 faire de fa\u00E7on asynchrone.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-clustering-infinispan/org/jboss/as/clustering/infinispan/subsystem/LocalDescriptions, author croe@redhat.com
infinispan.clustered-cache.mode=D\u00E9finit le mode cache clusteris\u00E9, ASYNC pour op\u00E9ration asynchrone, ou SYNC pour op\u00E9ration synchrone.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-clustering-infinispan/org/jboss/as/clustering/infinispan/subsystem/LocalDescriptions, author croe@redhat.com
infinispan.clustered-cache.queue-size=En mode ASYNC, cet attribut peut \u00EAtre utilis\u00E9 pour d\u00E9clencher le vidage de la file d'attente \u00E0 partir d'une certaine limite.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-clustering-infinispan/org/jboss/as/clustering/infinispan/subsystem/LocalDescriptions, author croe@redhat.com
infinispan.clustered-cache.queue-flush-interval=En mode ASYNC, cet attribut contr\u00F4le la fr\u00E9quence d'ex\u00E9cution du thread asynchrone utilis\u00E9 pour vider la file d'attente de r\u00E9plication. Il doit correspondre \u00E0 un entier relatif positif, qui repr\u00E9sente l'heure de r\u00E9veil du thread en millisecondes.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-clustering-infinispan/org/jboss/as/clustering/infinispan/subsystem/LocalDescriptions, author croe@redhat.com
infinispan.clustered-cache.remote-timeout=En mode SYNC, le timeout (en ms) pour recevoir un accus\u00E9 de r\u00E9ception quand on fait un appel \u00E0 distance; dur\u00E9e suite \u00E0 laquelle l'appel sera annul\u00E9 et une exception sera lanc\u00E9e.
infinispan.local-cache=Un cache local
infinispan.local-cache.add=Ajouter un cacahe local \u00E0 ce conteneur cache
infinispan.local-cache.remove=Supprimer un cache local dans ce conteneur cache
infinispan.invalidation-cache=Un cache d'invalidation
infinispan.invalidation-cache.add=Ajouter un cache d'invalidation \u00E0 ce conteneur de cache
infinispan.invalidation-cache.remove=Supprimer un cache d'invalidaiton dans ce conteneur cache
infinispan.replicated-cache=R\u00E9plique de cache
infinispan.replicated-cache.add=Ajouter une r\u00E9plique de cache \u00E0 ce conteneur de cache
infinispan.replicated-cache.remove=Supprimer un cache d'invalidation dans ce conteneur cache
infinispan.state-transfer=La configuration de transfert d'\u00E9tat pour la distribution et pour le r\u00E9plicat des caches.
infinispan.state-transfer.enabled=Si activ\u00E9, cela am\u00E8nera le cache \u00E0 demander un \u00E9tat aux caches voisins au d\u00E9marrage, pour que le cache commence \u00ABwarm\u00BB, malgr\u00E9 que cela aura un impact au d\u00E9marrage.
infinispan.state-transfer.timeout=La dur\u00E9e maximum (ms) d'attente d'\u00E9tat des caches voisins, avant de lancer une exception et d'abandonner le d\u00E9marrage.
infinispan.state-transfer.chunk-size=La taille, en octets, des regroupages de transferts d'entr\u00E9es cache.
infinispan.state-transfer.add=Ajouter une configuration de transfert d'\u00E9tat.
infinispan.state-transfer.remove=Supprimer une configuration de transfert d'\u00E9tat.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-clustering-infinispan/org/jboss/as/clustering/infinispan/subsystem/LocalDescriptions, author croe@redhat.com
infinispan.distributed-cache=Un cache distribu\u00E9
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-clustering-infinispan/org/jboss/as/clustering/infinispan/subsystem/LocalDescriptions, author croe@redhat.com
infinispan.distributed-cache.owners=Nombre de r\u00E9pliques pour chaque entr\u00E9e cache dans tout le groupement.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-clustering-infinispan/org/jboss/as/clustering/infinispan/subsystem/LocalDescriptions, author croe@redhat.com
infinispan.distributed-cache.virtual-nodes=\u00C9l\u00E9ments d\u00E9pr\u00E9ci\u00E9s. Auncun effet.
infinispan.distributed-cache.virtual-nodes.deprecated=\u00C9l\u00E9ments d\u00E9pr\u00E9ci\u00E9s. Auncun effet.
infinispan.distributed-cache.segments=Contr\u00F4le le nombre de segments spatiaux de hachage ce qui correspond \u00E0 la granularit\u00E9 de la distribution des cl\u00E9s dans le cluster. Cette valeur doit \u00EAtre strictement positive.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-clustering-infinispan/org/jboss/as/clustering/infinispan/subsystem/LocalDescriptions, author croe@redhat.com
infinispan.distributed-cache.l1-lifespan=Dur\u00E9e de vie maximum d'une entr\u00E9e mise dans le cache L1. Cet \u00E9l\u00E9ment configure le comportement du cache 1 dans les instances de caches 'distribu\u00E9s'. Dans tout autre mode de cache, cet \u00E9l\u00E9ment serait ignor\u00E9.
infinispan.distributed-cache.add=Ajouter un cache distribu\u00E9 \u00E0 ce conteneur de cache
infinispan.distributed-cache.remove=Supprimer un cache distribu\u00E9 dans ce conteneur cache
infinispan.locking=La configuration de verrouillage du cache.
infinispan.locking.isolation=D\u00E9finit le niveau d'isolation du verrouillage du cache.
infinispan.locking.striping=Si vrai, un pool de verrous partag\u00E9s sera maintenu pour toutes les entr\u00E9es qui sont besoin d'\u00EAtre verrouill\u00E9es. Sinon, un verrou par entr\u00E9e dans le cache sera cr\u00E9\u00E9. L'agr\u00E9gation par bandes des verrous permet de contr\u00F4ler l'impact sur la m\u00E9moire, mais peut r\u00E9duire la concurrence dans le syst\u00E8me.
infinispan.locking.acquire-timeout=Nombre maximum de tentatives d'acquisition d'un verrou particulier.
infinispan.locking.concurrency-level=Niveau de concurrence des conteneurs de verrous. Ajuster cette valeur suivant le nombre de threads concurrents entrent en contact avec Infinispan.
infinispan.locking.add=Ajouter un \u00E9l\u00E9ment de configuration du verrouillage au cache.
infinispan.locking.remove=Retire un \u00E9l\u00E9ment de configuration de verrouillage du cache.
infinispan.transaction=La configuration de la transaction cache.
infinispan.transaction.mode=D\u00E9finit le mode de transaction du cache soit \u00E0 NONE, NON_XA, NON_DURABLE_XA, ou FULL_XA.
infinispan.transaction.stop-timeout=S'il existe d\u00E9j\u00E0 des transactions en cours quand un cache est stopp\u00E9, Infinispan fait une pause jusqu'\u00E0 ce que les transactions locales ou en cours se terminent. La dur\u00E9e d'attente est d\u00E9finie par le d\u00E9lai d'arr\u00EAt du cache.
infinispan.transaction.locking=Le mode de verrouillage de ce cache est soit OPTIMISTIC, soit PESSIMISTIC
infinispan.transaction.add=Ajouter un \u00E9l\u00E9ment de configuration de transaction au cache.
infinispan.transaction.remove=Supprime un \u00E9l\u00E9ment de configuration de transaction du cache.
infinispan.eviction=La configuration de l'\u00E9viction du cache.
infinispan.eviction.strategy=D\u00E9finit la strat\u00E9gie d'\u00E9viction du cache. Options disponibles \: 'UNORDERED', 'FIFO', 'LRU', 'LIRS' et 'NONE' (pour d\u00E9sactiver l'\u00E9viction).
infinispan.eviction.max-entries=Nombre maximum d'entr\u00E9es dans une instance de cache. Si la valeur s\u00E9lectionn\u00E9e ne correspond pas \u00E0 un carr\u00E9 (*puissance 2), la valeur par d\u00E9faut correspondra \u00E0 la plus petit puissance parmi deux valeurs qui seraient sup\u00E9rieures \u00E0 la valeur s\u00E9lectionn\u00E9e. -1 signifie \u00ABaucune limite\u00BB.
infinispan.eviction.add=Ajoute un \u00E9l\u00E9ment de configuration d'\u00E9viction au cache.
infinispan.eviction.remove=Supprime un \u00E9l\u00E9ment de configuration d'\u00E9viction du cache.
infinispan.expiration=La configuration de l'expiration du cache.
infinispan.expiration.max-idle=Dur\u00E9e d'inactivit\u00E9 maximale qu'une entr\u00E9e de cache sera maintenue dans le cache, en millisecondes. Si la dur\u00E9e d'inactivit\u00E9 est d\u00E9pass\u00E9e, l'entr\u00E9e aura expir\u00E9 dans tout le cluster. -1 signifie que les entr\u00E9es n'expirent jamais.
infinispan.expiration.lifespan=Dur\u00E9e de vie maximum d'une entr\u00E9e de cache, suite \u00E0 laquelle l'entr\u00E9e l'entr\u00E9e aura expir\u00E9 dans tout le cluster, en millisecondes. -1 signifie que les entr\u00E9e n'expirent jamais.
infinispan.expiration.interval=Intervalle (en millisecondes) entre ex\u00E9cutions cons\u00E9cutives pour purger les entr\u00E9es p\u00E9rim\u00E9es de la m\u00E9moire et des cache stores. Si vous souhaitez d\u00E9sactiver le processus d'expulsion p\u00E9riodique compl\u00E8tement, d\u00E9finissez la valeur wakeupInterval -1.
infinispan.expiration.add=Ajouter un \u00E9l\u00E9ment de configuration d'expiration au cache.
infinispan.expiration.remove=Supprime un \u00E9l\u00E9ment de configuration d'expiration du cache.
infinispan.store=La configuration du cache store.
infinispan.store.add=Ajouter un \u00E9l\u00E9ment de configuration du cache store de base au cache.
infinispan.store.remove=Supprime un \u00E9l\u00E9ment de configuration de cache store du cache.
infinispan.store.shared=Cette configuration doit \u00EAtre configur\u00E9e \u00E0 true quand des instances de cache multiples partagent le m\u00EAme cache store (par ex. les n\u0153uds multiples d'un cluster qui utilisent un CacheStore bas\u00E9 JDBC pointant vers la m\u00EAme base de donn\u00E9es partag\u00E9e). D\u00E9finir ceci \u00E0 true \u00E9vite que les instances de cache multiples \u00E9crivent une m\u00EAme modification \u00E0 plusieurs reprises. Si activ\u00E9, seul le n\u0153ud d'o\u00F9 la modification provient \u00E9crira dans la cache stores. Si d\u00E9sactiv\u00E9, chaque cache individuel r\u00E9agira \u00E0 la mise \u00E0 jour distante potentielle en stockant les donn\u00E9es dans le cache store.
infinispan.store.preload=Si d\u00E9fini \u00E0 true, quand le start d\u00E9marre, les donn\u00E9es stock\u00E9es dans le cache store seront pr\u00E9charg\u00E9es dans la m\u00E9moire. Cela est particuli\u00E8rement utile lorsque les donn\u00E9es du cache store sont demand\u00E9es imm\u00E9diatement apr\u00E8s le d\u00E9marrage et que vous souhaitez \u00E9viter que les op\u00E9rations de cache soient retard\u00E9es lazily \u00E0 la suite du chargement des donn\u00E9es. Peut \u00EAtre utilis\u00E9 pour fournir un \u00AB warm-cache \u00BB au d\u00E9marrage, mais il y a une p\u00E9nalit\u00E9 de performance car le temps de d\u00E9marrage est affect\u00E9e par ce processus.
infinispan.store.passivation=Si d\u00E9fini \u00E0 true, les donn\u00E9es seront \u00E9crites uniquement dans le cache store lorsqu'il sera expuls\u00E9 de la m\u00E9moire, un ph\u00E9nom\u00E8ne appel\u00E9 \u00AB passivation \u00BB. La prochaine fois que les donn\u00E9es sont demand\u00E9es, il sera \u00AB activ\u00E9 \u00BB, ce qui signifie que les donn\u00E9es seront ramen\u00E9es \u00E0 la m\u00E9moire et supprim\u00E9es du store persistant. f faux, le cache store contient une copie du contenu de la m\u00E9moire, donc \u00E9crit dans les r\u00E9sultats de cache dans les \u00E9critures de cache store. Cela vous donne essentiellement une configuration \u00AB write-through \u00BB.
infinispan.store.fetch-state=Si d\u00E9fini sur true, ira chercher l'\u00E9tat persistant quand il rejoint le cluster. En cas de multiples cache stores mis \u00E0 la cha\u00EEne, ils peuvent avoir cette propri\u00E9t\u00E9 activ\u00E9e.
infinispan.store.purge=Si d\u00E9fini sur true, purgera ce cache store au d\u00E9marrage.
infinispan.store.singleton=Si d\u00E9fini sur true, le cache store SingletonStore sera activ\u00E9. SingletonStore est un cache store d\u00E9l\u00E9gant utilis\u00E9 dans les situations dans lesquelles une seule instance du cluster doit interagir avec le store sous-jacent.
infinispan.store.class=Classe d'impl\u00E9mentation de store personnalis\u00E9e \u00E0 utiliser pour ce cache store.
infinispan.store.write-behind=Configure un cache store en \u00E9criture diff\u00E9r\u00E9e \u00ABwrite-behind\u00BB au lieu de \u00ABwrite-through\u00BB.
infinispan.store.properties=Une liste de propri\u00E9t\u00E9s de cache store.
infinispan.store.properties.property=Une propri\u00E9t\u00E9 de cache store ayant un nom et une valeur.
infinispan.store.property=Une propri\u00E9t\u00E9 de cache store ayant un nom et une valeur.
infinispan.write-behind=Configure un cache store en \u00E9criture diff\u00E9r\u00E9e \u00ABwrite-behind\u00BB au lieu de \u00ABwrite-through\u00BB.
infinispan.write-behind.flush-lock-timeout=D\u00E9lai d'attente pour acqu\u00E9rir le verrou qui garde l'\u00E9tat \u00E0 vider dans le cache store p\u00E9riodiquement.
infinispan.write-behind.modification-queue-size=Le nombre maximum d'entr\u00E9es dans la file d'attente asynchrone. Quand la file d'attente est remplie, le store devient \u00ABwrite-through\u00BB jusqu'\u00E0 ce qu'il puisse accepter de nouvelles entr\u00E9es.
infinispan.write-behind.shutdown-timeout=Timeout en millisecondes pour stopper le cache store.
infinispan.write-behind.thread-pool-size=La taille du pool de cha\u00EEnes dont les cha\u00EEnes sont charg\u00E9s s'appliquer les modifications au cache store.
infinispan.write-behind.add=Ajoute un \u00E9l\u00E9ment d'\u00E9criture diff\u00E9r\u00E9e \u00ABwrite-behind\u00BB au store.
infinispan.write-behind.remove=Supprime un \u00E9l\u00E9ment d'\u00E9criture diff\u00E9r\u00E9e \u00ABwrite-behind\u00BB du store.
infinispan.properties=Une liste de propri\u00E9t\u00E9s de cache store.
infinispan.properties.property=Une propri\u00E9t\u00E9 de cache store ayant un nom et une valeur.
infinispan.property=Une propri\u00E9t\u00E9 de cache store ayant un nom et une valeur.
infinispan.property.value=La valeur de la propri\u00E9t\u00E9 de cache store.
infinispan.property.add=Ajoute une propri\u00E9t\u00E9 de cache store.
infinispan.property.remove=Supprime une propri\u00E9t\u00E9 de cache store.
infinispan.file-store=La configuration du file-store du cache.
infinispan.file-store.relative-to=Description
infinispan.file-store.path=Description
infinispan.file-store.add=Ajoute un \u00E9l\u00E9ment de configuration du cache file-store au cache.
infinispan.file-store.remove=Supprime un \u00E9l\u00E9ment de configuration de cache store du cache.
infinispan.jdbc-store=La configuration du JDBC cache store.
infinispan.jdbc-store.add=Ajoute un \u00E9l\u00E9ment de configuration du JDBC cache store au cache.
infinispan.jdbc-store.datasource=Une r\u00E9f\u00E9rence de source de donn\u00E9es pour ce datastore.
infinispan.jdbc-store.entry-table=La table de base de donn\u00E9es utilis\u00E9e pour stocker les entr\u00E9es cache.
infinispan.jdbc-store.bucket-table=La table de base de donn\u00E9es utilis\u00E9e pour stocker les entr\u00E9es de cache binaires.
infinispan.jdbc-store.string-keyed-table=La table de base de donn\u00E9es utilis\u00E9e pour stocker les entr\u00E9es cache.
infinispan.jdbc-store.string-keyed-table.table.prefix=Le pr\u00E9fixe du nom de la table de base de donn\u00E9es.
infinispan.jdbc-store.string-keyed-table.table.batch-size=Pour les insertions dans la DB, la taille du lot d\u00E9terminera combien d'insertions devront \u00EAtre mises dans un m\u00EAme lot.
infinispan.jdbc-store.string-keyed-table.table.fetch-size=Pour les requ\u00EAtes de DB, la taille d'extraction servira pour d\u00E9finir la taille des extractions sur les ResultSets.
infinispan.jdbc-store.string-keyed-table.table.id-column=Une colonne de base de donn\u00E9es pour mettre les ids d'entr\u00E9e de cache.
infinispan.jdbc-store.string-keyed-table.table.data-column=Une colonne de base de donn\u00E9es qui d\u00E9tient les donn\u00E9es d'entr\u00E9es cache.
infinispan.jdbc-store.string-keyed-table.table.timestamp-column=Une colonne de base de donn\u00E9es pour contenir les horodatages des entr\u00E9es de cache.
infinispan.jdbc-store.string-keyed-table.table.column.name=Le nom de la colonne de la base de donn\u00E9es.
infinispan.jdbc-store.string-keyed-table.table.column.type=Le type de colonne de base de donn\u00E9es.
infinispan.jdbc-store.binary-keyed-table=La table de base de donn\u00E9es utilis\u00E9e pour stocker les entr\u00E9es de cache binaires.
infinispan.jdbc-store.binary-keyed-table.table.prefix=Le pr\u00E9fixe du nom de la table de base de donn\u00E9es.
infinispan.jdbc-store.binary-keyed-table.table.batch-size=Pour les insertions dans la DB, la taille du lot d\u00E9terminera combien d'insertions devront \u00EAtre mises dans un m\u00EAme lot.
infinispan.jdbc-store.binary-keyed-table.table.fetch-size=Pour les requ\u00EAtes de DB, la taille d'extraction servira pour d\u00E9finir la taille des extractions sur les ResultSets.
infinispan.jdbc-store.binary-keyed-table.table.id-column=Une colonne de base de donn\u00E9es pour mettre les ids d'entr\u00E9e de cache.
infinispan.jdbc-store.binary-keyed-table.table.data-column=Une colonne de base de donn\u00E9es qui d\u00E9tient les donn\u00E9es d'entr\u00E9es cache.
infinispan.jdbc-store.binary-keyed-table.table.timestamp-column=Une colonne de base de donn\u00E9es pour contenir les horodatages des entr\u00E9es de cache.
infinispan.jdbc-store.binary-keyed-table.table.column.name=Le nom de la colonne de la base de donn\u00E9es.
infinispan.jdbc-store.binary-keyed-table.table.column.type=Le type de colonne de base de donn\u00E9es.
infinispan.string-keyed-jdbc-store=La configuration du String Keyed Cache JDBC Store
infinispan.string-keyed-jdbc-store.string-keyed-table=La table de base de donn\u00E9es utilis\u00E9e pour stocker les entr\u00E9es cache.
infinispan.string-keyed-jdbc-store.string-keyed-table.table.prefix=Le pr\u00E9fixe du nom de la table de base de donn\u00E9es.
infinispan.string-keyed-jdbc-store.string-keyed-table.table.batch-size=Pour les insertions dans la DB, la taille du lot d\u00E9terminera combien d'insertions devront \u00EAtre mises dans un m\u00EAme lot.
infinispan.string-keyed-jdbc-store.string-keyed-table.table.fetch-size=Pour les requ\u00EAtes de DB, la taille d'extraction servira pour d\u00E9finir la taille des extractions sur les ResultSets.
infinispan.string-keyed-jdbc-store.string-keyed-table.table.id-column=Une colonne de base de donn\u00E9es pour mettre les ids d'entr\u00E9e de cache.
infinispan.string-keyed-jdbc-store.string-keyed-table.table.data-column=Une colonne de base de donn\u00E9es qui d\u00E9tient les donn\u00E9es d'entr\u00E9es cache.
infinispan.string-keyed-jdbc-store.string-keyed-table.table.timestamp-column=Une colonne de base de donn\u00E9es pour contenir les horodatages des entr\u00E9es de cache.
infinispan.string-keyed-jdbc-store.string-keyed-table.table.column.name=Le nom de la colonne de la base de donn\u00E9es.
infinispan.string-keyed-jdbc-store.string-keyed-table.table.column.type=Le type de colonne de base de donn\u00E9es.
infinispan.string-keyed-jdbc-store.add=Ajoute un \u00E9l\u00E9ment de configuration du JDBC cache store au cache.
infinispan.string-keyed-jdbc-store.remove=Supprime un \u00E9l\u00E9ment JDBC de configuration de cache store du cache.
infinispan.binary-keyed-jdbc-store=La configuration du Binary Keyed Cache JDBC Store
infinispan.binary-keyed-jdbc-store.binary-keyed-table=La table de base de donn\u00E9es utilis\u00E9e pour stocker les entr\u00E9es de cache binaires.
infinispan.binary-keyed-jdbc-store.binary-keyed-table.table.prefix=Le pr\u00E9fixe du nom de la table de base de donn\u00E9es.
infinispan.binary-keyed-jdbc-store.binary-keyed-table.table.batch-size=Pour les insertions dans la DB, la taille du lot d\u00E9terminera combien d'insertions devront \u00EAtre mises dans un m\u00EAme lot.
infinispan.binary-keyed-jdbc-store.binary-keyed-table.table.fetch-size=Pour les requ\u00EAtes de DB, la taille d'extraction servira pour d\u00E9finir la taille des extractions sur les ResultSets.
infinispan.binary-keyed-jdbc-store.binary-keyed-table.table.id-column=Une colonne de base de donn\u00E9es pour mettre les ids d'entr\u00E9e de cache.
infinispan.binary-keyed-jdbc-store.binary-keyed-table.table.data-column=Une colonne de base de donn\u00E9es qui d\u00E9tient les donn\u00E9es d'entr\u00E9es cache.
infinispan.binary-keyed-jdbc-store.binary-keyed-table.table.timestamp-column=Une colonne de base de donn\u00E9es pour contenir les horodatages des entr\u00E9es de cache.
infinispan.binary-keyed-jdbc-store.binary-keyed-table.table.column.name=Le nom de la colonne de la base de donn\u00E9es.
infinispan.binary-keyed-jdbc-store.binary-keyed-table.table.column.type=Le type de colonne de base de donn\u00E9es.
infinispan.binary-keyed-jdbc-store.add=Ajoute un \u00E9l\u00E9ment de configuration du JDBC cache store au cache.
infinispan.binary-keyed-jdbc-store.remove=Supprime un \u00E9l\u00E9ment JDBC de configuration de cache store du cache.
infinispan.mixed-keyed-jdbc-store=La configuration du Mixed Keyed Cache JDBC Store
infinispan.mixed-keyed-jdbc-store.string-keyed-table=La table de base de donn\u00E9es utilis\u00E9e pour stocker les entr\u00E9es cache.
infinispan.mixed-keyed-jdbc-store.string-keyed-table.table.prefix=Le pr\u00E9fixe du nom de la table de base de donn\u00E9es.
infinispan.mixed-keyed-jdbc-store.string-keyed-table.table.batch-size=Pour les insertions dans la DB, la taille du lot d\u00E9terminera combien d'insertions devront \u00EAtre mises dans un m\u00EAme lot.
infinispan.mixed-keyed-jdbc-store.string-keyed-table.table.fetch-size=Pour les requ\u00EAtes de DB, la taille d'extraction servira pour d\u00E9finir la taille des extractions sur les ResultSets.
infinispan.mixed-keyed-jdbc-store.string-keyed-table.table.id-column=Une colonne de base de donn\u00E9es pour mettre les ids d'entr\u00E9e de cache.
infinispan.mixed-keyed-jdbc-store.string-keyed-table.table.data-column=Une colonne de base de donn\u00E9es qui d\u00E9tient les donn\u00E9es d'entr\u00E9es cache.
infinispan.mixed-keyed-jdbc-store.string-keyed-table.table.timestamp-column=Une colonne de base de donn\u00E9es pour contenir les horodatages des entr\u00E9es de cache.
infinispan.mixed-keyed-jdbc-store.string-keyed-table.table.column.name=Le nom de la colonne de la base de donn\u00E9es.
infinispan.mixed-keyed-jdbc-store.string-keyed-table.table.column.type=Le type de colonne de base de donn\u00E9es.
infinispan.mixed-keyed-jdbc-store.binary-keyed-table=La table de base de donn\u00E9es utilis\u00E9e pour stocker les entr\u00E9es de cache binaires.
infinispan.mixed-keyed-jdbc-store.binary-keyed-table.table.prefix=Le pr\u00E9fixe du nom de la table de base de donn\u00E9es.
infinispan.mixed-keyed-jdbc-store.binary-keyed-table.table.batch-size=Pour les insertions dans la DB, la taille du lot d\u00E9terminera combien d'insertions devront \u00EAtre mises dans un m\u00EAme lot.
infinispan.mixed-keyed-jdbc-store.binary-keyed-table.table.fetch-size=Pour les requ\u00EAtes de DB, la taille d'extraction servira pour d\u00E9finir la taille des extractions sur les ResultSets.
infinispan.mixed-keyed-jdbc-store.binary-keyed-table.table.id-column=Une colonne de base de donn\u00E9es pour mettre les ids d'entr\u00E9e de cache.
infinispan.mixed-keyed-jdbc-store.binary-keyed-table.table.data-column=Une colonne de base de donn\u00E9es qui d\u00E9tient les donn\u00E9es d'entr\u00E9es cache.
infinispan.mixed-keyed-jdbc-store.binary-keyed-table.table.timestamp-column=Une colonne de base de donn\u00E9es pour contenir les horodatages des entr\u00E9es de cache.
infinispan.mixed-keyed-jdbc-store.binary-keyed-table.table.column.name=Le nom de la colonne de la base de donn\u00E9es.
infinispan.mixed-keyed-jdbc-store.binary-keyed-table.table.column.type=Le type de colonne de base de donn\u00E9es.
infinispan.mixed-keyed-jdbc-store.add=Ajoute une configuration du Mixed Keyed Cache JDBC Store au cache.
infinispan.mixed-keyed-jdbc-store.remove=Supprime une configuration du Mixed Keyed Cache JDBC Store au cache.
infinispan.remote-store=La configuration du cache remote store.
infinispan.remote-store.cache=Le nom du remote cache \u00E0 utiliser pour ce remote store.
infinispan.remote-store.tcp-no-delay=Valeur TCP_NODELAY pour la communication cache \u00E0 distance.
infinispan.remote-store.socket-timeout=Un timeout de socket pour la communication cache \u00E0 distance.
infinispan.remote-store.remote-servers=Une liste de serveurs distants pour ce cache store.
infinispan.remote-store.remote.servers.remote-server=Un serveur distant, d\u00E9fini par sa liaison de socket sortante.
infinispan.remote-store.remote-servers.remote-server.outbound-socket-binding=Une liaison de socket sortante de serveur distant.
infinispan.remote-store.add=Ajoute un \u00E9l\u00E9ment de configuration du cache remote store au cache.
infinispan.remote-store.remove=Supprime un \u00E9l\u00E9ment de configuration de cache store du cache.
