infinispan=La configuraci\u00F3n del sub-sistema infinispan
infinispan.add=Agregar el sub-sistema infinispan
infinispan.describe=Describir el sub-sistema infinispan
infinispan.remove=Borrar el sub-sistema infinispan
infinispan.default-cache-container=El nombre predeterminado del contenedor cach\u00E9 infinispan
infinispan.container=La configuraci\u00F3n de un contenedor cach\u00E9 infinispan
infinispan.container.default-cache=El cach\u00E9 predeterminado infinispan
infinispan.container.add=Agregar un contenedor de cach\u00E9 al sub-sistema infinispan
infinispan.container.remove=Borrar un contenedor de cach\u00E9 del sub-sistema infinispan
infinispan.container.listener-executor=El ejecutador utilizado para la cola de replicaci\u00F3n
infinispan.container.eviction-executor=El ejecutador programado utilizado para eliminaci\u00F3n
infinispan.container.replication-queue-executor=El ejecutador utilizado para operaciones cach\u00E9 asincr\u00F3nicas
infinispan.container.jndi-name=El nombre jndi al cual enlazar este contenedor de cach\u00E9
infinispan.container.start=El modo de inicio del contenedor de cach\u00E9, el cual puede ser EAGER (inicio inmediato) o LAZY (inicio por demanda).
infinispan.container.aliases=La lista de aliases para este contenedor de cach\u00E9
infinispan.container.alias=Un alias para este contenedor de cach\u00E9
infinispan.container.alias.name=Nombre del alias para agregar o borrar
infinispan.container.alias.add-alias=Agregar un alias para este contenedor de cach\u00E9
infinispan.container.alias.remove-alias=Borrar un alias para este contenedor de cach\u00E9
infinispan.container.transport=La descripci\u00F3n del transporte utilizado por este contenedor de cach\u00E9
infinispan.container.transport.add=Agregar el transporte al contenedor cach\u00E9
infinispan.container.transport.remove=Borrar el transporte del contenedor cach\u00E9
infinispan.container.transport.stack=La pila jgroups a utilizar para el transporte
infinispan.container.transport.cluster=El nombre del cl\u00FAster de comunicaci\u00F3n del grupo
infinispan.container.transport.executor=El ejecutador a utilizar para el transporte
infinispan.container.transport.lock-timeout=El tiempo de expiraci\u00F3n para los bloqueos para el transporte
infinispan.container.transport.machine=Un identificador de m\u00E1quina para el transporte
infinispan.container.transport.rack=Un identificador de rack para el transporte
infinispan.container.transport.site=Un identificador de sitio para el transporte
infinispan.container.cache=La lista de cach\u00E9s disponibles para este contenedor de cach\u00E9
infinispan.container.singleton=Un grupo de elementos de configuraci\u00F3n de instancias solas del contenedor de cach\u00E9.
infinispan.container.local-cache=Un cach\u00E9 local
infinispan.container.local-cache.add=Agregar un cach\u00E9 local para este contenedor de cach\u00E9
infinispan.container.invalidation-cache=Un cach\u00E9 de invalidaci\u00F3n
infinispan.container.invalidation-cache.add=Agregar un cach\u00E9 de invalidaci\u00F3n para este contenedor de cach\u00E9
infinispan.container.replicated-cache=Un cach\u00E9 replicado
infinispan.container.replicated-cache.add=Agregar un cach\u00E9 replicado para este contenedor de cach\u00E9
infinispan.container.distributed-cache=Un cach\u00E9 distribu\u00EDdo
infinispan.container.distributed-cache.add=Agregar un cach\u00E9 distribu\u00EDdo para este contenedor de cach\u00E9
infinispan.cache.name=El nombre del cach\u00E9.
infinispan.cache.mode=El modo cach\u00E9. Uso interno s\u00F3lamente.
infinispan.cache.start=El modo de inicio del cach\u00E9, el cual puede ser EAGER (inicio inmediato) o LAZY (inicio por demanda).
infinispan.cache.batching=Si se habilita entonces el API de agrupaci\u00F3n de invocaciones se har\u00E1 disponible para este cach\u00E9.
infinispan.cache.indexing=Si se habilita entonces las entradas recibir\u00E1n un \u00EDndice cuando se agregan al cach\u00E9. Los \u00EDndices se actualizar\u00E1n cuando se borren o se cambien entradas.
infinispan.cache.jndi-name=El nombre jndi al cual enlazar esta instancia del cach\u00E9
infinispan.cache.remove=Borrar un cach\u00E9 de este contenedor.
infinispan.cache.singleton=Un grupo de elementos de configuraci\u00F3n de una sola instancia del cach\u00E9 (bloqueo, transacci\u00F3n, eliminaci\u00F3n, expiraci\u00F3n, almacenamiento, almacenamiento en archivo, almacenamiento jdbc, almacenamiento remoto).
infinispan.cache.locking=La configuraci\u00F3n de bloqueo del cach\u00E9.
infinispan.cache.locking.isolation=Establece el nivel de aislamiento de bloqueo del cach\u00E9.
infinispan.cache.locking.striping=Si es verdadero entonces se mantiene un pool de bloqueos compartidos para todas las entradas que necesitan ser bloqueadas. De otra manera, se crea un bloqueo para cada entrada en el cach\u00E9. El deshacer los bloqueos ayuda a controlar  la huella de la memoria pero puede reducir la concurrencia en el sistema.
infinispan.cache.locking.acquire-timeout=Tiempo m\u00E1ximo para tratar de adquirir un bloqueo en particular.
infinispan.cache.locking.concurrency-level=Nivel de concurrencia para los contenedores de bloqueos. Ajuste este valor de acuerdo al n\u00FAmero de hilos concurrentes interactuando con Infinispan.
infinispan.cache.locking.add=Agrega un elemento de configuraci\u00F3n de bloqueo al cach\u00E9.
infinispan.cache.locking.remove=Borra un elemento de configuraci\u00F3n de bloqueo del cach\u00E9.
infinispan.cache.transaction=La configuraci\u00F3n de transacciones del cach\u00E9.
infinispan.cache.transaction.mode=Establece el modo de transacci\u00F3n del cach\u00E9 como NONE, NON_XA, NON_DURABLE_XA o FULL_XA.
infinispan.cache.transaction.stop-timeout=Si hay alguna transacci\u00F3n en progreso cuando se detiene un cach\u00E9 entonces Infinispan espera que las transacciones remotas y locales terminen. La cantidad de tiempo de espera est\u00E1 definida por el tiempo de expiraci\u00F3n de detenci\u00F3n del cach\u00E9.
infinispan.cache.transaction.eager-locking=Solo tiene efecto para el modo DIST y cuando useEagerLocking est\u00E1 establecido como verdadero. Cuando esto est\u00E1 habilitado entonces solo un nodo est\u00E1 bloqueado en el  cl\u00FAster sin importar la configuraci\u00F3n de numOwners.
infinispan.cache.transaction.locking=El modo de bloqueo para este cach\u00E9 puede ser OPTIMISTIC o PESSIMISTIC.
infinispan.cache.transaction.add=Agrega un elemento de configuraci\u00F3n de una transacci\u00F3n al cach\u00E9.
infinispan.cache.transaction.remove=Borra un elemento de configuraci\u00F3n de una transacci\u00F3n del cach\u00E9.
infinispan.cache.eviction=La configuraci\u00F3n de eliminaci\u00F3n del cach\u00E9.
infinispan.cache.eviction.strategy=Establece la estrategia de eliminaci\u00F3n del cach\u00E9. Las opcions disponibles son 'UNORDERED', 'FIFO', 'LRU', 'LIRS' y 'NONE' (para inhabilitar la eliminaci\u00F3n).
infinispan.cache.eviction.max-entries=El n\u00FAmero m\u00E1ximo de entradas en una instancia de cach\u00E9. Si el valor seleccionado no es un potencia de dos entonces el valor real ser\u00E1 por defecto el poder m\u00EDnimo mayor que el valor seleccionado. -1 significa que no hay l\u00EDmite.
infinispan.cache.eviction.add=Agrega un elemento de configuraci\u00F3n de eliminaci\u00F3n al cach\u00E9.
infinispan.cache.eviction.remove=Borra un elemento de configuraci\u00F3n de eliminaci\u00F3n del cach\u00E9.
infinispan.cache.expiration=La configuraci\u00F3n de expiraci\u00F3n del cach\u00E9.
infinispan.cache.expiration.max-idle=El tiempo m\u00E1ximo de inactividad que se mantendr\u00E1 una entrada del cach\u00E9 en el cach\u00E9, en milisegundos. Si el tiempo de inactividad se excede entonces la entrada expirar\u00E1 en todo el cl\u00FAster. -1 significa que las entradas nunca expiran.
infinispan.cache.expiration.lifespan=Tiempo de vida m\u00E1ximo de una entrada de cach\u00E9 despu\u00E9s del cual la entrada expira en todo el cl\u00FAster, se expresa en milisegundos. -1 significa que las entradas nunca expiran.
infinispan.cache.expiration.interval=Intervalo (en milisegundos) entre ejecuciones posteriores para depurar entradas que han expirado de la memoria y cualquier almacenamiento cach\u00E9. Si desea inhabilitar el proceso de eliminaci\u00F3n peri\u00F3dico entonces establezca wakeupInterval como -1.
infinispan.cache.expiration.add=Agrega un elemento de configuraci\u00F3n de expiraci\u00F3n al cach\u00E9.
infinispan.cache.expiration.remove=Borra un elemento de configuraci\u00F3n de expiraci\u00F3n del cach\u00E9.
infinispan.cache.store=La configuraci\u00F3n del almac\u00E9namiento del cach\u00E9.
infinispan.cache.store.add=Agrega al cach\u00E9 un elemento de configuraci\u00F3n del almacenamiento b\u00E1sico de cach\u00E9.
infinispan.cache.store.remove=Borra del cach\u00E9 un elemento de configuraci\u00F3n del almacenamiento del cach\u00E9.
infinispan.cache.store.shared=Este debe ser verdadero cuando m\u00FAltiples instancias de cach\u00E9 comparten el mismo almacenamiento de cach\u00E9 (por ejemplo, m\u00FAltiples nodos en un cl\u00FAster usando un CacheStore basado en JDBC apuntando a la misma base de datos compartida). El configurarlo como verdadero evita que m\u00FAltiples instancias del cach\u00E9 escriban la misma modificaci\u00F3n m\u00FAltiples veces. Si se habilita entonces solo el nodo en donde se origin\u00F3 la modificaci\u00F3n escribir\u00E1 en el almacenamiento cach\u00E9. Si se inhabilita entonces cada cach\u00E9 individual reacciona a la potencial actualizaci\u00F3n remota almacenando los datos en el almac\u00E9n de cach\u00E9.
infinispan.cache.store.preload=Si es verdadero entonces cuando el cach\u00E9 inicia los datos almacenados en el almacenamiento de cach\u00E9 se pre-cargar\u00E1n en la memoria. Esto es particularmente \u00FAtil cuando los datos en el almac\u00E9n de cach\u00E9 se necesitar\u00E1n inmediatamente despu\u00E9s del arranque y quiere evitar que las operaciones del cach\u00E9 se retrasen como resultado de cargar estos datos de manera perezosa. Se puede utilizar para brindar un 'cach\u00E9-tibio' en el arranque; sin embargo, hay una penalidad en el rendimiento ya que el tiempo de arranque es afectado por este proceso.
infinispan.cache.store.passivation=Si es verdadero entonces los datos solo se escriben en el almacenamiento de cach\u00E9 cuando se elimina de la memoria, un fenomeno conocido como 'pasivaci\u00F3n'. La pr\u00F3xima vez que se soliciten los datos se 'activar\u00E1', lo que significa que los datos se traer\u00E1n de regreso a la memoria y se borrar\u00E1n del almacenamiento persistente. Si es falso entonces el almacenamiento de cach\u00E9 contiene una copia del contenido en la memoria as\u00ED que escribe el resultado cach\u00E9 en escrituras de almacenamiento de cach\u00E9. Esto esencialmente le da una configuraci\u00F3n de 'escritura-completa'.
infinispan.cache.store.fetch-state=Si es verdadero entonces busca el estado persistente al unirse a un cl\u00FAster. Si se encadenan m\u00FAltiples almacenamientos de cach\u00E9 entonces s\u00F3lo uno de ellos puede tener habilitada esta propiedad.
infinispan.cache.store.purge=Si es verdadero entonces este almacenamiento de cach\u00E9 vac\u00EDa cuando arranca.
infinispan.cache.store.singleton=Si es verdadero entonces el almacenamiento de cach\u00E9 de almacenamiento singleton se habilita. SingletonStore es un almacenamiento de cach\u00E9 de delegaci\u00F3n para las situaciones en que solo una instancia en un cl\u00FAster deben interactuar con el almacenamiento subyacente.
infinispan.cache.store.class=La clase de implementaci\u00F3n de almacenamiento personalizado a utilizar para este almacenamiento de cach\u00E9.
infinispan.cache.store.properties=Una lista de propiedades de almacenamiento de cach\u00E9.
infinispan.cache.store.property=Una propiedad de almacenamiento de cach\u00E9 con nombre y valor.
infinispan.cache.store.property.add=Agrega una propiedad de almacenamiento de cach\u00E9.
infinispan.cache.store.property.remove=Borra una propiedad de almacenamiento de cach\u00E9. 
infinispan.cache.store.property.value=El valor de la propiedad del almacenamiento cach\u00E9.
infinispan.cache.file-store=La configuraci\u00F3n del almac\u00E9namiento de archivos cach\u00E9.
infinispan.cache.file-store.add=Agrega al cach\u00E9 un elemento de configuraci\u00F3n del almacenamiento de cach\u00E9 de archivo.
infinispan.cache.file-store.relative-to=Descripci\u00F3n
infinispan.cache.file-store.path=Descripci\u00F3n
infinispan.cache.jdbc-store=La configuraci\u00F3n del almac\u00E9namiento de JDBC de cach\u00E9.
infinispan.cache.jdbc-store.add=Agrega al cach\u00E9 un elemento de configuraci\u00F3n del almacenamiento de cach\u00E9 JDBC.
infinispan.cache.jdbc-store.datasource=Una referencia de fuentes de datos para esta fuente de datos.
infinispan.cache.jdbc-store.entry-table=La tabla de la base de datos utilizada para almacenar entradas de cach\u00E9.
infinispan.cache.jdbc-store.bucket-table=La tabla de la base de datos utilizada para almacenar entradas cach\u00E9 binarias.
infinispan.cache.jdbc-store.table.prefix=El prefijo para el nombre de la tabla de la base de datos
infinispan.cache.jdbc-store.table.batch-size=Para inserciones de la base de datos el tama\u00F1o del grupo determina la cantidad de inserciones que se agrupan.
infinispan.cache.jdbc-store.table.fetch-size=Para peticiones de la base de datos el tama\u00F1o de b\u00FAsqueda se utilizar\u00E1 para buscar el tama\u00F1o de ResultSets.
infinispan.cache.jdbc-store.table.id-column=Una columna de la base de datos para mantener los ids de entrada del cach\u00E9.
infinispan.cache.jdbc-store.table.data-column=Una columna de la base de datos para mantener los datos de entrada del cach\u00E9.
infinispan.cache.jdbc-store.table.timestamp-column=Una columna de la base de datos para mantener los sellos de fecha de entrada del cach\u00E9.
infinispan.cache.jdbc-store.table.column.name=El nombre de la columna de la base de datos.
infinispan.cache.jdbc-store.table.column.type=El tipo de la columna de la base de datos.
infinispan.cache.remote-store=La configuraci\u00F3n del almac\u00E9namiento remoto cach\u00E9.
infinispan.cache.remote-store.add=Agrega al cach\u00E9 un elemento de configuraci\u00F3n del almacenamiento de cach\u00E9 remoto
infinispan.cache.remote-store.cache=El nombre del cach\u00E9 remoto a utilizar para este almacenamiento remoto.
infinispan.cache.remote-store.tcp-no-delay=Un valor TCP_NODELAY para la comunicaci\u00F3n cach\u00E9 remota.
infinispan.cache.remote-store.socket-timeout=Un tiempo de expiraci\u00F3n de socket para la comunicaci\u00F3n del cach\u00E9 remoto.
infinispan.cache.remote-store.remote-servers=Una lista de servidores remotos para este almacenamiento cach\u00E9.
infinispan.cache.remote-store.remote-server=Un servidor remoto definido por su enlace de socket saliente.
infinispan.cache.remote-store.remote-server.outbound-socket-binding=Un enlace de socket saliente para un servidor remoto.
infinispan.clustered-cache.async-marshalling=Si est\u00E1 habilitado har\u00E1 que la organizaci\u00F3n de las entradas se realice de manera asincr\u00F3nica.
infinispan.clustered-cache.mode=Establece el modo de cach\u00E9 en cl\u00FAsters, ASYNC para operaciones asincr\u00F3nicas o SYNC para operaci\u00F3n sincr\u00F3nica.
infinispan.clustered-cache.queue-size=En el modo ASYNC, este atributo se puede utilizar para disparar el vaciado de la cola cuando alcanza un l\u00EDmite espec\u00EDfico.
infinispan.clustered-cache.queue-flush-interval=En modo ASYNC, este atributo controla la frecuencia con la que el hilo asincr\u00F3nico sol\u00EDa vaciar las ejecuciones de la cola de replicaci\u00F3n. Este debe ser un entero positivo, el cual representa el tiempo despierto del hilo en milisegundos.
infinispan.clustered-cache.remote-timeout=En modo SYNC, el tiempo de expiraci\u00F3n (en milisegundos) que se utiliza para esperar por un reconocimiento al realizar una llamada remota, despu\u00E9s de la cual la llamada se aborta y se presenta una excepci\u00F3n. 
infinispan.replicated-cache.state-transfer=La configuraci\u00F3n de la transferencia de estado para los cach\u00E9s de distribuci\u00F3n y replicados.
infinispan.replicated-cache.state-transfer.add=Agregar una configuraci\u00F3n de transferencia de estado.
infinispan.replicated-cache.state-transfer.remove=Borrar una configuraci\u00F3n de transferencia de estado.
infinispan.replicated-cache.state-transfer.enabled=Si est\u00E1 habilitado esto har\u00E1 que el cach\u00E9 le pida a los cach\u00E9s vecinos el estado cuando arranca de manera que el cach\u00E9 inicia 'tibio' aunque tendr\u00E1 impacto en el tiempo del arranque.
infinispan.replicated-cache.state-transfer.timeout=La cantidad m\u00E1xima de tiempo a esperar (en milisegundos) por el estado de los cach\u00E9s vecionos antes de presentar una excepci\u00F3n y abortar el arranque.
infinispan.replicated-cache.state-transfer.chunk-size=El tama\u00F1o en bytes en el cual se debe agrupar la transferencia de las entradas en cach\u00E9.
infinispan.distributed-cache=La configuraci\u00F3n del cach\u00E9 distribuido.
infinispan.distributed-cache.owners=N\u00FAmero de r\u00E9plicas a nivel del cl\u00FAster para cada entrada del cach\u00E9. 
infinispan.distributed-cache.virtual-nodes=Controla el n\u00FAmero de nodos virtuales por nodo "real". Si numVirtualNodes es 1 entonces los nodos virtuales se inhabilitan. Debe utilizar el hash consistente conciente de la topolog\u00EDa si desea tomar ventaja de los nodos virtuales. Se utiliza un valor predeterminado de 1.
infinispan.distributed-cache.l1-lifespan=Tiempo de vida m\u00E1ximo de una entrada que se encuentra en el cach\u00E9 L1. Este elemento configura el comportamiento del cach\u00E9 L1 en instancias de cach\u00E9s 'distribuidos'. En otros modos de cach\u00E9 este elemento se ignora.
