infinispan=A configura\u00E7\u00E3o do sub-sistema infinispan
infinispan.add=Adiciona o sub-sistema do infinispan
infinispan.describe=Descreve o sub-sistema do infinispan
infinispan.remove=Remove o sub-sistema do infinispan
infinispan.default-cache-container=O nome do recipiente do cache infinispan padr\u00E3o
infinispan.container=A configura\u00E7\u00E3o de um recipiente do cache infinispan
infinispan.container.default-cache=O cache infinispan padr\u00E3o
infinispan.container.add=Adiciona o recipiente do cache ao sub-sistema do infinispan
infinispan.container.remove=Remove o recipiente do cache a partir do sub-sistema infinispan
infinispan.container.listener-executor=O executor usado para replicar a fila
infinispan.container.eviction-executor=O executor esquematizado para uso da remo\u00E7\u00E3o
infinispan.container.replication-queue-executor=O executor usado para as opera\u00E7\u00F5es do cache ass\u00EDncronas
infinispan.container.jndi-name=O nome jndi pelo qual deve efetuar i bind nesse recipiente do cache
infinispan.container.start=O modo de inicia\u00E7\u00E3o do recipiente do cache, que pode ser EAGER (in\u00EDcio imediato) ou LAZY (in\u00EDcio a pedido).
infinispan.container.aliases=A lista de aliases para esse recipiente de cache
infinispan.container.alias=Um alias para esse recipiente de cache
infinispan.container.alias.name=O nome do alias de adi\u00E7\u00E3o e remo\u00E7\u00E3o
infinispan.container.alias.add-alias=Adiciona um alias para esse recipiente de cache
infinispan.container.alias.remove-alias=Remove um alias para esse recipiente de cache
infinispan.container.transport=A descri\u00E7\u00E3o do transporte usado por esse recipiente do cache
infinispan.container.transport.add=Adiciona o transporte ao recipiente do cache
infinispan.container.transport.remove=Remove o transporte a partir do recipiente do cache
infinispan.container.transport.stack=A pilha jgroups para uso do transporte
infinispan.container.transport.cluster=O nome do cluster de comunica\u00E7\u00E3o do grupo
infinispan.container.transport.executor=O executor a ser usado pelo transporte
infinispan.container.transport.lock-timeout=O intervalo para bloqueio do transporte
infinispan.container.transport.machine=Um identificador da m\u00E1quina para o transporte
infinispan.container.transport.rack=Um identificador rack para transporte
infinispan.container.transport.site=Um identificador de site para transporte
infinispan.container.cache=Uma lista de caches dispon\u00EDveis para esse recipiente de cache
infinispan.container.singleton=Um conjunto de elementos de configura\u00E7\u00E3o da inst\u00E2ncia \u00FAnica do recipiente do cache.
infinispan.container.local-cache=Um cache local
infinispan.container.local-cache.add=Adiciona o cache local ao recipiente do cache
infinispan.container.invalidation-cache=Um cache inv\u00E1lido
infinispan.container.invalidation-cache.add=Adiciona uma invalida\u00E7\u00E3o do cache para esse recipiente do cache
infinispan.container.replicated-cache=Um cache replicado
infinispan.container.replicated-cache.add=Adiciona um cache replicado a esse recipiente do cache
infinispan.container.distributed-cache=Um cache distribu\u00EDdo
infinispan.container.distributed-cache.add=Adiciona o cache distribu\u00EDdo a esse recipiente do cache
infinispan.cache.name=O nome do cache.
infinispan.cache.mode=O modo do cache. Uso interno apenas.
infinispan.cache.start=O modo de inicializa\u00E7\u00E3o do cache, que pode ser EAGER (in\u00EDcio imediato) ou LAZY (in\u00EDcio a pedido).
infinispan.cache.batching=Caso ativado, o API de envio de lote da invoca\u00E7\u00E3o estar\u00E1 dispon\u00EDvel para esse cache.
infinispan.cache.indexing=Caso ativado, as entradas ser\u00E3o indexadas quando adicionadas ao cache. Os \u00EDndices ser\u00E3o atualizados uma vez que as entradas s\u00E3o alteradas ou removidas.
infinispan.cache.jndi-name=O jndi-name a ser vinculado a essa inst\u00E2ncia.
infinispan.cache.remove=Remove o cache desse recipiente.
infinispan.cache.singleton=Um conjunto de elementos de configura\u00E7\u00E3o da inst\u00E2ncia \u00FAnica do cache (bloqueamento, transa\u00E7\u00E3o, remo\u00E7\u00E3o, vencimento, armazenamento, file-store, jdbc-store, remote-store).
infinispan.cache.locking=A configura\u00E7\u00E3o de bloqueamento do cache.
infinispan.cache.locking.isolation=Determina o n\u00EDvel de isola\u00E7\u00E3o do bloqueamento.
infinispan.cache.locking.striping=Caso verdadeiro, um pool de bloqueamentos compartilhados \u00E9 mantido para todas as entradas que precisam ser bloqueadas. Do contr\u00E1rio, um bloqueio \u00E9 criado por entrada do cache. A distribui\u00E7\u00E3o de bloqueio auxilia no controle do volume da mem\u00F3ria, mas pode reduzir a simultaneidade no sistema.
infinispan.cache.locking.acquire-timeout=Per\u00EDodo m\u00E1ximo de tentativa de uma aquisi\u00E7\u00E3o particular de bloqueio. 
infinispan.cache.locking.concurrency-level=O n\u00EDvel de simultaneidade para recipientes de bloqueio. Ajuste este valor de acordo com o n\u00FAmero de threads simult\u00E2neos interagindo com o Infinispan.
infinispan.cache.locking.add=Adiciona o elemento de configura\u00E7\u00E3o do bloqueamento para o cache.
infinispan.cache.locking.remove=Remove o elemento de configura\u00E7\u00E3o do bloqueamento a partir do cache.
infinispan.cache.transaction=A configura\u00E7\u00E3o da transa\u00E7\u00E3o do cache.
infinispan.cache.transaction.mode=Determina o modo de transa\u00E7\u00E3o do cache para um dos NONE, NON_XA, NON_DURABLE_XA, FULL_XA.
infinispan.cache.transaction.stop-timeout=Caso hajam transa\u00E7\u00F5es em andamento quando o cache \u00E9 encerrado, o Infinispan espera por transa\u00E7\u00F5es locais e remotas em andamento para finaliza\u00E7\u00E3o. O per\u00EDodo de espera \u00E9 definido pelo intervalo de parada do cache.
infinispan.cache.transaction.eager-locking=Possui efeito apenas para o modo DIST e quando o useEagerLocking for configurado para verdadeiro. Quando ele \u00E9 ativado, apenas um n\u00F3 \u00E9 bloqueado no cluster, independente da configura\u00E7\u00E3o numOwners.
infinispan.cache.transaction.locking=O modo de bloqueamento para esse cache, OTIMISTA ou PESSIMISTA.
infinispan.cache.transaction.add=Adiciona o elemento de configura\u00E7\u00E3o da transa\u00E7\u00E3o ao cache.
infinispan.cache.transaction.remove=Remove um elemento de configura\u00E7\u00E3o da transa\u00E7\u00E3o a partir do cache.
infinispan.cache.eviction=A configura\u00E7\u00E3o de remo\u00E7\u00E3o do cache.
infinispan.cache.eviction.strategy=Determina a estrat\u00E9gia de remo\u00E7\u00E3o do cache. As op\u00E7\u00F5es dispon\u00EDveis s\u00E3o 'UNORDERED', 'FIFO', 'LRU', 'LIRS' e 'NONE' (para desativar a remo\u00E7\u00E3o).
infinispan.cache.eviction.max-entries=O n\u00FAmero m\u00E1ximo de entradas numa inst\u00E2ncia do cache. Caso o valor selecionado n\u00E3o estiver ao quadrado, o valor atual ser\u00E1 padr\u00E3o ao menor valor ao quadrado quando comparado ao valor selecionado. -1 significa sem limite.
infinispan.cache.eviction.add=Adiciona um elemento de configura\u00E7\u00E3o da remo\u00E7\u00E3o ao cache.
infinispan.cache.eviction.remove=Remove um elemento de configura\u00E7\u00E3o de remo\u00E7\u00E3o a partir do cache.
infinispan.cache.expiration=A configura\u00E7\u00E3o de validade do cache.
infinispan.cache.expiration.max-idle=Tempo m\u00E1ximo ocioso que uma entrada de cache ser\u00E1 mantida no cache, em mil\u00E9simos de segundos. Caso o tempo ocioso seja excedido, a entrada ser\u00E1 expirada no cluster. -1 significa que as entradas nunca expirar\u00E3o.
infinispan.cache.expiration.lifespan=O tempo de vida m\u00E1ximo de uma entrada de cache, ap\u00F3s uma entrada ser expirada no cluster, em mil\u00E9simos de segundo. -1 significa que as entradas nunca expirar\u00E3o.
infinispan.cache.expiration.interval=Intervalo (em mil\u00E9simos de segundos) entre rodagens subsequentes para limpar entradas vencidas da mem\u00F3ria e quaisquer armazenamentos do cache. Caso deseje desativar o processo de remo\u00E7\u00E3o peri\u00F3dico de uma vez, configure wakeupInterval para -1.
infinispan.cache.expiration.add=Adiciona um elemento de configura\u00E7\u00E3o expirado ao cache.
infinispan.cache.expiration.remove=Remove um elemento de configura\u00E7\u00E3o expirado do cache.
infinispan.cache.store=A configura\u00E7\u00E3o de armazenamento do cache.
infinispan.cache.store.add=Adiciona um elemento de configura\u00E7\u00E3o do armazenamento do cache b\u00E1sico ao cache.
infinispan.cache.store.remove=Remove um elemento de configura\u00E7\u00E3o de armazenamento do cache ao cache.
infinispan.cache.store.shared=Essa configura\u00E7\u00E3o deve ser configurada para verdadeiro quando as inst\u00E2ncias de cache m\u00FAltiplas compartilharem o mesmo armazenamento de cache (ex.\: n\u00F3s m\u00FAltiplos num cluster usando um CacheStore  baseado no JDBC direcionado ao mesmo, banco de dados compartilhado.) A configura\u00E7\u00E3o do mesmo para verdadeiro evita que inst\u00E2ncias de cache m\u00FAltiplas gravem a mesma modifica\u00E7\u00E3o diversas vezes. Caso ativado, apenas o n\u00F3 onde a modifica\u00E7\u00E3o foi originada ser\u00E1 gravado ao armazenamento do cache. Caso desativado, cada cache individual reage a uma atualiza\u00E7\u00E3o remota potencial pelo armazenamento de dados ao armazenamento do cache.
infinispan.cache.store.preload=Caso verdadeiro, quando o cache \u00E9 inicializado, os dados armazenados ser\u00E3o pr\u00E9-carregados na mem\u00F3ria. Isto \u00E9 particularmente \u00FAtil quando os dados no armazenamento do cache ser\u00E3o necess\u00E1rios imediatamente ap\u00F3s inicializa\u00E7\u00E3o e voc\u00EA deseje evitar que as opera\u00E7\u00F5es do cache sejam atrasadas como resultado do carregamento desses dados vagarosamente. Isso pode ser usado para fornecer um 'warm-cache' na inicializa\u00E7\u00E3o, no entanto ocorre uma penalidade de desempenho uma vez que o per\u00EDodo de inicializa\u00E7\u00E3o \u00E9 atingido por este processo.
infinispan.cache.store.passivation=Caso verdadeiro, os dados apenas gravam ao armazenamento do cache quando ele \u00E9 removido da mem\u00F3ria, um fen\u00F4meno conhecido como 'passiva\u00E7\u00E3o'. A pr\u00F3xima vez em que os dados sejam solicitados, eles ser\u00E3o 'ativados' significando que os dados ser\u00E3o levados de volta \u00E0 mem\u00F3ria e removidos do armazenamento persistente. Caso falso, o armazenamento do cache possuir\u00E1 uma c\u00F3pia dos conte\u00FAdos em mem\u00F3ria, de forma que a grava\u00E7\u00E3o ao cache resulta em grava\u00E7\u00F5es do armazenamento do cache. Basicamente, este procedimento o fornece uma configura\u00E7\u00E3o 'write-through'.\n
infinispan.cache.store.fetch-state=Caso verdadeiro, pesquise o estado persistente quando ingressando a um cluster. Caso armazenamentos de caches m\u00FAltiplos forem agrupados, apenas um deles ter\u00E1 essa propriedade ativada.
infinispan.cache.store.purge=Caso verdadeiro, esse cache armazenar\u00E1 na inicializa\u00E7\u00E3o.
infinispan.cache.store.singleton=Caso verdadeiro, o armazenamento de cache de armazenamento singleton ser\u00E1 ativado. O SingletonStore \u00E9 um armazenamento de cache de delega\u00E7\u00E3o usado em situa\u00E7\u00F5es onde uma inst\u00E2ncia no cluster deve interagir com um armazenamento subjacente.
infinispan.cache.store.class=A classe de implanta\u00E7\u00E3o do armazenamento personalizado de uso para esse armazenamento de cache.
infinispan.cache.store.properties=Uma lista de propriedades de armazenamento de cache.
infinispan.cache.store.property=Uma propriedade de armazenamento de cache com o nome e valor.
infinispan.cache.store.property.add=Adiciona a propriedade do armazenamento de cache.
infinispan.cache.store.property.remove=Remove a propriedade de armazenamento de cache.
infinispan.cache.store.property.value=O valor da propriedade do armazenamento do cache.
infinispan.cache.file-store=A configura\u00E7\u00E3o do armazenamento do arquivo do cache.
infinispan.cache.file-store.add=Adiciona o elemento da configura\u00E7\u00E3o do armazenamento do cache de arquivo ao cache.
infinispan.cache.file-store.relative-to=Descri\u00E7\u00E3o
infinispan.cache.file-store.path=Descri\u00E7\u00E3o
infinispan.cache.jdbc-store=A configura\u00E7\u00E3o do armazenamento JDBC do cache.
infinispan.cache.jdbc-store.add=Adiciona o elemento de configura\u00E7\u00E3o do armazenamento do cache ao cache.
infinispan.cache.jdbc-store.datasource=A refer\u00EAncia do datasource para esse banco de dados.
infinispan.cache.jdbc-store.entry-table=A tabela do banco de dados usada para armazenar as entradas do cache.
infinispan.cache.jdbc-store.bucket-table=A tabela do banco de dados usada para armazenar as entradas do cache bin\u00E1rio.
infinispan.cache.jdbc-store.table.prefix=O prefixo para o nome da tabela do banco de dados.
infinispan.cache.jdbc-store.table.batch-size=O tamanho do lote determina quantas inser\u00E7\u00F5es s\u00E3o agrupadas em lote nas inser\u00E7\u00F5es DB.
infinispan.cache.jdbc-store.table.fetch-size=O tamanho da pesquisa ser\u00E1 usada para determinar o tamanho da pesquisa no ResultSets nas consultas DB.
infinispan.cache.jdbc-store.table.id-column=A coluna do banco de dados para manter os ids da entrada do cache.
infinispan.cache.jdbc-store.table.data-column=A coluna do banco de dados para manter os dados de entrada do cache.
infinispan.cache.jdbc-store.table.timestamp-column=A coluna do banco de dados para manter os timestamps de entrada do cache.
infinispan.cache.jdbc-store.table.column.name=O nome da coluna do banco de dados.
infinispan.cache.jdbc-store.table.column.type=O tipo da coluna do banco de dados.
infinispan.cache.remote-store=A configura\u00E7\u00E3o do armazenamento remoto do cache.
infinispan.cache.remote-store.add=Adiciona o elemento de configura\u00E7\u00E3o do armazenamento do cache remoto ao cache.
infinispan.cache.remote-store.cache=O nome do cache remoto para uso no armazenamento remoto.
infinispan.cache.remote-store.tcp-no-delay=Um valor TCP_NODELAY para a comunica\u00E7\u00E3o do cache remoto.
infinispan.cache.remote-store.socket-timeout=O intervalo do soquete para a comunica\u00E7\u00E3o do cache remoto.
infinispan.cache.remote-store.remote-servers=Uma lista dos servidores remotos para esse armazenamento de cache.
infinispan.cache.remote-store.remote-server=Um servidor remoto, definido pelo binding do soquete externo.
infinispan.cache.remote-store.remote-server.outbound-socket-binding=Um binding do soquete externo para o servidor remoto.
infinispan.clustered-cache.async-marshalling=Caso ativado, isto levar\u00E1 ao empacotamentos das entradas a serem executadas de forma ass\u00EDncrona.
infinispan.clustered-cache.mode=Determina o modo do cache com cluster, ASYNC para opera\u00E7\u00E3o ass\u00EDncrona ou SYNC para opera\u00E7\u00E3o s\u00EDncrona.
infinispan.clustered-cache.queue-size=No modo ASYNC, esse atributo pode ser usado para aplicar o trigger no esvaziamento da fila quando ele alcan\u00E7ar um limite espec\u00EDfico.
infinispan.clustered-cache.queue-flush-interval=No modo ASYNC, esse atributo controla a frequ\u00EAncia em que o thread ass\u00EDncrono usou para esvaziar as rodagens da fila de replica\u00E7\u00E3o. Isto deve ser um n\u00FAmero positivo que representa o per\u00EDodo de despertar do thread em mil\u00E9simos de segundos. 
infinispan.clustered-cache.remote-timeout=No modo SYNC, o intervalo (em mil\u00E9simos de segundos) usado para esperar um reconhecimento na realiza\u00E7\u00E3o de uma chamada remota, ap\u00F3s a chamada ser abortada e uma exce\u00E7\u00E3o ser lan\u00E7ada.
infinispan.replicated-cache.state-transfer=A configura\u00E7\u00E3o de transfer\u00EAncia de estado para distribui\u00E7\u00E3o e replica\u00E7\u00E3o dos caches.
infinispan.replicated-cache.state-transfer.add=Adiciona a configura\u00E7\u00E3o da transfer\u00EAncia de estado.
infinispan.replicated-cache.state-transfer.remove=Remove a configura\u00E7\u00E3o da transfer\u00EAncia de estado.
infinispan.replicated-cache.state-transfer.enabled=Caso ativado, isso levar\u00E1 o cache a perguntar aos caches vizinhos pelo estafo quando ele iniciar, de forma que o cache inicia 'warm', mesmo que isto impacte no per\u00EDodo de inicializa\u00E7\u00E3o.
infinispan.replicated-cache.state-transfer.timeout=O per\u00EDodo m\u00E1ximo de tempo (em mil\u00E9simos de segundos) a partir dos caches vizinhos, antes de lan\u00E7ar uma exce\u00E7\u00E3o e abortar a inicializa\u00E7\u00E3o.
infinispan.replicated-cache.state-transfer.chunk-size=O tamanho, em bites, para posicionar em lote de transfer\u00EAncia das entradas do cache.
infinispan.distributed-cache=A configura\u00E7\u00E3o do cache distribu\u00EDdo.
infinispan.distributed-cache.owners=N\u00FAmero das r\u00E9plicas do cluster para cada entrada.
infinispan.distributed-cache.virtual-nodes=Controla o n\u00FAmero de n\u00F3s virtuais por n\u00F3 "real". Caso um numVirtualNodes for 1, os n\u00F3s virtuais ser\u00E3o desativados. A topologia consistente hash deve ser usada caso voc\u00EA deseje obter vantagens dos n\u00F3s virtuais. O padr\u00E3o 1 \u00E9 usado.
infinispan.distributed-cache.l1-lifespan=O tempo de vida m\u00E1ximo de uma entrada posicionada no cache de L1. Esse elemento configura o comportamento do cache de L1 nas inst\u00E2ncias de caches 'distribu\u00EDdas'. Esse elemento \u00E9 ignorado em quaisquer outros modos.
