ws=La configuraci\u00F3n del sub-sistema de servicios web.
ws.add=A\u00F1ade el sub-sistema de servicios web.
ws.remove=Borra el sub-sistema de servicios web.
deployment=Recursos del tiempo de ejecuci\u00F3n expuestos por los componentes en la implementaci\u00F3n.
endpoint=Punto final de Webservice.
endpoint.name=Nombre del punto final de Webservice.
endpoint.context=Contexto del punto final de Webservice.
endpoint.class=Clase del punto final de Webservice.
endpoint.type=Tipo del punto final de Webservice.
endpoint.wsdl=URL del WSDL de punto final de Webservice.
endpoint.add=A\u00F1ade el punto final de Webservice.
endpoint.remove=Borra el punto final de Webservice.
modify.wsdl.address=Si la direcci\u00F3n de SOAP puede modificarse o no.
wsdl.host=El WSDL, el cual es un artefacto de despliegue para un punto final, tiene un elemento  <soap\:address> que apunta al sitio del punto final. JBoss soporta la rescritura de la direcci\u00F3n de SOAP. Si  el contenido de <soap\:address> es una URL v\u00E1lida, JBossWS no la rescribir\u00E1 a menos que 'modify-wsdl-address' sea verdadero. Si el contenido de  <soap\:address> no es una URL v\u00E1lida, JBossWS la rescribir\u00E1 mediante los valores de atributos determinados abajo. Si 'wsdl-host' se establece a 'jbossws.undefined.host', JBossWS utiliza  solicitadores de host al rescribir <soap\:address>
wsdl.port=El puerto no-seguro que ser\u00E1 utilizado para rescribir la direcci\u00F3n de SOAP. Si el puerto est\u00E1 ausente, ser\u00E1 identificado al consultar la lista de los conectores instalados.
wsdl.secure.port=El puerto seguro que ser\u00E1 utilizado para rescribir la direcci\u00F3n de SOAP. Si el puerto est\u00E1 ausente, ser\u00E1 identificado al consultar la lista de los conectores instalados.
average.processing.time=Tiempo de procesamiento promedio de punto final.
min.processing.time=Tiempo de procesamiento m\u00EDnimo de punto final.
max.processing.time=Tiempo de procesamiento m\u00E1ximo de punto final.
total.processing.time=Tiempo de procesamiento total de punto final.
request.count=Conteo de peticiones de punto final procesadas. 
response.count=Conteo de respuestas de punto final generadas.
fault.count=Conteo de fallas de punto final generadas.
endpoint.config=Configuraci\u00F3n de punto final de Webservice
endpoint.config.add=A\u00F1ade una configuraci\u00F3n de punto final
endpoint.config.remove=Borra una configuraci\u00F3n de punto final
endpoint.config.pre.handler.chain=Cadena de PRE-controlador de configuraci\u00F3n de punto final
endpoint.config.post.handler.chain=Cadena de POST-controlador de configuraci\u00F3n de punto final
endpoint.config.property=Propiedad de configuraci\u00F3n de punto final
endpoint.config.property.add=A\u00F1ade una propiedad de configuraci\u00F3n de punto final
endpoint.config.property.remove=Borra una propiedad de configuraci\u00F3n de punto final
endpoint.config.property.value=Valor de una propiedad de configuraci\u00F3n de punto final
protocol.binding=Enlace de protocolo
handler=Controlador de protocolo
handler.name=Nombre de controlador
handler.class=Clase de controlador
