webservices=A configura\u00E7\u00E3o do subsistema dos servi\u00E7os da web.
webservices.add=Adiciona o subsistema dos servi\u00E7os da web.
webservices.remove=Remove o subsistema dos servi\u00E7os da web.
webservices.endpoint=Ponto de extremidade do Webservice. 
webservices.endpoint.name=\ O nome do ponto de extremidade do webservice.
webservices.endpoint.context=O contexto do ponto de extremidade do webservice.
webservices.endpoint.class=A classe do ponto de extremidade do webservice.
webservices.endpoint.type=Tipo do ponto de extremidade do webservice.
webservices.endpoint.wsdl=O URL do WSDL do ponto de extremidade do webservice.
webservices.endpoint.add=Adiciona o ponto de extremidade do webservice.
webservices.endpoint.remove=Remove o ponto de extremidade do webservice.
webservices.modify-wsdl-address=Se \u00E9 que o endere\u00E7o soap pode ser modificado.
webservices.wsdl-host=O WSDL, que \u00E9 requerido no artefato da implanta\u00E7\u00E3o para um ponto de extremidade, possui um elemento <soap\:address> que aponta \u00E0 localiza\u00E7\u00E3o do ponto de extremidade. O JBoss suporta a regrava\u00E7\u00E3o do endere\u00E7o SOAP. Caso o conte\u00FAdo do <soap\:address> for um URL v\u00E1lido, o JBoss ir\u00E1 regrav\u00E1-lo, a n\u00E3o ser que o 'modify-wsdl-address' seja verdadeiro. Caso o conte\u00FAdo do <soap\:address> n\u00E3o seja um URL v\u00E1lido, o JBossWS ir\u00E1 regrav\u00E1-lo usando os valores de atributo gerados abaixo. Caso o 'wsdl-host' esteja configurado para 'jbossws.undefined.host', o JBossWS usa o host dos solicitadores na regrava\u00E7\u00E3o do <soap\:address>
webservices.wsdl-port=A porta sem seguran\u00E7a que ser\u00E1 usada para regrava\u00E7\u00E3o do endere\u00E7o SOAP. Caso ausente, a porta ser\u00E1 identificada pelo enfileiramento da lista dos conectores instalados.
webservices.wsdl-secure-port=A porta de seguran\u00E7a que ser\u00E1 usada para regrava\u00E7\u00E3o do endere\u00E7o SOAP. Caso ausente, a porta ser\u00E1 identificada pelo enfileiramento da lista dos conectores instalados.
webservices.deployment=Os recursos do per\u00EDodo de rodagem expostos pelos componentes do servi\u00E7o da web na implanta\u00E7\u00E3o.
webservices.deployment.endpoint=Ponto de extremidade WS
webservices.deployment.endpoint.average-processing-time=O per\u00EDodo m\u00E9dio de processamento do ponto de extremidade.
webservices.deployment.endpoint.min-processing-time=O per\u00EDodo m\u00EDnimo de processamento do ponto de extremidade.
webservices.deployment.endpoint.max-processing-time=O per\u00EDodo m\u00E1ximo de processamento do ponto de extremidade.
webservices.deployment.endpoint.total-processing-time=O per\u00EDodo total de processamento do ponto de extremidade.
webservices.deployment.endpoint.request-count=A contagem das solicita\u00E7\u00F5es do ponto de extremidade processado.
webservices.deployment.endpoint.response-count=A contagem de respostas do ponto de extremidade gerado.
webservices.deployment.endpoint.fault-count=A contagem de falhas do ponto de extremidade gerado.
webservices.endpoint-config=A configura\u00E7\u00E3o do ponto de extremidade do webservice
webservices.endpoint-config.add=Adiciona a configura\u00E7\u00E3o do ponto de extremidade
webservices.endpoint-config.remove=Remove a configura\u00E7\u00E3o do ponto de extremidade
webservices.endpoint-config.pre-handler-chain=Corrente pr\u00E9 manuseadora
webservices.endpoint-config.post-handler-chain=Corrente p\u00F3s-manuseadora
webservices.endpoint-config.property=Propriedade da configura\u00E7\u00E3o
webservices.pre-handler-chain=A corrente PR\u00C9 manuseadora da configura\u00E7\u00E3o do ponto de extremidade
webservices.pre-handler-chain.add=Adiciona a corrente PR\u00C9 manuseadora da configura\u00E7\u00E3o do Ponto de Extremidade
webservices.pre-handler-chain.remove=Remove a corrente PR\u00C9 manuseadora da configura\u00E7\u00E3o do Ponto de Extremidade
webservices.pre-handler-chain.handler=Manuseador
webservices.post-handler-chain=A corrente P\u00D3S-manuseadora da configura\u00E7\u00E3o do ponto de extremidade
webservices.post-handler-chain.add=A corrente P\u00D3S-manuseadora da configura\u00E7\u00E3o do ponto de extremidade
webservices.post-handler-chain.remove=Remove a corrente P\u00D3S-manuseadora da configura\u00E7\u00E3o do Ponto de Extremidade
webservices.post-handler-chain.handler=Manuseador
webservices.property=A propriedade da configura\u00E7\u00E3o do ponto de extremidade
webservices.property.add=Adiciona a propriedade da configura\u00E7\u00E3o do ponto de extremidade
webservices.property.remove=Remove a propriedade da configura\u00E7\u00E3o do ponto de extremidade
webservices.property.value=Valor da propriedade de configura\u00E7\u00E3o do ponto de extremidade
webservices.client-config=Configura\u00E7\u00E3o do cliente webservice
webservices.client-config.add=Adiciona a configura\u00E7\u00E3o do cliente
webservices.client-config.remove=Remove a configura\u00E7\u00E3o do cliente
webservices.pre-handler-chain.chain=A corrente PR\u00C9 manuseadora da configura\u00E7\u00E3o do cliente
webservices.client-config.pre-handler-chain=A corrente PR\u00C9 manuseadora da configura\u00E7\u00E3o do cliente
webservices.client-config.post-handler-chain=A corrente P\u00D3S-manuseadora da configura\u00E7\u00E3o do cliente
webservices.client-config.property=A propriedade de configura\u00E7\u00E3o do cliente
webservices.pre-handler-chain.protocol-bindings=Binding do protocolo
webservices.post-handler-chain.protocol-bindings=Binding do protocolo
webservices.handler=Manuseador do ponto de extremidade
webservices.handler.add=Adiciona o manuseador do ponto de extremidade
webservices.handler.remove=Remove o manuseador do Ponto de Extremidade
webservices.handler.name=O nome do manuseador
webservices.handler.class=A classe do manuseador
