host=El nodo ra\u00EDz del modelo de administraci\u00F3n a nivel de host.
host.name=El nombre a utilizar para este controlador host del host. Debe ser \u00FAnico atrav\u00E9s del dominio. Si no se establece entonces por defecto es el valor del tiempo de ejecuci\u00F3n de InetAddress.getLocalHost().getHostName().
host.release-version=La versi\u00F3n del lanzamiento del servidor de aplicaciones de JBoss en que est\u00E1 ejecutando este controlador de host.
host.release-codename=El nombre del c\u00F3digo del lanzamiento del servidor de aplicaciones de JBoss en que est\u00E1 ejecutando este controlador de host.
host.product-name=El nombre del producto basado en JBoss AS que este controlador de host est\u00E1 ejecutando.
host.product-version=La versi\u00F3n del producto basado en JBoss AS que este controlador de host est\u00E1 ejecutando.
host.management-major-version=La versi\u00F3n importante de la interfaz de administraci\u00F3n de JBoss AS que este controlador de host proporciona.
host.management-minor-version=La versi\u00F3n menor de la interfaz de administraci\u00F3n de JBoss AS que este controlador de host proporciona.
host.running-mode=El modo actual de ejecuci\u00F3n del controlador host. Puede ser NORMAL (operaciones normales) o ADMIN_ONLY.  Un servidor ADMIN_ONLY iniciar\u00E1 las interfaces de administraci\u00F3n configuradas y acepta las peticiones de administraci\u00F3n, pero no iniciar\u00E1 los servidores o si este contralador host es el maestro para el dominio, acepta conexiones entrantes de los controladores host esclavos.
host.management=Configuraci\u00F3n del sistema de administraci\u00F3n del host.
host.management.interface=Interfaz en la cual se debe abrir el socket del host para la comunicaci\u00F3n de administraci\u00F3n intra-dominio.
host.directory-grouping=Describe la manera en que se deben organizar los directorios escribibles para los servidores administrados por este controlador host. El valor predeterminado, 'by-server', indica que los directorios escribibles de cada servidor se deben agrupar bajo el nombre del servidor en el directorio de dominios/servidores. La alternativa, 'by-type' indica que los directorios escribibles del servidor se deben agrupar con base en su "tipo" (es decir, "data", "log", "tmp") con los directorios de un tipo dado para todos los servidores que aparecen en el directorio a nivel del dominio para ese tipo, por ejemplo, dominio/datos/servidores/nombre-servidor.
host.management.port=Puerto en el cual se debe abrir el socket del host para la comunicaci\u00F3n de administraci\u00F3n intra-dominio.
host.domain-controller=Configuraci\u00F3n de la manera en que el host debe interactuar con el controlador de dominio
host.domain-controller.local=Configuraci\u00F3n de un controlador de dominio local
host.domain-controller.local.add=Configura el host para que act\u00FAe como el controlador del dominio
host.domain-controller.remote=Configuraci\u00F3n de la conexi\u00F3n del controlador de dominio remoto
host.domain-controller.remote.add=Agrega una configuraci\u00F3n de la conexi\u00F3n del controlador de dominio remoto
host.domain-controller.remote.host=La direcci\u00F3n utilizada para la conexi\u00F3n del controlador de dominio
host.domain-controller.remote.port=El puerto utilizado para la conexi\u00F3n del controlador de dominio
host.extension=Una lista de m\u00F3dulos de extensi\u00F3n.
host.path=Una lista de rutas del sistema de archivos nombrado.
host.interface=Una lista de interfaces de red nombradas especificadas completamente disponibles para utilizarlas en el host.
host.jvm=Una lista de configuraciones de la m\u00E1quina virtual Java que se pueden aplicar a los servidores en el host. Por hacer\: hijos
host.system-properties=Una lista de propiedades del sistema para establecer en todos los servidores en el host.
host.system-property=Una propiedad del sistema para establecer en todos los servidores en el host.
host.core-services=Servicios centrales proporcionados por el controlador host del host.
host.server-config=Configuraciones a nivel del host para los servidores que pueden ejecutar en este  host.
host.server=Servidores ejecutando actualmente en el host
host.shutdown=Apaga el host y sus servidores
host.shutdown.restart=Si es verdadero entonces una vez se apague el controlador host ser\u00E1 re-iniciado una vez m\u00E1s
host.start-server=Iniciar un servidor.
host.start-server.server=El nombre del servidor. 
host.start-server.reply=El estatus del servidor despu\u00E9s de la ejecuci\u00F3n de esta operaci\u00F3n.
host.state=El estado actual del controlador host; ya sea STARTING, RUNNING o RESTART_REQUIRED
host.restart-server=Reiniciar un servidor ejecutando actualmente.
host.restart-server.server=El nombre del servidor. 
host.restart-server.reply=El estatus del servidor despu\u00E9s de la ejecuci\u00F3n de esta operaci\u00F3n.
host.stop-server=Detener un servidor ejecutando actualmente.
host.stop-server.server=El nombre del servidor. 
host.stop-server.reply=El estatus del servidor despu\u00E9s de la ejecuci\u00F3n de esta operaci\u00F3n.
host.master=Si este host es es el host maestro para el dominio; es decir, si este proceso act\u00FAa como el controlador de dominio.
host.resolve-expression-on-domain.expression=La expresi\u00F3n a resolver.
host.resolve-expression-on-domain.reply=La expresi\u00F3n resuelta o la cadena forman el valor de entrada original si no represent an expression.
host.env=El entorno del controlador host.
host.env.modules-dir=El directorio en donde se encuentran los m\u00F3dulos.
host.env.domain-base-dir=El directorio base del dominio del servidor de aplicaciones JBoss.
host.env.domain-config-dir=El directorio de configuraci\u00F3n del dominio.
host.env.domain-data-dir=El directorio de datos.
host.env.domain-log-dir=El directorio a donde se env\u00EDan los archivos de registro.
host.env.domain-temp-dir=El directorio temporal.
host.env.default-jvm=La mvj predeterminada. 
server.add=Agregar una nueva configuraci\u00F3n del servidor.
server.remove=Borrar una configuraci\u00F3n existente del servidor.
server.name=El nombre del servidor. 
server.priority=La prioridad del servidor.
server.system-property=Una propiedad del sistema para establecer en este servidor.
core.management.native-interface=Configuraci\u00F3n de la interfaz de administraci\u00F3n nativa del servidor
core.management.native-interface.add=Agrega la interfaz de administraci\u00F3n nativa del servidor
core.management.native-interface.remove=Borra la interfaz de administraci\u00F3n nativa del servidor
core.management.native-interface.security-realm=Los l\u00EDmites de seguridad a utilizar para la interfaz de administraci\u00F3n nativa.
core.management.http-interface=Configuraci\u00F3n de la interfaz de administraci\u00F3n HTTP del servidor
core.management.http-interface.add=Agrega la configuraci\u00F3n de la interfaz de administraci\u00F3n HTTP del servidor
core.management.http-interface.remove=Agrega la configuraci\u00F3n de la interfaz de administraci\u00F3n HTTP del servidor
core.management.http-interface.console-enabled=Bandera que indica que la consola de administraci\u00F3n est\u00E1 habilitada
