host=O n\u00F3 da raiz do modelo de gerenciamento host-level.
host.name=O nome para uso deste controlador de host. Isto deve ser \u00FAnico no dom\u00EDnio. Caso n\u00E3o tenha sido determinado, o padr\u00E3o ser\u00E1 o valor do per\u00EDodo de rodagem do InetAddress.getLocalHost().getHostName().
host.release-version=A vers\u00E3o da libera\u00E7\u00E3o do Servidor do Aplicativo JBoss que esse controlador de host est\u00E1 rodando.
host.release-codename=O codename da libera\u00E7\u00E3o do Servidor do Aplicativo JBoss esse controlador do host est\u00E1 rodando.
host.product-name=O nome do produto baseado no JBoss AS que est\u00E1 sendo rodado pelo controlado do host.
host.product-version=A vers\u00E3o da libera\u00E7\u00E3o do produto baseado no JBoss AS que est\u00E1 sendo rodado pero esse controlador do host.
host.management-major-version=A vers\u00E3o principal da interface do gerenciamento do JBoss AS que que \u00E9 fornecida pelo controlador do host.
host.management-minor-version=A menor vers\u00E3o da interface de gerenciamento do JBoss AS que \u00E9 fornecida por esse controlador do host.
host.running-mode=O modo de rodagem atual do Controlador do Host. Tanto NORMAL (opera\u00E7\u00F5es normais) ou ADMIN_ONLY. O servidor ADMIN_ONLY iniciar\u00E1 quaisquer interfaces de gerenciamento e aceitar\u00E1 solicita\u00E7\u00F5es de gerenciamento, mas n\u00E3o iniciar\u00E1 servidores. Caso esse controlador de host for o mestre para o dom\u00EDnio, isto aceitar\u00E1 conex\u00F5es de entrada dos controladores do host subordinado.
host.management=A configura\u00E7\u00E3o do sistema de gerenciamento do host.
host.management.interface=A interface pela qual o soquete do host para a comunica\u00E7\u00E3o do gerenciamento deve ser aberta.
host.directory-grouping=Descreve como os diret\u00F3rios de grava\u00E7\u00E3o para servidores gerenci\u00E1veis por este controlador do host devem ser organizados. O valor padr\u00E3o, 'por servidor', indica cada  um dos diret\u00F3rios de grava\u00E7\u00E3o do servidor deve ser agrupado sob o nome do servidor no diret\u00F3rio domain/servers. Outra op\u00E7\u00E3o, 'por-tipo' indica que cada um dos diret\u00F3rios de grava\u00E7\u00E3o do servidor deve ser agrupado baseando-se no pr\u00F3prio "tipo" (ex.\: "dados", "regostro em log", "tmp") com diret\u00F3rios de um tipo gerado para todos os servidores no diret\u00F3rio do n\u00EDvel do dom\u00EDnio para aquele tipo, ex.\: domain/data/servers/server-name.
host.management.port=A porta pela qual o soquete do host para comunica\u00E7\u00E3o do gerenciamento intra-domain deve ser aberta.
host.domain-controller=A configura\u00E7\u00E3o de como o host deve interagir com o Controlador de Dom\u00EDnio
host.domain-controller.local=Configura o Controlador de Dom\u00EDnio local
host.domain-controller.local.add=Configura o host para agir como o Controlador de Dom\u00EDnio
host.domain-controller.remote=Configura\u00E7\u00E3o da conex\u00E3o do Controlador de Dom\u00EDnio Remoto
host.domain-controller.remote.add=Adiciona a configura\u00E7\u00E3o da conex\u00E3o do Controlador de Dom\u00EDnio
host.domain-controller.remote.host=O endere\u00E7o usado para a conex\u00E3o do Controlador de Dom\u00EDnio
host.domain-controller.remote.port=A porta usada para a conex\u00E3o do Controlador de Dom\u00EDnio
host.extension=A lista de m\u00F3dulos de extens\u00E3o.
host.path=A lista de caminhos de filesystem nomeados.
host.interface=A lista das interface de rede nomeadas inteiramente especificadas, dispon\u00EDveis para uso no host.
host.jvm=A lista das configura\u00E7\u00F5es da M\u00E1quina Virtual do Java que pode ser aplicada nos servidores do host. Filhos TODO
host.system-properties=A lista das propriedades de sistema para configurar em todos os servidores no host.
host.system-property=A propriedade de sistema para configurar em todos os servidores no host.
host.core-services=Os servi\u00E7os principais fornecidos pelo controlador do host.
host.server-config=As configura\u00E7\u00F5es host-level para os servidores que podem rodar no host.
host.server=Os servidores rodando no host.
host.shutdown=Encerra o host e seus servidores
host.shutdown.restart=Caso verdadeiro, uma vez encerrado o controlador de host ser\u00E1 reiniciado novamente
host.start-server=Inicia o servidor.
host.start-server.server=O nome do servidor.
host.start-server.reply=O status do servidor seguindo a execu\u00E7\u00E3o dessa opera\u00E7\u00E3o.
host.state=O estado atual do controlador do host; tanto STARTING, RUNNING ou RESTART_REQUIRED
host.restart-server=Reinicia o servidor rodando no momento.
host.restart-server.server=O nome do servidor.
host.restart-server.reply=O status do servidor seguindo a execu\u00E7\u00E3o dessa opera\u00E7\u00E3o.
host.stop-server=Encerra o servidor rodando no momento.
host.stop-server.server=O nome do servidor.
host.stop-server.reply=O status do servidor seguindo a execu\u00E7\u00E3o dessa opera\u00E7\u00E3o.
host.master=Se \u00E9 que esse host \u00E9 o host mestre para o dom\u00EDnio; ex.\: se \u00E9 que esse processo est\u00E1 agindo como o Controlador do Dom\u00EDnio.
host.resolve-expression-on-domain=A opera\u00E7\u00E3o que aceita uma express\u00E3o como entrada (ou uma sequ\u00EAncia que pode ser analisada numa express\u00E3o) e a resolve em refer\u00EAncia \u00E0s propriedades de sistema e var\u00E1veis de ambiente em todos os servidores gerenci\u00E1veis por esse controlador do host.
host.resolve-expression-on-domain.expression=A express\u00E3o a ser resolvida.
host.resolve-expression-on-domain.reply=A express\u00E3o resolvida, ou o formul\u00E1rio da sequ\u00EAncia do valor de entrada original, caso ele n\u00E3o represente uma express\u00E3o. 
host.env=O ambiente do controlador do host.
host.env.process-controller-address=O endere\u00E7o do controlador do processo esse controlador do host est\u00E1 conectado.
host.env.process-controller-port=A porta do controlador do processo que esse controlador de host est\u00E1 conectado.
host.env.host-controller-address=O endere\u00E7o que esse controlador de host usa para ouvir a comunica\u00E7\u00E3o dos servidores.
host.env.host-controller-port=A porta que esse controlador de host usa para ouvir a comunica\u00E7\u00E3o dos servidores.
host.env.home-dir=O diret\u00F3rio principal desse controlador do host do Servidor do Aplicativo JBoss.
host.env.modules-dir=O diret\u00F3rio onde os modelos s\u00E3o encontrados.
host.env.domain-base-dir=O diret\u00F3rio base do dom\u00EDnio do Servidor do Aplicativo JBoss.
host.env.domain-config-dir=O diret\u00F3rio de configura\u00E7\u00E3o do dom\u00EDnio.
host.env.host-config-file=O arquivo de configura\u00E7\u00E3o para esse host.
host.env.domain-config-file=O arquivo de configura\u00E7\u00E3o para esse dom\u00EDnio.
host.env.domain-content-dir=O diret\u00F3rio onde o conte\u00FAdo do usu\u00E1rio (ex.\: implanta\u00E7\u00F5es) que \u00E9 gerenciado por esse servidor \u00E9 armazenado.
host.env.domain-data-dir=O diret\u00F3rio de dados.
host.env.domain-log-dir=O diret\u00F3rio onde os arquivos de registro de log s\u00E3o enviados.
host.env.domain-servers-dir=O diret\u00F3rio onde esses servidores iniciados do host armazenam os pr\u00F3prios dados do per\u00EDodo de rodagem.
host.env.domain-temp-dir=O diret\u00F3rio tempor\u00E1rio.
host.env.default-jvm=O jvm padr\u00E3o.
host.env.is-restart=Se \u00E9 que o host foi reiniciado pelo controlador do processo.
host.env.backup-domain-files=Se \u00E9 que o controlador do host deve retornar ao conte\u00FAdo do dom\u00EDnio a partir do controlador de dom\u00EDnio mestre. Ele pode ser apenas verdadeiro nos controladores do host subordinado.
host.env.use-cached-dc=Se \u00E9 que o controlador deve usar o conte\u00FAdo do dom\u00EDnio com cache (conforme obtido pela inicia\u00E7\u00E3o com --backup) na inicializa\u00E7\u00E3o do host. Pode ser apenas verdadeiro nos controladores do host subordinados.
host.env.initial-running-mode=O mode de rodagem atual do host. Tanto LIVE (opera\u00E7\u00F5es normais) ou ADMIN_ONLY. Um servidor ADMIN_ONLY iniciar\u00E1 quaisquer interfaces de gerenciamento configuradas e aceitar\u00E1 solicita\u00E7\u00F5es gerenciadas, mas n\u00E3o iniciar\u00E3o servi\u00E7os usados para o manuseamento das solicita\u00E7\u00F5es do usu\u00E1rio final.
host.env.qualified-host-name=O nome do host inteiramente qualificado detectado na inicializa\u00E7\u00E3o.
host.env.host-name=O nome do host local detectado na inicializa\u00E7\u00E3o do servidor.
host.reload=Recarrega o Controlador do Host pela finaliza\u00E7\u00E3o de todos os servi\u00E7os e inicializa\u00E7\u00E3o dos mesmos novamente. O pr\u00F3prio JVM n\u00E3o \u00E9 reinicializado. Perceba que isto levar\u00E1 ao processo completo de reinicializa\u00E7\u00E3o para quaisquer processos gerenciados pelo controlador do host.
host.reload.admin-only=Se \u00E9 que o Controlador do Host deve iniciar a rodagem em modo ADMIN_ONLY quando for reiniciado. O Controlador do Host ADMIN_ONLY  iniciar\u00E1 quaisquer interfaces de gerenciamento e aceitar\u00E1 as solicita\u00E7\u00F5es de gerenciamento. No entanto, ele n\u00E3o iniciar\u00E1 os servidores ou, caso o esse controlador de host for o mestre para o dom\u00EDnio, aceitar\u00E1 as conex\u00F5es de entrada dos controladores do host subordinados.
host.reload.restart-servers=Caso verdadeiro os servidores ser\u00E3o recarregados e, caso falso, os servidores ser\u00E3o deixados rodando e reconectar\u00E3o ao Controlador do Host quando novamente iniciados.
server=Define um servidor no modelo do gerenciamento do host-level.
server.add=Adiciona uma nova configura\u00E7\u00E3o ao servidor.
server.remove=Remove uma configura\u00E7\u00E3o de servidor existente.
server.cpu-affinity=A afinidade do cpu do servidor.
server.interface=A lista das interfaces de rede nomeadas e inteiramente especificadas dispon\u00EDveis para uso no servidor. Filhos TODO
server.jvm=O jvm nomeado. Filhos TODO
server.name=O nome do servidor.
server.group=O nome de um grupo no servidor a partir do modelo do dom\u00EDnio.
server.path=A lista dos caminhos filesystem nomeados.
server.priority=A prioridade do servidor.
server.socket-binding-group=O grupo binding do soquete que esse servidor pertence.
server.socket-binding-port-offset=O deslocamento a ser adicionado aos valores da porta gerados pelo grupo binding do soquete para esse servidor.
server.auto-start=Se \u00E9 que esse servidor deve ser iniciado quando o Controlador do Host for iniciado. 
server.system-properties=A lista de propriedades do sistema a ser configurada nesse servidor.
server.system-property=A propriedade do sistema a ser configurada nesse servidor.
core.management.native-interface=A configura\u00E7\u00E3o da interface do gerenciamento nativo do servidor
core.management.native-interface.add=Adiciona a interface do gerenciamento nativo do servidor
core.management.native-interface.remove=Remove a interface do gerenciamento nativo do servidor
core.management.native-interface.interface=Preterido -- use socket-binding'. A interface da rede pela qual o soquete do servidor para comunica\u00E7\u00E3o do gerenciamento nativo deve ser aberta. Deve ser 'indefinida' caso o atributo 'socket-binding' for configurado.
core.management.native-interface.port=Preterido -- use 'socket-binding'. A porta pela qual o soquete do servidor para comunica\u00E7\u00E3o de gerenciamento nativo deve ser aberta. Deve ser 'indefinida' caso o atributo 'socket-binding' esteja configurado.
core.management.native-interface.security-realm=O realm de seguran\u00E7a para uso da interface de gerenciamento nativa.
core.management.http-interface=Configura\u00E7\u00E3o da interface de gerenciamento HTTP odo servidor
core.management.http-interface.add=Adiciona a configura\u00E7\u00E3o da interface de gerenciamento HTTP do servidor
core.management.http-interface.remove=Adiciona a configura\u00E7\u00E3o da interface do gerenciamento HTTP do servidor
core.management.http-interface.interface=Preterido -- use 'socket-binding'. A interface de rede pela qual o soquete do servidor para a comunica\u00E7\u00E3o de gerenciamento HTTP deve ser aberta. Deve ser 'indefinida' caso o atributo 'socket-binding' ou 'secure-socket-binding' esteja configurado.
core.management.http-interface.port=Preterido -- use 'socket-binding'. A porta pela qual o soquete do servidor para comunica\u00E7\u00E3o do gerenciamento HTTP deve ser aberta. Deve ser 'indefinida' caso o atributo'socket-binding' esteja configurado. 
core.management.http-interface.secure-port=Preterido -- use 'secure-socket-binding'. A porta pela qual o soquete do servidor para comunica\u00E7\u00E3o do gerenciamento deve ser aberta. Deve ser 'indefinido' caso o atributo 'socket-binding' ou 'secure-socket-binding' tenha sido configurado. 
core.management.http-interface.security-realm=O realm de seguran\u00E7a para uso da interface de gerenciamento HTTP.
core.management.http-interface.console-enabled=Aviso indicando que o console admin est\u00E1 ativado
ignored-resources=Nomes dos recursos filho diretos das solicita\u00E7\u00F5es do recurso da raiz de dom\u00EDnio pela qual esse Controlador do Host deve ignorar. Apenas relevante no Controlador do Host subordinado. A configura\u00E7\u00E3o de tais "recursos ignorados" pode permitir um Controlador de Host de uma vers\u00E3o anterior operar com um subordinado a Controlador de Host mestre rodando numa libera\u00E7\u00E3o mais recente, permitindo o subordinado ignorar por\u00E7\u00F5es de configura\u00E7\u00E3o que a pr\u00F3pria vers\u00E3o de software n\u00E3o pode compreender. Essa estrat\u00E9gia pode apenas ser bem sucedida caso os servidores gerenciados pelo Controlador do Host subordinado n\u00E3o referenciar qualquer configura\u00E7\u00E3o ignorada.
ignored-resource-type=Identifica o tipo de recurso (ex.\: 'perfil' ou 'socket-binding-group') em que certas inst\u00E2ncias devem ser ignoradas.
ignored-resource-type.add=Adiciona o tipo de recurso de certas inst\u00E2ncias em que devem ser ignoradas.
ignored-resource-type.remove=Remove o tipo de recurso a partir do conjunto pelo qual certas inst\u00E2ncias devem ser ignoradas.
ignored-resource-type.names=A lista de nomes de inst\u00E2ncias espec\u00EDficas desse tipo de recurso que devem ser ignoradas. A inclus\u00E3o de '*' na lista significa que todos os recursos do tipo devem ser ignorados.
ignored-resource-type.wildcard=O booliano que caso 'verdadeiro' indica que todos os recursos do tipo devem ser ignorados.
