host=Le n\u0153ud root du mod\u00E8le de gestion niveau h\u00F4te
host.name=Le nom \u00E0 utiliser pour ce contr\u00F4leur h\u00F4te d'h\u00F4te. Doit \u00EAtre unique dans le domaine. Si non d\u00E9fini, la valeur par d\u00E9faut correspondra \u00E0 InetAddress.getLocalHost().getHostName().
host.release-version=Le version de JBoss Application Server sur laquelle le contr\u00F4leur h\u00F4te ex\u00E9cute.
host.release-codename=Le code nom de la version JBoss Application Server sur laquelle ce contr\u00F4leur h\u00F4te ex\u00E9cute.
host.product-name=Le nom du produit bas\u00E9 JBoss AS qui est ex\u00E9cut\u00E9 par ce contr\u00F4leur h\u00F4te.
host.product-version=La version du produit bas\u00E9 JBoss AS qui est ex\u00E9cut\u00E9 par ce contr\u00F4leur h\u00F4te.
host.management-major-version=La version majeure de l'interface de gestion JBoss AS fournie par ce contr\u00F4leur h\u00F4te.
host.management-minor-version=La version mineure de l'interface de gestion JBoss AS fournie par ce contr\u00F4leur h\u00F4te.
host.running-mode=Le mode de fonctionnement actuel du contr\u00F4leur h\u00F4te. NORMAL (fonctionnement normal) ou ADMIN_ONLY. Un serveur ADMIN_ONLY d\u00E9marrera les interfaces de gestion configur\u00E9es et acceptera les demandes de gestion, mais ne fera pas d\u00E9marrer des serveurs ou, si ce contr\u00F4leur h\u00F4te est le ma\u00EEtre du domaine, n'acceptera pas les connexions entrantes de contr\u00F4leurs d'h\u00F4te esclave.
host.management=Configuration du syst\u00E8me de gestion de l'h\u00F4te.
host.management.interface=Interface sur laquelle le socket d'h\u00F4te de communication de gestion intra-domaine doit \u00EAtre ouvert.
host.directory-grouping=D\u00E9crit comment les r\u00E9pertoires accessibles en \u00E9criture pour les serveurs g\u00E9r\u00E9s par ce contr\u00F4leur h\u00F4te devraient \u00EAtre organis\u00E9es. La valeur par d\u00E9faut, 'by-server' (par serveur), indique que tous les annuaires accessibles en \u00E9criture de serveur doivent \u00EAtre regroup\u00E9s sous le nom du serveur dans le r\u00E9pertoire de serveur/domaine. L'alternatif, 'by-type' (par-type) indique que les r\u00E9pertoires accessibles en \u00E9criture de chaque serveur devraient \u00EAtre regroup\u00E9s selon leur 'type' (c'est-\u00E0-dire "data", "log", "tmp") avec les dossiers d'un type donn\u00E9 pour tous les serveurs figurant dans le r\u00E9pertoire de niveau de domaine de ce type, par exemple domain/data/servers/server-name.
host.management.port=Port sur lequel le socket d'h\u00F4te de communication de gestion intra-domaine doit \u00EAtre ouvert.
host.domain-controller=Configuration sur la fa\u00E7on dont l'h\u00F4te doit agir avec le Domain Controller
host.domain-controller.local=Configurer un Domain Controller local
host.domain-controller.local.add=Configure l'h\u00F4te pour qu'il agisse en tant que Domain Controller
host.domain-controller.remote=Configuration de connexion Domain Controller distant
host.domain-controller.remote.add=Ajouter un configuration de connexion Domain Controller distant
host.domain-controller.remote.host=Adresse utilis\u00E9e pour la connexion au Domain Controller
host.domain-controller.remote.port=Le port utilis\u00E9 pour la connexion au Domain Controller
host.extension=Une liste des modules d'extension
host.path=Une liste des chemins de fichiers syst\u00E8me nomm\u00E9s
host.interface=Une liste des interfaces de r\u00E9seau compl\u00E8tements sp\u00E9cifi\u00E9es et disponibles sur l'h\u00F4te.
host.jvm=Une liste de configurations de JVM qui peuvent \u00EAtre appliqu\u00E9es sur les serveurs de l'h\u00F4te. Enfants TODO
host.system-properties=Une liste des propri\u00E9t\u00E9s syst\u00E8me \u00E0 d\u00E9finir sur tous les serveurs de l'h\u00F4te.
host.system-property=Une propri\u00E9t\u00E9 syst\u00E8me \u00E0 d\u00E9finir sur tous les serveurs de l'h\u00F4te.
host.core-services=Services de base fournis par le contr\u00F4leur h\u00F4te de l'h\u00F4te.
host.server-config=Configuration niveau-h\u00F4te pour les serveurs qui peuvent ex\u00E9cuter sur cet h\u00F4te.
host.server=Serveurs actuellement en cours d'ex\u00E9cution sur l'h\u00F4te
host.shutdown=Ferme l'h\u00F4te et ses serveurs
host.shutdown.restart=Si true, une fois ferm\u00E9, le contr\u00F4leur de l'h\u00F4te va d\u00E9marrer \u00E0 nouveau
host.start-server=D\u00E9marrer un serveur \:
host.start-server.server=Le nom du serveur \:
host.start-server.reply=Le statut du serveur suite \u00E0 l'ex\u00E9cution de cette op\u00E9ration.
host.state=L'\u00E9tat actuel du contr\u00F4leur h\u00F4te; soit STARTING, RUNNING ou RESTART_REQUIRED
host.restart-server=D\u00E9marrer \u00E0 nouveau le serveur en cours.
host.restart-server.server=Le nom du serveur \:
host.restart-server.reply=Le statut du serveur suite \u00E0 l'ex\u00E9cution de cette op\u00E9ration.
host.stop-server=Stopper le serveur en cours.
host.stop-server.server=Le nom du serveur \:
host.stop-server.reply=Le statut du serveur suite \u00E0 l'ex\u00E9cution de cette op\u00E9ration.
host.master=Si cet h\u00F4te est un h\u00F4te ma\u00EEtre pour le domaine; c-a-d si ce process agit en tant que contr\u00F4leur de domaine.
host.resolve-expression-on-domain=Op\u00E9ration qui accepte une expression comme entr\u00E9e ( ou un string qui puisse \u00EAtre analys\u00E9 en expression) et la r\u00E9soudre en fonction des propri\u00E9t\u00E9s du syst\u00E8me local et des variables d'environnement sur ce contr\u00F4leur d'h\u00F4te.
host.resolve-expression-on-domain.expression=Expression \u00E0 r\u00E9soudre.
host.resolve-expression-on-domain.reply=Expression r\u00E9solue, ou la forme du string de la valeur d'entr\u00E9e d'origine si elle ne repr\u00E9sente pas une expression.
host.env=L'environnement du contr\u00F4leur d'h\u00F4te.
host.env.process-controller-address=L'adresse du contr\u00F4leur du processus auquel ce contr\u00F4leur d'h\u00F4te est connect\u00E9.
host.env.process-controller-port=Le port du contr\u00F4leur de processus auquel ce contr\u00F4leur d'h\u00F4te est connect\u00E9.
host.env.host-controller-address=L'adresse que ce contr\u00F4leur d'h\u00F4te utilise pour \u00E9couter les communications du serveur.
host.env.host-controller-port=Le port que ce contr\u00F4leur d'h\u00F4te utilise pour \u00E9couter les communications des serveurs.
host.env.modules-dir=Le r\u00E9pertoire o\u00F9 se trouvent les modules
host.env.domain-base-dir=Le r\u00E9pertoire de base du domaine JBoss Application Server.
host.env.domain-config-dir=Le r\u00E9pertoire de configuration du domaine.
host.env.host-config-file=Le fichier de configuration pour cet h\u00F4te.
host.env.domain-config-file=Le fichier de configuration pour ce domaine.
host.env.domain-content-dir=Le r\u00E9pertoire o\u00F9 le contenu utilisateur (comme les d\u00E9ploiements) g\u00E9r\u00E9 par le serveur est stock\u00E9.
host.env.domain-data-dir=Le r\u00E9pertoire de donn\u00E9es.
host.env.domain-log-dir=Le r\u00E9pertoire o\u00F9 les fichier log sont envoy\u00E9s.
host.env.domain-servers-dir=Le r\u00E9pertoire o\u00F9 les serveurs d\u00E9marr\u00E9s de l'h\u00F4te stockent leurs donn\u00E9es de runtime.
host.env.domain-temp-dir=Le r\u00E9pertoire temporaire.
host.env.default-jvm=Le jvm par d\u00E9faut.
host.env.is-restart=Si l'h\u00F4te a \u00E9t\u00E9 d\u00E9marr\u00E9 \u00E0 nouveau par le contr\u00F4leur de processus.
host.env.backup-domain-files=Si ce contr\u00F4leur d'h\u00F4te doit sauvegarder le contenu du domaine \u00E0 partir du contr\u00F4leur de domaine ma\u00EEtre. Possible uniquement sur les contr\u00F4leurs d'h\u00F4tes d'esclaves.
host.env.use-cached-dc=Si ce contr\u00F4leur d'h\u00F4te doit utiliser un contenu de domaine mis en cache (comme obtenu par --backup) quand on d\u00E9marre l'h\u00F4te. Possible uniquement sur les contr\u00F4leurs d'h\u00F4tes d'esclaves.
host.env.initial-running-mode=Le mode de fonctionnement actuel de l'h\u00F4te. LIVE (op\u00E9rations normales) ou ADMIN_ONLY. Un serveur ADMIN_ONLY d\u00E9marrera les interfaces de gestion configur\u00E9es et acceptera les demandes de gestion, mais ne fera pas d\u00E9marrer des serveurs utilis\u00E9s pour la gestion des demandes des utilisateurs finaux.
host.env.qualified-host-name=Nom d'h\u00F4te complet d\u00E9tect\u00E9 au d\u00E9marrage.
host.env.host-name=Le nom de l'h\u00F4te local d\u00E9tect\u00E9 au d\u00E9marrage du serveur.
host.reload=Recharge le contr\u00F4leur h\u00F4te par la fermeture de tous ses services et son red\u00E9marrage. La JVM elle-m\u00EAme n'est pas red\u00E9marr\u00E9e. Notez toutefois que cela entra\u00EEnera le red\u00E9marrage d'un processus complet pour tous les processus serveur g\u00E9r\u00E9s par cette contr\u00F4leur d'h\u00F4te.
host.reload.admin-only=Si le contr\u00F4leur h\u00F4te doit d\u00E9marrer en mode d'ex\u00E9cution ADMIN_ONLY and il d\u00E9marre \u00E0 nouveau. Un serveur ADMIN_ONLY d\u00E9marrera les interfaces de gestion configur\u00E9es et acceptera les demandes de gestion, mais ne fera pas d\u00E9marrer des serveurs ou, si ce contr\u00F4leur h\u00F4te est le ma\u00EEtre du domaine, XXXXX (or, or nor) n'acceptera pas les connexions entrantes de contr\u00F4leurs d'h\u00F4te esclave.
host.reload.restart-servers=Si true les serveurs seront charg\u00E9s \u00E0 nouveau, et si false les serveurs continueront d'ex\u00E9cuter et se connecteront \u00E0 nouveau au contr\u00F4leur h\u00F4te au prochain d\u00E9marrage.
server=D\u00E9finit un serveur dans le mod\u00E8le de gestion niveau h\u00F4te.
server.add=Ajouter une nouvelle configuration de serveur.
server.remove=Supprimer une configuration de serveur existante.
server.cpu-affinity=L'affinit\u00E9 du cpu du serveur.
server.interface=Une liste d'interfaces de r\u00E9seaux nomm\u00E9s et sp\u00E9cifi\u00E9s \u00E0 la disposition de l'utilisateur sur le serveur. Enfants TODO
server.jvm=Le jvm nomm\u00E9. Enfants TOD
server.name=Le nom du serveur \:
server.group=Le nom d'un groupe de serveurs d'un mod\u00E8le de domaine
server.path=Une liste des chemins de fichiers syst\u00E8me nomm\u00E9s
server.priority=La priorit\u00E9 du serveur.
server.socket-binding-group=Le groupe de liaisons de sockets auquel ce serveur appartient.
server.socket-binding-port-offset=La valeur de compensation par d\u00E9faut \u00E0 ajouter aux valeurs de ports donn\u00E9es par le groupe de liaisons de sockets pour ce serveur.
server.auto-start=Si ce serveur doit ou non \u00EAtre d\u00E9marr\u00E9 quand le contr\u00F4leur d'h\u00F4te d\u00E9marre.
server.system-properties=Une liste de propri\u00E9t\u00E9s syst\u00E8me \u00E0 d\u00E9finir sur ce serveur.
server.system-property=Une propri\u00E9t\u00E9 syst\u00E8me \u00E0 d\u00E9finir sur ce serveur.
core.management.native-interface=Configuration de l'interface de gestion native du serveur.
core.management.native-interface.add=Ajoute l'interface de gestion native du serveur.
core.management.native-interface.remove=Supprime l'interface de gestion native du serveur.
core.management.native-interface.interface=Obsol\u00E8te -- utiliser 'socket-binding'. Interface de r\u00E9seau sur laquelle le socket de communication native de gestion du serveur devra \u00EAtre ouvert. Doit \u00EAtre 'undefined' si l'attribut 'socket-binding' est d\u00E9fini.
core.management.native-interface.port=Obsol\u00E8te -- utiliser 'socket-binding'. Port sur lequel le socket de communication native de gestion du serveur devra \u00EAtre ouvert. Doit \u00EAtre 'undefined' si l'attribut 'socket-binding' est d\u00E9fini.
core.management.native-interface.security-realm=Le domaine de s\u00E9curit\u00E9 \u00E0 utiliser pour l'interface de gestion native.
core.management.http-interface=Configuration de l'interface de gestion HTTP du serveur.
core.management.http-interface.add=Ajoute la configuration de l'interface de gestion HTTP du serveur.
core.management.http-interface.remove=Ajoute la configuration de l'interface de gestion HTTP du serveur.
core.management.http-interface.interface=Obsol\u00E8te -- utiliser 'socket-binding'. Interface de r\u00E9seau sur laquelle le socket de communication de gestion HTTP du serveur devra \u00EAtre ouvert. Doit \u00EAtre 'undefined' si l'attribut 'socket-binding' est d\u00E9fini.
core.management.http-interface.port=Obsol\u00E8te -- utiliser 'socket-binding'. Port sur lequel le socket de communication de gestion HTTP du serveur devra \u00EAtre ouvert. Doit \u00EAtre 'undefined' si l'attribut 'socket-binding' est d\u00E9fini.
core.management.http-interface.secure-port=Obsol\u00E8te -- utiliser 'socket-binding'. Port sur lequel le socket de communication de gestion HTTP du serveur devra \u00EAtre ouvert. Doit \u00EAtre 'undefined' si l'attribut 'socket-binding' est d\u00E9fini.
core.management.http-interface.security-realm=Le domaine de s\u00E9curit\u00E9 \u00E0 utiliser pour l'interface de gestion HTTP.
core.management.http-interface.console-enabled=Drapeau qui indique que la console admin est active
