host=\u30DB\u30B9\u30C8\u30EC\u30D9\u30EB\u306E\u7BA1\u7406\u30E2\u30C7\u30EB\u306E root \u30CE\u30FC\u30C9
host.name=\u3053\u306E\u30DB\u30B9\u30C8\u306E\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u306B\u5229\u7528\u3059\u308B\u540D\u524D\u3002\u30C9\u30E1\u30A4\u30F3\u5168\u4F53\u3067\u4E00\u610F\u3067\u306A\u3051\u308C\u3070\u306A\u308A\u307E\u305B\u3093\u3002\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u3001\u30E9\u30F3\u30BF\u30A4\u30E0\u5024\u306FInetAddress.getLocalHost().getHostName() \u306B\u30C7\u30D5\u30A9\u30EB\u30C8\u8A2D\u5B9A\u3055\u308C\u307E\u3059\u3002
host.release-version=\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u304C\u4F5C\u52D5\u3059\u308B JBoss Application Server \u306E\u30D0\u30FC\u30B8\u30E7\u30F3
host.release-codename=\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u304C\u4F5C\u52D5\u3059\u308B JBoss Application Server \u306E\u30B3\u30FC\u30C9\u540D
host.product-name=\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u304C\u4F5C\u52D5\u3059\u308B JBoss AS \u30D9\u30FC\u30B9\u306E\u88FD\u54C1\u540D
host.product-version=\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u304C\u4F5C\u52D5\u3059\u308B JBoss AS \u30D9\u30FC\u30B9\u306E\u88FD\u54C1\u30EA\u30EA\u30FC\u30B9\u30D0\u30FC\u30B8\u30E7\u30F3
host.management-major-version=\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u304C\u63D0\u4F9B\u3059\u308B JBoss AS \u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u306E\u30E1\u30B8\u30E3\u30FC\u30D0\u30FC\u30B8\u30E7\u30F3
host.management-minor-version=\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u304C\u63D0\u4F9B\u3059\u308B JBoss AS \u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u306E\u30DE\u30A4\u30CA\u30FC\u30D0\u30FC\u30B8\u30E7\u30F3
host.running-mode=\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u306E\u73FE\u5728\u306E\u5B9F\u884C\u30E2\u30FC\u30C9\u3002NORMAL (\u901A\u5E38\u306E\u64CD\u4F5C) \u3042\u308B\u3044\u306F ADMIN_ONLY\u3002ADMIN_ONLY \u30B5\u30FC\u30D0\u30FC\u306F\u8A2D\u5B9A\u6E08\u307F\u306E\u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u3092\u8D77\u52D5\u3057\u3001\u7BA1\u7406\u30EA\u30AF\u30A8\u30B9\u30C8\u3092\u53D7\u3051\u4ED8\u3051\u307E\u3059\u304C\u30B5\u30FC\u30D0\u30FC\u306F\u8D77\u52D5\u3057\u307E\u305B\u3093\u3002\u3082\u3057\u304F\u306F\u3053\u306E\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u304C\u30C9\u30E1\u30A4\u30F3\u306E\u30DE\u30B9\u30BF\u30FC\u3067\u3042\u308B\u5834\u5408\u3001\u30B9\u30EC\u30FC\u30D6\u306E\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u304B\u3089\u306E\u53D7\u4FE1\u63A5\u7D9A\u3092\u53D7\u3051\u4ED8\u3051\u307E\u3059\u3002
host.management=\u30DB\u30B9\u30C8\u306E\u7BA1\u7406\u30B7\u30B9\u30C6\u30E0\u8A2D\u5B9A
host.management.interface=\u30A4\u30F3\u30C8\u30E9\u30C9\u30E1\u30A4\u30F3\u7BA1\u7406\u901A\u4FE1\u3067\u30DB\u30B9\u30C8\u306E\u30BD\u30B1\u30C3\u30C8\u3092\u958B\u304F\u3079\u304D\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9
host.directory-grouping=\u3053\u306E\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u304C\u7BA1\u7406\u3059\u308B\u30B5\u30FC\u30D0\u30FC\u5411\u3051\u306E\u66F8\u304D\u8FBC\u307F\u53EF\u80FD\u306A\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u3092\u3069\u306E\u3088\u3046\u306B\u6574\u7406\u3059\u3079\u304D\u304B\u8A18\u8FF0\u3057\u307E\u3059\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u5024 'by-server' \u306F\u3001\u5404\u30B5\u30FC\u30D0\u30FC\u306E\u66F8\u304D\u8FBC\u307F\u53EF\u80FD\u306A\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u3092\u30C9\u30E1\u30A4\u30F3\uFF0F\u30B5\u30FC\u30D0\u30FC\u306E\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u306E\u30B5\u30FC\u30D0\u30FC\u540D\u5225\u306B\u5206\u985E\u3059\u3079\u304D\u3053\u3068\u3092\u793A\u3057\u3066\u3044\u307E\u3059\u3002\u4ED6\u306E\u5024 'by-type' \u306F\u3001\u5404\u30B5\u30FC\u30D0\u30FC\u306E\u66F8\u304D\u8FBC\u307F\u53EF\u80FD\u306A\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u3092 "type" \u30D9\u30FC\u30B9 (data\u3001log\u3001tmp) \u3067\u3001\u5206\u985E\u3059\u3079\u304D\u3067\u3042\u308B\u3068\u6307\u5B9A\u3057\u307E\u3059\u3002\u5206\u985E\u306E\u5F62\u5F0F\u306F\u3001\u305D\u306E\u578B\u306E\u30C9\u30E1\u30A4\u30F3\u30EC\u30D9\u30EB\u306E\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u306B\u3042\u308B\u5168\u30B5\u30FC\u30D0\u30FC\u306B\u5BFE\u3059\u308B\u6307\u5B9A\u306E\u578B\u306E\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u3067\u884C\u3044\u307E\u3059 (\u4F8B\uFF1Adomain/data/servers/server-name)\u3002
host.management.port=\u30A4\u30F3\u30C8\u30E9\u30C9\u30E1\u30A4\u30F3\u7BA1\u7406\u901A\u4FE1\u3067\u30DB\u30B9\u30C8\u306E\u30BD\u30B1\u30C3\u30C8\u3092\u958B\u304F\u3079\u304D\u30DD\u30FC\u30C8
host.domain-controller=\u30DB\u30B9\u30C8\u304C\u30C9\u30E1\u30A4\u30F3\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u3068\u3069\u306E\u3088\u3046\u306B\u3084\u308A\u53D6\u308A\u3092\u884C\u3046\u304B\u306B\u3064\u3044\u3066\u8A2D\u5B9A
host.domain-controller.local=\u30ED\u30FC\u30AB\u30EB\u306E\u30C9\u30E1\u30A4\u30F3\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u3092\u8A2D\u5B9A
host.domain-controller.local.add=\u30DB\u30B9\u30C8\u304C\u30C9\u30E1\u30A4\u30F3\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u3068\u3057\u3066\u6A5F\u80FD\u3059\u308B\u3088\u3046\u306B\u8A2D\u5B9A\u3057\u307E\u3059\u3002
host.domain-controller.remote=\u30EA\u30E2\u30FC\u30C8\u306E\u30C9\u30E1\u30A4\u30F3\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u306E\u63A5\u7D9A\u8A2D\u5B9A
host.domain-controller.remote.add=\u30EA\u30E2\u30FC\u30C8\u306E\u30C9\u30E1\u30A4\u30F3\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u306E\u63A5\u7D9A\u8A2D\u5B9A\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
host.domain-controller.remote.host=\u30C9\u30E1\u30A4\u30F3\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u63A5\u7D9A\u306B\u5229\u7528\u3059\u308B\u30A2\u30C9\u30EC\u30B9
host.domain-controller.remote.port=\u30C9\u30E1\u30A4\u30F3\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u63A5\u7D9A\u306B\u5229\u7528\u3059\u308B\u30DD\u30FC\u30C8
host.extension=\u62E1\u5F35\u6A5F\u80FD\u30E2\u30B8\u30E5\u30FC\u30EB\u306E\u4E00\u89A7
host.path=\u540D\u524D\u3064\u304D\u306E\u30D5\u30A1\u30A4\u30EB\u30B7\u30B9\u30C6\u30E0\u30D1\u30B9\u306E\u4E00\u89A7
host.interface=\u30DB\u30B9\u30C8\u3067\u5229\u7528\u53EF\u80FD\u306A\u3001\u5B8C\u5168\u6307\u5B9A\u304B\u3064\u540D\u524D\u3064\u304D\u306E\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u306B\u95A2\u3059\u308B\u4E00\u89A7
host.jvm=\u30DB\u30B9\u30C8\u306B\u3042\u308B\u30B5\u30FC\u30D0\u30FC\u306B\u9069\u7528\u53EF\u80FD\u306A Java Virtual Machine \u8A2D\u5B9A\u306E\u4E00\u89A7\u3002TODO \u306E\u5B50\u3002
host.system-properties=\u30DB\u30B9\u30C8\u4E0A\u306E\u5168\u30B5\u30FC\u30D0\u30FC\u306B\u8A2D\u5B9A\u3059\u308B\u30B7\u30B9\u30C6\u30E0\u30D7\u30ED\u30D1\u30C6\u30A3\u4E00\u89A7
host.system-property=\u30DB\u30B9\u30C8\u4E0A\u306E\u5168\u30B5\u30FC\u30D0\u30FC\u306B\u8A2D\u5B9A\u3059\u308B\u30B7\u30B9\u30C6\u30E0\u30D7\u30ED\u30D1\u30C6\u30A3
host.core-services=\u30DB\u30B9\u30C8\u306E\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u304C\u63D0\u4F9B\u3059\u308B\u30B3\u30A2\u30B5\u30FC\u30D3\u30B9
host.server-config=\u30DB\u30B9\u30C8\u3067\u7A3C\u52D5\u3059\u308B\u30B5\u30FC\u30D0\u30FC\u306E\u30DB\u30B9\u30C8\u30EC\u30D9\u30EB\u306E\u8A2D\u5B9A
host.server=\u30DB\u30B9\u30C8\u3067\u7A3C\u50CD\u4E2D\u306E\u30B5\u30FC\u30D0\u30FC
host.shutdown=\u30DB\u30B9\u30C8\u3068\u305D\u306E\u30B5\u30FC\u30D0\u30FC\u3092\u30B7\u30E3\u30C3\u30C8\u30C0\u30A6\u30F3\u3057\u307E\u3059\u3002
host.shutdown.restart=True \u306E\u5834\u5408\u3001\u4E00\u65E6\u30B7\u30E3\u30C3\u30C8\u30C0\u30A6\u30F3\u3055\u308C\u3066\u3044\u305F\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u306F\u518D\u8D77\u52D5\u3055\u308C\u307E\u3059\u3002
host.start-server=\u30B5\u30FC\u30D0\u30FC\u306E\u8D77\u52D5
host.start-server.server=\u30B5\u30FC\u30D0\u30FC\u540D
host.start-server.reply=\u3053\u306E\u64CD\u4F5C\u5B9F\u884C\u5F8C\u306E\u30B5\u30FC\u30D0\u30FC\u306E\u30B9\u30C6\u30FC\u30BF\u30B9
host.state=\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u306E\u73FE\u5728\u306E\u30B9\u30C6\u30FC\u30BF\u30B9\u3002STARTING\u3001RUNNING\u3001RESTART_REQUIRED \u306E\u3044\u305A\u308C\u304B
host.restart-server=\u73FE\u5728\u7A3C\u50CD\u4E2D\u306E\u30B5\u30FC\u30D0\u30FC\u3092\u518D\u8D77\u52D5
host.restart-server.server=\u30B5\u30FC\u30D0\u30FC\u540D
host.restart-server.reply=\u3053\u306E\u64CD\u4F5C\u5B9F\u884C\u5F8C\u306E\u30B5\u30FC\u30D0\u30FC\u306E\u30B9\u30C6\u30FC\u30BF\u30B9
host.stop-server=\u73FE\u5728\u7A3C\u50CD\u4E2D\u306E\u30B5\u30FC\u30D0\u30FC\u3092\u505C\u6B62
host.stop-server.server=\u30B5\u30FC\u30D0\u30FC\u540D
host.stop-server.reply=\u3053\u306E\u64CD\u4F5C\u5B9F\u884C\u5F8C\u306E\u30B5\u30FC\u30D0\u30FC\u306E\u30B9\u30C6\u30FC\u30BF\u30B9
host.master=\u3053\u306E\u30DB\u30B9\u30C8\u304C\u5F53\u30C9\u30E1\u30A4\u30F3\u306B\u304A\u3051\u308B\u30DE\u30B9\u30BF\u30FC\u30DB\u30B9\u30C8\u304B\u3069\u3046\u304B\u3002\u3064\u307E\u308A\u3001\u3053\u306E\u30D7\u30ED\u30BB\u30B9\u304C\u30C9\u30E1\u30A4\u30F3\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u3068\u3057\u3066\u306E\u5F79\u5272\u3092\u679C\u305F\u3059\u304B\u3002
host.resolve-expression-on-domain=\u30A4\u30F3\u30D7\u30C3\u30C8 (\u3042\u308B\u3044\u306F\u89E3\u6790\u3057\u8868\u73FE\u306B\u5909\u63DB\u3055\u308C\u308B\u30B9\u30C8\u30EA\u30F3\u30B0) \u3068\u3057\u3066\u8868\u73FE\u3092\u53D7\u3051\u4ED8\u3051\u3001\u3053\u306E\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u304C\u7BA1\u7406\u3059\u308B\u5168\u30B5\u30FC\u30D0\u30FC\u4E0A\u306B\u3042\u308B\u30ED\u30FC\u30AB\u30EB\u306E\u30B7\u30B9\u30C6\u30E0\u30D7\u30ED\u30D1\u30C6\u30A3\u3068\u74B0\u5883\u5909\u6570\u306B\u5BFE\u3057\u3053\u306E\u8868\u73FE\u3092\u89E3\u6C7A\u3059\u308B\u3068\u3044\u3046\u64CD\u4F5C
host.resolve-expression-on-domain.expression=\u89E3\u6C7A\u306E\u5FC5\u8981\u306E\u3042\u308B\u8868\u73FE
host.resolve-expression-on-domain.reply=\u89E3\u6C7A\u6E08\u307F\u306E\u8868\u73FE\u3001\u3042\u308B\u3044\u306F\u8868\u73FE\u3067\u306A\u3044\u5834\u5408\u306F\u30B9\u30C8\u30EA\u30F3\u30B0\u5F62\u5F0F\u306E\u5143\u306E\u5165\u529B\u5024
host.env=\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u306E\u74B0\u5883
host.env.process-controller-address=\u3053\u306E\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u304C\u63A5\u7D9A\u3055\u308C\u3066\u3044\u308B\u30D7\u30ED\u30BB\u30B9\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u306E\u30A2\u30C9\u30EC\u30B9
host.env.process-controller-port=\u3053\u306E\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u304C\u63A5\u7D9A\u3055\u308C\u3066\u3044\u308B\u30D7\u30ED\u30BB\u30B9\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u306E\u30DD\u30FC\u30C8
host.env.host-controller-address=\u3053\u306E\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u304C\u30B5\u30FC\u30D0\u30FC\u304B\u3089\u306E\u901A\u4FE1\u306B\u3064\u3044\u3066\u30EA\u30C3\u30B9\u30F3\u3059\u308B\u30A2\u30C9\u30EC\u30B9
host.env.host-controller-port=\u3053\u306E\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u304C\u30B5\u30FC\u30D0\u30FC\u304B\u3089\u306E\u901A\u4FE1\u306B\u3064\u3044\u3066\u30EA\u30C3\u30B9\u30F3\u3059\u308B\u30DD\u30FC\u30C8
host.env.home-dir=JBoss Application Server \u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u306E\u30DB\u30FC\u30E0\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA
host.env.modules-dir=\u30E2\u30B8\u30E5\u30FC\u30EB\u304C\u898B\u3064\u304B\u3063\u305F\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA
host.env.domain-base-dir=JBoss Application Server \u30C9\u30E1\u30A4\u30F3\u306E\u30D9\u30FC\u30B9\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA
host.env.domain-config-dir=\u30C9\u30E1\u30A4\u30F3\u306E\u8A2D\u5B9A\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA
host.env.host-config-file=\u3053\u306E\u30DB\u30B9\u30C8\u306E\u8A2D\u5B9A\u30D5\u30A1\u30A4\u30EB
host.env.domain-config-file=\u3053\u306E\u30C9\u30E1\u30A4\u30F3\u306E\u8A2D\u5B9A\u30D5\u30A1\u30A4\u30EB
host.env.domain-content-dir=\u30B5\u30FC\u30D0\u30FC\u304C\u7BA1\u7406\u3059\u308B\u30E6\u30FC\u30B6\u30FC\u30B3\u30F3\u30C6\u30F3\u30C4  (\u4F8B\uFF1A\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8) \u306E\u683C\u7D0D\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA
host.env.domain-data-dir=\u30C7\u30FC\u30BF\u306E\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA
host.env.domain-log-dir=\u30ED\u30B0\u30D5\u30A1\u30A4\u30EB\u306E\u9001\u4FE1\u5148\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA
host.env.domain-servers-dir=\u3053\u306E\u30DB\u30B9\u30C8\u304C\u958B\u59CB\u3057\u305F\u30B5\u30FC\u30D0\u30FC\u304C\u30E9\u30F3\u30BF\u30A4\u30E0\u30C7\u30FC\u30BF\u3092\u4FDD\u5B58\u3059\u308B\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA
host.env.domain-temp-dir=\u4E00\u6642\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA
host.env.default-jvm=\u30C7\u30D5\u30A9\u30EB\u30C8\u306E jvm
host.env.is-restart=\u3053\u306E\u30DB\u30B9\u30C8\u304C\u30D7\u30ED\u30BB\u30B9\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u306B\u3088\u308A\u518D\u8D77\u52D5\u3055\u308C\u305F\u304B\u3069\u3046\u304B
host.env.backup-domain-files=\u3053\u306E\u30DB\u30B9\u30C8\u30ED\u30FC\u30E9\u30FC\u304C\u30DE\u30B9\u30BF\u30FC\u306E\u30C9\u30E1\u30A4\u30F3\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u304B\u3089\u30C9\u30E1\u30A4\u30F3\u30B3\u30F3\u30C6\u30F3\u30C4\u3092\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u3059\u3079\u304D\u304B\u3002\u30B9\u30EC\u30FC\u30D6\u306E\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u4E0A\u3067\u306E\u307F true \u3068\u306A\u308A\u5F97\u308B\u3002
host.env.use-cached-dc=\u30DB\u30B9\u30C8\u306E\u8D77\u52D5\u6642\u306B\u3001(--backup \u304B\u3089\u306F\u3058\u3081\u308B\u3053\u3068\u3067\u53D6\u5F97\u3057\u305F) \u30AD\u30E3\u30C3\u30B7\u30E5\u30C9\u30E1\u30A4\u30F3\u30B3\u30F3\u30C6\u30F3\u30C4 \u3092\u3053\u306E\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u304C\u5229\u7528\u3059\u3079\u304D\u304B\u3002\u30B9\u30EC\u30FC\u30D6\u306E\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u4E0A\u3067\u306E\u307F true \u3068\u306A\u308A\u5F97\u307E\u3059\u3002
host.env.initial-running-mode=\u30DB\u30B9\u30C8\u306E\u73FE\u5728\u306E\u5B9F\u884C\u30E2\u30FC\u30C9\u3002LIVE (\u901A\u5E38\u306E\u64CD\u4F5C) \u3042\u308B\u3044\u306F ADMIN_ONLY\u3002ADMIN_ONLY \u30B5\u30FC\u30D0\u30FC\u306F\u8A2D\u5B9A\u6E08\u307F\u306E\u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u3092\u8D77\u52D5\u3057\u3001\u7BA1\u7406\u30EA\u30AF\u30A8\u30B9\u30C8\u3092\u53D7\u3051\u4ED8\u3051\u307E\u3059\u304C\u30A8\u30F3\u30C9\u30E6\u30FC\u30B6\u30FC\u306E\u30EA\u30AF\u30A8\u30B9\u30C8\u3092\u51E6\u7406\u3059\u308B\u969B\u306B\u5229\u7528\u3059\u308B\u30B5\u30FC\u30D3\u30B9\u306E\u958B\u59CB\u306F\u884C\u3044\u307E\u305B\u3093\u3002
host.env.qualified-host-name=\u5B8C\u5168\u4FEE\u98FE\u30DB\u30B9\u30C8\u540D\u304C\u8D77\u52D5\u6642\u306B\u691C\u51FA\u3055\u308C\u307E\u3057\u305F\u3002
host.env.host-name=\u30ED\u30FC\u30AB\u30EB\u30DB\u30B9\u30C8\u540D\u304C\u30B5\u30FC\u30D0\u30FC\u306E\u8D77\u52D5\u6642\u306B\u691C\u51FA\u3055\u308C\u307E\u3057\u305F\u3002
host.reload=Host Controller \u306E\u30B5\u30FC\u30D3\u30B9\u3092\u3059\u3079\u3066\u30B7\u30E3\u30C3\u30C8\u30C0\u30A6\u30F3\u3057\u958B\u59CB\u3059\u308B\u3053\u3068\u3067\u3001Host controller \u306E\u30EA\u30ED\u30FC\u30C9\u3092\u884C\u3044\u307E\u3059\u3002JVM \u81EA\u4F53\u306F\u518D\u8D77\u52D5\u3055\u308C\u307E\u305B\u3093\u3002\u305F\u3060\u3057\u3001\u3053\u3046\u3059\u308B\u3053\u3068\u3067\u3001\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u304C\u7BA1\u7406\u3059\u308B\u5168\u30B5\u30FC\u30D0\u30FC\u30D7\u30ED\u30BB\u30B9\u304C\u5B9F\u884C\u3067\u304D\u308B\u3088\u3046\u5B8C\u5168\u306A\u30D7\u30ED\u30BB\u30B9\u306E\u518D\u8D77\u52D5\u304C\u884C\u308F\u308C\u307E\u3059\u3002
host.reload.admin-only=Host Controller \u306E\u518D\u8D77\u52D5\u6642\u306B ADMIN_ONLY \u306E\u7A3C\u52D5\u30E2\u30FC\u30C9\u3067\u8D77\u52D5\u3059\u3079\u304D\u304B\u3069\u3046\u304B\u3002ADMIN_ONLY Host Controller \u306F\u8A2D\u5B9A\u6E08\u307F\u306E\u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u3092\u8D77\u52D5\u3057\u3001\u7BA1\u7406\u30EA\u30AF\u30A8\u30B9\u30C8\u3092\u53D7\u3051\u4ED8\u3051\u307E\u3059\u304C\u30B5\u30FC\u30D0\u30FC\u306F\u8D77\u52D5\u3057\u307E\u305B\u3093\u3002\u3082\u3057\u304F\u306F\u3053\u306E\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u304C\u30C9\u30E1\u30A4\u30F3\u306E\u30DE\u30B9\u30BF\u30FC\u3067\u3042\u308B\u5834\u5408\u3001\u30B9\u30EC\u30FC\u30D6\u306E\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u304B\u3089\u306E\u53D7\u4FE1\u63A5\u7D9A\u3092\u53D7\u3051\u4ED8\u3051\u307E\u3059\u3002
host.reload.restart-servers=True \u306E\u5834\u5408\u30B5\u30FC\u30D0\u30FC\u306F\u30EA\u30ED\u30FC\u30C9\u3055\u308C\u3001false \u306E\u5834\u5408\u3001\u30B5\u30FC\u30D0\u30FC\u306F\u305D\u306E\u307E\u307E\u7A3C\u52D5\u3057\u3001\u518D\u8D77\u52D5\u5F8C\u306B Host Controller \u3068\u518D\u63A5\u7D9A\u3057\u307E\u3059\u3002
server=\u30DB\u30B9\u30C8\u30EC\u30D9\u30EB\u306E\u7BA1\u7406\u30E2\u30C7\u30EB\u3067\u30B5\u30FC\u30D0\u30FC\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002
server.add=\u65B0\u898F\u306E\u30B5\u30FC\u30D0\u30FC\u8A2D\u5B9A\u3092\u8FFD\u52A0
server.remove=\u65E2\u5B58\u306E\u30B5\u30FC\u30D0\u30FC\u8A2D\u5B9A\u3092\u524A\u9664
server.cpu-affinity=\u30B5\u30FC\u30D0\u30FC\u306E cpu \u30A2\u30D5\u30A3\u30CB\u30C6\u30A3
server.interface=\u30B5\u30FC\u30D0\u30FC\u3067\u5229\u7528\u53EF\u80FD\u306A\u3001\u5B8C\u5168\u6307\u5B9A\u304B\u3064\u540D\u524D\u3064\u304D\u306E\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u306B\u95A2\u3059\u308B\u4E00\u89A7\u3002TODO \u306E\u5B50\u3002
server.jvm=\u540D\u524D\u306E\u3064\u3044\u305F jvm\u3002TODO \u306E\u5B50\u3002
server.name=\u30B5\u30FC\u30D0\u30FC\u540D
server.group=\u30C9\u30E1\u30A4\u30F3\u30E2\u30C7\u30EB\u304B\u3089\u306E\u30B5\u30FC\u30D0\u30FC\u30B0\u30EB\u30FC\u30D7\u540D
server.path=\u540D\u524D\u3064\u304D\u306E\u30D5\u30A1\u30A4\u30EB\u30B7\u30B9\u30C6\u30E0\u30D1\u30B9\u306E\u4E00\u89A7
server.priority=\u30B5\u30FC\u30D0\u30FC\u306E\u512A\u5148\u9806\u4F4D
server.socket-binding-group=\u3053\u306E\u30B5\u30FC\u30D0\u30FC\u304C\u6240\u5C5E\u3059\u308B\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u30B0\u30EB\u30FC\u30D7
server.socket-binding-port-offset=\u3053\u306E\u30B5\u30FC\u30D0\u30FC\u306B\u5BFE\u3057\u3066\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u30B0\u30EB\u30FC\u30D7\u304C\u6E21\u3059\u30DD\u30FC\u30C8\u306E\u5024\u306B\u8FFD\u52A0\u3059\u308B\u30AA\u30D5\u30BB\u30C3\u30C8
server.auto-start=Host Controller \u306E\u8D77\u52D5\u6642\u306B\u3053\u306E\u30B5\u30FC\u30D0\u30FC\u3092\u8D77\u52D5\u3059\u3079\u304D\u304B\u3069\u3046\u304B
server.system-properties=\u3053\u306E\u30B5\u30FC\u30D0\u30FC\u306B\u8A2D\u5B9A\u3059\u308B\u30B7\u30B9\u30C6\u30E0\u30D7\u30ED\u30D1\u30C6\u30A3\u4E00\u89A7
server.system-property=\u3053\u306E\u30B5\u30FC\u30D0\u30FC\u306B\u8A2D\u5B9A\u3059\u308B\u30B7\u30B9\u30C6\u30E0\u30D7\u30ED\u30D1\u30C6\u30A3
core.management.native-interface=\u30B5\u30FC\u30D0\u30FC\u306E\u30CD\u30FC\u30C6\u30A3\u30D6\u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u8A2D\u5B9A
core.management.native-interface.add=\u30B5\u30FC\u30D0\u30FC\u306E\u30CD\u30FC\u30C6\u30A3\u30D6\u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u3092\u8FFD\u52A0
core.management.native-interface.remove=\u30B5\u30FC\u30D0\u30FC\u306E\u30CD\u30FC\u30C6\u30A3\u30D6\u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u3092\u524A\u9664
core.management.native-interface.interface=\u5EC3\u6B62\u3055\u308C\u307E\u3057\u305F -- 'socket-binding' \u3092\u5229\u7528\u3057\u3066\u304F\u3060\u3055\u3044\u3002\u30CD\u30FC\u30C6\u30A3\u30D6\u306E\u7BA1\u7406\u901A\u4FE1\u5411\u3051\u306E\u30B5\u30FC\u30D0\u30FC\u30BD\u30B1\u30C3\u30C8\u3092\u958B\u304F\u3079\u304D\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u3002'socket-binding' \u5C5E\u6027\u304C\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u306F 'undefined' \u3067\u306A\u3051\u308C\u3070\u306A\u308A\u307E\u305B\u3093\u3002
core.management.native-interface.port=\u5EC3\u6B62\u3055\u308C\u307E\u3057\u305F -- 'socket-binding' \u3092\u5229\u7528\u3057\u3066\u304F\u3060\u3055\u3044\u3002\u30CD\u30FC\u30C6\u30A3\u30D6\u306E\u7BA1\u7406\u901A\u4FE1\u5411\u3051\u306E\u30B5\u30FC\u30D0\u30FC\u30BD\u30B1\u30C3\u30C8\u3092\u958B\u304F\u3079\u304D\u30DD\u30FC\u30C8\u3002'socket-binding' \u5C5E\u6027\u304C\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u306F 'undefined' \u3067\u306A\u3051\u308C\u3070\u306A\u308A\u307E\u305B\u3093\u3002
core.management.native-interface.security-realm=\u30CD\u30FC\u30C6\u30A3\u30D6\u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u306B\u5229\u7528\u3059\u308B\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30EC\u30EB\u30E0
core.management.http-interface=\u30B5\u30FC\u30D0\u30FC\u306E HTTP \u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u306E\u8A2D\u5B9A
core.management.http-interface.add=\u30B5\u30FC\u30D0\u30FC\u306E HTTP \u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u306E\u8A2D\u5B9A\u3092\u8FFD\u52A0
core.management.http-interface.remove=\u30B5\u30FC\u30D0\u30FC\u306E HTTP \u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u306E\u8A2D\u5B9A\u3092\u8FFD\u52A0
core.management.http-interface.interface=\u5EC3\u6B62\u3055\u308C\u307E\u3057\u305F -- 'socket-binding' \u3092\u5229\u7528\u3057\u3066\u304F\u3060\u3055\u3044\u3002HTTP \u7BA1\u7406\u901A\u4FE1\u5411\u3051\u306E\u30B5\u30FC\u30D0\u30FC\u30BD\u30B1\u30C3\u30C8\u3092\u958B\u304F\u3079\u304D\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u3002'socket-binding' \u3042\u308B\u3044\u306F 'secure-socket-binding' \u5C5E\u6027\u304C\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u306F 'undefined' \u3067\u306A\u3051\u308C\u3070\u306A\u308A\u307E\u305B\u3093\u3002
core.management.http-interface.port=\u5EC3\u6B62\u3055\u308C\u307E\u3057\u305F -- 'socket-binding' \u3092\u5229\u7528\u3057\u3066\u304F\u3060\u3055\u3044\u3002HTTP \u7BA1\u7406\u901A\u4FE1\u5411\u3051\u306E\u30B5\u30FC\u30D0\u30FC\u30BD\u30B1\u30C3\u30C8\u3092\u958B\u304F\u3079\u304D\u30DD\u30FC\u30C8\u3002'socket-binding' \u3042\u308B\u3044\u306F 'secure-socket-binding' \u5C5E\u6027\u304C\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u306F 'undefined' \u3067\u306A\u3051\u308C\u3070\u306A\u308A\u307E\u305B\u3093\u3002
core.management.http-interface.secure-port=\u5EC3\u6B62\u3055\u308C\u307E\u3057\u305F -- 'secure-socket-binding' \u3092\u5229\u7528\u3057\u3066\u304F\u3060\u3055\u3044\u3002HTTP \u7BA1\u7406\u901A\u4FE1\u5411\u3051\u306E\u30B5\u30FC\u30D0\u30FC\u30BD\u30B1\u30C3\u30C8\u3092\u958B\u304F\u3079\u304D\u30DD\u30FC\u30C8\u3002'socket-binding' \u3042\u308B\u3044\u306F 'secure-socket-binding' \u5C5E\u6027\u304C\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u306F 'undefined' \u3067\u306A\u3051\u308C\u3070\u306A\u308A\u307E\u305B\u3093\u3002
core.management.http-interface.security-realm=HTTP \u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u306B\u5229\u7528\u3059\u308B\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30EC\u30EB\u30E0
core.management.http-interface.console-enabled=\u7BA1\u7406\u30B3\u30F3\u30BD\u30FC\u30EB\u304C\u6709\u52B9\u3067\u3042\u308B\u3053\u3068\u3092\u793A\u3059\u30D5\u30E9\u30B0
ignored-resources=Host Controller \u304C\u7121\u8996\u3059\u3079\u304D\u3001\u30C9\u30E1\u30A4\u30F3 root \u30EA\u30BD\u30FC\u30B9\u30EA\u30AF\u30A8\u30B9\u30C8\u306E\u76F4\u63A5\u306E\u5B50\u30EA\u30BD\u30FC\u30B9\u304C\u6301\u3064\u540D\u524D\u3002\u30B9\u30EC\u30FC\u30D6\u306E Host Controller \u306E\u307F\u8A72\u5F53\u3057\u307E\u3059\u3002\u3053\u306E\u3088\u3046\u306A\u300C\u7121\u8996\u3055\u308C\u305F\u30EA\u30BD\u30FC\u30B9\u300D\u3092\u8A2D\u5B9A\u3059\u308B\u3053\u3068\u3067\u3001\u4EE5\u524D\u306E\u30EA\u30EA\u30FC\u30B9\u306E Host Controller\u304C\u65B0\u3057\u3044\u30EA\u30EA\u30FC\u30B9\u306E\u30DE\u30B9\u30BF\u30FC Host Controller \u306B\u5BFE\u3059\u308B\u30B9\u30EC\u30FC\u30D6\u3068\u3057\u3066\u6A5F\u80FD\u3067\u304D\u308B\u3088\u3046\u306B\u306A\u308A\u307E\u3059\u3002\u3053\u308C\u306F\u3001\u30B9\u30EC\u30FC\u30D6\u5074\u306E\u30BD\u30D5\u30C8\u30A6\u30A7\u30A2\u30D0\u30FC\u30B8\u30E7\u30F3\u304C\u7406\u89E3\u3067\u304D\u306A\u3044\u8A2D\u5B9A\u306E\u4E00\u90E8\u3092\u30B9\u30EC\u30FC\u30D6\u304C\u7121\u8996\u3067\u304D\u308B\u3088\u3046\u306B\u3059\u308B\u3053\u3068\u3067\u5B9F\u73FE\u3055\u308C\u307E\u3059\u3002\u3053\u306E\u6226\u7565\u306F\u3001\u30B9\u30EC\u30FC\u30D6\u306EHost Controller \u304C\u7BA1\u7406\u3059\u308B\u30B5\u30FC\u30D0\u30FC\u304C\u7121\u8996\u3057\u305F\u8A2D\u5B9A\u306E\u3044\u305A\u308C\u304B\u3092\u53C2\u7167\u3057\u306A\u3044\u5834\u5408\u306B\u306E\u307F\u6B63\u5E38\u306B\u5B9F\u884C\u3055\u308C\u307E\u3059\u3002
ignored-resource-type=\u7279\u5B9A\u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u3092\u7121\u8996\u3059\u3079\u304D\u30EA\u30BD\u30FC\u30B9\u30BF\u30A4\u30D7 (\u4F8B\uFF1A'profile' \u3042\u308B\u3044\u306F 'socket-binding-group') \u3092\u7279\u5B9A\u3057\u307E\u3059\u3002
ignored-resource-type.add=\u7279\u5B9A\u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u3092\u7121\u8996\u3059\u3079\u304D\u30EA\u30BD\u30FC\u30B9\u30BF\u30A4\u30D7\u3092\u8FFD\u52A0
ignored-resource-type.remove=\u7279\u5B9A\u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u3092\u7121\u8996\u3059\u3079\u304D\u306A\u30EA\u30BD\u30FC\u30B9\u30BB\u30C3\u30C8\u304B\u3089\u30EA\u30BD\u30FC\u30B9\u30BF\u30A4\u30D7\u3092\u524A\u9664
ignored-resource-type.names=\u7279\u5B9A\u306E\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u540D\u3092\u7121\u8996\u3059\u3079\u304D\u30EA\u30BD\u30FC\u30B9\u30BF\u30A4\u30D7\u306E\u4E00\u89A7\u3002\u4E00\u89A7\u306B '*' \u3092\u542B\u3081\u308B\u3053\u3068\u3067\u578B\u306E\u5168\u30EA\u30BD\u30FC\u30B9\u3092\u7121\u8996\u3059\u308B\u3053\u3068\u306B\u306A\u308A\u307E\u3059\u3002
ignored-resource-type.wildcard='true' \u306E\u5834\u5408\u3001\u305D\u306E\u578B\u306E\u5168\u30EA\u30BD\u30FC\u30B9\u3092\u7121\u8996\u3059\u3079\u304D\u3067\u3042\u308B\u3068\u6307\u5B9A\u3059\u308B boolean
