jacorb=A configura\u00E7\u00E3o do sub-sistema JacORB.
jacorb.add=Adiciona o sub-sistema JacORB
jacorb.remove=Remove o sub-sistema JacORB
jacorb.name=O nome do ORB em execu\u00E7\u00E3o.
jacorb.print-version=Indica se \u00E9 que o n\u00FAmero de vers\u00E3o deve ser impresso durante a inicializa\u00E7\u00E3o ORB ou n\u00E3o (desligado).
jacorb.use-imr=Indica se \u00E9 que o reposit\u00F3rio de implanta\u00E7\u00E3o deve ser usado (ligado) ou n\u00E3o (desligado).
jacorb.use-bom=Indica se \u00E9 que os marcadores de ordem GIOP 1.2 bite devem ser usados (ligados) ou n\u00E3o (desligados). 
jacorb.cache-typecodes=Indica se \u00E9 que os typecodes devem possuir cache (ativado) ou n\u00E3o (desativado).
jacorb.cache-poa-names=Indica se \u00E9 que os nomes POA devem possuir cache (ativado) ou n\u00E3o (desativados).
jacorb.giop-minor-version=A vers\u00E3o inferior GIOP a ser usada.
jacorb.retries=O n\u00FAmero de tentativas caso as conex\u00F5es n\u00E3o possam estar prontamente estabelecidas.
jacorb.retry-interval=O intervalo em mil\u00E9simos de segundos entre as tentativas.
jacorb.client-timeout=O valor do intervalo de conex\u00E3o ao lado do cliente em mil\u00E9simos de segundos. O valor zero indica que a conex\u00E3o nunca entra em intervalo.
jacorb.server-timeout=O valor do intervalo de conex\u00E3o ao lado do servidor em mil\u00E9simos de segundos. O valor zero indica que a conex\u00E3o nunca entra em intervalo.
jacorb.max-server-connections=O n\u00FAmero m\u00E1ximo de conex\u00F5es aceitas pelo servidor.
jacorb.max-managed-buf-size=O log2 do tamanho m\u00E1ximo gerenciado pelo gerenciador buffer interno.
jacorb.outbuf-size=O tamanho dos buffers de rede para as mensagens de sa\u00EDda.
jacorb.outbuf-cache-timeout=O intervalo do cache buffer em mil\u00E9simos de segundos.
jacorb.security=Indica se \u00E9 que os interceptores de seguran\u00E7a est\u00E3o prestes a serem instalados (ativados) ou n\u00E3o (desativados).
jacorb.transactions=Indica se \u00E9 que os interceptores das transa\u00E7\u00F5es est\u00E3o prestes a serem instalados (ativados ou especificados) ou n\u00E3o (desativados). O valor 'ativado' habilitou o JTS enquanto 'especificado' habilita o modo compat\u00EDvel de especifica\u00E7\u00E3o (n\u00E3o-JTS) que rejeita os contextos de transa\u00E7\u00E3o de entrada.
jacorb.monitoring=Indica se \u00E9 que o GUI de monitora\u00E7\u00E3o deve ser exibido (ativado) ou n\u00E3o (desativado).
jacorb.queue-wait=Indica se \u00E9 que as solicita\u00E7\u00F5es que excedem o tamanho da fila m\u00E1ximo deve esperar (ativado) ou n\u00E3o (ativado). Quando habilitado, uma exce\u00E7\u00E3o TRANSIENTE \u00E9 lan\u00E7ada caso a fila esteja cheia.
jacorb.queue-min=O tamanho da fila para notifica\u00E7\u00E3o de solicita\u00E7\u00F5es de espera. Em outras palavras, as solicita\u00E7\u00F5es bloqueadas s\u00E3o apenas notificadas quando a fila n\u00E3o possui mais que as solicita\u00E7\u00F5es m\u00EDnimas da fila. 
jacorb.queue-max=O n\u00FAmero m\u00E1ximo de solicita\u00E7\u00F5es que podem ser enfileiradas.
jacorb.pool-size=O tamanho do thread-pool de processadores de solicita\u00E7\u00E3o. Os threads que finalizam o processamento de uma solicita\u00E7\u00E3o s\u00E3o retornados de volta ao pool, caso isto n\u00E3o esteja cheio. Do contr\u00E1rio, eles ser\u00E3o descartados.
jacorb.max-threads=O n\u00FAmero m\u00E1ximo dos threads do processador de solicita\u00E7\u00E3o ativa. Os threads s\u00E3o os primeiros obtidos a partir do pool e uma vez que isto \u00E9 esgotado, novos threads s\u00E3o criados at\u00E9 que o n\u00FAmero de threads alcance esse limite. Novas solicita\u00E7\u00F5es esperar\u00E3o at\u00E9 que o thread ativo encerre o pr\u00F3prio trabalho.
jacorb.root-context=O contexto da raiz de servi\u00E7o de nomea\u00E7\u00E3o.
jacorb.export-corbaloc=Indica se \u00E9 que o contexto de raiz deve ser exportado como corbaloc\:\:address\:port/NameService (ativado) ou n\u00E3o (desativado).
jacorb.sun=Indica se \u00E9 que a interoperabilidade com o ORB do Sun est\u00E1 habilitada (ativada) ou n\u00E3o (desativada).
jacorb.comet=Indica se \u00E9 que a interoperabilidade com o ORB do Comet est\u00E1 habilitado (ativado) ou n\u00E3o (desativado).
jacorb.iona=Indica se \u00E9 que a interoperabilidade com o ASP do IONA est\u00E1 habilitado (ativado) ou n\u00E3o (desativado).
jacorb.chunk-custom-rmi-valuetypes=Indica se \u00E9 que o RMI valuetypes deve ser codificado como partes (ativado) ou n\u00E3o (desativado). 
jacorb.lax-boolean-encoding=Indica se \u00E9 que qualquer valor booliano codificado CDR n\u00E3o-zero deve ser interpretado como verdadeiro (ativado) ou n\u00E3o (desativado).
jacorb.indirection-encoding-disable=Indicado se \u00E9 que a codifica\u00E7\u00E3o de indire\u00E7\u00E3o para typecodes repetidos deve ser desabilitado (ativado) ou n\u00E3o (ativado).
jacorb.strict-check-on-tc-creation=indica se \u00E9 que o m\u00E9todo create_abstract_interface_tc deve executar uma checagem de valida\u00E7\u00E3o no par\u00E2metro do nome (ativado) ou n\u00E3o (desativado).
jacorb.support-ssl=Indica se \u00E9 que o SSL deve ser suportado (ativado) ou n\u00E3o (desativado).
jacorb.security-domain=O nome do dom\u00EDnio de seguran\u00E7a que mant\u00E9m a chave e armazenamentos de confian\u00E7a que ser\u00E3o usados para estabelecer conex\u00F5es SSL.
jacorb.add-component-via-interceptor=Indica se \u00E9 que os componentes SSL devem ser adicionados por um interceptor IOR (ativado) ou n\u00E3o (desativado).
jacorb.client-supports=O valor que indica os par\u00E2metros suportados pelo cliente SSL (None, ServerAuth, ClientAuth, MutualAuth).
jacorb.client-requires=O valor que indica os par\u00E2metros solicitados do cliente SSL (None, ServerAuth, ClientAuth, MutualAuth).
jacorb.server-supports=O valor que indica os par\u00E2metros solicitados do servidor SSL (None, ServerAuth, ClientAuth, MutualAuth).
jacorb.server-requires=O valor que indica o par\u00E2metros solicitados do servidor SSL (None, ServerAuth, ClientAuth, MutualAuth).
jacorb.properties=A lista de propriedades de chave/valor gen\u00E9rico.
