jacorb=La configuraci\u00F3n del sub-sistema JacORB.
jacorb.add=Agrega el sub-sistema JacORB.
jacorb.remove=Borra el sub-sistema JacORB.
jacorb.name=El nombre del ORB ejecutando.
jacorb.print-version=Indica si el n\u00FAmero de la versi\u00F3n se debe imprimir durante el arranque ORB (on) o no (off).
jacorb.use-imr=Indica si el repositorio de implementaci\u00F3n se debe utilizar (on) o no (off).
jacorb.use-bom=Indica si se deben utilizar los marcadores de \u00F3rdenes bytes GIOP 1.2 (on) o no (off).
jacorb.cache-typecodes=Indica si se deben poner (on) o no (off) en cach\u00E9 los c\u00F3digos de tipo.
jacorb.cache-poa-names=Indica si se deben poner en cach\u00E9 (on) o no (off) los nombres POA.
jacorb.giop-minor-version=La versi\u00F3n menor GIOP a utilizar.
jacorb.retries=El n\u00FAmero de re-intentos si las conexiones no se pueden establecer de manera pronta.
jacorb.retry-interval=El intervalo en milisegundos entre re-intentos.
jacorb.client-timeout=El valor del tiempo de expiraci\u00F3n de la conexi\u00F3n del lado del cliente en milisegundos. Un valor de cero indica que la conexi\u00F3n nunca expira.
jacorb.server-timeout=El valor del tiempo de expiraci\u00F3n de la conexi\u00F3n del lado del servidor en milisegundos. Un valor de cero indica que la conexi\u00F3n nunca expira.
jacorb.max-server-connections=El n\u00FAmero m\u00E1ximo de conexiones aceptadas por el servidor.
jacorb.max-managed-buf-size=El log2 del tama\u00F1o m\u00E1ximo administrado por el administrador del buffer interno.
jacorb.outbuf-size=El tama\u00F1o de los buffers de red para los mensajes salientes.
jacorb.outbuf-cache-timeout=El tiempo de expiraci\u00F3n del cach\u00E9 en el buffer en milisegundos.
jacorb.security=Indica si los interceptores de seguridad se deben instalar (on) o no (off).
jacorb.transactions=Indica si los interceptores de las transacciones se deben instalar (on o spec) o no (off). El valor 'on' habilitaba JTS mientras que 'spec' habilita un modo que cumple con las especificaciones (no JTS) que rechaza los contextos de transacci\u00F3n entrantes.
jacorb.monitoring=Indica si la GUI de monitoreo se debe presentar (on) o no (off).
jacorb.queue-wait=Indica si las peticiones que exceden el tama\u00F1o m\u00E1ximo de cola deben esperar (on) o no (off). Cuando est\u00E1 inhabilitado entonces se presenta una excepci\u00F3n TRANSIENT si la cola est\u00E1 llena.
jacorb.queue-min=El tama\u00F1o de la cola para notificar peticiones en espera. En otras palabras, las peticiones bloqueadas s\u00F3lo se notifican cuando la cola no tiene m\u00E1s que las peticiones queue-min.
jacorb.queue-max=El n\u00FAmero m\u00E1ximo de peticiones que se pueden poner en la cola.
jacorb.pool-size=El tama\u00F1o del pool de hilos de los procesadores de peticiones. Los hilos que terminan de procesar una petici\u00F3n se ponen de regreso en el pool si el pool no est\u00E1 lleno y descartado.
jacorb.max-threads=El n\u00FAmero m\u00E1ximo  de hilos procesadores de peticiones activas. Los hilos se obtienen primero del pool y una vez que se acaba el pool entonces se crean nuevos hilos hasta que el n\u00FAmero de hilos alcanza este l\u00EDmite. Las nuevas peticiones esperar\u00E1n hasta que un hilo activo termine su trabajo.
jacorb.root-context=El contexto ra\u00EDz del servicio de nombrado.
jacorb.export-corbaloc=Indica si el contexto ra\u00EDz se debe exportar como  corbaloc\:\:address\:port/NameService (on) o no (off).
jacorb.sun=Indica si la interoperabilidad con el ORB de Sun est\u00E1 habilitada (on) o no (off).
jacorb.comet=Indica si la interoperabilidad con el ORB de Comet est\u00E1 habilitada (on) o no (off).
jacorb.iona=Indica si la interoperabilidad con el ASP de IONA est\u00E1 habilitada (on) o no (off).
jacorb.chunk-custom-rmi-valuetypes=Indica si los valuetypes RMI personalizados se deben codificar como pedazos (on) o no (off).
jacorb.lax-boolean-encoding=Indica si cualquier valor boolean codificado CDR no-cero se debe interpretar como verdadero (on) o no (off).
jacorb.indirection-encoding-disable=Indica si se debe inhabilitar la codificaci\u00F3n de indirecci\u00F3n para typecodes repetidos (on) o no (off).
jacorb.strict-check-on-tc-creation=Indica si el m\u00E9todo create_abstract_interface_tc debe realizar un chequeo de  validaci\u00F3n en el par\u00E1metro nombre (on) o no (off).
jacorb.support-ssl=Indica si SSL se debe soportar (on) o no (off).
jacorb.security-domain=El nombre del dominio de seguridad que mantiene los almacenes de llave y de confianza que se utilizar\u00E1n para establecer conexiones SSL.
jacorb.add-component-via-interceptor=Indica si los componentes SSL deben ser agregados por un interceptor IOR (on) o no (off).
jacorb.client-supports=Valor que indica los par\u00E1metros soportados por SSL cliente (None, ServerAuth, ClientAuth, MutualAuth).
jacorb.client-requires=Valor que indica los par\u00E1metros soportados por SSL cliente (None, ServerAuth, ClientAuth, MutualAuth).
jacorb.server-supports=Valor que indica los par\u00E1metros soportados por SSL servidor (None, ServerAuth, ClientAuth, MutualAuth).
jacorb.server-requires=Valor que indica los par\u00E1metros requeridos por SSL servidor (None, ServerAuth, ClientAuth, MutualAuth).
jacorb.properties=Una lista de propiedades de valor/llave gen\u00E9ricos.
