jacorb=JacORB \u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u8A2D\u5B9A
jacorb.add=JacORB \u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u306E\u8FFD\u52A0
jacorb.remove=JacORB \u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u306E\u524A\u9664
jacorb.name=\u5B9F\u884C\u4E2D\u306E ORB \u540D
jacorb.print-version=ORB \u8D77\u52D5\u6642 (on) \u3042\u308B\u3044\u306F\u305D\u308C\u4EE5\u5916 (off) \u306E\u6642\u306B\u30D0\u30FC\u30B8\u30E7\u30F3\u756A\u53F7\u3092\u51FA\u529B\u3059\u3079\u304D\u304B\u793A\u3057\u307E\u3059\u3002
jacorb.use-imr=\u5B9F\u88C5\u30EC\u30DD\u30B8\u30C8\u30EA\u3092\u5229\u7528\u3059\u308B\u304B (on) \u5426\u304B (off) \u3092\u793A\u3057\u307E\u3059\u3002
jacorb.use-bom=GIOP 1.2 \u30D0\u30A4\u30C8\u30AA\u30FC\u30C0\u30FC\u30DE\u30FC\u30AB\u30FC\u3092\u5229\u7528\u3059\u3079\u304D\u304B (on) \u5426\u304B (off) \u3092\u793A\u3057\u307E\u3059\u3002
jacorb.cache-typecodes=TypeCode \u3092\u30AD\u30E3\u30C3\u30B7\u30E5\u5316\u3059\u3079\u304D\u304B (on) \u5426\u304B (off) \u3092\u793A\u3057\u307E\u3059\u3002
jacorb.cache-poa-names=POA \u3092\u30AD\u30E3\u30C3\u30B7\u30E5\u5316\u3059\u3079\u304D\u304B (on) \u5426\u304B (off) \u3092\u793A\u3057\u307E\u3059\u3002
jacorb.giop-minor-version=GIOP \u306E\u30DE\u30A4\u30CA\u30FC\u7248\u3092\u4F7F\u3044\u307E\u3059\u3002
jacorb.retries=\u63A5\u7D9A\u304C\u3059\u3050\u306B\u78BA\u7ACB\u3067\u304D\u306A\u3044\u5834\u5408\u306E\u518D\u8A66\u884C\u6570
jacorb.retry-interval=\u518D\u8A66\u884C\u306E\u9593\u9694 (\u30DF\u30EA\u79D2)
jacorb.client-timeout=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u5074\u306E\u63A5\u7D9A\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u306E\u5024 (\u30DF\u30EA\u79D2)\u3002\u30BC\u30ED\u5024\u306F\u63A5\u7D9A\u306B\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u304C\u306A\u3044\u3068\u3044\u3046\u610F\u5473\u3067\u3059\u3002
jacorb.server-timeout=\u30B5\u30FC\u30D0\u30FC\u5074\u306E\u63A5\u7D9A\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u306E\u5024 (\u30DF\u30EA\u79D2)\u3002\u30BC\u30ED\u5024\u306F\u63A5\u7D9A\u306B\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u304C\u306A\u3044\u3068\u3044\u3046\u610F\u5473\u3067\u3059\u3002
jacorb.max-server-connections=\u30B5\u30FC\u30D0\u30FC\u304C\u53D7\u3051\u5165\u308C\u308B\u6700\u5927\u63A5\u7D9A\u6570
jacorb.max-managed-buf-size=\u5185\u90E8\u306E\u30D0\u30C3\u30D5\u30A1\u30FC\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u304C\u7BA1\u7406\u3059\u308B log2 \u306E\u6700\u5927\u30B5\u30A4\u30BA
jacorb.outbuf-size=\u9001\u4FE1\u30E1\u30C3\u30BB\u30FC\u30B8\u306B\u5BFE\u3059\u308B\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u30D0\u30C3\u30D5\u30A1\u30FC\u306E\u30B5\u30A4\u30BA
jacorb.outbuf-cache-timeout=\u30D0\u30C3\u30D5\u30A1\u30FC\u30AD\u30E3\u30C3\u30B7\u30E5\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8 (\u30DF\u30EA\u79D2)
jacorb.security=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30A4\u30F3\u30BF\u30FC\u30BB\u30D7\u30BF\u30FC\u3092\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u3059\u308B\u304B (on) \u5426\u304B (off) \u3092\u793A\u3057\u307E\u3059\u3002
jacorb.transactions=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30A4\u30F3\u30BF\u30FC\u30BB\u30D7\u30BF\u30FC\u3092\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u3059\u308B\u304B (on \u3042\u308B\u3044\u306F spec) \u5426\u304B (off) \u3092\u793A\u3057\u307E\u3059\u3002'on' \u306E\u5024\u306F JTS \u3092\u6709\u52B9\u306B\u3057\u3001'spec' \u306F\u3001\u53D7\u4FE1\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u3092\u62D2\u5426\u3059\u308B\u4ED5\u69D8\u6E96\u62E0\u30E2\u30FC\u30C9 (\u975E JTS) \u3092\u6709\u52B9\u306B\u3057\u307E\u3059\u3002
jacorb.monitoring=GUI \u3092\u8868\u793A\u3059\u3079\u304D\u304B (on) \u5426\u304B (off) \u3092\u793A\u3057\u307E\u3059\u3002
jacorb.queue-wait=\u6700\u5927\u30AD\u30E5\u30FC\u30B5\u30A4\u30BA\u3092\u8D85\u3048\u308B\u30EA\u30AF\u30A8\u30B9\u30C8\u3092\u5F85\u6A5F\u3059\u308B\u304B (on) \u5426\u304B (off) \u3092\u6307\u5B9A\u3057\u307E\u3059\u3002\u7121\u52B9\u306E\u5834\u5408\u3001\u30AD\u30E5\u30FC\u304C\u3044\u3063\u3071\u3044\u306B\u306A\u308B\u3068 TRANSIENT \u306E\u4F8B\u5916\u304C\u30B9\u30ED\u30FC\u3055\u308C\u307E\u3059\u3002
jacorb.queue-min=\u5F85\u6A5F\u4E2D\u306E\u30EA\u30AF\u30A8\u30B9\u30C8\u3092\u901A\u77E5\u3059\u308B\u30AD\u30E5\u30FC\u30B5\u30A4\u30BA\u3002\u3064\u307E\u308A\u3001\u30AD\u30E5\u30FC\u306B queue-min \u30EA\u30AF\u30A8\u30B9\u30C8\u3057\u304B\u306A\u3044\u5834\u5408\u3001\u30D6\u30ED\u30C3\u30AF\u3055\u308C\u305F\u30EA\u30AF\u30A8\u30B9\u30C8\u306E\u307F\u3092\u901A\u77E5\u3057\u307E\u3059\u3002
jacorb.queue-max=\u30AD\u30E5\u30FC\u3067\u304D\u308B\u30EA\u30AF\u30A8\u30B9\u30C8\u306E\u6700\u5927\u6570
jacorb.pool-size=\u30EA\u30AF\u30A8\u30B9\u30C8\u30D7\u30ED\u30BB\u30C3\u30B5\u30FC\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u306E\u30B5\u30A4\u30BA\u3002\u30D7\u30FC\u30EB\u304C\u3044\u3063\u3071\u3044\u3067\u306A\u3044\u5834\u5408\u306F\u30EA\u30AF\u30A8\u30B9\u30C8\u51E6\u7406\u3092\u5B8C\u4E86\u3057\u305F\u30B9\u30EC\u30C3\u30C9\u304C\u30D7\u30FC\u30EB\u306B\u623B\u3055\u308C\u3001\u305D\u308C\u3067\u306A\u3044\u5834\u5408\u306F\u7834\u68C4\u3055\u308C\u307E\u3059\u3002
jacorb.max-threads=\u6709\u52B9\u306A\u30EA\u30AF\u30A8\u30B9\u30C8\u30D7\u30ED\u30BB\u30C3\u30B5\u30FC\u30B9\u30EC\u30C3\u30C9\u306E\u6700\u5927\u6570\u3002\u307E\u305A\u30B9\u30EC\u30C3\u30C9\u3092\u30D7\u30FC\u30EB\u304B\u3089\u53D6\u5F97\u3057\u3001\u30D7\u30FC\u30EB\u304C\u306A\u304F\u306A\u308B\u3068\u3001\u30B9\u30EC\u30C3\u30C9\u306E\u5236\u9650\u6570\u306B\u9054\u3059\u308B\u307E\u3067\u65B0\u305F\u306A\u30B9\u30EC\u30C3\u30C9\u304C\u4F5C\u6210\u3055\u308C\u307E\u3059\u3002\u6709\u52B9\u306A\u30B9\u30EC\u30C3\u30C9\u304C\u305D\u306E\u30B8\u30E7\u30D6\u3092\u5B8C\u4E86\u3059\u308B\u307E\u3067\u65B0\u898F\u30EA\u30AF\u30A8\u30B9\u30C8\u306F\u5F85\u6A5F\u3057\u307E\u3059\u3002
jacorb.root-context=\u30CD\u30FC\u30DF\u30F3\u30B0\u30B5\u30FC\u30D3\u30B9\u306E\u30EB\u30FC\u30C8\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8
jacorb.export-corbaloc=\u30EB\u30FC\u30C8\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u3092corbaloc\:\:address\:port/NameService \u3068\u3057\u3066\u30A8\u30AF\u30B9\u30DD\u30FC\u30C8\u3059\u3079\u304D\u304B (on) \u5426\u304B (off) \u3092\u793A\u3057\u307E\u3059\u3002
jacorb.sun=Sun ORB \u3068\u306E\u76F8\u4E92\u904B\u7528\u6027\u3092\u6709\u52B9\u306B\u3059\u308B\u304B (on) \u5426\u304B (off) \u3092\u793A\u3057\u307E\u3059\u3002
jacorb.comet=Comet ORB \u3068\u306E\u76F8\u4E92\u904B\u7528\u6027\u3092\u6709\u52B9\u306B\u3059\u308B\u304B (on) \u5426\u304B (off) \u3092\u793A\u3057\u307E\u3059\u3002
jacorb.iona=IONA ASP \u3068\u306E\u76F8\u4E92\u904B\u7528\u6027\u3092\u6709\u52B9\u306B\u3059\u308B\u304B (on) \u5426\u304B (off) \u3092\u793A\u3057\u307E\u3059\u3002
jacorb.chunk-custom-rmi-valuetypes=\u30AB\u30B9\u30BF\u30E0\u306E RMI valuetype \u3092\u30C1\u30E3\u30F3\u30AF\u3068\u3057\u3066\u30A8\u30F3\u30B3\u30FC\u30C9\u3059\u3079\u304D\u304B (on) \u5426\u304B (off) \u3092\u793A\u3057\u307E\u3059\u3002
jacorb.lax-boolean-encoding=\u975E\u30BC\u30ED CDR \u3067\u30A8\u30F3\u30B3\u30FC\u30C9\u3055\u308C\u305F boolean \u5024\u3092 true \u3068\u89E3\u91C8\u3059\u308B\u304B (on) \u5426\u304B (off) \u3092\u793A\u3057\u307E\u3059\u3002
jacorb.indirection-encoding-disable=\u53CD\u5FA9 typecode \u306B\u5BFE\u3059\u308B\u9593\u63A5\u30A8\u30F3\u30B3\u30FC\u30C7\u30A3\u30F3\u30B0\u3092\u7121\u52B9\u306B\u3059\u308B\u304B (on) \u5426\u304B (off) \u3092\u793A\u3057\u307E\u3059\u3002
jacorb.strict-check-on-tc-creation=create_abstract_interface_tc \u30E1\u30BD\u30C3\u30C9\u304C name \u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u306E\u6709\u52B9\u6027\u30C1\u30A7\u30C3\u30AF\u3092\u5B9F\u884C\u3059\u3079\u304D\u304B (on) \u5426\u304B (off) \u3092\u793A\u3057\u307E\u3059\u3002
jacorb.support-ssl=SSL \u306F\u30B5\u30DD\u30FC\u30C8\u3055\u308C\u3066\u3044\u308B\u304B (on) \u5426\u304B (off) \u3092\u793A\u3057\u307E\u3059\u3002
jacorb.security-domain=SSL \u63A5\u7D9A\u3092\u78BA\u7ACB\u3059\u308B\u306E\u306B\u5229\u7528\u3059\u308B\u30AD\u30FC\u3068\u30C8\u30E9\u30B9\u30C8\u30B9\u30C8\u30A2\u3092\u4FDD\u6301\u3059\u308B\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30C9\u30E1\u30A4\u30F3\u540D
jacorb.add-component-via-interceptor=SSL \u30B3\u30F3\u30DD\u30FC\u30CD\u30F3\u30C8\u304C IOR \u30A4\u30F3\u30BF\u30FC\u30BB\u30D7\u30BF\u30FC\u306B\u3088\u308A\u8FFD\u52A0\u3059\u3079\u304D\u304B (on) \u5426\u304B (off) \u3092\u793A\u3057\u307E\u3059\u3002
jacorb.client-supports=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8 SSL \u306F\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC(None, ServerAuth, ClientAuth, MutualAuth) \u306B\u5BFE\u5FDC\u3057\u3066\u3044\u308B\u304B\u3092\u793A\u3059\u5024
jacorb.client-requires=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8 SSL \u306F\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC(None, ServerAuth, ClientAuth, MutualAuth) \u3092\u5FC5\u8981\u3068\u3057\u3066\u3044\u308B\u304B\u3092\u793A\u3059\u5024
jacorb.server-supports=\u30B5\u30FC\u30D0\u30FC SSL \u306F\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC(None, ServerAuth, ClientAuth, MutualAuth) \u306B\u5BFE\u5FDC\u3057\u3066\u3044\u308B\u304B\u3092\u793A\u3059\u5024
jacorb.server-requires=\u30B5\u30FC\u30D0\u30FC SSL \u306F\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC(None, ServerAuth, ClientAuth, MutualAuth) \u3092\u5FC5\u8981\u3068\u3057\u3066\u3044\u308B\u304B\u3092\u793A\u3059\u5024
jacorb.properties=\u7DCF\u79F0\u30AD\u30FC/\u5024\u306E\u30D7\u30ED\u30D1\u30C6\u30A3\u4E00\u89A7
