jacorb=La configuration du sous-syst\u00E8me JacORB
jacorb.add=Ajoute le sous-syst\u00E8me JacORB
jacorb.remove=Supprime le sous-syst\u00E8me JacORB
jacorb.name=Le nom de l'ORB en cours d'ex\u00E9cution.
jacorb.print-version=Indique si le num\u00E9ro de version doit \u00EAtre imprim\u00E9 au moment du d\u00E9marrage de l'ORB (on) ou non (off).
jacorb.use-imr=Indique si le r\u00E9f\u00E9rentiel de l'impl\u00E9mentation doit \u00EAtre d\u00E9fini (on) ou (off)
jacorb.use-bom=Indique si les indicateurs d'ordre d'octets GIOP 1.2 doivent \u00EAtre utilis\u00E9s ou non.
jacorb.cache-typecodes=Indique si les typecodes doivent \u00EAtre en cache (on) ou non (off)
jacorb.cache-poa-names=Indique si les noms POA doivent \u00EAtre en cache (on) ou non (off)
jacorb.giop-minor-version=La version mineure GIOP \u00E0 utiliser.
jacorb.retries=Le nombre d'essais \u00E0 nouveau si les connexions ne peuvent pas \u00EAtre \u00E9tablies rapidement.
jacorb.retry-interval=L'intervalle entre les essais \u00E0 nouveau (en millisecondes)
jacorb.client-timeout=La valeur du timeout de connexion c\u00F4t\u00E9-client (en millisecondes). Une valeur de z\u00E9ro indique que la connexion ne cesse jamais.
jacorb.server-timeout=La valeur du timeout de connexion c\u00F4t\u00E9-serveur (en millisecondes). Une valeur de z\u00E9ro indique que la connexion ne cesse jamais.
jacorb.max-server-connections=Le nombre maximum de connexions accept\u00E9es par le serveur.
jacorb.max-managed-buf-size=Le log2 de taille maximum g\u00E9r\u00E9 par le gestionnaire du tampon interne.
jacorb.outbuf-size=La taille des tampons de r\u00E9seau pour les messages sortants.
jacorb.outbuf-cache-timeout=Le timeout du cache du tampon en millisecondes.
jacorb.security=Indique si les intercepteurs de s\u00E9curit\u00E9 doivent \u00EAtre install\u00E9s (on) ou non (off).
jacorb.transactions=Indique si les intercepteurs de transactions doivent \u00EAtre install\u00E9s (on ou spec) ou non (off). La valeur 'on' active le JTS tandis que 'spec' active un mode compatible spec (non JTS) qui rej\u00E8te les contextes de transactions entrants.  
jacorb.monitoring=Indique si le monitoring GUI doit aficher (on) ou non (off).
jacorb.queue-wait=Indique si les requ\u00EAtes qui d\u00E9passent la taille de file d'attente maximum doivent \u00EAtre mises en attente (on) ou non (off). Si d\u00E9sactiv\u00E9es, une exception TRANSIENT sera lanc\u00E9e quand la file d'attente est remplie.
jacorb.queue-min=La taille de la file d'attente de notification des requ\u00EAtes en cours. En d'autres mots, les requ\u00EAtes bloqu\u00E9es sont notifi\u00E9es uniquement quand la file d'attente n'a pas plus que \u00ABqueue-min\u00BB requ\u00EAtes.
jacorb.queue-max=Le nombre maximum de requ\u00EAtes qui peuvent \u00EAtre mises en attente.
jacorb.pool-size=La taille du thread-pool du processeur de demande. Les threads qui ont fini de traiter une demande sont replac\u00E9s \u00E0 nouveau dans le pool si le pool n'est pas rempli, ou sinon, ils seront ignor\u00E9s.
jacorb.max-threads=Le nombre maximum de threads de processeur de requ\u00EAte actifs. Les threads tout d'abord du pool, et une fois que le pool est vide, de nouveaux threads seront cr\u00E9\u00E9s jusqu'\u00E0 ce que le nombre de threads atteigne sa limite. Les nouvelles requ\u00EAtes devront attendre jusqu'\u00E0 ce qu'un thread actif termine son travail.
jacorb.root-context=Le contexte root du service de nommage.
jacorb.export-corbaloc=Indique si le contexte root doit \u00EAtre export\u00E9 comme corbaloc\:\:address\:port/NameService (on) ou non (off).
jacorb.sun=Indique si l'interop\u00E9rabilit\u00E9 avec ORB de Sun est activ\u00E9e (on) ou pas (off).
jacorb.comet=Indique si l'interop\u00E9rabilit\u00E9 avec ORB de Comet est activ\u00E9e (on) ou pas (off).
jacorb.iona=Indique si l'interop\u00E9rabilit\u00E9 avec ASP de IONA est activ\u00E9e (on) ou pas (off).
jacorb.chunk-custom-rmi-valuetypes=Indique si les types de valeur RMI personnalis\u00E9s doivent \u00EAtre encod\u00E9s par morceau (on) ou pas (off).
jacorb.lax-boolean-encoding=Indique si une valeur bool\u00E9enne encod\u00E9e CDR non-nulle doit \u00EAtre interpr\u00E9t\u00E9e comme true (on) ou non (off).
jacorb.indirection-encoding-disable=Indique si l'encodage d'indirection des codes de codes qui se r\u00E9p\u00E8tent doivent \u00EAtre (on) ou (off)
jacorb.strict-check-on-tc-creation=Indique si la m\u00E9thode create_abstract_interface_tc doit faire une v\u00E9rification de validation du nom du param\u00E8tre oui (on) or non (off).
jacorb.support-ssl=Indique si SSL doit \u00EAtre support\u00E9 (on) ou non (off)
jacorb.security-domain=Le nom du domaine de s\u00E9curit\u00E9 qui contient les cl\u00E9s et trust stores qui seront utilis\u00E9s pour \u00E9tablir les connexions SSL.
jacorb.add-component-via-interceptor=Indique si les composants SSL doivent \u00EAtre ajout\u00E9s par un intercepteur IOR (on) ou non (off).
jacorb.client-supports=Valeur qui indique les param\u00E8tres qui sont support\u00E9s par le client SSL (None, ServerAuth, ClientAuth, MutualAuth).
jacorb.client-requires=Valeur qui indique les param\u00E8tres qui sont requis par le client SSL (None, ServerAuth, ClientAuth, MutualAuth).
jacorb.server-supports=Valeur qui indique les param\u00E8tres qui sont support\u00E9s par le serveur SSL (None, ServerAuth, ClientAuth, MutualAuth).
jacorb.server-requires=Valeur qui indique les param\u00E8tres qui sont requis par le serveur SSL (None, ServerAuth, ClientAuth, MutualAuth).
jacorb.properties=Une liste de propri\u00E9t\u00E9s de cl\u00E9/valeur g\u00E9n\u00E9rique.
