core.management=Los servicios de administraci\u00F3n utilizados para controlar un servidor o un controlador de hosts del host.
core.management.access=Representaci\u00F3n modelo para la configuraci\u00F3n afectando el control de acceso y la auditor\u00EDa de acceso.
core.management.access.audit=El modelo representando la configuraci\u00F3n de auditor\u00EDa.
core.management.security-realm=Un dominio de seguridad que se puede asociar con una interfaz de administraci\u00F3n y se puede utilizar para controlar el acceso a los servicios de administraci\u00F3n.
core.management.ldap-connection=Una f\u00E1brica de conexiones que un dominio de seguridad puede utilizar para acceder un servidor LDAP como una fuente de autenticaci\u00F3n e informaci\u00F3n de autorizaci\u00F3n.
core.management.management-interface=Interfaces expuestas por los servicios de administraci\u00F3n para permitir que los que realizan las llamadas de manera externa realicen tareas de administraci\u00F3n.
core.management.access-control.is-caller-in-role=Prueba si el que realiza la llamada actualmente es un miembro del rol.
core.access-control=Las definiciones del control de acceso que establecen las restricciones de la administraci\u00F3n de acceso.
core.access-control.provider=El proveedor a utilizar para las decisiones de control de acceso de administraci\u00F3n.
core.access-control.constraint=Restricciones de acceso para la sensibilidad de las expresiones de v\u00E1lvula, clasificaciones de sensibilidad y los recursos de la aplicaci\u00F3n.
core.access-control.permission-combination-policy=La pol\u00EDtica para combinar permisos de control de acceso cuando la pol\u00EDtica de autorizaci\u00F3n le otorga al usuario m\u00E1s de un tipo de permiso para una acci\u00F3n dada. En la pol\u00EDtica de autorizaci\u00F3n basada en roles est\u00E1ndares, esto ocurrir\u00EDa cuando un usuario mapea a m\u00FAltiples roles. La pol\u00EDtica 'permisiva' significa que si alguno de los permisos permite la acci\u00F3n entonces se permite la acci\u00F3n. La pol\u00EDtica de 'rechazo' significa que la existencia de m\u00FAltiples permisos debe generar un error.
core.access-control.standard-role-names=Los nombres oficiales de los roles est\u00E1ndares soportados por el proveedor de control de acceso de administraci\u00F3n actual.
core.access-control.standard-role-names.role=Los nombres oficiales de un rol est\u00E1ndar soportados por el proveedor de control de acceso de administraci\u00F3n actual.
core.access-control.all-role-names=Los nombres oficiales de todos los roles soportados por el proveedor de control de acceso de administraci\u00F3n actual. Esto incluye los roles est\u00E1ndares as\u00ED como los roles definidos por el usuario.
core.access-control.all-role-names.role=Los nombres oficiales de un rol soportados por el proveedor de control de acceso de administraci\u00F3n actual.
core.access-constraint.application-classification=Las restricciones de clasificaci\u00F3n de la aplicaci\u00F3n.
core.access-constraint.vault-expression=Clasificaci\u00F3n de sensibilidad de expresiones de v\u00E1lvula.
core.access-control.constraint.application-classification=Configuraci\u00F3n de las restricciones de clasificaci\u00F3n de la aplicaci\u00F3n.
core.access-control.constraint.application-classification.type=Las clasificaciones de las aplicaciones nombradas agrupadas por el subsistema de restricciones o 'n\u00FAcleo' si proviene del modelo n\u00FAcleo.
core.access-control.constraint.application-classification-config=La configuraci\u00F3n de una restricci\u00F3n de clasificaci\u00F3n de aplicaciones.
core.access-control.constraint.application-classification-config.configured-application=Configurado para sobreescribir el valor predeterminado de si la restricci\u00F3n se considera como un recurso de la aplicaci\u00F3n.
core.access-control.constraint.application-classification-config.default-application=Si los destinos que tienen esta restricci\u00F3n de tipo de aplicaci\u00F3n se consideran como recursos de aplicaciones.
core.access-control.constraint.application-classification-config.applies-to=Informaci\u00F3n sobre los recursos, atributos y operaciones a las cuales aplican esta restricci\u00F3n de clasificaci\u00F3n de aplicaciones.
core.access-control.constraint.application-classification-type=Las restricciones de clasificaci\u00F3n de aplicaciones por tipo. El tipo puede ser 'n\u00FAcleo' o el nombre de un subsistema.
core.access-control.constraint.application-classification-type.classification=Las restricciones de clasificaci\u00F3n de la aplicaci\u00F3n por tipo.
core.access-control.constraint.sensitivity-classification=Las restricciones de clasificaci\u00F3n de la sensibilidad.
core.access-control.constraint.sensitivity-classification.type=Las clasificaciones de las aplicaciones nombradas agrupadas por el subsistema de restricciones o 'n\u00FAcleo' si proviene del modelo n\u00FAcleo.
core.access-control.constraint.sensitivity-classification-config=La configuraci\u00F3n de una restricci\u00F3n de sensibilidad.
core.access-control.constraint.sensitivity-classification-config.configured-requires-addressable=Configurado para sobreescribir el valor predeterminado de si la visibilidad de los recursos anotados con esta restricci\u00F3n de sensibilidad se debe considerar como sensible.
core.access-control.constraint.sensitivity-classification-config.configured-requires-read=Configurado para sobreescribir el valor predeterminado de si la lectura de los atributos anotados con esta restricci\u00F3n de sensibilidad se debe considerar como sensible.
core.access-control.constraint.sensitivity-classification-config.configured-requires-write=Configurado para sobreescribir el valor predeterminado de si los atributos de escritura anotados con esta restricci\u00F3n de sensibilidad se debe considerar como sensible.
core.access-control.constraint.sensitivity-classification-config.default-requires-addressable=Si la visibilidad de los recursos anotados con esta restricci\u00F3n de sensibilidad se debe considerar como sensible.
core.access-control.constraint.sensitivity-classification-config.default-requires-read=Si los atributos de lectura anotados con esta restricci\u00F3n de sensibilidad se deben considerar como sensibles.
core.access-control.constraint.sensitivity-classification-config.default-requires-write=Si los atributos de escritura anotados con esta restricci\u00F3n de sensibilidad se deben considerar como sensibles.
core.access-control.constraint.sensitivity-classification-config.applies-to=Informaci\u00F3n sobre los recursos, atributos y operaciones a las cuales aplican esta restricci\u00F3n de clasificaci\u00F3n de sensibilidad.
core.access-control.constraint.sensitivity-classification-type=Las clasificaciones de sensibilidad por tipo. El tipo puede ser 'n\u00FAcleo' o el nombre de un subsistema.
core.access-control.constraint.sensitivity-classification-type.classification=Las clasificaciones de sensibilidad por tipo
core.access-control.constraint.applies-to=Informaci\u00F3n sobre los recursos, atributos y operaciones a las cuales aplican esta restricci\u00F3n de control de acceso.
core.access-control.constraint.applies-to.address=Patr\u00F3n de direcci\u00F3n que describe un recurso o recursos a los cuales aplican la restricci\u00F3n.
core.access-control.constraint.applies-to.entire-resource=Verdadero si la restricci\u00F3n aplica al recurso en su totalidad; falso si solo aplica a uno a m\u00E1s atributos u operaciones.
core.access-control.constraint.applies-to.attributes=Lista de los nombres de los atributos a los cuales aplican la restricci\u00F3n de manera especifica.
core.access-control.constraint.applies-to.attributes.attribute=Los nombres de un atributo a los cuales aplica la restricci\u00F3n espec\u00EDficamente.
core.access-control.constraint.applies-to.operations=Lista de los nombres de las operaciones a las cuales aplican la restricci\u00F3n de manera especifica.
core.access-control.constraint.applies-to.operations.operation=El nombre de una operaci\u00F3n a la cual aplica la restricci\u00F3n espec\u00EDficamente.
core.access-control.constraint.vault-expression-sensitivity=Configuraci\u00F3n de si las expresiones de v\u00E1lvula ses deben considerar sensibles.
core.access-control.constraint.vault-expression-sensitivity.configured-requires-addressable=Configurado para sobreescribir el valor predeterminado de si la visibilidad de los recursos con expresiones de b\u00F3veda se deben considerar como sensibles.
core.access-control.constraint.vault-expression-sensitivity.configured-requires-read=Configurado para sobreescribir el valor predeterminado de si los atributos de lectura con expresiones de b\u00F3veda se deben considerar como sensibles.
core.access-control.constraint.vault-expression-sensitivity.configured-requires-write=Configurado para sobreescribir el valor predeterminado de si los atributos de escritura con expresiones de b\u00F3veda se deben considerar como sensibles.
core.access-control.constraint.vault-expression-sensitivity.default-requires-addressable=Si la visibilidad de los recursos con expresiones de b\u00F3veda se debe considerar como sensible.
core.access-control.constraint.vault-expression-sensitivity.default-requires-read=Si los atributos de lectura con expresiones de b\u00F3veda se deben considerar como sensibles.
core.access-control.constraint.vault-expression-sensitivity.default-requires-write=Si los atributos de escritura con expresiones de b\u00F3veda se deben considerar como sensibles.
core.access-control.host-scoped-roles=Roles con \u00E1mbito de host a nivel de dominio a los cuales este host se debe agregar como un host v\u00E1lido
core.access-control.host-scoped-roles.role=Roles con \u00E1mbito de host a los cuales este host se debe agregar como un host v\u00E1lido
core.access-control.server-group-scoped-role=Roles administrativos basados en roles est\u00E1ndares pero est\u00E1n limitados aun grupo particular de grupos de servidor de dominio administrado
core.access-control.server-group-scoped-role.base-role=El rol est\u00E1ndar bajo el cual se basa el rol de \u00E1mbito de grupos de servidores
core.access-control.server-group-scoped-role.server-groups=La lista de grupos de servidores de nombres a los cuales est\u00E1n limitados los usuarios en este rol
core.access-control.server-group-scoped-role.server-groups.server-group=Un grupo de servidores al cual est\u00E1 limitado el usuario en este rol
core.access-control.server-group-scoped-role.add=Agrega un nuevo rol de \u00E1mbito de grupo de servidores
core.access-control.server-group-scoped-role.remove=Borra un rol de \u00E1mbito de grupo de servidores
core.access-control.host-scoped-role=Roles administrativos basados en roles est\u00E1ndares pero est\u00E1n limitados a un grupo particular de hosts de dominio administrados
core.access-control.host-scoped-role.base-role=El rol est\u00E1ndar bajo el cual se basa el rol de \u00E1mbito de host
core.access-control.host-scoped-role.hosts=La lista de hosts de nombres a los cuales est\u00E1n limitados los usuarios en este rol
core.access-control.host-scoped-role.hosts.host=Un host al cual est\u00E1 limitado el usuario en este rol
core.access-control.host-scoped-role.add=Agrega un nuevo rol de \u00E1mbito de host
core.access-control.host-scoped-role.remove=Borra un rol de \u00E1mbito de host
core.access-control.role-mapping=Un mapeo de usuarios y grupos a un rol espec\u00EDfico.
core.access-control.role-mapping.add=Agregar una nueva definici\u00F3n de mapeo de roles
core.access-control.role-mapping.remove=Borrar una definici\u00F3n de mapeo de roles existente.
core.access-control.role-mapping.include-all=Config\u00FArelo si todos los usuarios autenticados se deben asignar autom\u00E1ticamente este rol.
core.access-control.role-mapping.exclude=Los principales que se deben excluir de un rol.
core.access-control.role-mapping.include=Los principales que se deben incluir en un rol.
core.access-control.role-mapping.principal=Un principal individual utilizado dentro del mapeo de roles.
core.access-control.role-mapping.principal.add=Agregar un nuevo principal al mapeo de roles.
core.access-control.role-mapping.principal.remove=Borrar un principal existente al mapeo de roles.
core.access-control.role-mapping.principal.type=El tipo del principal que se est\u00E1 mapeando ya sea 'grupo' o 'usuario'.
core.access-control.role-mapping.principal.realm=Un atributo opcional a mapear con base en el dominio utilizado para la autenticaci\u00F3n.
core.access-control.role-mapping.principal.name=El nombre del usuario o grupo que se est\u00E1 mapeando.
core.management.audit-log=El recurso a nivel superior de registro de auditor\u00EDa de administraci\u00F3n.
core.management.audit-log.add=Agrega el recurso a nivel superior de auditor\u00EDa de administraci\u00F3n.
core.management.audit-log.remove=Borra el recurso a nivel superior de auditor\u00EDa de administraci\u00F3n.
core.management.audit-log.logger=El servicio de registro de auditor\u00EDa de administraci\u00F3n.
core.management.audit-log.logger.add=Agrega el servicio de registro de auditor\u00EDa de administraci\u00F3n.
core.management.audit-log.logger.remove=Borra el servicio de registro de auditor\u00EDa de administraci\u00F3n.
core.management.audit-log.server-logger=El servicio de registro de auditor\u00EDa de administraci\u00F3n para uso en los servidores administrados.
core.management.audit-log.server-logger.add=Agrega el servicio de registro de auditor\u00EDa de administraci\u00F3n para uso en los servidores administrados.
core.management.audit-log.server-logger.remove=Borra el servicio de registro de auditor\u00EDa de administraci\u00F3n para uso en los servidores administrados.
core.management.audit-log.log-boot=Si las operaciones se deben registrar en el arranque del servidor.
core.management.audit-log.log-read-only=Si se deben registrar las operaciones que no modifican la configuraci\u00F3n o los servicios en tiempo de ejecuci\u00F3n.
core.management.audit-log.enabled=Si el registro de auditor\u00EDa est\u00E1 activado.
core.management.audit-log.handler=Referencias a los agregadores de registros de auditor\u00EDa syslog o archivos.
core.management.audit-log.handler-reference=Una referencia a un archivo un controlador de registro de auditor\u00EDa syslog. El nombre del controlador se denota por el valor de la direcci\u00F3n.
core.management.audit-log.handler-reference.add=Agrega una referencia a un archivo o un controlador de registros de auditor\u00EDa syslog.
core.management.audit-log.handler-reference.remove=Borra una referencia a un archivo o un controlador de registros de auditor\u00EDa syslog.
core.management.audit-log.json-formatter=Formateadores para formatear los mensajes de registro de auditor\u00EDa usando json.
core.management.audit-log.file-handler=Controladores de archivos a utilizar con el servicio de registro de auditor\u00EDa de administraci\u00F3n.
core.management.audit-log.syslog-handler=Controladores syslog a utilizar con el servicio de registro de auditor\u00EDa de administraci\u00F3n.
core.management.file-handler=Un controlador de archivos a utilizar con el servicio de registro de auditor\u00EDa de administraci\u00F3n.
core.management.file-handler.add=Agrega un controlador de archivos de registro de auditor\u00EDa.
core.management.file-handler.remove=Borra un controlador de archivos de registro de auditor\u00EDa.
core.management.file-handler.disabled-due-to-failure=Si este controlador se desactiv\u00F3 debido a fallas de registro.
core.management.file-handler.failure-count=El n\u00FAmero de fallos de registro desde que se inicializ\u00F3 en controlador.
core.management.file-handler.formatter=El formateador utilizado para formatear los mensajes de registro.
core.management.file-handler.max-failure-count=El n\u00FAmero m\u00E1ximo de fallos de registro antes de desactivar este controlador.
core.management.file-handler.path=La ruta del archivo de registro de auditor\u00EDa.
core.management.file-handler.recycle=Re-establece el conteo de fallos del controlador de archivos y realiza una copia de seguridad del archivo de registro actual.
core.management.file-handler.relative-to=El nombre de otra ruta nombrada previamente o de una de las rutas est\u00E1ndar que el sistema proporciona. Si se proporciona un 'relativo-a' entonces el valor del atributo 'ruta' se trata como relativo a la ruta especificada por este atributo.
core.management.file-handler.server-path=La 'ruta' sobreescrita del archivo de registro de auditor\u00EDa a utilizar al configurar el controlador para los servidores administrados.
core.management.file-handler.server-relative-to=El 'relativo-a' sobreescrito del archivo de registro de auditor\u00EDa utilizado para configurar el controlador para los servidores administrados. El nombre de otra ruta nombrada previamente o de una de las rutas est\u00E1ndar que el sistema proporciona. Si se proporciona un 'relativo-a' entonces el valor del atributo 'ruta' se trata como relativo a la ruta especificada por este atributo.
core.management.json-formatter=Un formateador json para los mensajes de registro de auditor\u00EDa.
core.management.json-formatter.add=Agrega un formateador json para el registro de auditor\u00EDa.
core.management.json-formatter.remove=Borra un formateador json para el registro de auditor\u00EDa.
core.management.json-formatter.compact=Si es verdadero entonces le dar\u00E1 formato al JSON en una l\u00EDnea. Puede que hayan valores con nuevas l\u00EDneas, as\u00ED que si es importante tener todo el registro en una l\u00EDnea entonces establezca escape-new-line o escape-control-characters como verdaderos.
core.management.json-formatter.date-format=El formato de la fecha a utilizar tal como la entiende {@link java.text.SimpleDateFormat}. Se ignorar\u00E1 si include-date\="false".
core.management.json-formatter.date-separator=El separador entre la fecha y el resto del mensaje de registro formateado. Se ignorar\u00E1 si include-date\="false".
core.management.json-formatter.escape-control-characters=Si es verdaderon entonces escapar\u00E1 todos los caracteres de control (las entradas ascii con un valor decimal < 32) con el c\u00F3digo ascii en octal, por ejemplo,'\n becomes '\#012'. If this is true, it will override escape-new-line\="false".
core.management.json-formatter.escape-new-line=Si es verdadero escapar\u00E1 todas las nuevas l\u00EDneas con el c\u00F3digo ascii en octal, por ejemplo, "\#012".
core.management.json-formatter.include-date=Si debe incluir o no la fecha en el registro formateado.
core.management.syslog-handler=Un controlador syslog a utilizar con el servicio de registro de auditor\u00EDa de administraci\u00F3n.
core.management.syslog-handler.add=Agrega un controlador de syslog de registros de auditor\u00EDa.
core.management.syslog-handler.remove=Borra un controlador syslog de registro de auditor\u00EDa.
core.management.syslog-handler.app-name=El nombre de la aplicaci\u00F3n a agregar a los registros syslog tal como se define en la secci\u00F3n 6.2.5 de RFC-5424. Si no se especifica utilizar\u00E1 por defecto el nombre del producto.
core.management.syslog-handler.disabled-due-to-failure=Si este controlador se desactiv\u00F3 debido a fallas de registro.
core.management.syslog-handler.failure-count=El n\u00FAmero de fallos de registro desde que se inicializ\u00F3 el controlador.
core.management.syslog-handler.facility=El servicio a utilizar para el registro syslog tal como se define en la secci\u00F3n 6.2.1 de RFC-5424 y la secci\u00F3n 4.1.1 de RFC-3164.
core.management.syslog-handler.formatter=El formateador utilizado para formatear los mensajes de registro.
core.management.syslog-handler.max-failure-count=El n\u00FAmero m\u00E1ximo de fallos de registro antes de desactivar este controlador.
core.management.syslog-handler.max-length=La longitud m\u00E1xima en bytes que se le permite a un mensaje de registro, incluyendo el encabezado. Si no est\u00E1 definido, por defecto ser\u00E1 1024 si el formato syslog es RFC3164 o 2048 bytes si el formato syslog es RFC5424.
core.management.syslog-handler.truncate=Si un mensaje, incluyendo el encabezado, debe truncar el mensaje si la longitud en bytes es mayor que la longitud m\u00E1xima. Si se configura como falso entonces los mensajes se dividir\u00E1n y se enviar\u00E1n con los mismos valores de encabezado.
core.management.syslog-handler.syslog-format=Si se debe configurar el formato syslog con el especificado en RFC-5424 o RFC-3164.
core.management.syslog-handler.protocol=El protocolo a utilizar para el controlador syslog. Debe ser solo uno\: 'udp', 'tcp' o 'tls'.
core.management.syslog-handler.recycle=Reestablece el conteo de fallos del controlador syslog, desconecta y reconecta al servidor syslog.
core.management.syslog-client-cert-store=Configuraci\u00F3n para el almac\u00E9n de llaves que contiene el certificado del cliente si el servidor syslog requiere autenticaci\u00F3n.
core.management.syslog-client-cert-store.add=Agrega la configuraci\u00F3n del almac\u00E9n de llaves.
core.management.syslog-client-cert-store.remove=Borra la configuraci\u00F3n del almac\u00E9n de llaves.
core.management.syslog-client-cert-store.key-password=La contrase\u00F1a para la llave del almac\u00E9n de llaves.
core.management.syslog-client-cert-store.keystore-password=La contrase\u00F1a para el almac\u00E9n de llaves.
core.management.syslog-client-cert-store.keystore-path=\=La ruta del almac\u00E9n de llaves.
core.management.syslog-client-cert-store.keystore-relative-to=El nombre de otra ruta nombrada previamente o de una de las rutas est\u00E1ndar que el sistema proporciona. Si se proporciona un 'almac\u00E9n de llaves-relativo-a' entonces el valor del atributo 'ruta-almac\u00E9n de llaves' se trata como relativo a la ruta especificada por este atributo.
core.management.syslog-client-cert-store.server-keystore-path=La 'ruta-almac\u00E9n de llaves' sobreescrita del archivo de registro de auditor\u00EDa a utilizar al configurar el controlador para los servidores administrados.
core.management.syslog-client-cert-store.server-keystore-relative-to=El 'almac\u00E9n de llaves-relativo-a' sobreescrito del archivo de registro de auditor\u00EDa utilizado para configurar el controlador para los servidores administrados. El nombre de otra ruta nombrada previamente o de una de las rutas est\u00E1ndar que el sistema proporciona. Si se proporciona un 'almac\u00E9n de llaves-relativo-a' entonces el valor del atributo 'ruta-almac\u00E9n de llaves' se trata como relativo a la ruta especificada por este atributo.
core.management.syslog-truststore=Configuraci\u00F3n para el almac\u00E9n de confianza para el certificado del servidor, si no est\u00E1 firmado por una autoridad.
core.management.syslog-truststore.add=Agrega la configuraci\u00F3n del almac\u00E9n de confianza.
core.management.syslog-truststore.remove=Borra la configuraci\u00F3n del almac\u00E9n de confianza.
core.management.syslog-truststore.key-password=La contrase\u00F1a para la llave del almac\u00E9n de confianza.
core.management.syslog-truststore.keystore-password=La contrase\u00F1a para el almac\u00E9n de confianza.
core.management.syslog-truststore.keystore-path=\=La ruta del almacenamiento de confianza.
core.management.syslog-truststore.keystore-relative-to=El nombre de otra ruta nombrada previamente o de una de las rutas est\u00E1ndar que el sistema proporciona. Si se proporciona un 'almac\u00E9n de llaves-relativo-a' entonces el valor del atributo 'ruta-almac\u00E9n de llaves' se trata como relativo a la ruta especificada por este atributo.
core.management.syslog-truststore.server-keystore-path=La 'ruta-almac\u00E9n de llaves' sobreescrita del archivo de registro de auditor\u00EDa a utilizar al configurar el controlador para los servidores administrados.
core.management.syslog-truststore.server-keystore-relative-to=El 'almac\u00E9n de llaves-relativo-a' sobreescrito del archivo de registro de auditor\u00EDa utilizado para configurar el controlador para los servidores administrados. El nombre de otra ruta nombrada previamente o de una de las rutas est\u00E1ndar que el sistema proporciona. Si se proporciona un 'almac\u00E9n de llaves-relativo-a' entonces el valor del atributo 'ruta-almac\u00E9n de llaves' se trata como relativo a la ruta especificada por este atributo.
core.management.syslog-udp=Configuraci\u00F3n a agregar a syslog a trav\u00E9s de udp/ip.
core.management.syslog-udp.add=Agregar el protocolo udp syslog.
core.management.syslog-udp.remove=Borrar el protocolo udp syslog.
core.management.syslog-udp.host=El host del servidor syslog para las peticiones udp.
core.management.syslog-udp.port=El puerto del servidor syslog para las peticiones udp.
core.management.syslog-tcp=Configuraci\u00F3n a agregar a syslog a trav\u00E9s de tcp/ip.
core.management.syslog-tcp.add=Agregar el protocolo tcp syslog.
core.management.syslog-tcp.remove=Borrar el protocolo tcp syslog.
core.management.syslog-tcp.host=El host del servidor syslog para las peticiones tcp.
core.management.syslog-tcp.message-transfer=La configuraci\u00F3n de transferencia del mensaje tal como se describe en la secci\u00F3n 3.4 de RFC-6587. Puede ser OCTET_COUNTING tal como se describe en la secci\u00F3n 3.4.1 de RFC-6587 o NON_TRANSPARENT_FRAMING como se describe en la secci\u00F3n 3.4.1 de RFC-6587. Vea la documentaci\u00F3n de su proveedor syslog para ver lo que se soporta.
core.management.syslog-tcp.port=El puerto del servidor syslog para las peticiones tcp.
core.management.syslog-tls.add=Agregar el syslog tls a trav\u00E9s del protocolo tcp/ip.
core.management.syslog-tls.remove=Borrar el syslog tls a trav\u00E9s del protocolo tcp/ip.
core.management.syslog-tls=Configuraci\u00F3n a agregar a syslog a trav\u00E9s de tls por medio de tcp/ip.
core.management.syslog-tls.host=El host del servidor syslog para el tls a trav\u00E9s de peticiones tcp.
core.management.syslog-tls.message-transfer=La configuraci\u00F3n de transferencia del mensaje tal como se describe en la secci\u00F3n 3.4 de RFC-6587. Puede ser OCTET_COUNTING tal como se describe en la secci\u00F3n 3.4.1 de RFC-6587 o NON_TRANSPARENT_FRAMING como se describe en la secci\u00F3n 3.4.1 de RFC-6587. Vea la documentaci\u00F3n de su proveedor syslog para ver lo que se soporta.
core.management.syslog-tls.port=El puerto del servidor syslog para el tls a trav\u00E9s de peticiones tcp.
core.management.syslog-tls.authentication=Configuraci\u00F3n para el almac\u00E9n de confianza para el certificado del servidor si no es firmado por una autoridad y el almac\u00E9n de llaves que contiene el certificado del cliente si el servidor syslog se configura para requerir autenticaci\u00F3n del cliente.
