core.management=Os servi\u00E7os de gerenciamento usados para controlar o servidor aut\u00F4nomo ou um controlador do host.
core.management.access=A representa\u00E7\u00E3o para a configura\u00E7\u00E3o afetando o controle de acesso e a auditoria de acesso.
core.management.access.audit=O modelo representando a configura\u00E7\u00E3o de auditoria.
core.management.security-realm=O realm de seguran\u00E7a que pode ser associado com a interface de gerenciamento e usado para controlar o acesso aos servi\u00E7os de gerenciamento.
core.management.ldap-connection=A cria\u00E7\u00E3o da conex\u00E3o que pode ser usada pelo realm de seguran\u00E7a para acesso de um servidor LDAP como uma fonte de informa\u00E7\u00E3o de autentica\u00E7\u00E3o e autoriza\u00E7\u00E3o.
core.management.management-interface=As interfaces expostas pelos servi\u00E7os de gerenciamento para permitir chamadores externos executarem tarefas de gerenciamento.
core.management.access-control.is-caller-in-role=Teste se o chamador atual \u00E9 um membro da fun\u00E7\u00E3o.
core.access-control=As defini\u00E7\u00F5es do controle de acesso definindo o acesso das restri\u00E7\u00F5es de gerenciamento de acesso.
core.access-control.provider=O provedor para uso das decis\u00F5es do controle de acesso.
core.access-control.constraint=As restri\u00E7\u00F5es de acesso para a sensibilidade das express\u00F5es de vault, classifica\u00E7\u00F5es de sensibilidade e recursos do aplicativo. 
core.access-control.permission-combination-policy=A pol\u00EDtica para combina\u00E7\u00E3o do controle de acesso quando a pol\u00EDtica de autoriza\u00E7\u00E3o concede ao usu\u00E1rio mais de um tipo de permiss\u00E3o para uma a\u00E7\u00E3o gerada. Na pol\u00EDtica de autoriza\u00E7\u00E3o baseada na fun\u00E7\u00E3o padr\u00E3o, isto ocorreria quando o usu\u00E1rio mapeia fun\u00E7\u00F5es m\u00FAltiplas. A pol\u00EDtica 'permissive' significa que se qualquer uma das permiss\u00F5es permitir a a\u00E7\u00E3o, a a\u00E7\u00E3o ser\u00E1 permitida. A pol\u00EDtica 'rejecting' significa a exist\u00EAncia de permiss\u00F5es m\u00FAltiplas devem resultar num erro.
core.access-control.standard-role-names=Os nomes oficiais das fun\u00E7\u00F5es suportadas pelo provedor do controle de acesso do gerenciamento atual.
core.access-control.standard-role-names.role=Os nomes oficiais de uma fun\u00E7\u00E3o padr\u00E3o suportada pelo provedor do controle de acesso do gerenciamento atual.
core.access-control.all-role-names=Os nomes oficiais de todas as fun\u00E7\u00F5es suportadas pelo provedor do controle de acesso de gerenciamento atual. Isto inclui quaisquer fun\u00E7\u00F5es padr\u00F5es assim como quaisquer fun\u00E7\u00F5es user-defined.
core.access-control.all-role-names.role=Os nomes oficiais de uma fun\u00E7\u00E3o suportada pelo provedor do controle de acesso do gerenciamento atual.
core.access-constraint.application-classification=As restri\u00E7\u00F5es da classifica\u00E7\u00E3o do aplicativo.
core.access-constraint.vault-expression=A classifica\u00E7\u00E3o das express\u00F5es do vault.
core.access-control.constraint.application-classification=A configura\u00E7\u00E3o das restri\u00E7\u00F5es de classifica\u00E7\u00E3o do aplicativo.
core.access-control.constraint.application-classification.type=As classifica\u00E7\u00F5es do aplicativo nomeado agrupado pelo subsistema da restri\u00E7\u00E3o ou 'core', caso isto venha de um modelo core.
core.access-control.constraint.application-classification-config=A configura\u00E7\u00E3o das restri\u00E7\u00F5es de classifica\u00E7\u00E3o do aplicativo.
core.access-control.constraint.application-classification-config.configured-application=Determinado para substituir o padr\u00E3o se \u00E9 que a restri\u00E7\u00E3o seja considerada um recurso do aplicativo.
core.access-control.constraint.application-classification-config.default-application=Se \u00E9 que os destinos com esta restri\u00E7\u00E3o de tipo de aplicativo s\u00E3o considerados recursos do aplicativo.
core.access-control.constraint.application-classification-config.applies-to=A informa\u00E7\u00E3o sobre os recursos, atributos e opera\u00E7\u00F5es pelas quais esta restri\u00E7\u00E3o de classifica\u00E7\u00E3o do aplicativo \u00E9 aplicada.
core.access-control.constraint.application-classification-type=As restri\u00E7\u00F5es de classifica\u00E7\u00E3o do aplicativo pelo tipo. O tipo \u00E9 tanto 'core' ou o nome do subsistema.
core.access-control.constraint.application-classification-type.classification=As restri\u00E7\u00F5es da classifica\u00E7\u00E3o do aplicativo pelo tipo.
core.access-control.constraint.sensitivity-classification=As restri\u00E7\u00F5es da classifica\u00E7\u00E3o sens\u00EDveis.
core.access-control.constraint.sensitivity-classification.type=As classifica\u00E7\u00F5es do aplicativo nomeado agrupado pelo subsistema da restri\u00E7\u00E3o ou 'core', caso isto venha de um modelo core.
core.access-control.constraint.sensitivity-classification-config=A configura\u00E7\u00E3o de uma restri\u00E7\u00E3o sens\u00EDvel.
core.access-control.constraint.sensitivity-classification-config.configured-requires-addressable=Determinado para substituir o padr\u00E3o sendo que a sensibilidade de recursos anotados com esta restri\u00E7\u00E3o de sensibilidade deve ser consider\u00E1vel sens\u00EDvel.
core.access-control.constraint.sensitivity-classification-config.configured-requires-read=Determinado para substituir o padr\u00E3o sendo que os atributos de leitura anotados com esta restri\u00E7\u00E3o de sensibilidade deve ser consider\u00E1vel sens\u00EDvel.
core.access-control.constraint.sensitivity-classification-config.configured-requires-write=Determinado para substituir o padr\u00E3o sendo que os atributos de grava\u00E7\u00E3o anotados com esta restri\u00E7\u00E3o de sensibilidade deve ser consider\u00E1vel sens\u00EDvel.
core.access-control.constraint.sensitivity-classification-config.default-requires-addressable=Se \u00E9 que a sensibilidade de recursos anotados com esta restri\u00E7\u00E3o de sensibilidade deve ser consider\u00E1vel sens\u00EDvel.
core.access-control.constraint.sensitivity-classification-config.default-requires-read=Se \u00E9 que os atributos de leitura anotados com esta restri\u00E7\u00E3o de sensibilidade deve ser consider\u00E1vel sens\u00EDvel.
core.access-control.constraint.sensitivity-classification-config.default-requires-write=Se \u00E9 que os atributos de grava\u00E7\u00E3o anotados com esta restri\u00E7\u00E3o de sensibilidade deve ser consider\u00E1vel sens\u00EDvel.
core.access-control.constraint.sensitivity-classification-config.applies-to=A informa\u00E7\u00E3o sobre os recursos, atributos e opera\u00E7\u00F5es pelos quais esta restri\u00E7\u00E3o de classifica\u00E7\u00E3o sens\u00EDvel \u00E9 aplicada. 
core.access-control.constraint.sensitivity-classification-type=As classifica\u00E7\u00F5es de sensibilidade pelo tipo. Digitar \u00E9 tanto 'core' ou o nome do subsistema.
core.access-control.constraint.sensitivity-classification-type.classification=As classifica\u00E7\u00F5es de sensibilidade pelo tipo
core.access-control.constraint.applies-to=A informa\u00E7\u00E3o sobre os recursos, atributos e opera\u00E7\u00F5es pelos quais esta restri\u00E7\u00E3o de controle de acesso sens\u00EDvel \u00E9 aplicada. 
core.access-control.constraint.applies-to.address=O padr\u00E3o de endere\u00E7o descrito a um recurso ou recursos pelos quais as restri\u00E7\u00F5es s\u00E3o aplicadas.
core.access-control.constraint.applies-to.entire-resource=Verdadeiro caso as restri\u00E7\u00F5es forem aplicadas ao recurso como um todo. Falso caso elas sejam aplicadas a um ou mais atributos ou opera\u00E7\u00F5es.
core.access-control.constraint.applies-to.attributes=Lista dos nomes dos atributos pelos quais a restri\u00E7\u00E3o \u00E9 especificamente aplicada.
core.access-control.constraint.applies-to.attributes.attribute=Os nomes de um atributo pelo qual a restri\u00E7\u00E3o \u00E9 especificamente aplicada.
core.access-control.constraint.applies-to.operations=Lista dos nomes das opera\u00E7\u00F5es pelas quais a restri\u00E7\u00E3o \u00E9 especificamente aplicada.
core.access-control.constraint.applies-to.operations.operation=O nome de uma opera\u00E7\u00E3o pela qual a restri\u00E7\u00E3o \u00E9 aplicada.
core.access-control.constraint.vault-expression-sensitivity=A configura\u00E7\u00E3o se \u00E9 que as express\u00F5es vault devem ser consideradas sens\u00EDveis.
core.access-control.constraint.vault-expression-sensitivity.configured-requires-addressable=Determinado para substituir o padr\u00E3o sendo que a sensibilidade de recursos contendo express\u00F5es vault devem ser considerados sens\u00EDveis.
core.access-control.constraint.vault-expression-sensitivity.configured-requires-read=Determinado para substituir o padr\u00E3o sendo que os atributos de leitura contendo express\u00F5es vault devem ser considerados sens\u00EDveis.
core.access-control.constraint.vault-expression-sensitivity.configured-requires-write=Determinado para substituir o padr\u00E3o sendo que os atributos de grava\u00E7\u00E3o contendo express\u00F5es vault devem ser considerados sens\u00EDveis.
core.access-control.constraint.vault-expression-sensitivity.default-requires-addressable=Se \u00E9 que a sensibilidade de recursos contendo express\u00F5es vault devem ser considerados sens\u00EDveis.
core.access-control.constraint.vault-expression-sensitivity.default-requires-read=Se \u00E9 que os atributos e leitura contendo as express\u00F5es vault deved ser considerados sens\u00EDveis.
core.access-control.constraint.vault-expression-sensitivity.default-requires-write=Se \u00E9 que os atributos de grava\u00E7\u00E3o contendo as express\u00F5es vault devem ser considerados sens\u00EDveis.
core.access-control.host-scoped-roles=As fun\u00E7\u00F5es com escopo do host de domain pelas quais este host deve ser adicionado como um host v\u00E1lido.
core.access-control.host-scoped-roles.role=As fun\u00E7\u00F5es com escopo de host pelas quais este host devem ser adicionadas como um host v\u00E1lido
core.access-control.server-group-scoped-role=As fun\u00E7\u00F5es administrativas que s\u00E3o baseadas nas fun\u00E7\u00F5es padr\u00F5es, por\u00E9m s\u00E3o restringidas a um conjunto particular de grupos de servidor de domain gerenciado
core.access-control.server-group-scoped-role.base-role=A fun\u00E7\u00E3o padr\u00E3o pela qual o erver-group-scoped-role \u00E9 baseada
core.access-control.server-group-scoped-role.server-groups=A lista de nomes dos grupos do servidor pela qual estes servidores nesta fun\u00E7\u00E3o s\u00E3o restringidos
core.access-control.server-group-scoped-role.server-groups.server-group=O grupo do servidor pelo qual o usu\u00E1rio nesta fun\u00E7\u00E3o \u00E9 restringindo
core.access-control.server-group-scoped-role.add=Adiciona um novo server-group-scoped-role
core.access-control.server-group-scoped-role.remove=Remove o server-group-scoped-role
core.access-control.host-scoped-role=As fun\u00E7\u00F5es administrativas que s\u00E3o baseadas nas fun\u00E7\u00F5es padr\u00F5es mas s\u00E3o restringidas a um conjunto particular de hosts de domain gerenciado
core.access-control.host-scoped-role.base-role=A fun\u00E7\u00E3o padr\u00E3o pela qual o host-scoped-role \u00E9 baseado
core.access-control.host-scoped-role.hosts=A lista de nomes pela qual esses usu\u00E1rios nesta fun\u00E7\u00E3o s\u00E3o restringidos
core.access-control.host-scoped-role.hosts.host=O host pelo qual o usu\u00E1rio nesta fun\u00E7\u00E3o \u00E9 restringido
core.access-control.host-scoped-role.add=Adiciona um novo host-scoped-role
core.access-control.host-scoped-role.remove=Remove um novo host-scoped-role
core.access-control.role-mapping=O mapeamento de usu\u00E1rios e grupos a uma fun\u00E7\u00E3o espec\u00EDfica.
core.access-control.role-mapping.add=Adicionar uma nova defini\u00E7\u00E3o de mapeamento de fun\u00E7\u00E3o.
core.access-control.role-mapping.remove=Remover uma defini\u00E7\u00E3o de mapeamento de fun\u00E7\u00E3o existente.
core.access-control.role-mapping.include-all=Configurar se todos os usu\u00E1rios autenticados devem ser automaticamente determinados a esta fun\u00E7\u00E3o.
core.access-control.role-mapping.exclude=Principais a serem exclu\u00EDdos da fun\u00E7\u00E3o.
core.access-control.role-mapping.include=Principais a serem inclu\u00EDdos \u00E0 fun\u00E7\u00E3o.
core.access-control.role-mapping.principal=O principal individual usado com o mapeamento da fun\u00E7\u00E3o.
core.access-control.role-mapping.principal.add=Adicionar um novo principal ao mapeamento da fun\u00E7\u00E3o.
core.access-control.role-mapping.principal.remove=Remover um principal existente ao mapeamento da fun\u00E7\u00E3o.
core.access-control.role-mapping.principal.type=O tipo de Principal sendo mapeado, tanto 'group' ou 'user'.
core.access-control.role-mapping.principal.realm=Um atributo principal a ser mapeado baseado no realm usado para a autentica\u00E7\u00E3o.
core.access-control.role-mapping.principal.name=O nome do grupo ou usu\u00E1rio sendo mapeado.
core.management.audit-log=O recurso de n\u00EDvel superior de logging \u00E0 auditoria de gerenciamento.
core.management.audit-log.add=Adiciona o recurso de n\u00EDvel superior de auditoria de gerenciamento.
core.management.audit-log.remove=Remove o recurso de n\u00EDvel superior de auditoria de gerenciamento.
core.management.audit-log.logger=O servi\u00E7o de logging de auditoria de gerenciamento.
core.management.audit-log.logger.add=Adiciona o servi\u00E7o de logging de auditoria de gerenciamento.
core.management.audit-log.logger.remove=Remove o servi\u00E7o de logging de auditoria de gerenciamento.
core.management.audit-log.server-logger=O servi\u00E7o de logging de auditoria de gerenciamento para uso nos servidores gerenciados.
core.management.audit-log.server-logger.add=Adiciona o servi\u00E7o de logging de auditoria de gerenciamento para uso dos servidores gerenciados.
core.management.audit-log.server-logger.remove=Remove o servi\u00E7o de logging de auditoria de gerenciamento para uso nos servidores gerenciados.
core.management.audit-log.log-boot=Se \u00E9 que as opera\u00E7\u00F5es devem ser registradas no boot do servidor.
core.management.audit-log.log-read-only=Se \u00E9 que as opera\u00E7\u00F5es que n\u00E3o modificam a configura\u00E7\u00E3o ou quaisquer servi\u00E7os devem ser registradas.
core.management.audit-log.enabled=Se \u00E9 que o logging de auditoria est\u00E1 habilitado.
core.management.audit-log.handler=Referencia ao arquivo ou anexos de log de auditoria syslog.
core.management.audit-log.handler-reference=A refer\u00EAncia a um arquivo ou manuseador de log de auditoria syslog. O nome do manuseador \u00E9 denotado pelo valor do endere\u00E7o.
core.management.audit-log.handler-reference.add=Adiciona a refer\u00EAncia a um arquivo ou manuseador de log de auditoria syslog.
core.management.audit-log.handler-reference.remove=Remove uma refer\u00EAncia a um arquivo ou manuseador de log de auditoria syslog.
core.management.audit-log.json-formatter=Formatadores para a formata\u00E7\u00E3o de mensagens de log de auditoria usando o json.
core.management.audit-log.file-handler=Manuseadores de arquivo para uso com o servi\u00E7o de logging de auditoria de gerenciamento.
core.management.audit-log.syslog-handler=Os manuseadores syslog para uso com o servi\u00E7o de logging de auditoria de gerenciamento.
core.management.file-handler=O manuseador de arquivo para uso como o servi\u00E7o de logging de auditoria de gerenciamento.
core.management.file-handler.add=Adiciona o manuseador do arquivo log de auditoria.
core.management.file-handler.remove=Remove o manuseador do arquivo de log de auditoria.
core.management.file-handler.disabled-due-to-failure=Se \u00E9 que este manuseador foi desabilitado devido \u00E0s falhas de logging.
core.management.file-handler.failure-count=O n\u00FAmero de falhas de logging desde que o manuseador foi inicializado.
core.management.file-handler.formatter=O formatador usado para formatar as mensagens de log.
core.management.file-handler.max-failure-count=O n\u00FAmero m\u00E1ximo de falhas de logging antes de desabilitar este manuseador.
core.management.file-handler.path=O caminho do arquivo de log de auditoria.
core.management.file-handler.recycle=Reinicia a contagem de falha do manuseador do arquivo e realiza o back-up do arquivo de log existente.
core.management.file-handler.relative-to=O nome de outro caminho nomeado anteriormente, ou de um dos caminhos padr\u00F5es fornecidos pelo sistema. Caso 'relative-to' seja fornecido, o valor do atributo 'caminho' \u00E9 tratado como relativo ao caminho especificado por esse atributo.
core.management.file-handler.server-path=O 'path' substitu\u00EDdo do arquivo de log de auditoria a ser usado pelo manuseador para os servidores gerenciados.
core.management.file-handler.server-relative-to=O 'relative-to' substitu\u00EDdo do arquivo de log de auditoria a ser usado na configura\u00E7\u00E3o do manuseador para os servidores gerenciados. O nome de outro caminho nomeado previamente, ou um dos caminhos padr\u00F5es fornecidos pelo sistema. Caso o 'relative-to' seja fornecido, o valor do atributo 'path' \u00E9 tratado como relativo ao caminho especificado por este atributo.
core.management.json-formatter=O formatador jso para as mensagens de log de auditoria.
core.management.json-formatter.add=Adiciona um formatador json para o logging de auditoria.
core.management.json-formatter.remove=Remove o formatador json para o logging de autoria.
core.management.json-formatter.compact=Caso verdadeiro, ir\u00E1 formatar o JSON em uma linha. Ainda pode haver valores contendo novas linhas, portanto caso seja importante registrar em uma linha,configure o escape-new-line ou escape-control-characters para verdadeiro.
core.management.json-formatter.date-format=O formato da data para uso conforme entendido pelo {@link java.text.SimpleDateFormat}. Isto ser\u00E1 ignorado caso include-date\="false".
core.management.json-formatter.date-separator=O separador entre a data e o resto da mensagem de log formatada. Isto ser\u00E1 ignorado caso include-date\="false".
core.management.json-formatter.escape-control-characters=Caso verdadeiro escapar\u00E1 todos os caracteres de controle (entradas ascii com um valor decimal < 32) com o c\u00F3digo ascii code no octal, ex.\:'\n torna-se '\#012'. Caso verdadeiro, isto substituir\u00E1 escape-new-line\="false".
core.management.json-formatter.escape-new-line=Caso verdadeiro escapar\u00E1 todas as novas linhas com o c\u00F3digo ascii no octal, ex.\: "\#012".
core.management.json-formatter.include-date=Se \u00E9 que ou n\u00E3o incluir a data no registro de log formatado.
core.management.syslog-handler=O manuseador syslog para uso do servi\u00E7o de logging de auditoria do gerenciamento.
core.management.syslog-handler.add=Adiciona um manuseador syslog de log de auditoria.
core.management.syslog-handler.remove=Remove um manuseador syslog de log de auditoria.
core.management.syslog-handler.disabled-due-to-failure=Se \u00E9 que este manuseador foi desabilitado devido \u00E0s falhas de logging.
core.management.syslog-handler.failure-count=O n\u00FAmero de falhas de logging desde que o manuseador foi inicializado.
core.management.syslog-handler.formatter=O formatador usado para formatar as mensagens de log.
core.management.syslog-handler.max-failure-count=O n\u00FAmero m\u00E1ximo de falhas de logging antes de desabilitar este manuseador.
core.management.syslog-handler.max-length=O comprimento m\u00E1ximo em bites que uma mensagem de log, incluindo o cabe\u00E7alho, \u00E9 permitida. Caso indefinida, o padr\u00E3o ser\u00E1 1024 bites caso o syslog-format for RFC3164, ou 2048 bites caso o syslog-format for RFC5424.
core.management.syslog-handler.truncate=Se \u00E9 que ou n\u00E3o uma mensagem, incluindo o cabe\u00E7alho, deve truncar a mensagem caso o comprimento em bites for maior que o comprimento m\u00E1ximo. Caso determinado para falso, as mensagens ser\u00E3o divididas e enviadas com os mesmos valores do cabe\u00E7alho.
core.management.syslog-handler.syslog-format=Se \u00E9 que ou n\u00E3o determinar o formato do syslog a um especificado no RFC-5424 ou RFC-3164.
core.management.syslog-handler.protocol=O protocolo de uso para o manuseador syslog. Deve ser um do 'udp', 'tcp' ou 'tls'.
core.management.syslog-handler.recycle=Reinicie a contagem de falha do manuseador syslog, desconecte e reconecte ao servidor syslog.
core.management.syslog-client-cert-store=A configura\u00E7\u00E3o para o keystore contendo o certificado do cliente caso o servidor syslog requeira autentica\u00E7\u00E3o.
core.management.syslog-client-cert-store.add=Adicione a configura\u00E7\u00E3o keystore.
core.management.syslog-client-cert-store.remove=Remova a configura\u00E7\u00E3o keystore.
core.management.syslog-client-cert-store.key-password=A senha para a chave keystore.
core.management.syslog-client-cert-store.keystore-password=A senha para o keystore.
core.management.syslog-client-cert-store.keystore-path=\=O caminho para o keystore.
core.management.syslog-client-cert-store.keystore-relative-to=O nome do outro caminho nomeado anteriormente, ou um dos caminhos padr\u00F5es fornecidos pelo sistema. Caso o 'keystore-relative-to' seja fornecido, o valor do atributo 'keystore-path' \u00E9 tratado como relativo ao caminho especificado por este atributo.
core.management.syslog-client-cert-store.server-keystore-path=O 'keystore-path' substitu\u00EDdo do arquivo de log de auditoria para ser usado na configura\u00E7\u00E3o do manuseador para os servidores gerenciados.
core.management.syslog-client-cert-store.server-keystore-relative-to=O 'keystore-relative-to' substitu\u00EDdo do arquivo de log de auditoria a ser usado na configurado do manuseador para os servidores gerenciados. O nome de outro caminho anteriormente nomeado, ou um dos caminhos padr\u00F5es fornecidos pelo sistema. Caso o 'keystore-relative-to' seja fornecido, o valor do atributo 'keystore-path' \u00E9 tratdo como relativo ao caminho especificado por este atributo.
core.management.syslog-truststore=A configura\u00E7\u00E3o para o truststore para o certificado do servidor, caso n\u00E3o assinado por uma autoridade.
core.management.syslog-truststore.add=Adiciona a configura\u00E7\u00E3o truststore.
core.management.syslog-truststore.remove=Remove a configura\u00E7\u00E3o truststore.
core.management.syslog-truststore.key-password=A senha para a chave truststore.
core.management.syslog-truststore.keystore-password=A senha para o truststore.
core.management.syslog-truststore.keystore-path=\=O caminho para o truststore.
core.management.syslog-truststore.keystore-relative-to=O nome do outro caminho nomeado anteriormente, ou um dos caminhos padr\u00F5es fornecidos pelo sistema. Caso o 'keystore-relative-to' seja fornecido, o valor do atributo 'keystore-path' \u00E9 tratado como relativo ao caminho especificado por este atributo.
core.management.syslog-truststore.server-keystore-path=O 'keystore-path' substitu\u00EDdo do arquivo de log de auditoria para ser usado na configura\u00E7\u00E3o do manuseador para os servidores gerenciados.
core.management.syslog-truststore.server-keystore-relative-to=O 'keystore-relative-to' substitu\u00EDdo do arquivo de log de auditoria a ser usado na configurado do manuseador para os servidores gerenciados. O nome de outro caminho anteriormente nomeado, ou um dos caminhos padr\u00F5es fornecidos pelo sistema. Caso o 'keystore-relative-to' seja fornecido, o valor do atributo 'keystore-path' \u00E9 tratdo como relativo ao caminho especificado por este atributo.
core.management.syslog-udp=A configura\u00E7\u00E3o para anexar para o syslog sobre o udp/ip.
core.management.syslog-udp.add=Adicionar o protocolo udp syslog.
core.management.syslog-udp.remove=Remover o protocolo upd syslog.
core.management.syslog-udp.host=O host do servidor syslog para as solicita\u00E7\u00F5es upd.
core.management.syslog-udp.port=A porta do servidor syslog para as solicita\u00E7\u00F5es udp.
core.management.syslog-tcp=A configura\u00E7\u00E3o para anexar o syslog sobre o tcp/ip.
core.management.syslog-tcp.add=Adicionar o protocolo tcp syslog.
core.management.syslog-tcp.remove=Remover o protocolo tcp syslog.
core.management.syslog-tcp.host=O host do servidor syslog para as solicita\u00E7\u00F5es tcp.
core.management.syslog-tcp.message-transfer=A configura\u00E7\u00E3o de transfer\u00EAncia de mensagem conforme descrito na se\u00E7\u00E3o 3.4 do  RFC-6587. Isto pode tanto ser o OCTET_COUNTING conforme descrito na se\u00E7\u00E3o 3.4.1, ou NON_TRANSPARENT_FRAMING conforme descrito na se\u00E7\u00E3o 3.4.1 do RFC-6587. Consulte a documenta\u00E7\u00E3o do provedor syslog para o que \u00E9 suportado.
core.management.syslog-tcp.port=A porta do servidor syslog para as solicita\u00E7\u00F5es tcp.
core.management.syslog-tls.add=Adicionar os totais do sylog sobre o protocolo tcp/ip.
core.management.syslog-tls.remove=Remover os totais syslog sobre o protocolo tcp/ip.
core.management.syslog-tls=A configura\u00E7\u00E3o a ser anexada ao syslog sobre os totais sobre o tcp/ip.
core.management.syslog-tls.host=O host do servidor syslog para os totais sobre as solicita\u00E7\u00F5es tcp.
core.management.syslog-tls.message-transfer=A configura\u00E7\u00E3o de transfer\u00EAncia da mensagem conforme descrito na se\u00E7\u00E3o do RFC-6587. Isto pode ser tanto o OCTET_COUNTING conforme descrito na se\u00E7\u00E3o 3.4.1 do RFC-6587, ou NON_TRANSPARENT_FRAMING conforme descrito na se\u00E7\u00E3o RFC-6587, ou NON_TRANSPARENT_FRAMING. Consulte a documenta\u00E7\u00E3o do provedor syslog para o que \u00E9 suportado.
core.management.syslog-tls.port=A porta do servidor syslog para os totais sobre as solicita\u00E7\u00F5es tcp.
core.management.syslog-tls.authentication=A configura\u00E7\u00E3o para o truststore para o certificado do servidor caso n\u00E3o assinado por uma autoridade e o keystore contendo o certificado do cliente caso servidor syslog \u00E9 configurado a requere a autentica\u00E7\u00E3o do cliente.
