core.management=Die Management-Dienste, die zur Steuerung eines Servers oder eines Host-Controllers eines Hosts verwendet werden.
core.management.access=Modelldarstellung f\u00FCr Konfiguration, die die Zugriffssteuerung und Zugriffspr\u00FCfung.
core.management.access.audit=Die Pr\u00FCfungskonfiguration darstellende Modell.
core.management.security-realm=Ein Sicherheitsbereich, der mit einem Management-Interface verkn\u00FCpft und zur Steuerung des Zugriffs auf die Management-Dienste verwendet werden kann.
core.management.ldap-connection=Eine Verbindungs-Factory, die von einem Sicherheitsbereich verwendet werden kann, um auf einen LDAP-Server f\u00FCr Informationen zur Authentifizierung und Autorisierung zuzugreifen.
core.management.management-interface=Von Management-Diensten bereitgestellte Schnittstellen, die externen Aufrufern das Ausf\u00FChren von Verwaltungsaufgaben erm\u00F6glichen.
core.management.access-control.is-caller-in-role=Testen Sie, ob der aktuelle Aufrufer ein Mitglied der Rolle ist.
core.access-control=Die Zugriffssteuerungsdefinitionen, die die Zugriffsmanagementeinschr\u00E4nkungen definieren.
core.access-control.provider=Der Provider, der f\u00FCr Managementzugriffssteuerungsentscheidungen verwendet werden soll.
core.access-control.constraint=Zugriffsbeschr\u00E4nkungen f\u00FCr die Sensitivit\u00E4t der Vault-Ausdr\u00FCcke, die Sensitivit\u00E4t-Klassifizierungen und die Applikationsressourcen.
core.access-control.permission-combination-policy=Die Richtlinie f\u00FCr die Verbindung von Zugriffssteuerungsberechtigungen wenn die Authorisierungsrichtlinie dem Benutzer mehr als einen Berechtigungstyp f\u00FCr einen bestimmten Vorgang gibt. In der standardm\u00E4\u00DFigen, rollenbasierten Authorisierungsrichtlinie w\u00FCrde dies vorkommen, wenn ein Benutzer zu mehreren Rollen mappt. Die 'permissive' Richtlinie bedeutet, dass der Vorgang gestattet wird, wenn irgendeine der Berechtigungen diesen gestattet. Die 'ablehnende' Richtlinie bedeutet, dass das Vorhandensein mehrerer Berechtigungen zu einem Fehler f\u00FChrt.
core.access-control.standard-role-names=Die offiziellen Namen der vom aktuellen Provider f\u00FCr die Managementzugriffssteuerung unterst\u00FCtzten Standardrollen.
core.access-control.standard-role-names.role=Die offiziellen Namen einer vom aktuellen Provider f\u00FCr die Managementzugriffssteuerung unterst\u00FCtzten Standardrolle.
core.access-control.all-role-names=Die offiziellen Namen aller vom aktuellen Managementzugriffssteuerungs-Provider unterst\u00FCtzten Rollen. Dies umfasst sowohl Standardrollen sowie benutzerdefinierte Rollen.
core.access-control.all-role-names.role=Die offiziellen Namen einer vom aktuellen Provider f\u00FCr die Managementzugriffssteuerung unterst\u00FCtzten Rolle.
core.access-constraint.application-classification=Die Applikationsklassifizierungseinschr\u00E4nkungen.
core.access-constraint.vault-expression=Sensitivit\u00E4tsklassifizierung von Vault-Ausdr\u00FCcken.
core.access-control.constraint.application-classification=Konfiguration der Applikationsklassifizierungseinschr\u00E4nkungen.
core.access-control.constraint.application-classification.type=Die benannten Applikationklassifizierungen gruppiert nach dem Untersystem der Einschr\u00E4nkung oder 'core' (Kern) wenn vom Kernmodell stammend.
core.access-control.constraint.application-classification-config=Konfiguration einer Applikationsklassifizierungseinschr\u00E4nkungen.
core.access-control.constraint.application-classification-config.configured-application=Auf die Au\u00DFerkraftsetzung der Standardeinstellung eingestellt, ob die Einschr\u00E4nkung als Applikationsressource angesehen wird.
core.access-control.constraint.application-classification-config.default-application=Ob Ziele mit dieser Applikationstypeinschr\u00E4nkung als Applikationsressourcen angesehen werden.
core.access-control.constraint.application-classification-config.applies-to=Informationen zu den Ressourcen, Attributen und Operationen f\u00FCr die diese Applikationsklassifizierungseinschr\u00E4nkung gilt.
core.access-control.constraint.application-classification-type=Die Applikationsklassifizierungseinschr\u00E4nkungen nach Typ. Der Typ ist entweder 'core' (Kern) oder der Name eines Untersystems.
core.access-control.constraint.application-classification-type.classification=Die Applikationsklassifizierungseinschr\u00E4nkungen nach Typ.
core.access-control.constraint.sensitivity-classification=Die Sensitivit\u00E4t Klassifizierungseinschr\u00E4nkungen.
core.access-control.constraint.sensitivity-classification.type=Die benannten Applikationklassifizierungen gruppiert nach dem Untersystem der Einschr\u00E4nkung oder 'core' (Kern) wenn vom Kernmodell stammend.
core.access-control.constraint.sensitivity-classification-config=Konfiguration einer Sensitivit\u00E4tseinschr\u00E4nkung.
core.access-control.constraint.sensitivity-classification-config.configured-requires-addressable=Auf die Au\u00DFerkraftsetzung der Standardeinstellung eingestellt, ob die Visibilit\u00E4t der mit dieser Sensitivit\u00E4tseinschr\u00E4nkung annotierten Ressourcen als sensitiv angesehen werden soll.
core.access-control.constraint.sensitivity-classification-config.configured-requires-read=Auf die Au\u00DFerkraftsetzung der Standardeinstellung eingestellt, ob das Lesen der mit dieser Sensitivit\u00E4tseinschr\u00E4nkung annotierten Attribute als sensitiv angesehen werden soll.
core.access-control.constraint.sensitivity-classification-config.configured-requires-write=Auf die Au\u00DFerkraftsetzung der Standardeinstellung eingestellt, ob das Schreiben der mit dieser Sensitivit\u00E4tseinschr\u00E4nkung annotierten Attribute als sensitiv angesehen werden soll.
core.access-control.constraint.sensitivity-classification-config.default-requires-addressable=Ob die Visibilit\u00E4t der mit dieser Sensitivit\u00E4tseinschr\u00E4nkung annotierten Ressourcen als sensitiv angesehen werden soll.
core.access-control.constraint.sensitivity-classification-config.default-requires-read=Ob das Lesen der mit dieser Sensitivit\u00E4tseinschr\u00E4nkung annotierten Attribute als sensitiv angesehen werden soll.
core.access-control.constraint.sensitivity-classification-config.default-requires-write=Ob das Schreiben der mit dieser Sensitivit\u00E4tseinschr\u00E4nkung annotierten Attribute als sensitiv angesehen werden soll.
core.access-control.constraint.sensitivity-classification-config.applies-to=Informationen zu den Ressourcen, Attributen und Operationen f\u00FCr die diese Sensitivit\u00E4tseinschr\u00E4nkung gilt.
core.access-control.constraint.sensitivity-classification-type=Die Sensitivit\u00E4tseinschr\u00E4nkungen nach Typ. Der Typ ist entweder 'core' (Kern) oder der Name eines Untersystems.
core.access-control.constraint.sensitivity-classification-type.classification=Die Sensitivit\u00E4tsklassifizierungen nach Typ
core.access-control.constraint.applies-to=Informationen zu den Ressourcen, Attributen und Operationen f\u00FCr die eine Zugriffssteuerungseinschr\u00E4nkung gilt.
core.access-control.constraint.applies-to.address=Adressmuster, das eine Ressource oder Ressourcen beschreibt, f\u00FCr die die Einschr\u00E4nkung gilt.
core.access-control.constraint.applies-to.entire-resource="True", falls die Einschr\u00E4nkung f\u00FCr die Ressource insgesamt gilt; "false", falls sie nur f\u00FCr eines/einen oder mehrere Attribut(e) oder Vorgang(e) gilt.
core.access-control.constraint.applies-to.attributes=Liste von Namen der Attribute f\u00FCr die die Einschr\u00E4nkung gilt.
core.access-control.constraint.applies-to.attributes.attribute=Der Name eines Attributs f\u00FCr das die Einschr\u00E4nkung gilt.
core.access-control.constraint.applies-to.operations=Liste der Namen von Operationen, f\u00FCr die die Einschr\u00E4nkung spezifisch gilt.
core.access-control.constraint.applies-to.operations.operation=Der Name einer Operation, f\u00FCr die die Einschr\u00E4nkung spezifisch gilt.
core.access-control.constraint.vault-expression-sensitivity=Konfiguration ob Vault-Ausdr\u00FCcke als sensitiv angesehen werden sollen.
core.access-control.constraint.vault-expression-sensitivity.configured-requires-addressable=Auf die Au\u00DFerkraftsetzung der Standardeinstellung eingestellt, ob die Visibilit\u00E4t von Vault-Ausdr\u00FCcke enthaltenden Ressourcen als sensitiv angesehen werden soll.
core.access-control.constraint.vault-expression-sensitivity.configured-requires-read=Auf die Au\u00DFerkraftsetzung der Standardeinstellung eingestellt, ob das Lesen von Vault-Ausdr\u00FCcke enthaltenden Ressourcen als sensitiv angesehen werden soll.
core.access-control.constraint.vault-expression-sensitivity.configured-requires-write=Auf die Au\u00DFerkraftsetzung der Standardeinstellung eingestellt, ob das Schreiben von Vault-Ausdr\u00FCcke enthaltenden Ressourcen als sensitiv angesehen werden soll.
core.access-control.constraint.vault-expression-sensitivity.default-requires-addressable=Ob die Visibilit\u00E4t von Vault-Ausdr\u00FCcke enthaltenden Ressourcen als sensitiv angesehen werden soll.
core.access-control.constraint.vault-expression-sensitivity.default-requires-read=Ob das Lesen von Vault-Ausdr\u00FCcke enthaltenden Attributen als sensitiv angesehen werden soll.
core.access-control.constraint.vault-expression-sensitivity.default-requires-write=Ob das Schreiben von Vault-Ausdr\u00FCcke enthaltenden Attributen als sensitiv angesehen werden soll.
core.access-control.host-scoped-roles=Domain-weite Host-begrenzte Rollen, zu denen dieser Host als g\u00FCltiger Host hinzugef\u00FCgt werden sollte
core.access-control.host-scoped-roles.role=Host-begrenzte Rollen, zu denen dieser Host als g\u00FCltiger Host hinzugef\u00FCgt werden sollte
core.access-control.server-group-scoped-role=Administrative Rollen, die auf Standardrollen basieren, sind auf einen bestimmten Satz an gemanagen Domain Servergruppen beschr\u00E4nkt
core.access-control.server-group-scoped-role.base-role=Die Standardrolle auf der die Servergruppen-begrenzte Rolle basiert
core.access-control.server-group-scoped-role.server-groups=Die Liste von Nemen Servergruppen auf die Benutzer in dieser Rolle beschr\u00E4nkt sind
core.access-control.server-group-scoped-role.server-groups.server-group=Eine Servergruppe auf die der Benutzer dieser Rolle beschr\u00E4nkt ist
core.access-control.server-group-scoped-role.add=F\u00FCgt eine neue Servergruppen-begrenzte Rolle hinzu.
core.access-control.server-group-scoped-role.remove=Entfernt eine Servergruppen-begrenzte Rolle.
core.access-control.host-scoped-role=Administrative Rollen, die auf Standardrollen basieren, sind auf einen bestimmten Satz an gemanagen Domain Hosts beschr\u00E4nkt
core.access-control.host-scoped-role.base-role=Die Standardrolle auf der die Host-begrenzte Rolle basiert
core.access-control.host-scoped-role.hosts=Die Liste von Namen Hosts auf die Benutzer in dieser Rolle beschr\u00E4nkt sind
core.access-control.host-scoped-role.hosts.host=Ein Host auf den der Benutzer dieser Rolle beschr\u00E4nkt ist
core.access-control.host-scoped-role.add=F\u00FCgt eine neue Host-begrenzte Rolle hinzu.
core.access-control.host-scoped-role.remove=Entfernt eine Host-begrenzte Rolle.
core.access-control.role-mapping=Ein Mapping von Benutzern und Gruppen zu einer bestimmten Rolle.
core.access-control.role-mapping.add=Hinzuf\u00FCgen einer neuen Rollen Mapping Definition
core.access-control.role-mapping.remove=Entfernen einer bestehenden Rollen Mapping Definition
core.access-control.role-mapping.include-all=Konfigurieren Sie, ob alle authentifizierten Benutzer dieser Rolle automatisch zugewiesen werden sollen.
core.access-control.role-mapping.exclude=Principals, die von einer Rolle ausgeschlossen werden sollten.
core.access-control.role-mapping.include=Principals, die in eine Rolle eingeschlossen werden sollten.
core.access-control.role-mapping.principal=Ein einzelner Principal, der innerhalb eines Rollen-Mappings verwendet werden soll.
core.access-control.role-mapping.principal.add=Hinzuf\u00FCgen eines neuen Principal zu einem Rollen-Mapping.
core.access-control.role-mapping.principal.remove=Entfernen eines bestehenden Principal aus einem Rollen-Mapping.
core.access-control.role-mapping.principal.type=Der Typ von gemapptem Principal, entweder 'group' (Gruppe) oder 'user' (Benutzer).
core.access-control.role-mapping.principal.realm=Ein optionales Attribut f\u00FCr das Mapping basierend auf dem f\u00FCr die Authentifizierung verwendeten Bereich.
core.access-control.role-mapping.principal.name=Der Name des/der gemappten Benutzers oder Gruppe.
core.management.audit-log=Die h\u00F6chste Ebene des Management Audit Protokollierungsdienstes.
core.management.audit-log.add=F\u00FCgt die Ressource der h\u00F6chsten Ebene des Management-Audit hinzu.
core.management.audit-log.remove=Entfernt die Ressource der h\u00F6chsten Ebene des Management-Audit.
core.management.audit-log.logger=Der Management Audit Protokollierungsdienst.
core.management.audit-log.logger.add=F\u00FCgt den Management Audit Protokollierungsdienst hinzu.
core.management.audit-log.logger.remove=Entfernt den Management Audit Protokollierungsdienst.
core.management.audit-log.server-logger=Der Management Audit Protokollierungsdienst zur Verwendung an den gemanagten Servern.
core.management.audit-log.server-logger.add=F\u00FCgt den Management Audit Protokollierungsdienst zur Verwendung an den gemanagten Servern hinzu.
core.management.audit-log.server-logger.remove=Entfernt den Management Audit Protokollierungsdienst zur Verwendung an den gemanagten Servern.
core.management.audit-log.log-boot=Ob Operationen beim Server-Boot protokolliert werden sollen.
core.management.audit-log.log-read-only=Ob Operationen, die die Konfiguration oder Runtime-Dienste nicht ver\u00E4ndern protokolliert werden sollen.
core.management.audit-log.enabled=Ob Audit-Protokollierung aktiviert ist.
core.management.audit-log.handler=Referenzen zu Datei oder syslog Audit Protokoll Appendern.
core.management.audit-log.handler-reference=Eine Referenz zu einem Datei oder syslog Audit Protokoll Handler. Der Name des Handler ist durch den Wert der Adresse gekennzeichnet.
core.management.audit-log.handler-reference.add=F\u00FCgt einer Datei oder einem Syslog Audit Protokoll Handler eine Referenz hinzu.
core.management.audit-log.handler-reference.remove=Entfernt aus einer Datei oder einem Syslog Audit Protokoll Handler eine Referenz.
core.management.audit-log.json-formatter=Formattierer f\u00FCr die Formattierung der Audit Protokoll Nachrichten mittels json.
core.management.audit-log.file-handler=Datei-Handler zur Verwendung mit dem Management Audit Protokollierungsdienst.
core.management.audit-log.syslog-handler=Syslog-Handler zur Verwendung mit dem Management Audit Protokollierungsdienst.
core.management.file-handler=Ein Datei-Handler der mit dem Management Audit Protokollierungsdienst verwendet werden soll.
core.management.file-handler.add=F\u00FCgt einen Audit Protokolldatei-Handler hinzu.
core.management.file-handler.remove=Entfernt einen Audit Protokolldatei-Handler.
core.management.file-handler.disabled-due-to-failure=Ob dieser Handler aufgrund von Protokollierungsfehlern deaktiviert ist.
core.management.file-handler.failure-count=Die Anzahl von Protokollierungsfehlern seit Initialisierung des Handlers.
core.management.file-handler.formatter=Der f\u00FCr die Formattierung der Protokollnachrichten verwendete Formattierer.
core.management.file-handler.max-failure-count=Die maximale Anzahl an Protokollierungsfehlern ehe dieser Handler deaktiviert wird.
core.management.file-handler.path=Der Pfad der Audit Protokolldatei.
core.management.file-handler.recycle=Setzt die Fehlerz\u00E4hlung des Datei-Handlers zur\u00FCck und erstellt eine Sicherungskopie der aktuellen Protokolldatei.
core.management.file-handler.relative-to=Der Name eines anderen vorher benannten Pfads, oder einer der Standardpfade des Systems. Falls 'relative-to' angegeben ist, gilt der Wert des 'path' Attributs als relativ zu dem Pfad, der von diesem Attribut spezifiziert ist.
core.management.file-handler.server-path=Der au\u00DFer Kraft gesetzte 'path' der Audit Protokolldatei, der f\u00FCr die Einstellung des Handlers f\u00FCr gemanagte Server verwendet werden soll.
core.management.file-handler.server-relative-to=Das au\u00DFer kraft gesetzte 'relativ zu' der Audit Protokolldatei, das f\u00FCr die Einstellung des Handlers f\u00FCr gemanagte Server verwendet werden soll. Der Name eines anderen vorher benannten Pfads, oder einer der Standardpfade des Systems. Falls 'relative-to' angegeben ist, gilt der Wert des 'path' Attributs als relativ zu dem Pfad, der von diesem Attribut spezifiziert ist.
core.management.json-formatter=Ein json Formattierer f\u00FCr Audit Protokollnachrichten.
core.management.json-formatter.add=F\u00FCgt einen json Formattierer f\u00FCr Audit Protokollnachrichten hinzu.
core.management.json-formatter.remove=Entfernt einen json Formattierer f\u00FCr Audit Protokollnachrichten.
core.management.json-formatter.compact=Falls "true" wird JSON in einer Zeile formattiert. Es k\u00F6nnen nach wie vor Werte mit neuen Zeilen vorhandensein, daher setzen Sie escape-new-line oder escape-control-characters auf "true" wenn es wichtig ist, dass der gesamte Eintrag sich in einer Zeile befindet.
core.management.json-formatter.date-format=Das zu verwendende Datumsformat wie von {@link java.text.SimpleDateFormat} verstanden. Wird ignoriert, falls include-date\="false".
core.management.json-formatter.date-separator=Der Trenner zwischen dem Datum und dem Rest der formattierten Protokollnachricht. Wird ignoriert, falls include-date\="false".
core.management.json-formatter.escape-control-characters=Falls "true"  will escape all control characters (ascii entries with a decimal value < 32) with the ascii code in octal, e.g.'\n becomes '\#012'. If this is true, it will override escape-new-line\="false".
core.management.json-formatter.escape-new-line=Falls "true"  Fluchtzeichen aller neuen Zeilen mit dem ascii Code in oktal, z.B. "\#012".
core.management.json-formatter.include-date=Ob das Datum im formattierten Protokolleintrag eingeschlossen werden soll oder nicht.
core.management.syslog-handler=Ein Syslog-Handler der mit dem Management Audit Protokollierungsdienst verwendet werden soll.
core.management.syslog-handler.add=F\u00FCgt einen Audit Protokoll Syslog Handler hinzu.
core.management.syslog-handler.remove=Entfernt einen Audit Protokoll Syslog Handler.
core.management.syslog-handler.disabled-due-to-failure=Ob dieser Handler aufgrund von Protokollierungsfehlern deaktiviert ist.
core.management.syslog-handler.failure-count=Die Anzahl von Protokollierungsfehlern seit Initialisierung des Handlers.
core.management.syslog-handler.formatter=Der f\u00FCr die Formattierung der Protokollnachrichten verwendete Formattierer.
core.management.syslog-handler.max-failure-count=Die maximale Anzahl an Protokollierungsfehlern ehe dieser Handler deaktiviert wird.
core.management.syslog-handler.max-length=Die maximal erlaubte L\u00E4nge einschlie\u00DFlich des Headers einer Protokollnachricht in Bytes. Falls nicht definiert, so lautet die Standardeinstellung 1024 Bytes f\u00FCr das syslog-Format RFC3164 oder 2048 Bytes f\u00FCr das syslog-Format RFC5424.
core.management.syslog-handler.truncate=Ob eine Nachricht einschlie\u00DFlich Header die Nachricht abschneiden soll, falls deren L\u00E4nge in Bytes die maximale L\u00E4nge \u00FCberschreitet. Falls auf "false" eingestellt, so werden Nachrichten geteilt und mit denselben Headerwerten verschickt.
core.management.syslog-handler.syslog-format=Ob das syslog-Format auf das in RFC-5424 oder RFC-3164 festgelegte eingestellt werden soll.
core.management.syslog-handler.protocol=Das f\u00FCr den syslog-Handler zu verwendende Protokoll. Muss eines (und nur eines) der folgenden sein\: 'udp', 'tcp' oder 'tls'.
core.management.syslog-handler.recycle=Setzt die Fehlerz\u00E4hlung des syslog-Handlers zur\u00FCck, l\u00F6st die Verbindung zum syslog-Server und stellt diese wieder her.
core.management.syslog-client-cert-store=Konfiguration f\u00FCr den Schl\u00FCsselspeicher, der das Client-Zertifikat enth\u00E4lt, falls der syslog Server Authentifizierung erfordert.
core.management.syslog-client-cert-store.add=F\u00FCgt die Schl\u00FCsselspeicherkonfiguration hinzu.
core.management.syslog-client-cert-store.remove=Entfernt die Schl\u00FCsselspeicherkonfiguration.
core.management.syslog-client-cert-store.key-password=Das Passwort f\u00FCr den Schl\u00FCsselspeicherschl\u00FCssel.
core.management.syslog-client-cert-store.keystore-password=Das Passwort f\u00FCr den Schl\u00FCsselspeicher.
core.management.syslog-client-cert-store.keystore-path=\=Der Pfad des Keystore.
core.management.syslog-client-cert-store.keystore-relative-to=Der Name eines anderen vorher benannten Pfads, oder einer der Standardpfade des Systems. Falls 'keystore-relative-to' angegeben ist, gilt der Wert des 'keystore-path' Attributs als relativ zu dem Pfad, der von diesem Attribut spezifiziert ist.
core.management.syslog-client-cert-store.server-keystore-path=Der au\u00DFer Kraft gesetzte 'keystore-path' der Audit Protokolldatei, der f\u00FCr die Einstellung des Handlers f\u00FCr gemanagte Dienste verwendet werden soll.
core.management.syslog-client-cert-store.server-keystore-relative-to=Das au\u00DFer kraft gesetzte 'keystore-relative-to' der Audit Protokolldatei, das f\u00FCr die Einstellung des Handlers f\u00FCr gemanagte Server verwendet werden soll. Der Name eines anderen vorher benannten Pfads, oder einer der Standardpfade des Systems. Falls 'relative-to' angegeben ist, gilt der Wert des 'path' Attributs als relativ zu dem Pfad, der von diesem Attribut spezifiziert ist.
core.management.syslog-truststore=Konfiguration f\u00FCr den Truststore f\u00FCr das Serverzertifikat, falls nicht von einer Authorit\u00E4t unterzeichnet.
core.management.syslog-truststore.add=F\u00FCgt die Truststore Konfiguration hinzu.
core.management.syslog-truststore.remove=Entfernt die Truststore Konfiguration.
core.management.syslog-truststore.key-password=Das Passwort f\u00FCr den Truststore Schl\u00FCssel.
core.management.syslog-truststore.keystore-password=Das Passwort f\u00FCr den Truststore.
core.management.syslog-truststore.keystore-path=\=Der Pfad des Truststore.
core.management.syslog-truststore.keystore-relative-to=Der Name eines anderen vorher benannten Pfads, oder einer der Standardpfade des Systems. Falls 'keystore-relative-to' angegeben ist, gilt der Wert des 'keystore-path' Attributs als relativ zu dem Pfad, der von diesem Attribut spezifiziert ist.
core.management.syslog-truststore.server-keystore-path=Der au\u00DFer Kraft gesetzte 'keystore-path' der Audit Protokolldatei, der f\u00FCr die Einstellung des Handlers f\u00FCr gemanagte Dienste verwendet werden soll.
core.management.syslog-truststore.server-keystore-relative-to=Das au\u00DFer kraft gesetzte 'keystore-relative-to' der Audit Protokolldatei, das f\u00FCr die Einstellung des Handlers f\u00FCr gemanagte Server verwendet werden soll. Der Name eines anderen vorher benannten Pfads, oder einer der Standardpfade des Systems. Falls 'relative-to' angegeben ist, gilt der Wert des 'path' Attributs als relativ zu dem Pfad, der von diesem Attribut spezifiziert ist.
core.management.syslog-udp=Konfiguration f\u00FCr Anh\u00E4ngen von syslog vor udp/ip.
core.management.syslog-udp.add=Hinzuf\u00FCgen des syslog udp Protokolls.
core.management.syslog-udp.remove=Entfernen des syslog udp Protokolls.
core.management.syslog-udp.host=Der Host des syslog Servers f\u00FCr die udp Anfragen.
core.management.syslog-udp.port=Der Port des syslog Servers f\u00FCr die udp Anfragen.
core.management.syslog-tcp=Konfiguration f\u00FCr Anh\u00E4ngen von syslog vor tcp/ip.
core.management.syslog-tcp.add=Hinzuf\u00FCgen des syslog tcp Protokolls.
core.management.syslog-tcp.remove=Entfernen des syslog tcp Protokolls.
core.management.syslog-tcp.host=Der Host des syslog Servers f\u00FCr die tcp Anfragen.
core.management.syslog-tcp.message-transfer=Die Nachrichtentransfereinstellung wie in 3.4 von RFC-6587 beschrieben. Dies kann entweder sein OCTET_COUNTING wie in Abschnitt 3.4.1 von RFC-6587 beschrieben oder NON_TRANSPARENT_FRAMING wie in Abschnitt 3.4.1 of RFC-6587 beschrieben. In der Dokumentation Ihres syslog Providers finden Sie Informationen dazu, was unterst\u00FCtzt ist.
core.management.syslog-tcp.port=Der Port des syslog Servers f\u00FCr die tcp Anfragen.
core.management.syslog-tls.add=Hinzuf\u00FCgen des syslog tcp/ip Protokolls.
core.management.syslog-tls.remove=Entfernen des syslog tcp/ip Protokolls.
core.management.syslog-tls=Konfiguration f\u00FCr Anh\u00E4ngen von syslog vor tls vor tcp/ip.
core.management.syslog-tls.host=Der Host des syslog Servers f\u00FCr die tls vor tcp Anfragen.
core.management.syslog-tls.message-transfer=Die Nachrichtentransfereinstellung wie in 3.4 von RFC-6587 beschrieben. Dies kann entweder sein OCTET_COUNTING wie in Abschnitt 3.4.1 von RFC-6587 beschrieben oder NON_TRANSPARENT_FRAMING wie in Abschnitt 3.4.1 of RFC-6587 beschrieben. In der Dokumentation Ihres syslog Providers finden Sie Informationen dazu, was unterst\u00FCtzt ist.
core.management.syslog-tls.port=Der Port des syslog Servers f\u00FCr die tls vor tcp Anfragen.
core.management.syslog-tls.authentication=Konfiguration f\u00FCr den Truststore f\u00FCr das Serverzertifikat, falls nicht von einer Authorit\u00E4t unterzeichnet und der Schl\u00FCsselspeicher, der das Client-Zertifikat enth\u00E4lt, falls der syslog Server so eingestellt ist, dass er Client Authentifizierung erfordert.
