core.management=Services de gestion pour contr\u00F4ler un serveur ou un contr\u00F4leur h\u00F4te d'h\u00F4te.
core.management.access=Repr\u00E9sentation du mod\u00E8le pour la configuration affectant le contr\u00F4le et l'auditing des acc\u00E8s.
core.management.access.audit=Mod\u00E8le repr\u00E9sentant la configuration de l'auditing.
core.management.security-realm=Un domaine de s\u00E9curit\u00E9 qui peut \u00EAtre associ\u00E9 \u00E0 une interface de gestion et pouvant \u00EAtre utilis\u00E9 pour contr\u00F4ler l'acc\u00E8s aux services de gestion.
core.management.ldap-connection=Une usine de connexions qui peut \u00EAtre utilis\u00E9e par un domaine de s\u00E9curit\u00E9 pour acc\u00E9der \u00E0 un serveur LDAP comme source d'authentification et information d'autorisation.
core.management.management-interface=Interfaces expos\u00E9es par les services de gestion pour permettre aux appelants externes d'effectuer des t\u00E2ches de gestion.
core.management.access-control.is-caller-in-role=Test si l'appelant en cours est un membre du r\u00F4le.
core.access-control=Les d\u00E9finitions de contr\u00F4le d'acc\u00E8s d\u00E9finissant les restrictions de gestion de l'acc\u00E8s.
core.access-control.provider=Le fournisseur \u00E0 utiliser pour les d\u00E9cisions de contr\u00F4le d'acc\u00E8s pour la gestion.
core.access-control.constraint=Contraintes d'acc\u00E8s pour la sensibilit\u00E9 des expressions d'archivage s\u00E9curit\u00E9, pour les classification de sensibilit\u00E9 et les ressources d'applications.
core.access-control.permission-combination-policy=La politique permettant de combiner des permissions de contr\u00F4le d'acc\u00E8s lorsque la strat\u00E9gie d'autorisation accorde \u00E0 l'utilisateur plusieurs types de permissions pour une action donn\u00E9e. Dans la strat\u00E9gie d'autorisation bas\u00E9e sur les r\u00F4les standard, cela se produit lorsqu'un utilisateur correspond \u00E0 plusieurs r\u00F4les. La politique \u00AB permissive \u00BB signifie que si aucune des permissions permet l'action, l'action sera autoris\u00E9e. La politique de rejet \u00AB rejecting \u00BB d\u00E9signe que l'existence de plusieurs permissions devrait se traduire par une erreur.
core.access-control.standard-role-names=Les noms officiels des r\u00F4les standard pris en charge par le fournisseur du contr\u00F4le d'acc\u00E8s \u00E0 la gestion, qui existe actuellement.
core.access-control.standard-role-names.role=Les noms officiels d'un r\u00F4le standard pris en charge par le fournisseur du contr\u00F4le d'acc\u00E8s \u00E0 la gestion, qui existe actuellement.
core.access-control.all-role-names=Les noms officiels de tous les r\u00F4les pris en charge par le fournisseur du contr\u00F4le d'acc\u00E8s \u00E0 la gestion. Cela inclut tous les r\u00F4les standards, ainsi que tous les r\u00F4les d\u00E9finis par l'utilisateur.
core.access-control.all-role-names.role=Les noms officiels d'un r\u00F4le pris en charge par le fournisseur du contr\u00F4le d'acc\u00E8s \u00E0 la gestion.
core.access-constraint.application-classification=Les contraintes de classification d'application.
core.access-constraint.vault-expression=Les classifications de sensibilit\u00E9 des expressions d'archivage s\u00E9curis\u00E9.
core.access-control.constraint.application-classification=Configuration des contraintes de classification d'applications.
core.access-control.constraint.application-classification.type=Les classifications d'applications nomm\u00E9es group\u00E9es par le sous-syst\u00E8me de la contrainte, ou 'core' s'il s'agit du mod\u00E8le principal.
core.access-control.constraint.application-classification-config=Configuration d'une contrainte de classification d'application.
core.access-control.constraint.application-classification-config.configured-application=D\u00E9fini pour remplacer par valeur par d\u00E9faut et d\u00E9finir si la contrainte est consid\u00E9r\u00E9e comme une ressource d'application.
core.access-control.constraint.application-classification-config.default-application=Indique si les cibles qui ont cette contrainte de type d'application sont consid\u00E9r\u00E9es comme ressources d'applications.
core.access-control.constraint.application-classification-config.applies-to=Information sur les ressources, attributs, et op\u00E9rations auxquels cette contrainte de classification d'application s'applique.
core.access-control.constraint.application-classification-type=Les contraintes de classification d'application par type. Le type est 'core' ou bien correspond au nom d'un sous-syst\u00E8me.
core.access-control.constraint.application-classification-type.classification=Les contraintes de classification d'application par type.
core.access-control.constraint.sensitivity-classification=Les contraintes de sensibilit\u00E9 de classification.
core.access-control.constraint.sensitivity-classification.type=Les classifications de l'application nomm\u00E9e group\u00E9es par le sous-syst\u00E8me de la contrainte, ou 'core' si issues d'un mod\u00E8le principal.
core.access-control.constraint.sensitivity-classification-config=Configuration d'une contrainte de sensibilit\u00E9.
core.access-control.constraint.sensitivity-classification-config.configured-requires-addressable=D\u00E9fini pour remplacer la valeur par d\u00E9faut et indiquer si la visibilit\u00E9 des ressources annot\u00E9es avec cette contrainte de sensibilit\u00E9 doivent \u00EAtre consid\u00E9r\u00E9es comme sensibles.
core.access-control.constraint.sensitivity-classification-config.configured-requires-read=D\u00E9fini pour remplacer la valeur par d\u00E9faut et indiquer si les attribut de lecture annot\u00E9s avec la contrainte de s\u00E9curit\u00E9 doivent \u00EAtre consid\u00E9r\u00E9s comme sensibles.
core.access-control.constraint.sensitivity-classification-config.configured-requires-write=D\u00E9fini pour remplacer la valeur par d\u00E9faut et indiquer si les attribut d'\u00E9criture annot\u00E9s avec la contrainte de s\u00E9curit\u00E9 doivent \u00EAtre consid\u00E9r\u00E9s comme sensibles.
core.access-control.constraint.sensitivity-classification-config.default-requires-addressable=Indique si la visibilit\u00E9 des ressources annot\u00E9es avec cette contrainte de sensibilit\u00E9 doivent \u00EAtre consid\u00E9r\u00E9es comme sensibles.
core.access-control.constraint.sensitivity-classification-config.default-requires-read=Indique si les attributs de lecture annot\u00E9s avec cette contrainte de sensibilit\u00E9 doivent \u00EAtre consid\u00E9r\u00E9s comme sensibles.
core.access-control.constraint.sensitivity-classification-config.default-requires-write=Indique si les attributs d'\u00E9criture annot\u00E9s avec cette contrainte de sensibilit\u00E9 doivent \u00EAtre consid\u00E9r\u00E9s comme sensibles.
core.access-control.constraint.sensitivity-classification-config.applies-to=Information sur les ressources, attributs, et op\u00E9rations auxquels cette contrainte de sensibilit\u00E9 de classification s'applique.
core.access-control.constraint.sensitivity-classification-type=Les classifications de sensibilit\u00E9 par type. Le type est 'core' ou bien correspond au nom d'un sous-syst\u00E8me.
core.access-control.constraint.sensitivity-classification-type.classification=Les classifications de sensibilit\u00E9 par type.
core.access-control.constraint.applies-to=Information sur les ressources, attributs, et op\u00E9rations auxquels cette contrainte de contr\u00F4le d'acc\u00E8s s'applique.
core.access-control.constraint.applies-to.address=Mod\u00E8le d'adresse d\u00E9crivant une ressource ou des ressources auxquelles la contrainte s'applique.
core.access-control.constraint.applies-to.entire-resource=True si les contraintes s'appliquent \u00E0 la ressource dans son ensemble; false si elle ne s'applique qu'\u00E0 un ou plusieurs attributs ou op\u00E9rations.
core.access-control.constraint.applies-to.attributes=Liste des noms des attributs \u00E0 qui la contrainte s'applique particuli\u00E8rement.
core.access-control.constraint.applies-to.attributes.attribute=Les noms d'un attribut \u00E0 qui la contrainte s'applique particuli\u00E8rement.
core.access-control.constraint.applies-to.operations=Liste des noms des op\u00E9rations \u00E0 qui la contrainte s'applique particuli\u00E8rement.
core.access-control.constraint.applies-to.operations.operation=Les noms d'une op\u00E9ration \u00E0 qui la contrainte s'applique particuli\u00E8rement.
core.access-control.constraint.vault-expression-sensitivity=Configuration qui indique si les expressions d'archivage s\u00E9curis\u00E9 doivent \u00EAtre consid\u00E9r\u00E9es comme sensibles.
core.access-control.constraint.vault-expression-sensitivity.configured-requires-addressable=D\u00E9fini pour remplacer la valeur par d\u00E9faut et indiquer si la visibilit\u00E9 des ressources contenant les expression d'archivage s\u00E9curis\u00E9 doivent \u00EAtre consid\u00E9r\u00E9es comme sensibles.
core.access-control.constraint.vault-expression-sensitivity.configured-requires-read=D\u00E9fini pour remplacer la valeur par d\u00E9faut et indiquer si les attributs de lecture contenant les expression d'archivage s\u00E9curis\u00E9 doivent \u00EAtre consid\u00E9r\u00E9es comme sensibles.
core.access-control.constraint.vault-expression-sensitivity.configured-requires-write=D\u00E9fini pour remplacer la valeur par d\u00E9faut et indiquer si les attributs d'\u00E9criture contenant les expression d'archivage s\u00E9curis\u00E9 doivent \u00EAtre consid\u00E9r\u00E9es comme sensibles.
core.access-control.constraint.vault-expression-sensitivity.default-requires-addressable=Indique si la visibilit\u00E9 des ressources contenant les expression d'archivage s\u00E9curis\u00E9 doivent \u00EAtre consid\u00E9r\u00E9es comme sensibles.
core.access-control.constraint.vault-expression-sensitivity.default-requires-read=Indique si les attributs contenant les expression d'archivage s\u00E9curis\u00E9 doivent \u00EAtre consid\u00E9r\u00E9es comme sensibles.
core.access-control.constraint.vault-expression-sensitivity.default-requires-write=Indique si les attributs d'\u00E9criture contenant les expression d'archivage s\u00E9curis\u00E9 doivent \u00EAtre consid\u00E9r\u00E9es comme sensibles.
core.access-control.host-scoped-roles=Domain-wide host scoped roles auxquels cet h\u00F4te doit se rajouter comme h\u00F4te valide
core.access-control.host-scoped-roles.role=Host scoped roles auxquels cet h\u00F4te doit se rajouter comme h\u00F4te valide
core.access-control.server-group-scoped-role=R\u00F4les administratifs bas\u00E9s sur des r\u00F4les standard mais qui sont assujetis \u00E0 un ensemble particulier de groupes de serveurs de domaines g\u00E9r\u00E9s. 
core.access-control.server-group-scoped-role.base-role=R\u00F4le standard sur lequel le server-group-scoped-role est bas\u00E9
core.access-control.server-group-scoped-role.server-groups=Le liste des noms des groupes de serveurs \u00E0 qui ces utilisateurs sont contraints pour ce r\u00F4le
core.access-control.server-group-scoped-role.server-groups.server-group=Le groupe de serveurs \u00E0 qui l'utilisateur ayant ce r\u00F4le est contraint
core.access-control.server-group-scoped-role.add=Ajoute un nouveau server-group-scoped-role
core.access-control.server-group-scoped-role.remove=Supprime un server-group-scoped-role
core.access-control.host-scoped-role=R\u00F4les administratifs bas\u00E9s sur des r\u00F4les standard mais qui sont assujetis \u00E0 un ensemble particulier d'h\u00F4tes de domaines g\u00E9r\u00E9s. 
core.access-control.host-scoped-role.base-role=R\u00F4le standard sur lequel l'host-scoped-role est bas\u00E9
core.access-control.host-scoped-role.hosts=Le liste des noms d'h\u00F4tes \u00E0 qui ces utilisateurs sont contraints pour ce r\u00F4le
core.access-control.host-scoped-role.hosts.host=H\u00F4te \u00E0 qui l'utilisateur ayant ce r\u00F4le est contraint
core.access-control.host-scoped-role.add=Ajoute un nouveau host-scoped-role
core.access-control.host-scoped-role.remove=Supprime un host-scoped-role
core.access-control.role-mapping=Un mappage des utilisateurs et des groupes vers un r\u00F4le sp\u00E9cifique.
core.access-control.role-mapping.add=Ajouter une nouvelle d\u00E9finition de mmappage de r\u00F4le.
core.access-control.role-mapping.remove=Supprimer une d\u00E9finition de mappage de r\u00F4le existante.
core.access-control.role-mapping.include-all=Configurer si tous les utilisateurs authentifi\u00E9s doivent automatiquement \u00EAtre assign\u00E9s \u00E0 ce r\u00F4le.
core.access-control.role-mapping.exclude=Principaux \u00E0 exclure d'un r\u00F4le.
core.access-control.role-mapping.include=Principaux \u00E0 inclure dans un r\u00F4le.
core.access-control.role-mapping.principal=Un principal individuel utilis\u00E9 dans un mappage de r\u00F4le.
core.access-control.role-mapping.principal.add=Ajouter un nouveau principal \u00E0 un mappage de r\u00F4le.
core.access-control.role-mapping.principal.remove=Supprimer un principal existant \u00E0 un mappage de r\u00F4le.
core.access-control.role-mapping.principal.type=Le type de Principal en cours de mappage, un 'group' ou un 'utilisateur'
core.access-control.role-mapping.principal.realm=Attribut en option pour mapper sur la base du domaine utilis\u00E9 pour l'authentification.
core.access-control.role-mapping.principal.name=Le nom de l'utilisateur ou du groupe ne cours de mappage.
core.management.audit-log=La ressource d'audit de gestion de niveau sup\u00E9rieur.
core.management.audit-log.add=Ajoute la ressource d'audit de gestion de niveau sup\u00E9rieur.
core.management.audit-log.remove=Supprime la ressource d'audit de gestion de niveau sup\u00E9rieur.
core.management.audit-log.logger=Le service de journalisation d'audit de gestion.
core.management.audit-log.logger.add=Ajoute le service de journalisation d'audit de gestion.
core.management.audit-log.logger.remove=Supprime le service de journalisation d'audit de gestion.
core.management.audit-log.server-logger=Le service de journalisation d'audit de gestion \u00E0 utiliser sur les serveurs g\u00E9r\u00E9s.
core.management.audit-log.server-logger.add=Ajoute le service de journalisation d'audit de gestion \u00E0 utiliser sur les serveurs g\u00E9r\u00E9s.
core.management.audit-log.server-logger.remove=Supprime le service de journalisation d'audit de gestion \u00E0 utiliser sur les serveurs g\u00E9r\u00E9s.
core.management.audit-log.log-boot=Indique si les op\u00E9rations doivent \u00EAtre enregistr\u00E9es au d\u00E9marrage du serveur.
core.management.audit-log.log-read-only=Indique si les op\u00E9rations qui ne modifient pas la configuration ou aucun des services de runtime doivent \u00EAtre journalis\u00E9s.
core.management.audit-log.enabled=Indique si la journalisation de l'audit des activ\u00E9e.
core.management.audit-log.handler=R\u00E9f\u00E9rences \u00E0 des fichiers ou \u00E0 des \u00ABaudit log appenders\u00BB.
core.management.audit-log.handler-reference=Une r\u00E9f\u00E9rence \u00E0 un fichier ou \u00E0 un handler de syslog audit log. Le nom du handler est d\u00E9fini par la valeur de l'adresse.
core.management.audit-log.handler-reference.add=Ajoute une r\u00E9f\u00E9rence \u00E0 un fichier ou \u00E0 un handler de syslog audit log.
core.management.audit-log.handler-reference.remove=Supprime une r\u00E9f\u00E9rence \u00E0 un fichier ou \u00E0 un handler de syslog audit log.
core.management.audit-log.json-formatter=Formateurs pour les messages de journalisation d'audit utilisant json.
core.management.audit-log.file-handler=Handlers de fichiers \u00E0 utiliser avec le service de journalisation de l'audit de management.
core.management.audit-log.syslog-handler=Handlers de syslog \u00E0 utiliser avec le service de journalisation de l'audit de gestion.
core.management.file-handler=Handler de fichiers \u00E0 utiliser avec le service de journalisation de l'audit de management.
core.management.file-handler.add=Ajoute un handler de fichiers de journalisation d'audit.
core.management.file-handler.remove=Supprime un handler de fichiers de journalisation d'audit.
core.management.file-handler.disabled-due-to-failure=Indique si ce handler a \u00E9t\u00E9 d\u00E9sactiv\u00E9 \u00E0 cause des \u00E9checs de journalisation.
core.management.file-handler.failure-count=Le nombre d'\u00E9checs de journalisation depuis que le handler a \u00E9t\u00E9 initialis\u00E9.
core.management.file-handler.formatter=Le formateur utilis\u00E9 pour formater les messages de journalisation.
core.management.file-handler.max-failure-count=Le nombre maximum d'\u00E9chec de journalisation avant de d\u00E9sactiver le handler.
core.management.file-handler.path=Le chemin d'acc\u00E8s d'un fichier de journalisation d'audit.
core.management.file-handler.recycle=R\u00E9initialise le nombre d'\u00E9checs d'un handler de fichiers, et sauvegarde le fichier de journalisation en cours.
core.management.file-handler.relative-to=Le nom d'un chemin alternatif pr\u00E9c\u00E9demment nomm\u00E9, ou un des chemins d'acc\u00E8s standards fourni par le syst\u00E8me. Si la valeur de 'relative-to' est fournie, la valeur de l'attribut \u00ABpath\u00BB (chemin) est trait\u00E9e en fonction du chemin sp\u00E9cifi\u00E9 par cet attribut.
core.management.file-handler.server-path=Le 'path' (chemin) substitu\u00E9 d'un fichier audit log \u00E0 utiliser pour installer le handler dans les serveurs g\u00E9r\u00E9s.
core.management.file-handler.server-relative-to=La valeur de 'relative-to' substitu\u00E9e D,un fichier d'audit log \u00E0 utiliser pour configurer le handler de serveurs g\u00E9r\u00E9s. Le nom d'un autre chemin pr\u00E9c\u00E9demment nomm\u00E9, ou de l'un des chemins d'acc\u00E8s standards fourni par le syst\u00E8me. Si 'relative-to' est fourni, la valeur de l'attribut 'path' sera trait\u00E9e en fonction du chemin sp\u00E9cifi\u00E9 par cet attribut.
core.management.json-formatter=Un formateur json pour les messages d'audit log
core.management.json-formatter.add=Ajoute un formateur json pour la journalisation de l'audit.
core.management.json-formatter.remove=Supprime un formateur json pour la journalisation de l'audit.
core.management.json-formatter.compact=Si sur true, formatera JSON sur une ligne. Il peut y avoir plusieurs valeurs contenant des nouvelles lignes, donc si avoir tous les enregistrements sur une ligne est important, d\u00E9finir set escape-new-line ou escape-control-characters \u00E0 true.
core.management.json-formatter.date-format=Le format de la date \u00E0 utiliser tel qu'il est compris par {@link java.text.SimpleDateFormat}. Sera ignor\u00E9 si  include-date\="false".
core.management.json-formatter.date-separator=Le s\u00E9parateur entre la date et le reste du message de journalisation format\u00E9. Sera ignor\u00E9 si include-date\="false".
core.management.json-formatter.escape-control-characters=Si sur true, \u00E9chappera tous les caract\u00E8res de contr\u00F4le (les entr\u00E9es contenant une valeur d\u00E9cimale < 32) avec un code ascii en octal, par ex'\n devient '\#012'. Si sur true, remplacera escape-new-line\="false".
core.management.json-formatter.escape-new-line=Si sur true, \u00E9chappera toutes les nouvelles lignes ayant le code ascii en octal, par ex. "\#012".
core.management.json-formatter.include-date=Indique si on doit inclure ou non la date dans une archive de journalisation format\u00E9e.
core.management.syslog-handler=Syslog handler \u00E0 utiliser avec le service de journalisation de l'audit de gestion.
core.management.syslog-handler.add=Ajoute un handler d'audit log syslog.
core.management.syslog-handler.remove=Supprime un handler d'audit log syslog.
core.management.syslog-handler.disabled-due-to-failure=Indique si ce handler a \u00E9t\u00E9 d\u00E9sactiv\u00E9 \u00E0 cause des \u00E9checs de journalisation.
core.management.syslog-handler.failure-count=Le nombre d'\u00E9checs de journalisation depuis que le handler a \u00E9t\u00E9 initialis\u00E9.
core.management.syslog-handler.formatter=Le formateur utilis\u00E9 pour formater les messages de journalisation.
core.management.syslog-handler.max-failure-count=Le nombre maximum d'\u00E9chec de journalisation avant de d\u00E9sactiver le handler.
core.management.syslog-handler.max-length=Longueur maximum en octets d'un message de journalisation, comprenant l'en-t\u00EAte. Si non d\u00E9finie, la valeur par d\u00E9faut sera de 1024 octets si le format syslog est RFC164, ou 2048 octets si le syslog-format est RFC5424.
core.management.syslog-handler.truncate=Indique si un message, y compris son en-t\u00EAte, doit tronquer le message si la longueur en octets est sup\u00E9rieure \u00E0 la longueur maximum. Si d\u00E9fini sur false, les messages seront alors divis\u00E9s et envoy\u00E9s avec les m\u00EAmes valeurs d'en-t\u00EAte.
core.management.syslog-handler.syslog-format=Indique si on doit d\u00E9finir le format du syslog \u00E0 une valeur sp\u00E9cifi\u00E9e dans RFC-5424 ou RFC-3164.
core.management.syslog-handler.protocol=Protocole \u00E0 utiliser pour le syslog handler. Doit correspondre strictement \u00E0 un 'udp', 'tcp' ou 'tls'.
core.management.syslog-handler.recycle=R\u00E9initialise le comptage des \u00E9checs de syslog handler, disconnecte et reconnecte au serveur de syslog.
core.management.syslog-client-cert-store=Configuration du keystore qui contient le certificat client si le serveur de syslog demande une authentification.
core.management.syslog-client-cert-store.add=Ajoute la configuration du keystore.
core.management.syslog-client-cert-store.remove=Supprime la configuration du keystore.
core.management.syslog-client-cert-store.key-password=Mot de passe pour la cl\u00E9 de keystore.
core.management.syslog-client-cert-store.keystore-password=Mot de passe du keystore.
core.management.syslog-client-cert-store.keystore-path=\=Chemin de keystore.
core.management.syslog-client-cert-store.keystore-relative-to=Nom d'un autre chemin nomm\u00E9 auparavant, ou un des chemins standards fournis par le syst\u00E8me. Si 'keystore-relative-to' est fourni, la valeur de l'attribut 'keystore-path' (chemin) sera trait\u00E9e comme \u00E9tant relative \u00E0 celle du chemin indiqu\u00E9 par cet attribut.
core.management.syslog-client-cert-store.server-keystore-path=Le 'keystore' substitu\u00E9 d'un fichier audit log \u00E0 utiliser pour installer le handler dans les serveurs g\u00E9r\u00E9s.
core.management.syslog-client-cert-store.server-keystore-relative-to=La valeur de 'keystore-relative-to' substitu\u00E9e D,un fichier d'audit log \u00E0 utiliser pour configurer le handler de serveurs g\u00E9r\u00E9s. Le nom d'un autre chemin pr\u00E9c\u00E9demment nomm\u00E9, ou de l'un des chemins d'acc\u00E8s standards fourni par le syst\u00E8me. Si 'relative-to' est fourni, la valeur de l'attribut 'path' sera trait\u00E9e en fonction du chemin sp\u00E9cifi\u00E9 par cet attribut.
core.management.syslog-truststore=Configuration du truststore pour le certificat de serveur, si non sign\u00E9 par une autorit\u00E9.
core.management.syslog-truststore.add=Ajoute la configuration du truststore.
core.management.syslog-truststore.remove=Supprime la configuration du truststore.
core.management.syslog-truststore.key-password=Mot de passe pour la cl\u00E9 du truststore.
core.management.syslog-truststore.keystore-password=Mot de passe du truststore.
core.management.syslog-truststore.keystore-path=\=Le chemin du truststore.
core.management.syslog-truststore.keystore-relative-to=Nom d'un autre chemin nomm\u00E9 auparavant, ou un des chemins standards fournis par le syst\u00E8me. Si 'keystore-relative-to' est fourni, la valeur de l'attribut 'keystore-path' (chemin) sera trait\u00E9e comme \u00E9tant relative \u00E0 celle du chemin indiqu\u00E9 par cet attribut.
core.management.syslog-truststore.server-keystore-path=Le 'keystore' substitu\u00E9 d'un fichier audit log \u00E0 utiliser pour installer le handler dans les serveurs g\u00E9r\u00E9s.
core.management.syslog-truststore.server-keystore-relative-to=La valeur de 'keystore-relative-to' substitu\u00E9e D,un fichier d'audit log \u00E0 utiliser pour configurer le handler de serveurs g\u00E9r\u00E9s. Le nom d'un autre chemin pr\u00E9c\u00E9demment nomm\u00E9, ou de l'un des chemins d'acc\u00E8s standards fourni par le syst\u00E8me. Si 'relative-to' est fourni, la valeur de l'attribut 'path' sera trait\u00E9e en fonction du chemin sp\u00E9cifi\u00E9 par cet attribut.
core.management.syslog-udp=Configuration pour ajouter au syslog sur udp/ip.
core.management.syslog-udp.add=Ajouter le protocole udp au syslog.
core.management.syslog-udp.remove=Supprimer le protocole udp au syslog.
core.management.syslog-udp.host=L'h\u00F4te du serveur de syslog pour les requ\u00EAtes udp.
core.management.syslog-udp.port=Le port du serveur syslog pour les requ\u00EAtes udp.
core.management.syslog-tcp=La configuration \u00E0 ajouter au syslog sur tcp/ip.
core.management.syslog-tcp.add=Ajouter le protocole tcp au syslog.
core.management.syslog-tcp.remove=Supprimer le protocole tcp au syslog.
core.management.syslog-tcp.host=L'h\u00F4te du serveur de syslog pour les requ\u00EAtes tcp.
core.management.syslog-tcp.message-transfer=La configuration du transfert de messages telle qu'elle est d\u00E9crite dans la section 3.4 de RFC-6587. Peut correspondre \u00E0 OCTET_COUNTING comme d\u00E9crit dans la section 3.4.1 de RFC-6587, ou NON_TRANSPARENT_FRAMING comme d\u00E9crit dans la section 3.4.1 de RFC-6587. Voir la documentation du fournisseur de syslog pour voir ce qui est pris en charge.
core.management.syslog-tcp.port=Le port du serveur syslog pour les requ\u00EAtes tcp.
core.management.syslog-tls.add=Ajouter le protocole tls au syslog sur protocole tcp/ip.
core.management.syslog-tls.remove=Supprimer le protocole tls au syslog sur protocole tcp/ip.
core.management.syslog-tls=La configuration \u00E0 ajouter au syslog sur tls sur tcp/ip.
core.management.syslog-tls.host=L'h\u00F4te du serveur de syslog pour les requ\u00EAtes tls sur tcp.
core.management.syslog-tls.message-transfer=La configuration du transfert de messages telle qu'elle est d\u00E9crite dans la section 3.4 de RFC-6587. Peut correspondre \u00E0 OCTET_COUNTING comme d\u00E9crit dans la section 3.4.1 de RFC-6587, ou NON_TRANSPARENT_FRAMING comme d\u00E9crit dans la section 3.4.1 de RFC-6587. Voir la documentation du fournisseur de syslog pour voir ce qui est pris en charge.
core.management.syslog-tls.port=Le port du serveur de syslog pour les requ\u00EAtes tls sur tcp.
core.management.syslog-tls.authentication=Configuration du truststore qui contient le certificat client si non sign\u00E9 par une autorit\u00E9, et pour le keystore contenant le certificat client si le serveur du syslog est d\u00E9fini pour recevoir une authentification de la part du client.
