server=El nodo ra\u00EDz del modelo de administraci\u00F3n a nivel de servidor.
server.name=El nombre de este servidor. Si no se establece entonces se predetermina al valor de tiempo de ejecuci\u00F3n de InetAddress.getLocalHost().getHostName().
server.extension=Una lista de m\u00F3dulos de extensi\u00F3n.
server.path=Una lista de rutas del sistema de archivos nombrado.
server.core-services=Servicios centrales proporcionados por el servidor.
server.management=Especifica protocolos de administraci\u00F3n habilitados para el servidor
server.profile=El nombre del perfil de configuraci\u00F3n del servidor.
server.subsystem=Los sub-sistemas que componen el perfil del servidor.
server.interface=Una lista de interfaces nombradas disponibles para el servidor.
server.socket-binding=Una lista de enlaces de sockets disponibles para el servidor.
server.system-properties=Una lista de propiedades del sistema para establecer en el servidor.
server.system-property=Una propiedad del sistema para establecer en el  servidor.
server.deployment=Una lista de implementaciones disponibles en el servidor.
server.state=El estado actual del controlador del servidor; ya sea STARTING, RUNNING o RESTART_REQUIRED
server.running-mode=El modo actual de ejecuci\u00F3n del servidor. Puede ser NORMAL  (operaciones normales) o ADMIN_ONLY.  Un servidor ADMIN_ONLY iniciar\u00E1 las interfaces de administraci\u00F3n configuradas y aceptar\u00E1 las peticiones de administraci\u00F3n, pero no iniciar\u00E1 servicios utilizados para el manejo de peticiones de usuarios finales.
server.process-type=El tipo de proceso representado por este recurso ra\u00EDz. Siempre tiene un valor de "Servidor" para un recurso de servidor.
server.launch-type=La forma en que se lanza el proceso del servidor. Ya sea "DOMAIN" para un servidor de dominio lanzado por un controlador de host, "STANDALONE" para un servidor aut\u00F3nomo lanzado desde la l\u00EDnea de comandos o "EMBEDDED" para un servidor aut\u00F3nomo  lanzado como parte incorporada de una aplicaci\u00F3n que se ejecuta en la misma m\u00E1quina virtual .
server.release-version=La versi\u00F3n del lanzamiento del servidor de aplicaciones de JBoss en la que est\u00E1 ejecut\u00E1ndose este servidor.
server.release-codename=El nombre del c\u00F3digo del lanzamiento del servidor de aplicaciones de JBoss en el que se est\u00E1 ejecutando este servidor.
server.product-name=El nombre del producto basado en JBoss AS que este servidor est\u00E1 ejecutando.
server.product-version=La versi\u00F3n del producto basado en JBoss AS que este servidor est\u00E1 ejecutando.
server.management-major-version=La versi\u00F3n m\u00E1s importante de la interfaz de administraci\u00F3n de JBoss AS que este servidor proporciona.
server.management-minor-version=La versi\u00F3n menor de la interfaz de administraci\u00F3n de JBoss AS que este servidor proporciona.
server.env=El entorno del servidor.
server.env.base-dir=El directorio base del servidor de aplicaciones JBoss.
server.env.config-dir=El directorio en donde se almacenan las configuraciones.
server.env.content-dir=El directorio donde se almacena el contenido de usuario administrado por el servidor.
server.env.config-file=El archivo de configuraci\u00F3n utilizado para lanzar el servidor de aplicaciones de JBoss.
server.env.data-dir=El directorio de datos.
server.env.deploy-dir=Variante descontinuada de 'content-dir'.
server.env.ext-dirs=Una lista de directorios de extensi\u00F3n
server.env.home-dir=El directorio base para el servidor de aplicaciones JBoss.
server.env.host-name=El nombre de host.
server.env.launch-type=El tipo de servidor en ejecuci\u00F3n.
server.env.log-dir=El directorio a donde se env\u00EDan los archivos de registro.
server.env.modules-dir=El directorio en donde se encuentran los m\u00F3dulos.
server.env.node-name=El nombre del nodo de servidor. 
server.env.qualified-host-name=El nombre de host completamente calificado. 
server.env.initial-running-mode=El modo actual en ejecuci\u00F3n del servidor. Puede ser LIVE (operaciones normales) o ADMIN_ONLY.  Un servidor ADMIN_ONLY iniciar\u00E1 las interfaces de administraci\u00F3n configuradas y aceptar\u00E1 las peticiones de administraci\u00F3n, pero no iniciar\u00E1 servicios utilizados para el manejo de peticiones de usuarios finales.
server.env.server-name=El nombre del servidor. 
server.env.temp-dir=El directorio temporal.
server.reload=Recarga el servidor al apagar todos sus servicios e iniciar de nuevo. La propia MVJ no se reinicia.
server.reload.admin-only=Si el servidor debe iniciarse en modo de ejecuci\u00F3n  ADMIN_ONLY cuando se reinicia. Un servidor ADMIN_ONLY iniciar\u00E1 las interfaces de administraci\u00F3n configuradas y aceptar\u00E1 las peticiones de administraci\u00F3n, pero no iniciar\u00E1 servicios utilizados para el manejo de peticiones de usuarios finales.
core.management=Los servicios de administraci\u00F3n utilizados para controlar un servidor.
core.management.security-realms=Los l\u00EDmites de seguridad disponibles para controlar el acceso a los servicios de administraci\u00F3n.
core.management.security-realm=Un l\u00EDmite de seguridad que se puede asociar con una interfaz de administraci\u00F3n y utilizar para controlar el acceso a los servicios de administraci\u00F3n.
core.management.security-realm.add=A\u00F1ade un l\u00EDmite de seguridad que se puede asociar con una interfaz de administraci\u00F3n y utilizar para controlar el acceso a los servicios de administraci\u00F3n.
core.management.outbound-connections=Configuraciones de f\u00E1bricas de conexiones que un contexto de seguridad puede utilizar para acceder a una fuente de autenticaci\u00F3n e informaci\u00F3n de  autorizaci\u00F3n. (por ejemplo, un servidor LDAP). 
core.management.outbound-connection=Una f\u00E1brica de conexiones que un contexto de seguridad puede utilizar para acceder a una fuente de autenticaci\u00F3n e informaci\u00F3n de  autorizaci\u00F3n. (por ejemplo, un servidor LDAP). 
core.management.outbound-connection.add=A\u00F1ade una f\u00E1brica de conexiones que un contexto de seguridad puede utilizar para acceder a una fuente de autenticaci\u00F3n e informaci\u00F3n de  autorizaci\u00F3n. (por ejemplo, un servidor LDAP). 
core.management.management-interfaces=Interfaces expuestas por los servicios de administraci\u00F3n para permitir a llamadores externos realizar tareas de administraci\u00F3n.
core.management.native-interface=Configuraci\u00F3n de la interfaz de administraci\u00F3n nativa del servidor
core.management.native-interface.add=A\u00F1ade la interfaz de administraci\u00F3n nativa del servidor
core.management.native-interface.remove=Borra la interfaz de administraci\u00F3n nativa del servidor
core.management.native-interface.interface=--use 'socket-binding' descontinuado. La interfaz de red  en la cual la comunicaci\u00F3n de administraci\u00F3n nativa del socket del servidor debe estar abierta. Debe ser 'indefinida' si se configura el atributo 'socket-binding'.
core.management.native-interface.port=--use 'socket-binding' descontinuado. El puerto de red  en el cual la comunicaci\u00F3n de administraci\u00F3n nativa del socket del servidor debe estar abierta. Debe ser 'indefinida' si se configura el atributo 'socket-binding'.
core.management.native-interface.security-realm=Los l\u00EDmites de seguridad a utilizar para la interfaz de administraci\u00F3n nativa.
core.management.native-interface.socket-binding=El nombre de la configuraci\u00F3n de enlace de sockets a utilizar para el socket de la interfaz de administraci\u00F3n nativa.
core.management.native-remoting-interface=Configuraci\u00F3n de la interfaz de administraci\u00F3n nativa del servidor mediante un conector del sub-sistema remoto.
core.management.native-remoting-interface.add=A\u00F1ade la interfaz de administraci\u00F3n nativa del servidor mediante un conector del sub-sistema remoto.
core.management.native-remoting-interface.remove=Borra la interfaz de administraci\u00F3n nativa del servidor mediante un conector del sub-sistema remoto.
core.management.http-interface=Configuraci\u00F3n de la interfaz de administraci\u00F3n HTTP del servidor
core.management.http-interface.add=A\u00F1ade la configuraci\u00F3n de la interfaz de administraci\u00F3n HTTP del servidor
core.management.http-interface.remove=A\u00F1ade la configuraci\u00F3n de la interfaz de administraci\u00F3n HTTP del servidor
core.management.http-interface.interface=--use 'socket-binding' descontinuado. La interfaz de red  en la cual la comunicaci\u00F3n de administraci\u00F3n HTTP del socket del servidor debe estar abierto. Debe ser 'indefinida' si se configura el atributo 'socket-binding' o 'secure-binding'.
core.management.http-interface.port=--use 'socket-binding' descontinuado. El puerto de red en el cual la comunicaci\u00F3n de administraci\u00F3n nativa del socket del servidor debe estar abierto. Debe ser 'indefinida' si se configura el atributo 'socket-binding'.
core.management.http-interface.secure-port=--use 'socket-binding' descontinuado. El puerto en el cual la comunicaci\u00F3n de administraci\u00F3n HTTPS del socket del servidor debe estar abierto. Debe ser 'indefinida' si se configura el atributo 'socket-binding'.
core.management.http-interface.security-realm=Los l\u00EDmites de seguridad a utilizar para la interfaz de administraci\u00F3n HTTP.
core.management.http-interface.socket-binding=El nombre de la configuraci\u00F3n de enlace de sockets a utilizar para el socket de la interfaz de administraci\u00F3n HTTP.
core.management.http-interface.secure-socket-binding=El nombre de la configuraci\u00F3n de enlace de sockets a utilizar para el socket de la interfaz de administraci\u00F3n HTTP.
core.management.http-interface.console-enabled=Bandera que indica que la consola de administraci\u00F3n est\u00E1 habilitada
core.service-container=El contenedor central que administra todos los servicios en un servidor aut\u00F3nomo ejecutando en un controlador de host en un dominio de administraci\u00F3n.
interface.resolve-internet-address=Toma una serie de criterios de resoluci\u00F3n de interfaz y busca una direcci\u00F3n IP en la m\u00E1quina local que coincida con los criterios o falle si no corresponde a la direcci\u00F3n encontrada.
interface.resolve-internet-address.reply=La cadena de direcci\u00F3n IP en presentaci\u00F3n textual.
deployment.remove=Borra una implementaci\u00F3n de la lista de contenido disponible. Si la implementaci\u00F3n actualmente se implementa en el tiempo de ejecuci\u00F3n, primero se borrar\u00E1 la implementaci\u00F3n.
composite=Una operaci\u00F3n que ejecuta una lista de otras operaciones como una unidad. 
composite.steps=Una lista en la que cada elemento tiene la misma estructura de una petici\u00F3n de operaci\u00F3n simple.
composite.result=Una lista en la que cada elemento es el resultado de un elemento colocado de forma equivalente  en la lista de par\u00E1metros de 'pasos'.
shutdown=Apaga el servidor a trav\u00E9s de una llamada a System.exit(0)
shutdown.restart=Si es verdadero, entonces una vez que se apague el servidor ser\u00E1 iniciado de nuevo
dump-services=Vac\u00EDa todos los servicios que se ejecutan en el contenedor, incluyendo su informaci\u00F3n de estatus y dependencia.
restart-required=Pone al servidor en un modo de reinicio-requerido.
