server=\u30B5\u30FC\u30D0\u30FC\u30EC\u30D9\u30EB\u7BA1\u7406\u30E2\u30C7\u30EB\u306E root \u30CE\u30FC\u30C9
server.name=\u3053\u306E\u30B5\u30FC\u30D0\u30FC\u306E\u540D\u524D\u3002\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u3001InetAddress.getLocalHost().getHostName() \u306E\u30E9\u30F3\u30BF\u30A4\u30E0\u5024\u306B\u30C7\u30D5\u30A9\u30EB\u30C8\u8A2D\u5B9A\u3055\u308C\u307E\u3059\u3002
server.extension=\u62E1\u5F35\u6A5F\u80FD\u30E2\u30B8\u30E5\u30FC\u30EB\u306E\u4E00\u89A7
server.path=\u540D\u524D\u3064\u304D\u306E\u30D5\u30A1\u30A4\u30EB\u30B7\u30B9\u30C6\u30E0\u30D1\u30B9\u306E\u4E00\u89A7
server.core-services=\u30B5\u30FC\u30D0\u30FC\u304C\u63D0\u4F9B\u3059\u308B\u30B3\u30A2\u30B5\u30FC\u30D3\u30B9
server.management=\u30B5\u30FC\u30D0\u30FC\u306B\u5BFE\u3057\u3066\u6709\u52B9\u3068\u306A\u3063\u3066\u3044\u308B\u7BA1\u7406\u30D7\u30ED\u30C8\u30B3\u30EB\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
server.profile=\u30B5\u30FC\u30D0\u30FC\u306E\u8A2D\u5B9A\u30D7\u30ED\u30D5\u30A1\u30A4\u30EB\u540D
server.subsystem=\u30B5\u30FC\u30D0\u30FC\u306E\u30D7\u30ED\u30D5\u30A1\u30A4\u30EB\u3092\u69CB\u6210\u3059\u308B\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0
server.interface=\u540D\u524D\u6307\u5B9A\u3055\u308C\u305F\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u3067\u3053\u306E\u30B5\u30FC\u30D0\u30FC\u3067\u5229\u7528\u53EF\u80FD\u306A\u3082\u306E\u306E\u4E00\u89A7
server.socket-binding=\u3053\u306E\u30B5\u30FC\u30D0\u30FC\u3067\u5229\u7528\u53EF\u80FD\u306A\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u4E00\u89A7
server.system-properties=\u3053\u306E\u30B5\u30FC\u30D0\u30FC\u306B\u8A2D\u5B9A\u3059\u308B\u30B7\u30B9\u30C6\u30E0\u30D7\u30ED\u30D1\u30C6\u30A3\u4E00\u89A7
server.system-property=\u3053\u306E\u30B5\u30FC\u30D0\u30FC\u306B\u8A2D\u5B9A\u3059\u308B\u30B7\u30B9\u30C6\u30E0\u30D7\u30ED\u30D1\u30C6\u30A3
server.deployment=\u3053\u306E\u30B5\u30FC\u30D0\u30FC\u3067\u5229\u7528\u53EF\u80FD\u306A\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u4E00\u89A7
server.state=\u30B5\u30FC\u30D0\u30FC\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u306E\u73FE\u5728\u306E\u30B9\u30C6\u30FC\u30BF\u30B9\u3002STARTING\u3001RUNNING\u3001RESTART_REQUIRED \u306E\u3044\u305A\u308C\u304B
server.running-mode=\u30B5\u30FC\u30D0\u30FC\u306E\u73FE\u5728\u306E\u5B9F\u884C\u30E2\u30FC\u30C9\u3002NORMAL (\u901A\u5E38\u306E\u64CD\u4F5C) \u3042\u308B\u3044\u306F ADMIN_ONLY\u3002ADMIN_ONLY \u30B5\u30FC\u30D0\u30FC\u306F\u8A2D\u5B9A\u6E08\u307F\u306E\u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u3092\u8D77\u52D5\u3057\u3001\u7BA1\u7406\u30EA\u30AF\u30A8\u30B9\u30C8\u3092\u53D7\u3051\u4ED8\u3051\u307E\u3059\u304C\u30A8\u30F3\u30C9\u30E6\u30FC\u30B6\u30FC\u306E\u30EA\u30AF\u30A8\u30B9\u30C8\u3092\u51E6\u7406\u3059\u308B\u969B\u306B\u5229\u7528\u3059\u308B\u30B5\u30FC\u30D3\u30B9\u306E\u958B\u59CB\u306F\u884C\u3044\u307E\u305B\u3093\u3002
server.process-type=\u3053\u306E root \u30EA\u30BD\u30FC\u30B9\u3067\u8868\u73FE\u3055\u308C\u308B\u30D7\u30ED\u30BB\u30B9\u578B\u3002\u30B5\u30FC\u30D0\u30FC\u30EA\u30BD\u30FC\u30B9\u306B\u306F\u5E38\u306B "Server" \u306E\u5024\u304C\u5165\u308A\u307E\u3059\u3002
server.launch-type=\u30B5\u30FC\u30D0\u30FC\u30D7\u30ED\u30BB\u30B9\u306E\u8D77\u52D5\u5F62\u5F0F\u3002\u5F62\u5F0F\u306F\u3001 "DOMAIN" (\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u3067\u8D77\u52D5\u3059\u308B\u30C9\u30E1\u30A4\u30F3\u30E2\u30FC\u30C9\u306E\u30B5\u30FC\u30D0\u30FC)\u3001"STANDALONE" (\u30B3\u30DE\u30F3\u30C9\u30E9\u30A4\u30F3\u304B\u3089\u8D77\u52D5\u3059\u308B\u30B9\u30BF\u30F3\u30C9\u30A2\u30ED\u30FC\u30F3\u30B5\u30FC\u30D0\u30FC)\u3001"EMBEDDED" (\u540C\u3058\u4EEE\u60F3\u30DE\u30B7\u30F3\u3067\u8D77\u52D5\u3059\u308B\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306E\u57CB\u3081\u8FBC\u307F\u90E8\u5206\u3068\u3057\u3066\u8D77\u52D5\u3059\u308B\u30B9\u30BF\u30F3\u30C9\u30A2\u30ED\u30F3\u30B5\u30FC\u30D0\u30FC) \u3068\u3044\u305A\u308C\u304B\u3068\u306A\u308A\u307E\u3059\u3002
server.release-version=\u3053\u306E\u30B5\u30FC\u30D0\u30FC\u304C\u4F5C\u52D5\u3059\u308B JBoss Application Server \u30EA\u30EA\u30FC\u30B9\u306E\u30D0\u30FC\u30B8\u30E7\u30F3
server.release-codename=\u3053\u306E\u30B5\u30FC\u30D0\u30FC\u304C\u4F5C\u52D5\u3059\u308B JBoss Application Server \u30EA\u30EA\u30FC\u30B9\u306E\u30B3\u30FC\u30C9\u540D
server.product-name=\u3053\u306E\u30B5\u30FC\u30D0\u30FC\u304C\u4F5C\u52D5\u3059\u308B JBoss AS \u30D9\u30FC\u30B9\u306E\u88FD\u54C1\u540D
server.product-version=\u3053\u306E\u30B5\u30FC\u30D0\u30FC\u304C\u4F5C\u52D5\u3059\u308B JBoss AS \u30D9\u30FC\u30B9\u306E\u88FD\u54C1\u30EA\u30EA\u30FC\u30B9\u30D0\u30FC\u30B8\u30E7\u30F3
server.management-major-version=\u3053\u306E\u30B5\u30FC\u30D0\u30FC\u304C\u63D0\u4F9B\u3059\u308B JBoss AS \u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u306E\u30E1\u30B8\u30E3\u30FC\u30D0\u30FC\u30B8\u30E7\u30F3
server.management-minor-version=\u3053\u306E\u30B5\u30FC\u30D0\u30FC\u304C\u63D0\u4F9B\u3059\u308B JBoss AS \u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u306E\u30DE\u30A4\u30CA\u30FC\u30D0\u30FC\u30B8\u30E7\u30F3
server.env=\u30B5\u30FC\u30D0\u30FC\u306E\u74B0\u5883
server.env.base-dir=JBoss Application Server \u306E\u30D9\u30FC\u30B9\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA
server.env.config-dir=\u8A2D\u5B9A\u304C\u4FDD\u5B58\u3055\u308C\u308B\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA
server.env.content-dir=\u30B5\u30FC\u30D0\u30FC\u304C\u7BA1\u7406\u3059\u308B\u30E6\u30FC\u30B6\u30FC\u30B3\u30F3\u30C6\u30F3\u30C4  (\u4F8B\uFF1A\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8) \u306E\u683C\u7D0D\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA
server.env.config-file=JBoss Applicaiton Server \u306E\u8D77\u52D5\u306B\u4F7F\u3046\u8A2D\u5B9A\u30D5\u30A1\u30A4\u30EB
server.env.data-dir=\u30C7\u30FC\u30BF\u306E\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA
server.env.deploy-dir='content-dir' \u306E\u5EC3\u6B62\u4E88\u5B9A\u306E\u30D0\u30EA\u30A2\u30F3\u30C8
server.env.ext-dirs=ext \u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u4E00\u89A7
server.env.home-dir=JBoss Application Server \u306E\u30DB\u30FC\u30E0\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA
server.env.host-name=\u30DB\u30B9\u30C8\u540D
server.env.launch-type=\u5B9F\u884C\u30B5\u30FC\u30D0\u30FC\u306E\u30BF\u30A4\u30D7
server.env.log-dir=\u30ED\u30B0\u30D5\u30A1\u30A4\u30EB\u9001\u4FE1\u5148\u306E\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA
server.env.modules-dir=\u30E2\u30B8\u30E5\u30FC\u30EB\u304C\u7F6E\u304B\u308C\u3066\u3044\u308B\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA
server.env.node-name=\u30B5\u30FC\u30D0\u30FC\u30CE\u30FC\u30C9\u540D
server.env.qualified-host-name=\u4FEE\u98FE\u30DB\u30B9\u30C8\u540D
server.env.initial-running-mode=\u30B5\u30FC\u30D0\u30FC\u306E\u73FE\u5728\u306E\u5B9F\u884C\u30E2\u30FC\u30C9\u3002LIVE (\u901A\u5E38\u306E\u64CD\u4F5C) \u3042\u308B\u3044\u306F ADMIN_ONLY\u3002ADMIN_ONLY \u30B5\u30FC\u30D0\u30FC\u306F\u8A2D\u5B9A\u6E08\u307F\u306E\u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u3092\u8D77\u52D5\u3057\u3001\u7BA1\u7406\u30EA\u30AF\u30A8\u30B9\u30C8\u3092\u53D7\u3051\u4ED8\u3051\u307E\u3059\u304C\u30A8\u30F3\u30C9\u30E6\u30FC\u30B6\u30FC\u306E\u30EA\u30AF\u30A8\u30B9\u30C8\u3092\u51E6\u7406\u3059\u308B\u969B\u306B\u5229\u7528\u3059\u308B\u30B5\u30FC\u30D3\u30B9\u306E\u958B\u59CB\u306F\u884C\u3044\u307E\u305B\u3093\u3002
server.env.server-name=\u30B5\u30FC\u30D0\u30FC\u540D
server.env.temp-dir=\u4E00\u6642\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA
server.reload=\u5168\u30B5\u30FC\u30D3\u30B9\u3092\u7D42\u4E86\u3057\u958B\u59CB\u3057\u306A\u304A\u3059\u3053\u3068\u3067\u30B5\u30FC\u30D0\u30FC\u3092\u30EA\u30ED\u30FC\u30C9\u3057\u307E\u3059\u3002JVM \u81EA\u4F53\u306F\u518D\u8D77\u52D5\u3057\u307E\u305B\u3093\u3002
server.reload.admin-only=\u30B5\u30FC\u30D0\u30FC\u304C\u518D\u8D77\u52D5\u6642\u306B ADMIN_ONLY \u306E\u5B9F\u884C\u30E2\u30FC\u30C9\u3067\u8D77\u52D5\u3059\u3079\u304D\u304B\u3002ADMIN_ONLY \u30B5\u30FC\u30D0\u30FC\u306F\u8A2D\u5B9A\u6E08\u307F\u306E\u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u3092\u8D77\u52D5\u3057\u3001\u7BA1\u7406\u30EA\u30AF\u30A8\u30B9\u30C8\u3092\u53D7\u3051\u4ED8\u3051\u307E\u3059\u304C\u30A8\u30F3\u30C9\u30E6\u30FC\u30B6\u30FC\u306E\u30EA\u30AF\u30A8\u30B9\u30C8\u3092\u51E6\u7406\u3059\u308B\u969B\u306B\u5229\u7528\u3059\u308B\u30B5\u30FC\u30D3\u30B9\u306E\u958B\u59CB\u306F\u884C\u3044\u307E\u305B\u3093\u3002
core.management=\u30B5\u30FC\u30D0\u30FC\u5236\u5FA1\u306B\u5229\u7528\u3059\u308B\u7BA1\u7406\u30B5\u30FC\u30D3\u30B9
core.management.security-realms=\u7BA1\u7406\u30B5\u30FC\u30D3\u30B9\u3078\u306E\u30A2\u30AF\u30BB\u30B9\u5236\u5FA1\u306B\u5229\u7528\u53EF\u80FD\u306A\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30EC\u30EB\u30E0
core.management.security-realm=\u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u306B\u95A2\u9023\u4ED8\u3051\u308B\u3053\u3068\u304C\u3067\u304D\u3001\u7BA1\u7406\u30B5\u30FC\u30D3\u30B9\u3078\u306E\u30A2\u30AF\u30BB\u30B9\u3092\u5236\u5FA1\u3059\u308B\u969B\u306B\u5229\u7528\u53EF\u80FD\u306A\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30EC\u30EB\u30E0
core.management.security-realm.add=\u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u306B\u95A2\u9023\u4ED8\u3051\u308B\u3053\u3068\u304C\u3067\u304D\u3001\u7BA1\u7406\u30B5\u30FC\u30D3\u30B9\u3078\u306E\u30A2\u30AF\u30BB\u30B9\u3092\u5236\u5FA1\u3059\u308B\u969B\u306B\u5229\u7528\u53EF\u80FD\u306A\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30EC\u30EB\u30E0\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
core.management.outbound-connections=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30EC\u30EB\u30E0\u304C\u8A8D\u8A3C\u3042\u308B\u3044\u306F\u6A29\u9650\u627F\u8A8D\u60C5\u5831\u306A\u3069\u306E\u5916\u90E8\u30BD\u30FC\u30B9\u3078\u30A2\u30AF\u30BB\u30B9\u3067\u304D\u308B\u3088\u3046\u306B\u5229\u7528\u3059\u308B\u63A5\u7D9A\u30D5\u30A1\u30AF\u30C8\u30EA\u8A2D\u5B9A (\u4F8B\uFF1ALDAP \u30B5\u30FC\u30D0\u30FC)
core.management.outbound-connection=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30EC\u30EB\u30E0\u304C\u8A8D\u8A3C\u3042\u308B\u3044\u306F\u6A29\u9650\u627F\u8A8D\u60C5\u5831\u306A\u3069\u306E\u5916\u90E8\u30BD\u30FC\u30B9\u3078\u30A2\u30AF\u30BB\u30B9\u3067\u304D\u308B\u3088\u3046\u306B\u5229\u7528\u3059\u308B\u63A5\u7D9A\u30D5\u30A1\u30AF\u30C8\u30EA\u8A2D\u5B9A (\u4F8B\uFF1ALDAP \u30B5\u30FC\u30D0\u30FC)
core.management.outbound-connection.add=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30EC\u30EB\u30E0\u304C\u8A8D\u8A3C\u3042\u308B\u3044\u306F\u6A29\u9650\u627F\u8A8D\u60C5\u5831\u306A\u3069\u306E\u5916\u90E8\u30BD\u30FC\u30B9\u3078\u30A2\u30AF\u30BB\u30B9\u3067\u304D\u308B\u3088\u3046\u306B\u5229\u7528\u3059\u308B\u63A5\u7D9A\u30D5\u30A1\u30AF\u30C8\u30EA\u8A2D\u5B9A (\u4F8B\uFF1ALDAP \u30B5\u30FC\u30D0\u30FC) \u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
core.management.management-interfaces=\u7BA1\u7406\u30B5\u30FC\u30D3\u30B9\u304C\u516C\u958B\u3059\u308B\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u3067\u3001\u5916\u90E8\u306E\u547C\u3073\u51FA\u3057\u5143\u304C\u7BA1\u7406\u30BF\u30B9\u30AF\u3092\u5B9F\u884C\u3067\u304D\u308B\u3088\u3046\u306B\u3057\u307E\u3059\u3002
core.management.native-interface=\u30B5\u30FC\u30D0\u30FC\u306E\u30CD\u30FC\u30C6\u30A3\u30D6\u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u8A2D\u5B9A
core.management.native-interface.add=\u30B5\u30FC\u30D0\u30FC\u306E\u30CD\u30FC\u30C6\u30A3\u30D6\u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u3092\u8FFD\u52A0
core.management.native-interface.remove=\u30B5\u30FC\u30D0\u30FC\u306E\u30CD\u30FC\u30C6\u30A3\u30D6\u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u3092\u524A\u9664
core.management.native-interface.interface=\u5EC3\u6B62\u3055\u308C\u307E\u3057\u305F -- 'socket-binding' \u3092\u5229\u7528\u3057\u3066\u304F\u3060\u3055\u3044\u3002\u30CD\u30FC\u30C6\u30A3\u30D6\u306E\u7BA1\u7406\u901A\u4FE1\u5411\u3051\u306E\u30B5\u30FC\u30D0\u30FC\u30BD\u30B1\u30C3\u30C8\u3092\u958B\u304F\u3079\u304D\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u3002'socket-binding' \u5C5E\u6027\u304C\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u306F 'undefined' \u3067\u306A\u3051\u308C\u3070\u306A\u308A\u307E\u305B\u3093\u3002
core.management.native-interface.port=\u5EC3\u6B62\u3055\u308C\u307E\u3057\u305F -- 'socket-binding' \u3092\u5229\u7528\u3057\u3066\u304F\u3060\u3055\u3044\u3002\u30CD\u30FC\u30C6\u30A3\u30D6\u306E\u7BA1\u7406\u901A\u4FE1\u5411\u3051\u306E\u30B5\u30FC\u30D0\u30FC\u30BD\u30B1\u30C3\u30C8\u3092\u958B\u304F\u3079\u304D\u30DD\u30FC\u30C8\u3002'socket-binding' \u5C5E\u6027\u304C\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u306F 'undefined' \u3067\u306A\u3051\u308C\u3070\u306A\u308A\u307E\u305B\u3093\u3002
core.management.native-interface.security-realm=\u30CD\u30FC\u30C6\u30A3\u30D6\u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u306B\u5229\u7528\u3059\u308B\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30EC\u30EB\u30E0
core.management.native-interface.socket-binding=\u30CD\u30FC\u30C6\u30A3\u30D6\u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u306E\u30BD\u30B1\u30C3\u30C8\u3092\u4F7F\u3046\u305F\u3081\u306E\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u8A2D\u5B9A\u540D
core.management.native-remoting-interface=\u30EA\u30E2\u30FC\u30C8\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u304B\u3089\u306E\u30B3\u30CD\u30AF\u30BF\u30FC\u3092\u4F7F\u3046\u30B5\u30FC\u30D0\u30FC\u306E\u30CD\u30FC\u30C6\u30A3\u30D6\u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u8A2D\u5B9A
core.management.native-remoting-interface.add=\u30EA\u30E2\u30FC\u30C8\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u304B\u3089\u306E\u30B3\u30CD\u30AF\u30BF\u30FC\u3092\u4F7F\u3046\u30B5\u30FC\u30D0\u30FC\u306E\u30CD\u30FC\u30C6\u30A3\u30D6\u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
core.management.native-remoting-interface.remove=\u30EA\u30E2\u30FC\u30C8\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u304B\u3089\u306E\u30B3\u30CD\u30AF\u30BF\u30FC\u3092\u4F7F\u3046\u30B5\u30FC\u30D0\u30FC\u306E\u30CD\u30FC\u30C6\u30A3\u30D6\u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u3092\u524A\u9664\u3057\u307E\u3059\u3002
core.management.http-interface=\u30B5\u30FC\u30D0\u30FC\u306E HTTP \u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u306E\u8A2D\u5B9A
core.management.http-interface.add=\u30B5\u30FC\u30D0\u30FC\u306E HTTP \u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u306E\u8A2D\u5B9A\u3092\u8FFD\u52A0
core.management.http-interface.remove=\u30B5\u30FC\u30D0\u30FC\u306E HTTP \u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u306E\u8A2D\u5B9A\u3092\u8FFD\u52A0
core.management.http-interface.interface=\u5EC3\u6B62\u3055\u308C\u307E\u3057\u305F -- 'socket-binding' \u3092\u5229\u7528\u3057\u3066\u304F\u3060\u3055\u3044\u3002HTTP \u7BA1\u7406\u901A\u4FE1\u5411\u3051\u306E\u30B5\u30FC\u30D0\u30FC\u30BD\u30B1\u30C3\u30C8\u3092\u958B\u304F\u3079\u304D\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u3002'socket-binding' \u3042\u308B\u3044\u306F 'secure-socket-binding' \u5C5E\u6027\u304C\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u306F 'undefined' \u3067\u306A\u3051\u308C\u3070\u306A\u308A\u307E\u305B\u3093\u3002
core.management.http-interface.port=\u5EC3\u6B62\u3055\u308C\u307E\u3057\u305F -- 'socket-binding' \u3092\u5229\u7528\u3057\u3066\u304F\u3060\u3055\u3044\u3002HTTP \u7BA1\u7406\u901A\u4FE1\u5411\u3051\u306E\u30B5\u30FC\u30D0\u30FC\u30BD\u30B1\u30C3\u30C8\u3092\u958B\u304F\u3079\u304D\u30DD\u30FC\u30C8\u3002'socket-binding' \u3042\u308B\u3044\u306F 'secure-socket-binding' \u5C5E\u6027\u304C\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u306F 'undefined' \u3067\u306A\u3051\u308C\u3070\u306A\u308A\u307E\u305B\u3093\u3002
core.management.http-interface.secure-port=\u5EC3\u6B62\u3055\u308C\u307E\u3057\u305F -- 'secure-socket-binding' \u3092\u5229\u7528\u3057\u3066\u304F\u3060\u3055\u3044\u3002HTTP \u7BA1\u7406\u901A\u4FE1\u5411\u3051\u306E\u30B5\u30FC\u30D0\u30FC\u30BD\u30B1\u30C3\u30C8\u3092\u958B\u304F\u3079\u304D\u30DD\u30FC\u30C8\u3002'socket-binding' \u3042\u308B\u3044\u306F 'secure-socket-binding' \u5C5E\u6027\u304C\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u306F 'undefined' \u3067\u306A\u3051\u308C\u3070\u306A\u308A\u307E\u305B\u3093\u3002
core.management.http-interface.security-realm=HTTP \u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u306B\u5229\u7528\u3059\u308B\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30EC\u30EB\u30E0
core.management.http-interface.socket-binding=HTTP \u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u306E\u30BD\u30B1\u30C3\u30C8\u3092\u4F7F\u3046\u305F\u3081\u306E\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u8A2D\u5B9A\u540D
core.management.http-interface.secure-socket-binding=HTTPS \u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u306E\u30BD\u30B1\u30C3\u30C8\u3092\u4F7F\u3046\u305F\u3081\u306E\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u8A2D\u5B9A\u540D
core.management.http-interface.console-enabled=\u7BA1\u7406\u30B3\u30F3\u30BD\u30FC\u30EB\u304C\u6709\u52B9\u3067\u3042\u308B\u3053\u3068\u3092\u793A\u3059\u30D5\u30E9\u30B0
core.service-container=\u7A3C\u50CD\u4E2D\u306E\u30B9\u30BF\u30F3\u30C9\u30A2\u30ED\u30FC\u30F3\u30B5\u30FC\u30D0\u30FC\u304B\u3001\u7BA1\u7406\u30C9\u30E1\u30A4\u30F3\u306E\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u5185\u306B\u3042\u308B\u5168\u30B5\u30FC\u30D3\u30B9\u3092\u7BA1\u7406\u3059\u308B\u96C6\u7D04\u30B3\u30F3\u30C6\u30CA\u30FC
interface.resolve-internet-address=\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u89E3\u6C7A\u57FA\u6E96\u3092\u53D6\u308A\u3001\u305D\u306E\u57FA\u6E96\u306B\u30DE\u30C3\u30C1\u3059\u308B\u30ED\u30FC\u30AB\u30EB\u30DE\u30B7\u30F3\u306E IP \u30A2\u30C9\u30EC\u30B9\u3092\u691C\u7D22\u3059\u308B\u304B\u3001\u4E00\u81F4\u3059\u308B IP \u30A2\u30C9\u30EC\u30B9\u304C\u898B\u3064\u304B\u3089\u306A\u3044\u5834\u5408\u306F\u5931\u6557\u3057\u307E\u3059\u3002
interface.resolve-internet-address.reply=\u30C6\u30AD\u30B9\u30C8\u8868\u73FE\u306E IP \u30A2\u30C9\u30EC\u30B9\u6587\u5B57\u5217
deployment.remove=\u5229\u7528\u53EF\u80FD\u306A\u30B3\u30F3\u30C6\u30F3\u30C4\u4E00\u89A7\u304B\u3089\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u3092\u524A\u9664\u3057\u3066\u304F\u3060\u3055\u3044\u3002\u73FE\u5728\u3053\u306E\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u304C\u30E9\u30F3\u30BF\u30A4\u30E0\u306B\u30C7\u30D7\u30ED\u30A4\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u306F\u3001\u307E\u305A\u30A2\u30F3\u30C7\u30D7\u30ED\u30A4\u3057\u3066\u304F\u3060\u3055\u3044\u3002
composite=\u4ED6\u306E\u64CD\u4F5C\u4E00\u89A7\u3092\uFF11\u3064\u306E\u30E6\u30CB\u30C3\u30C8\u3068\u3057\u3066\u5B9F\u884C\u3059\u308B\u64CD\u4F5C
composite.steps=\u4E00\u89A7\u5185\u306E\u5404\u30A2\u30A4\u30C6\u30E0\u304C\u5358\u7D14\u306A\u64CD\u4F5C\u30EA\u30AF\u30A8\u30B9\u30C8\u3068\u540C\u3058\u69CB\u9020\u3092\u6301\u3064\u4E00\u89A7
composite.result=\u5404\u30A2\u30A4\u30C6\u30E0\u304C 'steps' \u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u4E00\u89A7\u3067\u540C\u3058\u4F4D\u7F6E\u3065\u3051\u3092\u6301\u3064\u30A2\u30A4\u30C6\u30E0\u306E\u7D50\u679C\u3068\u306A\u3063\u3066\u3044\u308B\u4E00\u89A7
shutdown=System.exit(0) \u3078\u306E\u547C\u3073\u51FA\u3057\u3092\u4F7F\u3044\u30B5\u30FC\u30D0\u30FC\u3092\u30B7\u30E3\u30C3\u30C8\u30C0\u30A6\u30F3\u3057\u307E\u3059\u3002
shutdown.restart=True \u306E\u5834\u5408\u3001\u4E00\u65E6\u30B7\u30E3\u30C3\u30C8\u30C0\u30A6\u30F3\u3055\u308C\u3066\u3044\u305F\u30B5\u30FC\u30D0\u30FC\u306F\u518D\u8D77\u52D5\u3055\u308C\u307E\u3059\u3002
dump-services=\u30B9\u30C6\u30FC\u30BF\u30B9\u3084\u4F9D\u5B58\u60C5\u5831\u306A\u3069\u3092\u542B\u3081\u3001\u30B3\u30F3\u30C6\u30CA\u30FC\u3067\u5B9F\u884C\u4E2D\u306E\u30B5\u30FC\u30D3\u30B9\u3092\u3059\u3079\u3066\u30C0\u30F3\u30D7\u3057\u307E\u3059\u3002
restart-required=\u30B5\u30FC\u30D0\u30FC\u3092\u518D\u8D77\u52D5\u5FC5\u9808\u30E2\u30FC\u30C9\u306B\u8A2D\u5B9A\u3057\u307E\u3059\u3002
