server=O n\u00F3 da raiz do modelo do gerenciamento ao n\u00EDvel do servidor.
server.name=O nome desse servidor. Caso n\u00E3o seja determinado, ele \u00E9 padronizado ao valor do per\u00EDodo de rodagem do InetAddress.getLocalHost().getHostName().
server.extension=A lista dos m\u00F3dulos de extens\u00E3o.
server.path=A lista dos caminhos do filesystem nomeado.
server.core-services=Os servi\u00E7os centrais fornecidos pelo servidor.
server.management=Especifica os protocolos de gerenciamento ativado para o servidor
server.profile=O nome do perfil da configura\u00E7\u00E3o do servidor.
server.subsystem=Os sub-sistemas que criam o perfil do servidor.
server.interface=As interfaces da rede nomeada dispon\u00EDvel para uso no servidor.
server.socket-binding=A lista de bindings de soquete para uso no servidor.
server.system-properties=A lista de propriedades de sistema para determina\u00E7\u00E3o no servidor.
server.system-property=A propriedade de sistema para configura\u00E7\u00E3o no servidor.
server.deployment=A lista de implanta\u00E7\u00F5es dispon\u00EDveis para uso no servidor.
server.state=O estado atual do controlador do servidor\: tanto STARTING, RUNNING or RESTART_REQUIRED
server.running-mode=O mode de rodagem atual do servidor. Tanto NORMAL (opera\u00E7\u00E3o normal) ou ADMIN_ONLY.  Um servidor ADMIN_ONLY iniciar\u00E1 quaisquer interfaces de gerenciamento configuradas e aceitar\u00E1 solicita\u00E7\u00F5es de gerenciamento. No entanto, isto n\u00E3o iniciar\u00E1 servi\u00E7os usados para manuseio de solicita\u00E7\u00F5es de usu\u00E1rios finais.
server.process-type=O tipo de processo representado por esse recurso de raiz. Isto sempre possui o valor do "Servidor" para o recurso do servidor.
server.launch-type=A maneira pela qual o processo do servidor foi iniciado. Tanto o "DOMAIN" para um servidor do modo de dom\u00EDnio pelo Host Controller, "STANDALONE" para o servidor aut\u00F4nomo iniciado na linha de comando, ou "EMBEDDED" para o servidor aut\u00F4nomo iniciado na linha de comando como parte incorporada de um aplicativo rodando na mesma m\u00E1quina virtual.
server.release-version=A vers\u00E3o da libera\u00E7\u00E3o do Servidor do Aplicativo JBoss desse servidor est\u00E1 rodando.
server.release-codename=O codename da libera\u00E7\u00E3o do Servidor do Aplicativo JBoss que esse servidor est\u00E1 rodando.
server.product-name=O nome do JBoss AS baseado no produto que est\u00E1 rodando por esse servidor.
server.product-version=A vers\u00E3o do JBoss AS baseada na libera\u00E7\u00E3o do produto que est\u00E1 sendo rodada por esse servidor.
server.management-major-version=A vers\u00E3o principal da interface do gerenciamento do JBoss fornecida por esse servidor.
server.management-minor-version=A vers\u00E3o secund\u00E1ria da interface de gerenciamento do JBoss As fornecida por esse servidor.
server.env=O ambiente do servidor.
server.env.base-dir=O diret\u00F3rio base para o Servidor do Aplicativo JBoss.
server.env.config-dir=O diret\u00F3rio onde as configura\u00E7\u00F5es s\u00E3o armazenadas.
server.env.content-dir=O diret\u00F3rio onde o conte\u00FAdo do usu\u00E1rio (ex.\: implanta\u00E7\u00F5es) gerenciado por esse servidor \u00E9 instalado. 
server.env.config-file=O arquivo de configura\u00E7\u00E3o usado para lan\u00E7ar o Servidor do Aplicativo do JBoss.
server.env.data-dir=O diret\u00F3rio de dados.
server.env.deploy-dir=A variante preterida do 'content-dir'.
server.env.ext-dirs=A lista dos diret\u00F3rios externos.
server.env.home-dir=O diret\u00F3rio principal para o Servidor do Aplicativo JBoss.
server.env.host-name=O nome do host.
server.env.launch-type=O tipo de servidor em execu\u00E7\u00E3o.
server.env.log-dir=O diret\u00F3rio onde os arquivos log s\u00E3o enviados.
server.env.modules-dir=O diret\u00F3rio onde os m\u00F3dulos s\u00E3o encontrados.
server.env.node-name=O nome do n\u00F3 do servidor.
server.env.qualified-host-name=O nome do host qualificado.
server.env.initial-running-mode=O modo de rodagem atual do servidor. Tanto LIVE (opers\u00E7\u00F5es normais) ou ADMIN_ONLY.  Um servidor ADMIN_ONLY iniciar\u00E1 quaisquer interfaces de gerenciamento e aceitar\u00E1 solicita\u00E7\u00F5es. No entanto, isto n\u00E3o iniciar\u00E1 os servidores usados para as solicita\u00E7\u00F5es do usu\u00E1rio final.
server.env.server-name=O nome do servidor.
server.env.temp-dir=O diret\u00F3rio tempor\u00E1rio.
server.reload=Recarrega o servidor pela finaliza\u00E7\u00E3o de todos os seus servi\u00E7os e inicia-os novamente. O JVM n\u00E3o \u00E9 reiniciado.
server.reload.admin-only=Se \u00E9 que o servidor deve iniciar o ADMIN_ONLY no modo de rodagem quando reiniciado. Um servidor ADMIN_ONLY iniciar\u00E1 quaisquer interfaces de gerenciamento configuradas e aceitar\u00E1 as solicita\u00E7\u00F5es de gerenciamento. No entanto ele n\u00E3o iniciar\u00E1 os servi\u00E7os usados para manuseio das solicita\u00E7\u00F5es do usu\u00E1rio final.
core.management=Os servi\u00E7os de gerenciamento usados para controlar o servidor.
core.management.security-realms=Os realms de seguran\u00E7a dispon\u00EDveis para acesso de controle aos servi\u00E7os de gerenciamento.
core.management.security-realm=O realm de seguran\u00E7a que pode ser associado \u00E0 interface de gerenciamento e usado para controlar o acesso aos servi\u00E7os de gerenciamento.
core.management.security-realm.add=Adiciona o realm de seguran\u00E7a que pode ser associado com uma interface de gerenciamento e usado para controlar o acesso aos servi\u00E7os de gerenciamento.
core.management.outbound-connections=As configura\u00E7\u00F5es de cria\u00E7\u00E3o de conex\u00E3o que podem ser usadas pelo realm de seguran\u00E7a para acesso da fonte externa de informa\u00E7\u00E3o da autentica\u00E7\u00E3o e autoriza\u00E7\u00E3o.
core.management.outbound-connection=A cria\u00E7\u00E3o da conex\u00E3o que pode ser usada pelo realm de seguran\u00E7a para acesso da fonte externa da informa\u00E7\u00E3o de autentica\u00E7\u00E3o e autoriza\u00E7\u00E3o (ex.\: um servidor LDAP). 
core.management.outbound-connection.add=Adiciona a cria\u00E7\u00E3o da conex\u00E3o que pode ser usada pelo realm de seguran\u00E7a para acesso da fonte externa da informa\u00E7\u00E3o de autoriza\u00E7\u00E3o e autentica\u00E7\u00E3o (ex.\: um servidor LDAP).
core.management.management-interfaces=As interfaces expostas pelos servi\u00E7os de gerenciamento para permitir que chamadores externos executem as tarefas de gerenciamento.
core.management.native-interface=A configura\u00E7\u00E3o da interface de gerenciamento nativo do servidor.
core.management.native-interface.add=Adiciona a interface de gerenciamento nativo do servidor.
core.management.native-interface.remove=Remove a interface de gerenciamento nativo do servidor.
core.management.native-interface.interface=Preterido -- use 'socket-binding'. A interface da rede pela qual o soquete do servidor para a comunica\u00E7\u00E3o de gerenciamento nativo deve ser aberta. Ela deve ser 'indefinida', caso o atributo 'socket-binding' esteja configurado.
core.management.native-interface.port=Preterido -- use 'socket-binding'. A porta pela qual o soquete do servidor para a comunica\u00E7\u00E3o de gerenciamento nativo deve ser aberta. Ela deve ser 'indefinida', caso o atributo 'socket-binding' esteja configurado.
core.management.native-interface.security-realm=O realm de seguran\u00E7a para uso na interface de gerenciamento nativo
core.management.native-interface.socket-binding=O nome da configura\u00E7\u00E3o binding de soquete para uso no soquete da interface de gerenciamento nativo.
core.management.native-remoting-interface=A configura\u00E7\u00E3o da interface do gerenciamento nativo do servidor usando um conector do sub-sistema remoto.
core.management.native-remoting-interface.add=Adiciona a interface de gerenciamento nativo do servidor usando o conector do sub-sistema remoto.
core.management.native-remoting-interface.remove=Remove a interface de gerenciamento nativo do servidor usando o conector do sub-sistema remoto.
core.management.http-interface=A configura\u00E7\u00E3o da interface de gerenciamento HTTP do servidor
core.management.http-interface.add=Adiciona a configura\u00E7\u00E3o da interface do gerenciamento HTTP do servidor
core.management.http-interface.remove=Adiciona a configura\u00E7\u00E3o da interface do gerenciamento HTTP do servidor
core.management.http-interface.interface=Preterido -- use 'socket-binding'. A interface da rede pela qual o soquete do servidor para a comunica\u00E7\u00E3o de gerenciamento HTTP deve ser aberta. Ela deve ser 'indefinida', caso o atributo 'socket-binding' esteja configurado.
core.management.http-interface.port=Preterido -- use 'socket-binding'. A porta pela qual o soquete do servidor para a comunica\u00E7\u00E3o de gerenciamento HTTP deve ser aberta. Ela deve ser 'indefinida', caso o atributo 'socket-binding' esteja configurado.
core.management.http-interface.secure-port=Preterido -- use 'socket-binding'. A porta pela qual o soquete do servidor para a comunica\u00E7\u00E3o de gerenciamento HTTPS deve ser aberta. Ela deve ser 'indefinida', caso o atributo 'socket-binding' esteja configurado.
core.management.http-interface.security-realm=O realm de seguran\u00E7a para uso na interface de gerenciamento HTTP.
core.management.http-interface.socket-binding=O nome de configura\u00E7\u00E3o binding do soquete para uso do soquete da interface de gerenciamento HTTP.
core.management.http-interface.secure-socket-binding=O nome da configura\u00E7\u00E3o binding do soquete para uso do soquete da interface de gerenciamento HTTPS.
core.management.http-interface.console-enabled=O aviso indicando que o consolo admin est\u00E1 ativado
core.service-container=O recipiente principal que gerencia todos os servi\u00E7os num servidor aut\u00F4nomo ou num controlador do host num dom\u00EDnio de gerenciamento.
interface.resolve-internet-address=Isto obt\u00E9m um conjunto de crit\u00E9rio de resolu\u00E7\u00E3o de interface e encontra um endere\u00E7o IP na m\u00E1quina local que coincide com o crit\u00E9rio ou falha, caso nenhum endere\u00E7o IP possa ser encontrado. 
interface.resolve-internet-address.reply=O endere\u00E7o IP na apresenta\u00E7\u00E3o textual.
deployment.remove=Remove a implanta\u00E7\u00E3o da lista de conte\u00FAdo dispon\u00EDvel para uso. Caso a implanta\u00E7\u00E3o estiver implantada no per\u00EDodo de rodagem, ela ser\u00E1 a primeira a ser desimplantada.
composite=A opera\u00E7\u00E3o que executa a lista de outras opera\u00E7\u00F5es como uma unidade.
composite.steps=Uma lista, onde cada item da lista possui a mesmo estrutura \u00E0 da solicita\u00E7\u00E3o de opera\u00E7\u00E3o simples.
composite.result=Uma lista, onde cada item na lista \u00E9 resultado para o item posicionado na lista de par\u00E2metro das 'estapas'
shutdown=Encerra o servidor atrav\u00E9s de uma chamada ao System.exit(0)
shutdown.restart=Caso verdadeiro, uma vez encerrado o servidor ser\u00E1 reiniciado novamente
dump-services=Despeja todos os servi\u00E7os rodando no recipiente, incluindo suas informa\u00E7\u00F5es de status e depend\u00EAncia. 
restart-required=Coloca o servidor no modo de inicializa\u00E7\u00E3o-requerida.
