messaging=El sub-sistema de mensajer\u00EDa.
messaging.add=Operaci\u00F3n agregando el sub-sistema de mensajer\u00EDa.
messaging.remove=Operaci\u00F3n borrando el sub-sistema de mensajer\u00EDa.
messaging.hornetq-server=Servidores HornetQ proporcionados por el sub-sistema de mensajer\u00EDa
hornetq-server=Una instancia del servidor HornetQ.
hornetq-server.add=Operaci\u00F3n agregando un servidor HornetQ.
hornetq-server.remove=Operaci\u00F3n borrando un servidor HornetQ.
hornetq-server.name=No utilizado.
hornetq-server.clustered=Si el servidor est\u00E1 en cl\u00FAsters.
hornetq-server.persistence-enabled=Si el servidor utilizar\u00E1 el diario basado en archivos para persistencia.
hornetq-server.scheduled-thread-pool-max-size=El n\u00FAmero de hilos que tiene el grupo de hilos principal programado.
hornetq-server.thread-pool-max-size=El n\u00FAmero de hilos que tiene el grupo de hilos principal .  -1 significa que no hay l\u00EDmite.
hornetq-server.security-domain=El dominio de seguridad a utilizar para verificar la informaci\u00F3n de usuarios y roles. 
hornetq-server.security-enabled=Si la seguridad est\u00E1 habilitada.
hornetq-server.security-invalidation-interval=\u00BFCu\u00E1nto tiempo (en ms) debe esperar antes de invalidar la cache de seguridad?
hornetq-server.wild-card-routing-enabled=Si el servidor soporta el enrutamiento de comodines.
hornetq-server.management-address=Direcci\u00F3n a la cual enviar mensajes de administraci\u00F3n.
hornetq-server.management-notification-address=El nombre de la direcci\u00F3n a la que los usuarios se conectan para recibir notificaciones de administraci\u00F3n.
hornetq-server.cluster-user=El usuario utilizado por conexiones de cl\u00FAster para comunicarse entre los nodos agrupados. 
hornetq-server.cluster-password=La contrase\u00F1a utilizada por conexiones de cl\u00FAster para comunicarse entre los nodos agrupados. 
hornetq-server.jmx-management-enabled=Si HornetQ debe exponer su API de administraci\u00F3n interna a trav\u00E9s de  JMX.  Esto se recomienda, ya que el acceso a los MBeans puede conducir a una configuraci\u00F3n inconsistente.
hornetq-server.jmx-domain=El dominio de JMX utilizado para registrar  MBeans HornetQ  en el MBeanServer.
hornetq-server.message-counter-enabled=Si los contadores de mensajes est\u00E1n habilitados. 
hornetq-server.message-counter-sample-period=El periodo de ejemplo (en ms) a usar para contadores de mensajes.
hornetq-server.message-counter-max-day-history=\u00BFPor cu\u00E1ntos d\u00EDas mantener la historia del contador de mensajes? 
hornetq-server.connection-ttl-override=Si se establece, sobrescribir\u00E1 el tiempo (en ms) para mantener una conexi\u00F3n viva sin recibir un ping.
hornetq-server.async-connection-execution-enabled=Si los paquetes entrantes en el servidor deben ser entregados a un hilo del grupo de hilos para procesamiento. Falso si deben ser entregados en el hilo remoto.
hornetq-server.transaction-timeout=El tiempo (en ms) antes de que una transacci\u00F3n pueda retirarse del administrador de recursos despu\u00E9s de create time.
hornetq-server.transaction-timeout-scan-period=Frecuencia (en ms) para escanear  transacciones que han expirado.
hornetq-server.message-expiry-scan-period=Frecuencia (en ms) para escanear mensajes que han expirado.
hornetq-server.message-expiry-thread-priority=La prioridad del hilo de mensajes de expiraci\u00F3n.
hornetq-server.id-cache-size=El tama\u00F1o de cache para creaci\u00F3n previa de los ID de mensajes
hornetq-server.persist-id-cache=Si los ID son persistentes para el diario
hornetq-server.remoting-interceptors=La lista de clases de interceptores utilizados por el servidor.
hornetq-server.backup=Si este servidor es un servidor de respaldo.
hornetq-server.allow-failback=Si este servidor se apagar\u00E1 autom\u00E1ticamente si  se vuelve a subir el servidor vivo original.
hornetq-server.failback-delay=El tiempo de espera antes de que ocurra la recuperaci\u00F3n en el reinicio del servidor vivo.  
hornetq-server.failover-on-shutdown=Si este servidor de respaldo (si es un servidor de respaldo) debe activarse en un apagado normal de servidor.
hornetq-server.shared-store=Si este servidor est\u00E1 utilizando un almacenamiento compartido para recuperaci\u00F3n.
hornetq-server.persist-delivery-count-before-delivery=SI el contador de entregas es persistente antes de la entrega. Falso significa que esto solamente ocurre despu\u00E9s de que se haya cancelado un mensaje.
hornetq-server.live-connector-ref=El nombre del conector utilizado para el conector vivo. Si este servidor no es una copia de respaldo que utiliza   HA nada compartido,  el valor es 'indefinido'. 
hornetq-server.create-bindings-dir=Si el servidor debe crear el directorio de enlaces en el inicio.  
hornetq-server.create-journal-dir=Si el servidor debe crear el directorio del diario en el inicio.
hornetq-server.journal-type=El tipo diario a utilizar.
hornetq-server.journal-buffer-timeout=El tiempo de expiraci\u00F3n (en nano'segundos) utilizado para vaciar buffers internos en el diario. 
hornetq-server.journal-buffer-size=Tama\u00F1o del buffer interno en el diario.
hornetq-server.journal-sync-transactional=Si se debe esperar a que los datos de transacci\u00F3n se sincronicen con el diario antes de devolver una respuesta al cliente. 
hornetq-server.journal-sync-non-transactional=Si se debe esperar  a que ning\u00FAn dato de transacci\u00F3n se sincronice con el diario antes de devolver una respuesta al cliente. 
hornetq-server.log-journal-write-rate=Si peri\u00F3dicamente se deben registrar la tasa de escritura del diario y la tasa de vaciado.
hornetq-server.journal-file-size=El tama\u00F1o (en bytes) de cada archivo de diario.
hornetq-server.journal-min-files=El n\u00FAmero de archivos de diario a crear previamente.
hornetq-server.journal-compact-percentage=El porcentaje de datos vivos en los cuales consideramos compactar el diario.
hornetq-server.journal-compact-min-files=El n\u00FAmero de archivos de datos de diario antes de poder  empezar a compactar.
hornetq-server.journal-max-io=El n\u00FAmero m\u00E1ximo de solicitudes de escritura que pueden estar en cola AIO en cualquier momento.
hornetq-server.perf-blast-pages=TODO
hornetq-server.run-sync-speed-test=Si debe realizar al inicio una prueba de diagn\u00F3stico sobre qu\u00E9 tan r\u00E1pido puede sincronizarse su disco. Es \u00FAtil para determinar problemas de rendimiento.
hornetq-server.server-dump-interval=La frecuencia de vaciado de informaci\u00F3n del tiempo de ejecuci\u00F3n b\u00E1sico al registro del servidor . Un valor inferior a 1 desactiva esta funcionalidad. 
hornetq-server.memory-warning-threshold=Porcentaje de memoria disponible que si se excede,  da lugar a un registro de advertencia. 
hornetq-server.memory-measure-interval=La frecuencia para muestra de memoria JVM en ms (o -1 para desactivar el muestreo de memoria) 
hornetq-server.started=Si se inicia este servidor.
hornetq-server.version=La versi\u00F3n del servidor.
match=Expresi\u00F3n coincidi\u00F3 con una direcci\u00F3n de cola. 
hornetq-server.get-connectors-as-json=Retorna los conectores configurados para este servidor mediante serializaci\u00F3n de JSON.
hornetq-server.get-connectors-as-json.reply=Una cadena en formato JSON.
hornetq-server.enable-message-counters=Habilita contadores de mensajes.
hornetq-server.disable-message-counters=Inhabilita contadores de mensajes.
hornetq-server.reset-all-message-counters=Restablece todos los contadores de mensajes.
hornetq-server.reset-all-message-counter-histories=Restablece la historia de loa contadores de mensajes.
hornetq-server.list-prepared-transactions=Lista todas las transacciones preparadas, clasificadas por fecha, la menos reciente al comienzo. 
hornetq-server.list-prepared-transactions.reply=Una lista de todas las cadenas. Las cadenas son representaci\u00F3n de base-64 de la transacci\u00F3n XID y se pueden utilizar para guardar o  cambiar las transacciones de forma heur\u00EDstica. 
hornetq-server.list-prepared-transaction-details-as-json=Lista todas las transacciones preparadas, clasificadas por fecha, la menos reciente primero, con informaci\u00F3n, en formato JSON. 
hornetq-server.list-prepared-transaction-details-as-json.reply=La cadena devuelta es una cadena JSON que contiene una serie de detalles de la transacci\u00F3n.
hornetq-server.list-prepared-transaction-details-as-html=Lista todas las transacciones preparadas, clasificadas por fecha, la menos reciente primero, con informaci\u00F3n, en formato HTML.
hornetq-server.list-prepared-transaction-details-as-html.reply=La cadena devuelta es una cadena HTML que contiene una serie de detalles de la transacci\u00F3n.
hornetq-server.list-heuristic-committed-transactions=Lista las transacciones que han sido guardadas de forma heur\u00EDstica.
hornetq-server.list-heuristic-committed-transactions.reply=Una lista de cadenas. Las cadenas son representaci\u00F3n de base-64 de la transacci\u00F3n XID. 
hornetq-server.list-heuristic-rolled-back-transactions=Lista las transacciones que han sido cambiadas de forma heur\u00EDstica.
hornetq-server.list-heuristic-rolled-back-transactions.reply=Una lista de cadenas. Las cadenas son representaci\u00F3n de base-64 de la transacci\u00F3n XID. 
hornetq-server.commit-prepared-transaction=Guarda de forma heur\u00EDstica una transacci\u00F3n preparada.
hornetq-server.commit-prepared-transaction.transaction-as-base-64=La representaci\u00F3n de base-64 de una transacci\u00F3n XID. 
hornetq-server.commit-prepared-transaction.reply=Verdadero, si la transacci\u00F3n se guard\u00F3 correctamente y falso, lo contrario. 
hornetq-server.rollback-prepared-transaction=Cambia de forma heur\u00EDstica una transacci\u00F3n preparada.
hornetq-server.rollback-prepared-transaction.transaction-as-base-64=La representaci\u00F3n de base-64 de una transacci\u00F3n XID. 
hornetq-server.rollback-prepared-transaction.reply=Verdadero, si la transacci\u00F3n se cambi\u00F3 correctamente y falso, lo contrario. 
hornetq-server.list-remote-addresses=Lista las  direcciones de todos los clientes conectados a una direcci\u00F3n determinada. Si se proporciona un argumento de direcci\u00F3n IP, solamente los clientes cuya cadena de direcci\u00F3n remota incluya la cadena de direcci\u00F3n determinada retornar\u00E1n. 
hornetq-server.list-remote-addresses.ip-address=Una direcci\u00F3n IP en formato de cadena.
hornetq-server.list-remote-addresses.reply=Una lista de cadenas, donde las cadenas son direcciones de clientes remotos.
hornetq-server.close-connections-for-address=Cierra todas las conexiones de clientes conectados a este servidor cuya direcci\u00F3n remota contiene la direcci\u00F3n IP especificada. 
hornetq-server.close-connections-for-address.ip-address=Una direcci\u00F3n IP en formato de cadena.
hornetq-server.close-connections-for-address.reply=Verdadero, si las conexiones fueron cerradas o falso, lo contrario. 
hornetq-server.list-connection-ids=Lista los ID de todas las conexiones a este servidor.
hornetq-server.list-connection-ids.reply=Una lista de cadenas, donde cada cadena es un ID de conexi\u00F3n.
hornetq-server.list-producers-info-as-json=Para todas las sesiones, lista informaci\u00F3n sobre procedimientos de mensajes mediante serializaci\u00F3n de JSON\:
hornetq-server.list-producers-info-as-json.reply=La cadena devuelta es una cadena JSON que contiene una serie de detalles de los productores.
hornetq-server.list-sessions=Lista todas las ID de sesiones para un ID de conexi\u00F3n especificada.
hornetq-server.list-sessions.connection-id=El ID de conexi\u00F3n.
hornetq-server.list-sessions.reply=Una lista de cadenas, donde cada cadena es un ID de sesi\u00F3n.
hornetq-server.get-roles=Obtiene roles de seguridad para una coincidencia de direcci\u00F3n espec\u00EDfica.
hornetq-server.get-roles.address-match=Una coincidencia de direcci\u00F3n.
hornetq-server.get-roles.reply=Una lista , cada elemento del cual es una serie de propiedades que describen un rol de seguridad.
hornetq-server.get-roles-as-json=Obtiene roles de seguridad (como un JSON) para una coincidencia de direcci\u00F3n espec\u00EDfica.
hornetq-server.get-roles-as-json.address-match=Una coincidencia de direcci\u00F3n.
hornetq-server.get-roles-as-json.reply=La cadena devuelta es una cadena JSON que contiene una serie de detalles del rol de seguridad.
hornetq-server.get-address-settings-as-json=Devuelve los par\u00E1metros de direcci\u00F3n como una cadena JSON para una coincidencia de direcci\u00F3n. 
hornetq-server.get-address-settings-as-json.address-match=Una coincidencia de direcci\u00F3n.
hornetq-server.get-address-settings-as-json.reply=La cadena devuelta es una cadena JSON que contiene una serie de detalles de los par\u00E1metros de direcci\u00F3n.
hornetq-server.force-failover=Obliga al servidor de mensajes a detener y notificar clientes para recuperaci\u00F3n. 
jms-server.list-connections-as-json=Lista todas las conexiones JMS.
jms-server.list-connections-as-json.reply=La cadena devuelta es una cadena JSON que contiene una serie de objetos de JMSConnectioninfo.
jms-server.list-consumers-as-json=Lista todos los usuarios que pertenecen a la conexi\u00F3n JMS especificada por el ID de conexi\u00F3n.
jms-server.list-consumers-as-json.connection-id=El ID de conexi\u00F3n.
jms-server.list-consumers-as-json.reply=La cadena devuelta es una cadena JSON que contiene una serie de objetos de JMSConsumerinfo.
jms-server.list-all-consumers-as-json=Lista de todos los usuarios.
jms-server.list-all-consumers-as-json.reply=La cadena devuelta es una cadena JSON que contiene una serie de objetos de JMSConsumerinfo.
jms-server.list-target-destinations=Lista todas las direcciones a las que la sesi\u00F3n designada ha enviado mensajes.
jms-server.list-target-destinations.session-id=El ID de sesi\u00F3n.
jms-server.list-target-destinations.reply=La cadena devuelta es una cadena JSON que contiene una serie de nombres de direcciones.
jms-server.get-last-sent-message-id=Retorna el ID del \u00FAltimo mensaje enviado desde la sesi\u00F3n determinada a la direcci\u00F3n especificada. 
jms-server.get-last-sent-message-id.session-id=El ID de sesi\u00F3n.
jms-server.get-last-sent-message-id.reply=El ID de mensaje.
jms-server.get-session-creation-time=Obtiene el tiempo de creaci\u00F3n de la sesi\u00F3n.
jms-server.get-session-creation-time.session-id=El ID de sesi\u00F3n.
jms-server.get-session-creation-time.reply=El tiempo de creaci\u00F3n, representado como una cadena que muestra el n\u00FAmero de mili-segundos desde  la \u00E9poca.
jms-server.list-sessions-as-json=Lista todas los ID de sesiones para un ID de conexi\u00F3n especificado.
jms-server.list-sessions-as-json.connection-id=El ID de conexi\u00F3n.
jms-server.list-sessions-as-json.reply=La cadena devuelta es una cadena JSON que contiene una serie de ID de sesi\u00F3n.
jms-server.list-prepared-transaction-jms-details-as-json=Lista todas las transacciones preparadas, clasificadas por fecha, la menos reciente primero, con detalles, en formato JMS, en formato JSON.
jms-server.list-prepared-transaction-jms-details-as-json.reply=La cadena devuelta es una cadena JSON que contiene una serie de detalles de la transacci\u00F3n.
jms-server.list-prepared-transaction-jms-details-as-html=Lista todas las transacciones preparadas, clasificadas por fecha, la menos reciente primero, con detalles en JMS, en formato HTML.
jms-server.list-prepared-transaction-jms-details-as-html.reply=La cadena devuelta es una cadena HTML que contiene una serie de detalles de la transacci\u00F3n.
path=Un sistema de archivos que apunta a uno de los sitios donde HornetQ almacena datos persistentes.
path.add=A\u00F1adir una ruta de sistema de archivos.
path.remove=Borrar una ruta.
path.path=La ruta de sistema de archivos real. Tratada como una ruta absoluta, a menos que se especifique el atributo 'relativo a', en cuyo caso el valor se trata como relativo a esa ruta. <p>Si se trata como una ruta absoluta, el nombre de ruta en tiempo de ejecuci\u00F3n real especificado por el valor de este atributo se determinar\u00E1 de la siguiente manera\: </p>Si este valor es ya absoluto, entonces el valor se utiliza directamente. De lo contrario,  el nombre de ruta en tiempo de ejecuci\u00F3n se resuelve de forma dependiente del sistema. En los sistemas UNIX, un nombre de ruta relativo se hace absoluto si se resuelve con el directorio del usuario actual. En los sistemas Microsoft Windows, un nombre de ruta relativo se hace absoluto al resolverlo con el directorio actual de la unidad con el nombre de la ruta, si lo hay, y si no, se resuelve con el directorio del usuario actual.
path.relative-to=El nombre de otra ruta nombrada previamente o de una de las rutas est\u00E1ndar que el  sistema proporciona. Si se brinda 'relative-to' entonces el valor del atributo 'path' se trata como relativo a la ruta especificada por este atributo. Las rutas est\u00E1ndar que el sistema proporciona incluyen\:<ul><li>jboss.home - el directorio ra\u00EDz de la distribuci\u00F3n JBoss AS</li><li>user.home - el directorio de inicio del usuario</li><li>user.dir - el directorio de trabajo actual del usuario</li><li>java.home - directorio de instalaci\u00F3n java</li><li>jboss.server.base.dir - directorio ra\u00EDz para una instancia individual del servidor</li><li>jboss.server.data.dir - directorio que el servidor utilizar\u00E1 para almacenamiento de archivos de datos persistentes</li><li>jboss.server.log.dir - directorio que el servidor utilizar\u00E1 para el almacenamiento de archivos de registro</li><li>jboss.server.tmp.dir - directorio que el servidor utilizar\u00E1 para almacenamiento de archivos temporales</li><li>jboss.domain.servers.dir - directorio bajo el cual un controlador de hosts crear\u00E1 el \u00E1rea de trabajo para instancias individuales del servidor</li></ul>
bindings-directory.path=El directorio en el cual reside el diario de enlaces. El predeterminado es ${jboss.server.data.dir}/messaging/bindings. 
journal-directory.path=El directorio en el cual reside el diario de mensajes. El predeterminado es ${jboss.server.data.dir}/messaging/journal.
large-messages-directory.path=El directorio en el cual se almacenan grandes mensajes. El predeterminado es ${jboss.server.data.dir}/messaging/largemessages.
paging-directory.path=El directorio a donde se almacenan los archivos de pa\u01F5ina. El predeterminado es  ${jboss.server.data.dir}/messaging/paging.
grouping-handler=Toma decisiones sobre cu\u00E1l nodo en un cl\u00FAster debe manejar un mensaje con un ID de grupo asignado. 
grouping-handler.add=Operaci\u00F3n de adici\u00F3n de un controlador de agrupamiento. Solamente se permite un controlador de agrupamiento.
grouping-handler.remove=Operaci\u00F3n de borrado de un controlador de agrupamiento.
grouping-handler.type=Si se trata de un controlador individual "Local" para el cl\u00FAster quel toma decisiones de manejo o de un controlador "Remoto" que conversa con el controlador local.
grouping-handler.grouping-handler-address=Una referencia a una conexi\u00F3n de cl\u00FAster y la direcci\u00F3n que utiliza.
grouping-handler.timeout=Por cu\u00E1nto tiempo debe esperar para tomar una decisi\u00F3n sobre manejo, 
in-vm-acceptor=Define una forma en la cual se pueden hacer  conexiones en VM a un servidor de HornetQ.
remote-acceptor=Define una forma en la cual se pueden hacer conexiones remotas  a un servidor de HornetQ.
acceptor=Un aceptador define una forma en que se pueden hacer las conexiones al servidor HornetQ. 
acceptor.remote=Un aceptador remoto
acceptor.in-vm=Un aceptador de IN-VM 
acceptor.add=Operaci\u00F3n de adici\u00F3n de un aceptador
acceptor.add.params=Una serie de pares de llave-valor entendido por el aceptador de clase-f\u00E1brica y utilizados para configurarlo.
acceptor.remove=Operaci\u00F3n de adici\u00F3n de un aceptador
acceptor.started=Si se inicia este aceptador.
acceptor.start=Inicia el aceptador.
acceptor.stop=Detiene el aceptador..
acceptor.param=Un par llave-valor entendido por el aceptador de clase-f\u00E1brica y utilizados para configurarlo.
address-setting=Una configuraci\u00F3n de direcci\u00F3n define algunos atributos con un comod\u00EDn de direcci\u00F3n en lugar de una cola espec\u00EDfica. 
address-setting.add=Operaci\u00F3n de adici\u00F3n de una configuraci\u00F3n de direcci\u00F3n
address-setting.remove=Operaci\u00F3n de borrado de una configuraci\u00F3n de direcci\u00F3n existente
address-setting.address-full-policy=Determina lo que sucede cuando el tama\u00F1o m\u00E1ximo en bytes especificado de una direcci\u00F3n se llena. (PAGE, DROP o  BLOCK) 
address-setting.dead-letter-address=La direcci\u00F3n de carta muerta
address-setting.last-value-queue=Define si una cola solamente utiliza los \u00FAltimos valores o no
address-setting.max-delivery-attempts=Define las veces en que el mensaje cancelado puede reenviarse antes de enviar una direcci\u00F3n de carta muerta.
address-setting.max-size-bytes=El tama\u00F1o m\u00E1ximo en bytes.
address-setting.message-counter-history-day-limit=D\u00EDa l\u00EDmite para el historial del contador de mensajes.  
address-setting.expiry-address=Define a d\u00F3nde enviar un mensaje que ha expirado.
address-setting.redelivery-delay=Define el tiempo de espera antes de intentar reenviar un mensaje cancelado. 
address-setting.redistribution-delay=Define el tiempo de espera cuando el \u00FAltimo usuario se cierra en una cola antes de redistribuir los mensajes. 
address-setting.page-size-bytes=El tama\u00F1o de p\u00E1gina.
address-setting.page-max-cache-size=El n\u00FAmero de archivos de p\u00E1gina a guardar en memoria para optimizar el SO durante la navegaci\u00F3n de p\u00E1gina. 
address-setting.send-to-dla-on-no-route=Si este par\u00E1metro se establece a verdadero para esa direcci\u00F3n, si el mensaje no est\u00E1 dirigido a ninguna de las colas ser\u00E1 en su lugar, enviado a la direcci\u00F3n de carta muerta (DLA) para esa direcci\u00F3n, si ella existe. 
connector=Un conector puede ser utilizado por un cliente para definir c\u00F3mo conectarse a un servidor.
remote-connector=Utilizado por un cliente remoto para definir c\u00F3mo se conecta a un servidor. 
in-vm-connector=Utilizado por un cliente de VM para definir c\u00F3mo  se conecta a un servidor.
connector.add=Operaci\u00F3n de adici\u00F3n de un conector
connector.add.params=Una serie de pares de llave-valor entendidas por el conector de clase-f\u00E1brica y utilizadas para configurarlo.
connector.remove=Operaci\u00F3n de borrado de un conector
connector.param=Un par llave-valor entendido por el conector de clase-f\u00E1brica y utilizado para configurarlo.
core-address=Un recurso de tiempo de ejecuci\u00F3n que representa una "direcci\u00F3n" de HornetQ. Cero o m\u00E1s colas pueden enlazarse a una direcci\u00F3n individual. Cuando se dirige un mensaje, se dirige a la serie de colas conectadas a la direcci\u00F3n de mensajes. 
core-address.roles=Una lista de roles de seguridad (nombre y permisos) asociados a la direcci\u00F3n.
core-address.role.name=El nombre del rol de seguridad.
core-address.role.send=SI el rol tiene permiso para enviar a la direcci\u00F3n
core-address.role.consume=Si el rol tiene permiso para consumir desde la direcci\u00F3n. 
core-address.role.createDurableQueue=Si el rol tiene permiso para crear una cola durable. 
core-address.role.deleteDurableQueue=Si el rol tiene el permiso para borrar una cola durable.
core-address.role.createNonDurableQueue=Si el rol tiene el permiso para crear una cola no durable.
core-address.role.deleteNonDurableQueue=Si el rol tiene el permiso para borrar una cola no durable.
core-address.role.manage=SI el rol tiene permiso para administrar la direcci\u00F3n.
core-address.queue-names=Los nombres de las colas asociadas con la direcci\u00F3n.
core-address.number-of-bytes-per-page=El n\u00FAmero de bytes utilizados por cada p\u00E1gina para esta direcci\u00F3n.
core-address.number-of-pages=El n\u00FAmero de p\u00E1ginas utilizadas por esta direcci\u00F3n.
core-address.binding-names=Los nombres de los enlaces (tanto colas como desv\u00EDos) conectados a esta direcci\u00F3n.
core-address.get-roles-as-json=Retorna los roles (nombres y permisos) asociados a esta direcci\u00F3n mediante serializaci\u00F3n de JSON.
core-address.get-roles-as-json.reply=Una cadena en formato JSON.
queue=Una cola.
queue.add=Operaci\u00F3n de adici\u00F3n de una cola central.
queue.remove=Operaci\u00F3n de borrado de una cola existente.
queue.name=El nombre de cola \u00FAnico. 
queue.queue-address=Las direcciones de cola definen qu\u00E9 direcci\u00F3n se utiliza para dirigir mensajes. 
queue.filter=Una definici\u00F3n de filtro de mensaje de cola . Un filtro indefinido o vac\u00EDo coincidir\u00E1 con todos los mensajes. 
queue.durable=Define si la cola es durable.
queue.id=El ID de la cola.
queue.paused=Si la cola est\u00E1 en pausa.
queue.temporary=Si la cola es temporal.
queue.message-count=El n\u00FAmero de mensajes actualmente en esta cola.
queue.scheduled-count=El n\u00FAmero de mensajes programados en esta cola.
queue.consumer-count=El n\u00FAmero de usuarios que consumen mensajes desde esta cola.
queue.delivering-count=El n\u00FAmero de mensajes que esta cola entrega actualmente a sus usuarios.
queue.messages-added=El n\u00FAmero de mensajes a\u00F1adidos a esta cola desde que fue creada.
queue.list-scheduled-messages=Lista los mensajes programados para entrega.
queue.list-scheduled-messages.reply=Una lista de cada elemento es un mapa de propiedades de mensajes para su valor.
queue.list-scheduled-messages-as-json=Lista los mensajes programados para entrega como una cadena en formato JSON. 
queue.list-scheduled-messages-as-json.reply=Una cadena en formato JSON que representa una lista en la que cada elemento es un mapa de propiedades de mensajes para su valor.
queue.message.messageID=El ID de mensaje.
queue.message.userID=El userID -  es un UUID de usuario especificado opcional que se puede configurar para identificar el mensaje.  
queue.message.address=La direcci\u00F3n a la que se env\u00EDa este mensaje.
queue.message.type=Tipo de mensaje. 0 \= Predeterminado; 2 \= Objeto; 3 \= Texto; 4 \= Bytes; 5 \= Mapa; 6 \= Cadena
queue.message.durable=Si este mensaje es durable o no.
queue.message.expiration=El tiempo de expiraci\u00F3n de este mensaje.
queue.message.timestamp=El sello de fecha. El sello de fecha corresponde al tiempo en que este mensaje fue entregado por el servidor HornetQ. 
queue.message.priority=La prioridad del mensaje. El rango de valores de 0 (menor prioridad) a 9 (mayor prioridad) inclusive.
queue.list-messages=Lista todos los mensajes en la cola que coinciden con el filtro. 
queue.list-messages.reply=Una lista  en la que cada elemento es un mapa de propiedades de mensajes para su valor.
queue.list-messages-as-json=Lista todos los mensajes en la cola que coinciden con el filtro y los devuelve como una cadena en formato JSON. 
queue.count-messages=Retorna el n\u00FAmero total de mensajes en la cola que coinciden con el filtro determinado. 
queue.remove-message=Retira el mensaje correspondiente a un ID de mensaje determinado.
queue.remove-message.reply=Verdadero, si el mensaje fue retirado o falso, lo contrario. 
queue.message-id=El ID de un mensaje.
queue.remove-messages=Retira mensajes correspondientes al filtro determinado de su destino.
queue.remove-messages.reply=El n\u00FAmero de mensajes borrados.
queue.expire-message=Expira el mensaje correspondiente a un ID de mensaje determinado.
queue.expire-message.reply=Verdadero, si el mensaje ha expirado o falso, lo contrario. 
queue.expire-messages=Expiran los mensajes coincidentes con el filtro determinado. 
queue.expire-messages.reply=El n\u00FAmero de mensajes expirados.
queue.send-message-to-dead-letter-address=Env\u00EDa el mensaje correspondiente a un ID de mensaje determinado para esta Direcci\u00F3n de carta muerta de cola.
queue.send-message-to-dead-letter-address.reply=Verdadero, si el mensaje fue enviado a la direcci\u00F3n de carta muerta o falso, lo contrario.
queue.send-messages-to-dead-letter-address=Env\u00EDa los mensajes correspondientes al filtro dado para su direcci\u00F3n de carta muerta de cola.
queue.send-messages-to-dead-letter-address.reply=El n\u00FAmero de mensajes enviados.
queue.change-message-priority=Cambia la prioridad del mensaje correspondiente al ID del mensaje determinado.
queue.change-message-priority.new-priority=La nueva prioridad (entre 0 y 9) .
queue.change-message-priority.reply=Verdadero, si la prioridad del mensaje ha cambiado o falso, lo contrario. 
queue.change-messages-priority=Cambia la prioridad de los  mensajes correspondientes al filtro determinado.
queue.change-messages-priority.reply=El n\u00FAmero de mensajes cambiados.
queue.move-message=Desplaza el mensaje correspondiente para ID del mensaje determinado a otra cola.
queue.move-message.other-queue-name=El nombre de la cola a d\u00F3nde se desplaza el mensaje.
queue.move-message.reject-duplicates=Rechaza mensajes identificados como duplicados.
queue.move-message.reply=Verdadero, si el mensaje fue desplazado o falso, lo contrario.
queue.move-messages=Desplaza los mensajes correspondientes para filtro determinado a otra cola.
queue.move-messages.reply=El n\u00FAmero de mensajes desplazados.
queue.list-message-counter=Lista detalles del contador de mensajes.
queue.list-message-counter.reply=Detalles del contador de mensajes.
queue.list-message-counter-as-json=Lista el contador de mensajes como una cadena en un formato JSON. 
queue.list-message-counter-as-json.reply=Una cadena en formato JSON.
queue.list-message-counter-as-html=Lista el contador de mensajes como una cadena en un formato HTML. 
queue.list-message-counter-as-html.reply=Una cadena en formato HTML.
queue.list-message-counter-history=Lista el historial del contador de mensajes. 
queue.list-message-counter-history.reply=Detalles del historial del contador de mensajes.
queue.list-message-counter-history-as-json=Lista el historial de mensajes como una cadena en un formato JSON. 
queue.list-message-counter-history-as-json.reply=Una cadena en formato JSON.
queue.list-message-counter-history-as-html=Lista el historial del contador de mensajes. 
queue.list-message-counter-history-as-html.reply=Una cadena en formato HTML como una cadena en un formato HTML. 
queue.reset-message-counter=Restablece los contadores de mensajes.
queue.pause=Pausa la cola.
queue.resume=Reanuda la cola.
queue.list-consumers=Lista todos los usuarios en la cola.
queue.list-consumers.reply=Una lista, en la cual cada uno de sus elementos detalla a un usuario de cola.
queue.list-consumers-as-json=Una cadena en formato JSON
queue.list-consumers-as-json.reply=Una cadena en formato JSON.
broadcast-group=Un grupo de difusi\u00F3n es el medio por el cual un servidor difunde conectores a trav\u00E9s de la red.
broadcast-group.add=A\u00F1ade un grupo de difusi\u00F3n.
broadcast-group.remove=Borra un grupo de difusi\u00F3n.
broadcast-group.local-bind-address=La direcci\u00F3n de enlace local a la que est\u00E1 conectado el datagrama de socket. Si tiene varias interfaces de red en el servidor, debe especificar cu\u00E1l desea utilizar para difusiones al establecer este atributo. Si dicho atributo no se especifica, entonces el socket se conectar\u00E1 a la direcci\u00F3n de comod\u00EDn, una direcci\u00F3n IP elegida por el kernel.
broadcast-group.local-bind-port=El puerto local al cual el socket de datagrama est\u00E1 enlazado. Por lo general, Ud solamente utilizar\u00E1 el valor predeterminado -1, el cual significa que debe usarse un puerto an\u00F3nimo. Este par\u00E1metro siempre se especifica junto con la direcci\u00F3n de enlace local. 
broadcast-group.group-address=La direcci\u00F3n Multicast en la cual los datos ser\u00E1n difundidos. Es una direcci\u00F3n IP clase D en el rango entre 224.0.0.0 y 239.255.255.255, inclusive. La direcci\u00F3n  224.0.0.0 est\u00E1 reservada y no est\u00E1 disponible para su uso.
broadcast-group.group-port=El n\u00FAmero de puerto UDP utilizado para la difusi\u00F3n.
broadcast-group.broadcast-period=El periodo en milisegundos entre difusiones consecutivas.
broadcast-group.connectors=Especifica los nombres de conectores que ser\u00E1n difundidos.
broadcast-group.socket-binding=El enlace de socket del grupo de difusi\u00F3n. 
broadcast-group.started=Si se inicia el grupo de difusi\u00F3n.
broadcast-group.start=Inicia el grupo de difusi\u00F3n.
broadcast-group.stop=Detiene al grupo de difusi\u00F3n.
broadcast-group.get-connector-pairs-as-json=Retorna los pares de conectores de respaldo vivos que son difundidos por el grupo de difusi\u00F3n mediante serializaci\u00F3n de JSON.
discovery-group=El grupo Multicast para escuchar difusiones recibidas desde otros servidores que anuncian sus conectores.
discovery-group.add=A\u00F1adir un grupo de descubrimiento.
discovery-group.remove=Retirar un Grupo de descubrimiento 
discovery-group.local-bind-address=La direcci\u00F3n de enlace local a la que se conecta el socket de datagrama. 
discovery-group.group-address=Direcci\u00F3n IP Multicast del grupo en el que se escucha. 
discovery-group.group-port=Puerto UDP del grupo Multicast.
discovery-group.refresh-timeout=El periodo de espera del grupo de descubrimiento despu\u00E9s de recibir la \u00FAltima difusi\u00F3n de un servidor determinado antes de retirar esa entrada par de conectores del servidor de su lista.
discovery-group.initial-wait-timeout=El periodo de espera, en ms, para que una difusi\u00F3n inicial nos d\u00E9 por lo menos un nodo en el cl\u00FAster. 
discovery-group.socket-binding=El enlace de socket del grupo de descubrimiento. 
bridge=La funci\u00F3n de un puente es la de consumir mensajes desde una cola de origen y reenviarlos a una direcci\u00F3n de destino, por lo general  en un servidor HornetQ. 
bridge.add=Operaci\u00F3n de adici\u00F3n de un puente.
bridge.remove=Operaci\u00F3n de borrado de un puente.
bridge.queue-name=El nombre \u00FAnico de la cola local desde donde el puente consume.
bridge.forwarding-address=La direcci\u00F3n en un servidor de destino a la que el mensaje ser\u00E1 reenviado. Si la direcci\u00F3n de reenv\u00EDo no se especifica, entonces se retendr\u00E1  el destino original del mensaje.
bridge.ha=Si este puente soporta alta disponiblidad o no. Verdadero, significa que se conectar\u00E1 a cualquier servidor en un cl\u00FAster y soporte de recuperaci\u00F3n.
bridge.filter=Una cadena de filtro opcional, si se especifica, entonces solamente los mensajes que coinciden con la expresi\u00F3n de filtro especificada ser\u00E1n reenviados. La cadena de filtro sigue la sintaxis de  expresi\u00F3n de filtro de HornetQ descrita en la documentaci\u00F3n de HornetQ. 
bridge.transformer-class-name=El nombre de la clase de usuario-definido que implementa la interfaz org.hornetq.core.server.cluster.Transformer. 
bridge.retry-interval=El periodo en milisegundos entre los intentos subsiguientes entre intentos, si la conexi\u00F3n al servidor de destino ha fallado. 
bridge.retry-interval-multiplier=Un multiplicador de tiempo para aplicar al  tiempo desde el \u00FAltimo intento hasta el tiempo del pr\u00F3ximo intento.  Esto le permite un retroceso exponencial entre reintentos. 
bridge.reconnect-attempts=El n\u00FAmero total de intentos de reconexi\u00F3n que har\u00E1 el puente antes de rendirse y apagar. Un valor de -1 significa un n\u00FAmero ilimitado de intentos.
bridge.failover-on-server-shutdown=SI el puente intentar\u00E1 recuperaci\u00F3n en un servidor de respaldo (si se especifica) cuando el servidor de destino tiene un apagado limpio y no de fallo.  
bridge.use-duplicate-detection=Si el puente insertar\u00E1 autom\u00E1ticamente una propiedad de ID duplicada en cada mensaje que env\u00EDa. 
bridge.confirmation-window-size=El tama\u00F1o de la ventana de confirmaci\u00F3n a utilizar para la conexi\u00F3n utilizada para reenviar mensajes al nodo de destino.
bridge.user=El nombre de usuario a utilizar en la creaci\u00F3n de la conexi\u00F3n de puente al servidor remoto. Si no se especifica, se utilizar\u00E1 el usuario de cl\u00FAster predeterminado especificado por el atributo de usuario de cl\u00FAster en  el recurso de subsistema de mensajer\u00EDa de root. 
bridge.password=La contrase\u00F1a a utilizar en la creaci\u00F3n de una conexi\u00F3n de puente al servidor remoto. Si no se especifica,  se utilizar\u00E1 la contrase\u00F1a de cl\u00FAster predeterminada especificada por el atributo de  contrase\u00F1a de cl\u00FAster en el recurso de subsistema de mensajer\u00EDa de root.
bridge.static-connectors=Una lista de nombres de conectores definidos de forma est\u00E1tica utilizados por este puente. Debe ser indefinido (null) si se define 'discovery-group-name'
bridge.discovery-group-name=El nombre del grupo de descubrimiento utiizado por este puente\: Debe ser indefinido (null) si se definen 'static-connectors' 
bridge.started=Si se inicia el puente.
bridge.start=Inicia el puente.
bridge.stop=Detiene el puente.
divert=Un recurso de  mensajer\u00EDa que le permite desviar los mensajes de una direcci\u00F3n a alguna otra direcci\u00F3n, sin hacer ning\u00FAn cambio a cualquier l\u00F3gica de aplicaci\u00F3n de cliente.
divert.add=Operaci\u00F3n de adici\u00F3n de un desv\u00EDo.
divert.remove=Operaci\u00F3n de borrado de un desv\u00EDo.
divert.routing-name=Nombre de enrutamiento del desv\u00EDo.
divert.divert-address=Direcci\u00F3n desde donde desviar.
divert.forwarding-address=Direcci\u00F3n a donde desviar
divert.filter=Una cadena de filtro opcional. Si se especifica, entonces solamente los mensajes que coinciden con la expresi\u00F3n de filtro especificada ser\u00E1n desviados. La cadena de filtro sigue la sintaxis de  expresi\u00F3n de filtro de HornetQ descrita en la documentaci\u00F3n de HornetQ. 
divert.exclusive=Si el desv\u00EDo es exclusivo, es decir que el mensaje fue desviado a una nueva direcci\u00F3n y no ir\u00E1 a la direcci\u00F3n anterior de ninguna manera.
divert.transformer-class-name=El nombre de una clase utilizada para transformar el cuerpo del mensaje o propiedades antes de que sea enviado.
cluster-connection=Los servidores de grupo de conexiones de cl\u00FAster dentro de cl\u00FAsteres, para que los mensajes puedan cargarse de forma equilibrada entre los nodos del cl\u00FAster.  
cluster-connection.add=Operaci\u00F3n de adici\u00F3n de una conexi\u00F3n de cl\u00FAster
cluster-connection.remove=Operaci\u00F3n de retiro de una conexi\u00F3n de cl\u00FAster
cluster-connection.cluster-connection-address=Cada conexi\u00F3n de cl\u00FAster solamente se aplica a los mensajes enviados a una direcci\u00F3n que empieza por este valor. 
cluster-connection.connector-ref=El tama\u00F1o de la ventana de confirmaci\u00F3n a utilizar para la conexi\u00F3n utilizada para reenviar mensajes al nodo de destino.
cluster-connection.retry-interval=El periodo en milisegundos entre los intentos de reconexi\u00F3n subsiguientes para reconectar a un servidor de destino. si la conexi\u00F3n al servidor de destino ha fallado. 
cluster-connection.use-duplicate-detection=Si el puente insertar\u00E1 autom\u00E1ticamente una propiedad de ID duplicado en cada mensaje que env\u00EDa. 
cluster-connection.forward-when-no-consumers=Si los mensajes ser\u00E1n distribuidos de manera autom\u00E1tica entre otros nodos del cl\u00FAster, sin importar si hay coincidencias o si hay usuarios en otros nodos. Si esto se establece a falso (el predeterminado) entonces HornetQ  solamente reenviar\u00E1 mensajes a otros nodos del cl\u00FAster si la direcci\u00F3n a la cual se env\u00EDan tiene colas con usuarios, y si esos usuarios tienen filtros de mensajes (selectores) por lo menos uno de los selectores debe coincidir con el mensaje.
cluster-connection.max-hops=El n\u00FAmero m\u00E1ximo de veces que un mensaje puede ser enviado. HornetQ puede ser configurado tambi\u00E9n para equilibrar la carga de mensajes para nodos que podr\u00EDan estar conectados a \u00E9ste solamente de forma indirecta con otros servidores HornetQ como intermediarios en una cadena.
cluster-connection.confirmation-window-size=El tama\u00F1o de la ventana de confirmaci\u00F3n a utilizar para la conexi\u00F3n utilizada para reenviar mensajes al nodo de destino.
cluster-connection.static-connectors=La lista de conectores definida de forma est\u00E1tica a los cuales esta conexi\u00F3n de cl\u00FAster har\u00E1 conexiones. Debe ser indefinida (null) si 'discovery-group-name' se define.
cluster-connection.allow-direct-connections-only=Si un nodo sabe de la existencia de un nodo que es mayor de 1 hop, no creamos un puente para conexi\u00F3n de cl\u00FAster directa. Solamente si se define 'static-connectors'.
cluster-connection.discovery-group-name=El grupo discovery utilizado para obtener la lista de otros servidores en el cl\u00FAster al cual est\u00E1 conexi\u00F3n de cl\u00FAster har\u00E1 conexiones. Debe definirse como (null) si 'static-connectors' se define.
cluster-connection.node-id=El ID de nodo utilizado por esta conexi\u00F3n de cl\u00FAster.
cluster-connection.get-nodes=Devuelve un mapa de nodos conectados a esta conexi\u00F3n de cl\u00FAster, donde las llaves son las ID de nodos y los valores son las direcciones utilizadas para conectarse a los nodos.
cluster-connection.get-nodes.reply=Un mapa en el que las llaves son las ID de nodos y los valores son las direcciones utilizadas para conectarse a los nodos. 
cluster-connection.get-static-connectors-as-json=Devuelve la lista de conexiones est\u00E1ticas como una cadena en un formato JSON.
cluster-connection.started=Si se inicia o no la conexi\u00F3n de cl\u00FAster .
cluster-connection.start=Inicia la conexi\u00F3n de cl\u00FAster.
cluster-connection.stop=Detiene la conexi\u00F3n de cl\u00FAster.
connector-service=TODO
connector-service.add=Operaci\u00F3n de adici\u00F3n de un servicio de conector 
connector-service.remove=Operaci\u00F3n de borrado de un servicio de conector
connector-service.factory-class=Nombre de la clase de f\u00E1brica que puede instanciar el servicio de conector.
connector-service.param=Un par llave-valor entendido por el servicio de conector de clase-f\u00E1brica
connector-service.param.add=A\u00F1ade un par  llave-valor entendido por el  servicio del conector de clase-f\u00E1brica
connector-service.param.remove=Borra un par llave-valor entendido por el servicio del conector de clase-f\u00E1brica
connector-service.param.value=Porci\u00F3n del valor de un par llave-valor entendido por el conector de clase-f\u00E1brica del servicio.
factory-class=Clase de f\u00E1brica.
jndi-binding=El nombre del enlace para JNDI
jms=La configuraci\u00F3n del subsistema JMS.
jms.connection-factories=Las f\u00E1bricas de conexi\u00F3n JMS.
jms.queues=Las colas JMS.
jms.topics=Los temas JMS.
jms.pooled-connection-factories=Las f\u00E1bricas de conexi\u00F3n JMS administradas.
jms.add=A\u00F1ade el subsistema JMS.
jms-queue=Define una cola JMS.
jms-queue.add=A\u00F1ade una cola JMS.
jms-queue.remove=Borra una cola JMS.
jms-queue.entries=Los nombres jndi a los que la cola estar\u00E1 enlazada.
jms-queue.selector=El selector de cola.
jms-queue.durable=Si la cola es durable o no.
jms-queue.queue-address=Las direcciones de cola definen qu\u00E9 direcci\u00F3n se utiliza para dirigir mensajes. 
jms-queue.expiry-address=La direcci\u00F3n a donde se env\u00EDan los mensajes expirados.
jms-queue.dead-letter-address=La direcci\u00F3n a donde se env\u00EDan los mensajes muertos.
jms-queue.paused=Si la cola est\u00E1 en pausa.
jms-queue.temporary=Si la cola es temporal.
jms-queue.message-count=El n\u00FAmero de mensajes actualmente en esta cola.
jms-queue.scheduled-count=El n\u00FAmero de mensajes programados en esta cola.
jms-queue.consumer-count=El n\u00FAmero de usuarios que consumen mensajes desde esta cola.
jms-queue.delivering-count=El n\u00FAmero de mensajes que esta cola entrega actualmente a sus usuarios.
jms-queue.messages-added=El n\u00FAmero de mensajes a\u00F1adidos a esta cola desde que fue creada.
jms-queue.add-jndi=A\u00F1ade la cola a otro enlace JNDI
jms-queue.message.JMSPriority=La prioridad del mensaje.
jms-queue.message.JMSTimestamp=El sello de fecha, en ms, desde la \u00E9poca. 
jms-queue.message.JMSExpiration=El tiempo de expiraci\u00F3n del mensaje. 
jms-queue.message.JMSDeliveryMode=El modo de entrega para el mensaje, PERSISTENTE O NO_PERSISTENTE
jms-queue.message.JMSMessageID=El ID de mensaje.
jms-topic=Define un tema JMS.
jms-topic.add=A\u00F1ade un tema JMS.
jms-topic.remove=Borra un tema JMS.
jms-topic.entries=Los nombres jndi a los que estar\u00E1 enlazado el tema.
jms-topic.topic-address=La direcci\u00F3n a la que apunta el tema.
jms-topic.temporary=Si el tema es temporal.
jms-topic.message-count=El n\u00FAmero de mensajes actualmente en esta cola.
jms-topic.delivering-count=El n\u00FAmero de mensajes que esta cola entrega actualmente a sus usuarios.
jms-topic.messages-added=El n\u00FAmero de mensajes a\u00F1adidos a esta cola desde que fue creada.
jms-topic.durable-message-count=\ El n\u00FAmero de mensajes a\u00F1adidos para todos los suscriptores durables para este tema.
jms-topic.non-durable-message-count=\ El n\u00FAmero de mensajes a\u00F1adidos para todos los suscriptores no-durables para este tema.
jms-topic.subscription-count=\ El n\u00FAmero de suscriptores (durables y no-durables) para este tema.
jms-topic.durable-subscription-count=\ El n\u00FAmero de suscriptores durables para este tema.
jms-topic.non-durable-subscription-count=\ El n\u00FAmero de suscriptores no-durables para este tema.
jms-topic.list-all-subscriptions=Lista de todos los suscriptores 
jms-topic.list-all-subscriptions.reply=Una lista, en la cual cada uno de sus elementos describe una suscripci\u00F3n individual.
jms-topic.list-all-subscriptions-as-json=Lista todas las suscripciones durables como una cadena en un formato JSON. 
jms-topic.list-all-subscriptions-as-json.reply=Una cadena en formato JSON.
jms-topic.list-durable-subscriptions=Lista solamente las suscripciones durables.
jms-topic.list-durable-subscriptions.reply=Una lista. cada uno de sus elementos describe una suscripci\u00F3n individual.
jms-topic.list-durable-subscriptions-as-json=Lista las suscripciones durables, como una cadena en un formato JSON. 
jms-topic.list-non-durable-subscriptions=Lista solamente las suscripciones no-durables.
jms-topic.list-non-durable-subscriptions.reply=Una lista. cada uno de sus elementos describe una suscripci\u00F3n individual.
jms-topic.list-non-durable-subscriptions-as-json=Lista las suscripciones no-durables, como una cadena en un formato JSON. 
jms-topic.list-subscriptions.queueName=El nombre completo de la cola.
jms-topic.list-subscriptions.clientID=El ID de cliente
jms-topic.list-subscriptions.selector=El selector de cola.
jms-topic.list-subscriptions.name=El nombre de la cola.
jms-topic.list-subscriptions.durable=Si la cola es durable o no.
jms-topic.list-subscriptions.messageCount=El n\u00FAmero de mensajes actualmente en esta cola.
jms-topic.list-subscriptions.deliveringCount=El n\u00FAmero de mensajes que esta cola entrega actualmente a sus usuarios.
jms-topic.list-subscriptions.consumers=La cola de usuarios.
jms-topic.list-subscriptions.consumers.consumerID=El ID del usuario.
jms-topic.list-subscriptions.consumers.connectionID=El ID de conexi\u00F3n.
jms-topic.list-subscriptions.consumers.sessionID=El ID de sesi\u00F3n del usuario
jms-topic.list-subscriptions.consumers.browseOnly=Si el usuario solamente est\u00E1 explorando la cola.
jms-topic.list-subscriptions.consumers.creationTime=Tiempo en el que se cre\u00F3 el usuario, en ms, desde la \u00E9poca.
jms-topic.list-messages-for-subscription=Lista todos los mensajes para la suscripci\u00F3n determinada.
jms-topic.list-messages-for-subscription.queue-name=El nombre de la cola que representa una suscripci\u00F3n.
jms-topic.list-messages-for-subscription.reply=Una lista en la que cada elemento es un mapa de propiedades de mensajes para su valor.
jms-topic.list-messages-for-subscription-as-json=Lista todos los mensajes para la suscripci\u00F3n determinada como una cadena en formato JSON.
jms-topic.count-messages-for-subscription=Cuenta el n\u00FAmero de mensajes coincidentes con el filtro para la suscripci\u00F3n determinada.
jms-topic.client-id=El ID de cliente
jms-topic.subscription-name=El nombre de suscripci\u00F3n durable.
jms-topic.filter=Un filtro de mensajes JMS.
jms-topic.drop-durable-subscription=Descarga una suscripci\u00F3n durable.
jms-topic.drop-all-subscriptions=Descarga todas las suscripciones de este tema.
jms-topic.add-jndi=A\u00F1ade la cola a otro enlace JNDI
transport-config.param=Un par\u00E1metro
transport-config.param.value=El valor de un par\u00E1metro
transport-config.param.add=Operaci\u00F3n de adici\u00F3n de un nuevo par\u00E1metro
transport-config.param.remove=Operaci\u00F3n de borrado de una par\u00E1metro existente.
transport-config.param.optional=Par\u00E1metros opcionales
connection-factory=Define una f\u00E1brica de conexiones.
connection-factory.add=A\u00F1ade una f\u00E1brica de conexiones.
connection-factory.remove=Borra una f\u00E1brica de  conexiones.
connection-factory.factory-type=Un tipo de f\u00E1brica de conexi\u00F3n. 0 \= jms cf, 1 \= cola cf, 2 \= tema cf, 3 \= xa cf, 4 \= xa cola cf, 5 \= xa tema cf
connection-factory.initial-message-packet-size=El tama\u00F1o inicial de mensajes creados a trav\u00E9s de esta f\u00E1brica.
pooled-connection-factory=Define una f\u00E1brica de conexiones administrada.
pooled-connection-factory.add=A\u00F1ade una f\u00E1brica de conexiones administrada.
pooled-connection-factory.remove=Borra una f\u00E1brica de conexiones administradas.
connection-factory.auto-group=Sea que se use o no  la agrupaci\u00F3n de mensajes de forma autom\u00E1tica.
connection-factory.block-on-acknowledge=Verdadero para establecer un bloqueo en reconocimiento. 
connection-factory.block-on-durable-send=Verdadero para establecer un bloqueo en env\u00EDo durable.
connection-factory.block-on-non-durable-send=Verdadero para establecer un bloqueo en env\u00EDo no-durable.
connection-factory.cache-large-message-client=Verdadero para  guardar en cache grandes mensajes.
connection-factory.call-timeout=El tiempo de espera de la llamada.
connection-factory.client-failure-check-period=El periodo de verificaci\u00F3n de  falla del cliente. 
connection-factory.client-id=El ID de cliente.
connection-factory.compress-large-messages=Si se deben comprimir grandes mensajes.
connection-factory.confirmation-window-size=El tama\u00F1o de ventana de confirmaci\u00F3n.
connection-factory.connection-factory=Define una f\u00E1brica de conexiones.
connection-factory.connection-ttl=La conexi\u00F3n ttl.
connection-factory.connector=Define los conectores. Estos se almacenan en un mapa por nombre de conector, con los conectores de respaldo guardados como el valor, o un valor indefinido si no hay un conector de respaldo.
connection-factory.consumer-max-rate=La tasa m\u00E1xima del usuario.
connection-factory.consumer-window-size=El tama\u00F1o de ventana del usuario.
connection-factory.discovery-group-name=El nombre del grupo del descubrimiento.
connection-factory.discovery-initial-wait-timeout=El tiempo de espera del descubrimiento inicial.
connection-factory.dups-ok-batch-size=El tama\u00F1o de lote duplicados OK. 
connection-factory.entries=Los nombres jndi a los que la f\u00E1brica de conexi\u00F3n debe estar ligado.
connection-factory.failover-on-initial-connection=Verdadera, para recuperaci\u00F3n en conexi\u00F3n inicial.
connection-factory.failover-on-server-shutdown=Verdadera, para recuperaci\u00F3n en servidor inicial.
connection-factory.group-id=El ID de grupo.
connection-factory.ha=Si la f\u00E1brica de conexiones soporta alta disponibilidad
connection-factory.connection-load-balancing-policy-class-name=Nombre de  una clase que implementa una pol\u00EDtica de balance de carga de parte del cliente 
connection-factory.max-retry-interval=Intervalo de reintento m\u00E1ximo 
connection-factory.min-large-message-size=Tama\u00F1o m\u00EDnimo de mensaje grande.
connection-factory.pre-acknowledge=Verdadero para reconocimiento previo.
connection-factory.producer-max-rate=La tasa m\u00E1xima del productor.
connection-factory.producer-window-size=El tama\u00F1o de la ventana del productor.
connection-factory.reconnect-attempts=Los intentos de reconexi\u00F3n.
connection-factory.retry-interval=El intervalo de reintento.
connection-factory.retry-interval-multiplier=El multiplicador de intervalo de reintento.
connection-factory.scheduled-thread-pool-max-size=El tama\u00F1o m\u00E1ximo del grupo de hilos programados. 
connection-factory.thread-pool-max-size=El tama\u00F1o m\u00E1ximo del grupo de hilos. 
connection-factory.transaction-batch-size=El tama\u00F1o de lote de transacciones. 
connection-factory.use-global-pools=Verdadero, el uso de grupos globales.
connection-factory.add-jndi=Agrega la f\u00E1brica a otro enlace JNDI
pooled-connection-factory.auto-group=El autogrupo
pooled-connection-factory.block-on-acknowledge=Verdadero para establecer un bloqueo en reconocimiento. 
pooled-connection-factory.block-on-durable-send=Verdadero para establecer un bloqueo en env\u00EDo durable.
pooled-connection-factory.block-on-non-durable-send=Verdadero para establecer un bloqueo en env\u00EDo no-durable.
pooled-connection-factory.cache-large-message-client=Verdadero para guardar en cache grandes mensajes.
pooled-connection-factory.call-timeout=El tiempo de espera de la llamada.
pooled-connection-factory.client-failure-check-period=El periodo de verificaci\u00F3n de  falla del cliente. 
pooled-connection-factory.client-id=El ID de cliente
pooled-connection-factory.confirmation-window-size=El tama\u00F1o de la ventana de confirmaci\u00F3n.
pooled-connection-factory.connection-factory=Define una f\u00E1brica de conexiones.
pooled-connection-factory.connection-ttl=La conexi\u00F3n ttl.
pooled-connection-factory.connector=Define los conectores. Estos se almacenan en un mapa por nombre de conector, con los conectores de respaldo guardados como el valor, o un valor indefinido si no hay un conector de respaldo.
pooled-connection-factory.consumer-max-rate=La tasa m\u00E1xima de usuarios.
pooled-connection-factory.consumer-window-size=El tama\u00F1o de la ventana de usuario.
pooled-connection-factory.discovery-group-name=El nombre del grupo de descubrimiento.
pooled-connection-factory.discovery-initial-wait-timeout=El tiempo de espera del descubrimiento inicial.
pooled-connection-factory.dups-ok-batch-size=El tama\u00F1o de lote duplicados OK. 
pooled-connection-factory.entries=Los nombres jndi a los que la f\u00E1brica de conexi\u00F3n debe estar ligado.
pooled-connection-factory.failover-on-initial-connection=Verdadera, para recuperaci\u00F3n en conexi\u00F3n inicial.
pooled-connection-factory.failover-on-server-shutdown=Verdadera, para recuperaci\u00F3n en servidor inicial.
pooled-connection-factory.group-id=El ID de grupo.
pooled-connection-factory.ha=Si la f\u00E1brica de conexiones soporta alta disponibilidad
pooled-connection-factory.connection-load-balancing-policy-class-name=Nombre de  una clase que implementa una pol\u00EDtica de balance de carga de parte del cliente 
pooled-connection-factory.max-retry-interval=Intervalo de reintento m\u00E1ximo 
pooled-connection-factory.min-large-message-size=Tama\u00F1o m\u00EDnimo de mensaje grande.
pooled-connection-factory.pre-acknowledge=Verdadero para reconocimiento previo. 
pooled-connection-factory.producer-max-rate=La tasa m\u00E1xima del productor.
pooled-connection-factory.producer-window-size=El tama\u00F1o de la ventana del productor.
pooled-connection-factory.reconnect-attempts=Los intentos de reconexi\u00F3n.
pooled-connection-factory.retry-interval=El intervalo de reintento.
pooled-connection-factory.retry-interval-multiplier=El multiplicador de intervalo de reintento.
pooled-connection-factory.scheduled-thread-pool-max-size=El tama\u00F1o m\u00E1ximo del grupo de hilos programados. 
pooled-connection-factory.thread-pool-max-size=El tama\u00F1o m\u00E1ximo del grupo de hilos.
pooled-connection-factory.transaction-batch-size=El tama\u00F1o de lote de transacciones. 
pooled-connection-factory.use-global-pools=Verdadero, el uso de grupos globales.
pooled-connection-factory.use-jndi=Utilice JND a fin de localizar el destino para conexiones entrantes
pooled-connection-factory.jndi-params=Los par\u00E1metros JNDI a usar para localizar el destino de conexiones entrantes.
pooled-connection-factory.use-local-tx=Utilice la transacci\u00F3n local para sesiones entrantes
pooled-connection-factory.user=El nombre de usuario predeterminado a usar con esta f\u00E1brica de conexiones. Solamente se necesita cuando se apunta la f\u00E1brica de conexiones a un host remoto.
pooled-connection-factory.password=La contrase\u00F1a predeterminada a usar con esta f\u00E1brica de conexiones. Solamente se requiere cuando se apunta la f\u00E1brica de conexiones a un host remoto.
pooled-connection-factory.setup-attempts=El n\u00FAmero de veces para configurar un punto final de MDB.
pooled-connection-factory.setup-interval=El intervalo entre intentos de configuraci\u00F3n de un punto final de MDB.
pooled-connection-factory.transaction=TODO
server-id=\ El ID de servidor.
security-setting=Un par\u00E1metro de seguridad le otorga una serie de permisos definidos a partir de las colas basadas en su direcci\u00F3n.
security-setting.add=A\u00F1ada un par\u00E1metro de seguridad.
security-setting.remove=Borre un par\u00E1metro de seguridad existente.
security-role=Un rol de seguridad.
security-role.add=A\u00F1ada un nuevo rol de seguridad.
security-role.remove=Retire un rol de seguridad existente.
security-role.name=El nombre de un rol de seguridad.
security-role.send=Este permiso autoriza al usuario para enviar un mensaje a direcciones coincidentes.
security-role.consume=Su permiso autoriza al usuario para consumir un mensaje de una cola conectada a direcciones coincidentes.
security-role.create-durable-queue=Este permiso autoriza al usuario para crear una cola durable.
security-role.delete-durable-queue=Este permiso autoriza al usuario para  borrar una cola durable.
security-role.create-non-durable-queue=Este permiso autoriza al usuario para crear una cola temporal.
security-role.delete-non-durable-queue=Este permiso autoriza al usuario para borrar una cola temporal.
security-role.manage=Este permiso autoriza al usuario para invocar operaciones administrativas al enviar mensajes administrativos a la direcci\u00F3n de administraci\u00F3n.
socket-binding=Referencia del enlace de socket.
deployed=Recursos de tiempo de ejecuci\u00F3n expuestos por recursos de mensajer\u00EDa.
