messaging=O sub-sistema de mensagem.
messaging.add=A opera\u00E7\u00E3o adicionando o sub-sistema de mensagem
messaging.remove=A opera\u00E7\u00E3o removendo o sub-sistema de mensagem
messaging.hornetq-server=Os servidores HornetQ fornecidos pelo sub-sistema de mensagem
hornetq-server=A inst\u00E2ncia do servidor do HornetQ.
hornetq-server.add=A opera\u00E7\u00E3o de adi\u00E7\u00E3o do servidor HornetQ.
hornetq-server.remove=A opera\u00E7\u00E3o de remo\u00E7\u00E3o do servidor HornetQ.
hornetq-server.name=N\u00E3o \u00E9 usado.
hornetq-server.clustered=Se \u00E9 que o servidor est\u00E1 com cluster.
hornetq-server.persistence-enabled=Se \u00E9 que o servidor usar\u00E1 o arquivo baseado no di\u00E1rio para a persist\u00EAncia.
hornetq-server.scheduled-thread-pool-max-size=O n\u00FAmero de threads que o pool do thread principal possui.
hornetq-server.thread-pool-max-size=O n\u00FAmero de threads que o pool do thread principal possui. -1 significa sem limite.
hornetq-server.security-domain=O dom\u00EDnio de seguran\u00E7a para uso na verifica\u00E7\u00E3o da informa\u00E7\u00E3o do usu\u00E1rio e fun\u00E7\u00E3o
hornetq-server.security-enabled=Se \u00E9 que a seguran\u00E7a est\u00E1 ativada.
hornetq-server.security-invalidation-interval=O quanto esperar (in mil\u00E9simos de segundos) antes de invalidar o cache de seguran\u00E7a.
hornetq-server.wild-card-routing-enabled=Se \u00E9 que o servidor suporta a roteamento do cart\u00E3o curinga.
hornetq-server.management-address=Endere\u00E7o a ser enviado as mensagens de gerenciamento.
hornetq-server.management-notification-address=O nome do endere\u00E7o que os consumidores aplicam o bind para receber notifica\u00E7\u00F5es de gerenciamento.
hornetq-server.cluster-user=O usu\u00E1rio usado pelas conex\u00F5es do cluster para comunicar-se entre os n\u00F3s de cluster.
hornetq-server.cluster-password=A senha usada pelas conex\u00F5es com cluster para comunicar-se entre os n\u00F3s com cluster.
hornetq-server.jmx-management-enabled=Se \u00E9 que o HornetQ deve expor seu API de gerenciamento interno atrav\u00E9s do JMX. Este procedimento n\u00E3o \u00E9 recomendado, uma vez que o acesso a esses MBeans podem levar a uma configura\u00E7\u00E3o inconsistente.
hornetq-server.jmx-domain=O dom\u00EDnio do JMX usado para registrar os MBeans HornetQ internos no MBeanServer.
hornetq-server.message-counter-enabled=Se \u00E9 que os contadores de mensagem est\u00E3o ativados.
hornetq-server.message-counter-sample-period=O per\u00EDodo (em mil\u00E9simos de segundos) da amostra para uso dos contadores de mensagem.
hornetq-server.message-counter-max-day-history=Quantos dias que deve-se manter o hist\u00F3rico do contador de mensagem.
hornetq-server.connection-ttl-override=Caso configurado, ele substituir\u00E1 o tempo (em mil\u00E9simos de segundos) que deve-se manter uma conex\u00E3o ativa sem receber um ping.
hornetq-server.async-connection-execution-enabled=Se \u00E9 que os pacotes de entrada no servidor devem ser entregues a um thread do pool de thread para processamento. Isto ser\u00E1 falso, caso eles sejam manuseados no thread remoto.
hornetq-server.transaction-timeout=Quanto tempo (em mil\u00E9simos de segundos) antes da transa\u00E7\u00E3o poder ser removida a partir do gerenciador de recurso ap\u00F3s o per\u00EDodo de cria\u00E7\u00E3o. 
hornetq-server.transaction-timeout-scan-period=Quanto tempo (em mil\u00E9simos de segundos) para verificar as transa\u00E7\u00F5es de intervalo.
hornetq-server.message-expiry-scan-period=Quanto tempo (em mil\u00E9simos de segundos) para verificar as mensagens expiradas.
hornetq-server.message-expiry-thread-priority=A prioridade das mensagens de expira\u00E7\u00E3o do thread.
hornetq-server.id-cache-size=O tamanho do cache para as IDs de mensagem de pr\u00E9-cria\u00E7\u00E3o.
hornetq-server.persist-id-cache=Se \u00E9 que as IDs s\u00E3o persistidas no di\u00E1rio.
hornetq-server.remoting-interceptors=A lista das classes do interceptor usada por esse servidor.
hornetq-server.backup=Se \u00E9 que esse servidor \u00E9 um servidor de back-up.
hornetq-server.allow-failback=Se \u00E9 que esse servidor ser\u00E1 automaticamente encerrado, caso o servidor ativo original vier com o back-up.
hornetq-server.failback-delay=Quanto tempo esperar antes da falha ocorrer na reinicializa\u00E7\u00E3o do servidor ativo.
hornetq-server.failover-on-shutdown=Se \u00E9 que esse servidor do back-up (caso ele seja um servidor de back-up) deve vir ativo num encerramento de servidor normal.
hornetq-server.shared-store=Se \u00E9 que esse servidor est\u00E1 usando um armazenamento compartilhado para a falha.
hornetq-server.persist-delivery-count-before-delivery=Se \u00E9 que esse contador de entrega \u00E9 persistido antes da entrega. Falso significa que isto apenas acontece ap\u00F3s a mensagem ser cancelada.
hornetq-server.live-connector-ref=O nome do conector usado para conectar-se ao conectar ativo. Caso esse servidor n\u00E3o seja um back-up que usa o compartilhamento diferente do HA, o seu valor \u00E9 "indefinido".
hornetq-server.create-bindings-dir=Se \u00E9 que o servidor deve ser criar o diret\u00F3rio de bindings na inicializa\u00E7\u00E3o.
hornetq-server.create-journal-dir=Se \u00E9 que o servidor deve criar o diret\u00F3rio do di\u00E1rio na inicializa\u00E7\u00E3o.
hornetq-server.journal-type=O tipo de di\u00E1rio a ser usado.
hornetq-server.journal-buffer-timeout=O intervalo  (em nanossegundos) usado para esvaziar os buffers internos no di\u00E1rio.
hornetq-server.journal-buffer-size=O tamanho do buffer interno no di\u00E1rio.
hornetq-server.journal-sync-transactional=Se \u00E9 que a espera para os dados da transa\u00E7\u00E3o deve ser sincronizada ao di\u00E1rio antes de retornar uma resposta ao cliente.
hornetq-server.journal-sync-non-transactional=Se \u00E9 que a espera para os dados sem transa\u00E7\u00E3o a serem sincronizados ao di\u00E1rio antes de retornarem uma resposta ao cliente.
hornetq-server.log-journal-write-rate=Se \u00E9 que o registrar periodicamente a taxa de grava\u00E7\u00E3o e de esvaziamento.
hornetq-server.journal-file-size=O tamanho (em bites) de cada arquivo do di\u00E1rio.
hornetq-server.journal-min-files=Quantos arquivos de jornal a serem pr\u00E9-criados.
hornetq-server.journal-compact-percentage=A percentagem de dados ativos pelos quais n\u00F3s consideramos estar comprimindo o di\u00E1rio.
hornetq-server.journal-compact-min-files=O n\u00FAmero m\u00EDnimo de arquivos de dados do di\u00E1rio antes de n\u00F3s iniciarmos a compacta\u00E7\u00E3o.
hornetq-server.journal-max-io=O n\u00FAmero m\u00E1ximo de solicita\u00E7\u00F5es de grava\u00E7\u00E3o que podem estar na fila AIO a de uma s\u00F3 vez.
hornetq-server.perf-blast-pages=TODO
hornetq-server.run-sync-speed-test=Se \u00E9 que executar na inicializa\u00E7\u00E3o o teste de diagn\u00F3stico do quanto r\u00E1pido seu discp pode sincronizar. Isto \u00E9 \u00FAtil na determina\u00E7\u00E3o dos problemas de execu\u00E7\u00E3o. 
hornetq-server.server-dump-interval=Qual a frequ\u00EAncia do despejo de informa\u00E7\u00E3o do per\u00EDodo de rodagem b\u00E1sico no registo do servidor.  Um valor inferior a 1 desativa este recurso.
hornetq-server.memory-warning-threshold=A percentagem de mem\u00F3ria dispon\u00EDvel no caso dos resultados excederem num registro de log 
hornetq-server.memory-measure-interval=A frequ\u00EAncia para exemplificar a mem\u00F3ria JVN em mil\u00E9simos de segundos (ou -1 para destivar a amostra de mem\u00F3ria).
hornetq-server.started=Se \u00E9 que o servidor foi inicializado.
hornetq-server.version=A vers\u00E3o do servidor.
match=A express\u00E3o coincidente ao endere\u00E7o da fila.
hornetq-server.get-connectors-as-json=Retorna os conectores configurados para esse servidor usando a serializa\u00E7\u00E3o JSON.
hornetq-server.get-connectors-as-json.reply=Uma sequ\u00EAncia no formato JSON.
hornetq-server.enable-message-counters=Ativa os contadores de mensagem.
hornetq-server.disable-message-counters=Desativa os contadores de mensagem.
hornetq-server.reset-all-message-counters=Reinicia todos os contadores de mensagem.
hornetq-server.reset-all-message-counter-histories=Reinicia todo o hist\u00F3rico dos contadores de mensagens.
hornetq-server.list-prepared-transactions=Lista toda a transa\u00E7\u00E3o preparada, organizada pela data. O mais antigo aparece antes.
hornetq-server.list-prepared-transactions.reply=A lista das sequ\u00EAncias. As Sequ\u00EAncias est\u00E3o baseadas na representa\u00E7\u00E3o do XID da transa\u00E7\u00E3o e podem ser usadas  para confirmar ou reverter heuristicamente as transa\u00E7\u00F5es. 
hornetq-server.list-prepared-transaction-details-as-json=Lista toda a transa\u00E7\u00E3o preparada, organizada pela data, os mais antigos aparecem antes, com detalhes no formato JSON.
hornetq-server.list-prepared-transaction-details-as-json.reply=A Sequ\u00EAncia retornada cont\u00E9m um array dos detalhes da transa\u00E7\u00E3o.
hornetq-server.list-prepared-transaction-details-as-html=Lista toda a transa\u00E7\u00E3o preparada, organizada pela data, as mais antigas antes, com detalhes, no formato HTML.
hornetq-server.list-prepared-transaction-details-as-html.reply=A Sequ\u00EAncia retornada cont\u00E9m HTML e possui uma tabela de detalhes da transa\u00E7\u00E3o.
hornetq-server.list-heuristic-committed-transactions=Lista as transa\u00E7\u00F5es que foram confirmadas heuristicamente.
hornetq-server.list-heuristic-committed-transactions.reply=A lista da sequ\u00EAncia. As sequ\u00EAncias s\u00E3o uma representa\u00E7\u00E3o Base-64 do XID da transa\u00E7\u00E3o.
hornetq-server.list-heuristic-rolled-back-transactions=Lista as transa\u00E7\u00F5es que foram heuristicamente revertidas.
hornetq-server.list-heuristic-rolled-back-transactions.reply=A lista das sequ\u00EAncias. As Sequ\u00EAncias s\u00E3o uma representa\u00E7\u00E3o Base-64 do XID da transa\u00E7\u00E3o.
hornetq-server.commit-prepared-transaction=Confirma heuristicamente uma transa\u00E7\u00E3o preparada.
hornetq-server.commit-prepared-transaction.transaction-as-base-64=A representa\u00E7\u00E3o Base64 do XID da transa\u00E7\u00E3o.
hornetq-server.commit-prepared-transaction.reply=Verdadeira caso a transa\u00E7\u00E3o tenha sido confirmada com \u00EAxito, do contr\u00E1rio ser\u00E1 falsa.
hornetq-server.rollback-prepared-transaction=Heuristicamente reverte uma transa\u00E7\u00E3o preparada.
hornetq-server.rollback-prepared-transaction.transaction-as-base-64=A representa\u00E7\u00E3o Base64 do XID da transa\u00E7\u00E3o.
hornetq-server.rollback-prepared-transaction.reply=Verdadeira caso a transa\u00E7\u00E3o tenha sido revertida com \u00EAxito, do contr\u00E1rio ser\u00E1 falsa.
hornetq-server.list-remote-addresses=Lista os endere\u00E7os de todos os clientes conectados no endere\u00E7o gerado. Caso um argumento do endere\u00E7o ip seja fornecido, apenas aqueles clientes cujos sequ\u00EAncia inclui a sequ\u00EAncia do endere\u00E7o ip gerado ser\u00E3o retornados.
hornetq-server.list-remote-addresses.ip-address=Um endere\u00E7o ip no formato de sequ\u00EAncia.
hornetq-server.list-remote-addresses.reply=A lista de sequ\u00EAncias, onde as sequ\u00EAncias s\u00E3o endere\u00E7os de cliente remoto.
hornetq-server.close-connections-for-address=Encerra todas as conex\u00F5es dos clientes conectados a esse servidor cujo endere\u00E7o remoto cont\u00E9m o endere\u00E7o IP.
hornetq-server.close-connections-for-address.ip-address=Um endere\u00E7o IP no formato de sequ\u00EAncia.
hornetq-server.close-connections-for-address.reply=Verdadeiro caso as conex\u00F5es sejam encerradas, do contr\u00E1rio ser\u00E1 falso.
hornetq-server.list-connection-ids=Lista as IDs de todas as conex\u00F5es conectadas a esse servidor.
hornetq-server.list-connection-ids.reply=A lista de sequ\u00EAncia, onde cada sequ\u00EAncia \u00E9 uma ID de conex\u00E3o.
hornetq-server.list-producers-info-as-json=Lista informa\u00E7\u00E3o sobre os produtores de mensagem usado a serializa\u00E7\u00E3o JSON, para todas as sess\u00F5es.
hornetq-server.list-producers-info-as-json.reply=A Sequ\u00EAncia retornada \u00E9 uma sequ\u00EAncia JSON contendo um array dos detalhes do produtor.
hornetq-server.list-sessions=Lista todas as IDs de sess\u00F5es para a ID de conex\u00E3o especificada.
hornetq-server.list-sessions.connection-id=A id da conex\u00E3o.
hornetq-server.list-sessions.reply=A lista de sequ\u00EAncias, onde cada sequ\u00EAncia \u00E9 uma ID da sess\u00E3o.
hornetq-server.get-roles=Obt\u00E9m as fun\u00E7\u00F5es de seguran\u00E7a para a coincidir com o endere\u00E7o espec\u00EDfico.
hornetq-server.get-roles.address-match=Um combina\u00E7\u00E3o de endere\u00E7o.
hornetq-server.get-roles.reply=Uma lista, cada elemento pelo qual \u00E9 um conjunto de propriedades descrevendo a fun\u00E7\u00E3o de seguran\u00E7a.
hornetq-server.get-roles-as-json=Obt\u00E9m as fun\u00E7\u00F5es (como uma sequ\u00EAncia JSON) para combina\u00E7\u00E3o do endere\u00E7o espec\u00EDfico.
hornetq-server.get-roles-as-json.address-match=Uma combina\u00E7\u00E3o de endere\u00E7o.
hornetq-server.get-roles-as-json.reply=A Sequ\u00EAncia retornada \u00E9 uma sequ\u00EAncia JSON contendo um array dos detalhes da fun\u00E7\u00E3o de seguran\u00E7a.
hornetq-server.get-address-settings-as-json=Retorna as configura\u00E7\u00F5es do endere\u00E7o como uma sequ\u00EAncia JSON para a combina\u00E7\u00E3o do endere\u00E7o.
hornetq-server.get-address-settings-as-json.address-match=Uma combina\u00E7\u00E3o de endere\u00E7o.
hornetq-server.get-address-settings-as-json.reply=Uma Sequ\u00EAncia retornada \u00E9 uma sequ\u00EAncia JSON contendo um array dos detalhes de configura\u00E7\u00F5es do endere\u00E7o.
hornetq-server.force-failover=For\u00E7a o servidor de mensagem a encerrar e notificar os clientes para a falha.
jms-server.list-connections-as-json=Lista todas as conex\u00F5es JMS.
jms-server.list-connections-as-json.reply=A Sequ\u00EAncia retornada \u00E9 uma sequ\u00EAncia JSON contendo um array dos objetos JMSConnectionInfo.
jms-server.list-consumers-as-json=Lista todos os consumidores que pertencem \u00E0 Conex\u00E3o JMS especificada pela id da conex\u00E3o.
jms-server.list-consumers-as-json.connection-id=A id da conex\u00E3o.
jms-server.list-consumers-as-json.reply=A Sequ\u00EAncia retornada \u00E9 uma sequ\u00EAncia JSON contendo um array dos objetos JMSConsumerInfo.
jms-server.list-all-consumers-as-json=Lista todos os consumidores.
jms-server.list-all-consumers-as-json.reply=A Sequ\u00EAncia retornada \u00E9 uma sequ\u00EAncia JSON contendo um array dos objetos JMSConsumerInfo.
jms-server.list-target-destinations=Lista todos os endere\u00E7os pelos quais a sess\u00E3o designada enviou mensagens.
jms-server.list-target-destinations.session-id=A id da sess\u00E3o.
jms-server.list-target-destinations.reply=A Sequ\u00EAncia retornada \u00E9 uma Sequ\u00EAncia JSON contendo um array dos nomes do endere\u00E7o.
jms-server.get-last-sent-message-id=Retorna a ID da \u00FAltima mensagem enviada \u00E0 sess\u00E3o gerada ao endere\u00E7o gerado.
jms-server.get-last-sent-message-id.session-id=A id da sess\u00E3o.
jms-server.get-last-sent-message-id.reply=A id da mensagem.
jms-server.get-session-creation-time=Obt\u00E9m o per\u00EDodo de cria\u00E7\u00E3o da sess\u00E3o.
jms-server.get-session-creation-time.session-id=A id da sess\u00E3o.
jms-server.get-session-creation-time.reply=O per\u00EDodo de cria\u00E7\u00E3o, representado como uma sequ\u00EAncia apresentando o n\u00FAmero de mil\u00E9simos de segundos desde a \u00E9poca.
jms-server.list-sessions-as-json=Lista todas as IDs da sess\u00E3o para a ID da conex\u00E3o especificada.
jms-server.list-sessions-as-json.connection-id=A id da conex\u00E3o.
jms-server.list-sessions-as-json.reply=A Sequ\u00EAncia retornada \u00E9 uma sequ\u00EAncia JSON contendo um array das ids de sess\u00E3o.
jms-server.list-prepared-transaction-jms-details-as-json=Lista todas as transa\u00E7\u00F5es preparadas, organizadas pela data, a mais antiga antes, com os detalhes no formato JMS, no formato JSON
jms-server.list-prepared-transaction-jms-details-as-json.reply=A Sequ\u00EAncia retornada \u00E9 uma sequ\u00EAncia JSON contendo um array dos detalhes da transa\u00E7\u00E3o.
jms-server.list-prepared-transaction-jms-details-as-html=Lista todas as transa\u00E7\u00F5es preparadas, organizadas pela data, a mais antiga antes, com os detalhes no JMS, no formato HTML
jms-server.list-prepared-transaction-jms-details-as-html.reply=A Sequ\u00EAncia retornada \u00E9 uma sequ\u00EAncia HTML contendo uma tabela de detalhes da transa\u00E7\u00E3o.
path=Um caminho do filesystem apontando a uma das localiza\u00E7\u00F5es onde o HornetQ armazena os dados persistentes.
path.add=Adiciona um caminho do sistema de arquivo.
path.remove=Remove o caminho.
path.path=O caminho do filesystem atual. Tratado como um caminho absoluto, a n\u00E3o ser que o atributo 'relative-to' seja especificado. Neste caso, o valor \u00E9 tratado como relativo ao caminho. <p>Caso tratado como um caminho absoluto, o pathname do per\u00EDodo de rodagem especificado pelo valor desse atributo ser\u00E1 determinado conforme a seguir\: </p>Caso esse valor j\u00E1 seja absoluto, o valor ser\u00E1 usado diretamente. Do contr\u00E1rio, o pathname do per\u00EDodo de rodagem ser\u00E1 resolvido numa maneira independente de sistema. Nos sistemas do UNIX, um pathname relativo torna-se absoluto pela resolu\u00E7\u00E3o do mesmo em rela\u00E7\u00E3o ao diret\u00F3rio do usu\u00E1rio atual. Nos sistemas do Microsoft Windows, um pathname relativo torna-se absoluto pela resolu\u00E7\u00E3o do mesmo em rela\u00E7\u00E3o ao diret\u00F3rio atual do drive nomeado pelo pathname, caso haja um. Do contr\u00E1rio, ele ser\u00E1 resolvido em rela\u00E7\u00E3o ao diret\u00F3rio do usu\u00E1rio atual.
path.relative-to=O nome de outro caminho nomeado anteriormente, ou um dos caminhos padr\u00F5es fornecidos pelo sistema. Caso o 'relative-to' seja fornecido, o valor do atributo 'path' \u00E9 tratado como relativo ao caminho especificado por esse atributo. Os caminhos padr\u00F5es fornecidos pelo sistema incluem\: <ul><li>jboss.home - o diret\u00F3rio raiz do JBoss AS distribution</li><li>user.home - home directory</li><li>user.dir do usu\u00E1rio - trabalho atual directory</li><li>java.home do usu\u00E1rio - java installation directory</li><li>jboss.server.base.dir - diret\u00F3rio raiz para um servidor individual de instance</li><li>jboss.server.data.dir - diret\u00F3rio em que o servidor ir\u00E1 usar para o arquivo de dados persistentesi storage</li><li>jboss.server.log.dir - diret\u00F3rio em que o servidor ir\u00E1 usar para o arquivo de registro de log storage</li><li>jboss.server.tmp.dir - diret\u00F3rio em que o servidor ir\u00E1 usar para o arquivo tempor\u00E1rio storage</li><li>jboss.domain.servers.dir - diret\u00F3rio pelo qual um controlador criar\u00E1 a \u00E1rea de trabalho para o servidor individual instances</li></ul>
bindings-directory.path=O diret\u00F3rio pelo qual o di\u00E1rio de bindings mora. O padr\u00E3o \u00E9 ${jboss.server.data.dir}/messaging/bindings.
journal-directory.path=O diret\u00F3rio pelo qual o di\u00E1rio de mensagem mora. O padr\u00E3o \u00E9 ${jboss.server.data.dir}/messaging/journal.
large-messages-directory.path=O diret\u00F3rio pelo qual s\u00E3o armazenadas grandes. O padr\u00E3o \u00E9 ${jboss.server.data.dir}/messaging/largemessages.
paging-directory.path=O diret\u00F3rio pelo qual s\u00E3o armazenados arquivos de p\u00E1gina. O padr\u00E3o \u00E9 ${jboss.server.data.dir}/messaging/paging.
grouping-handler=Decida qual n\u00F3 no cluster deve manusear uma mensagem com uma id de grupoo determinada.
grouping-handler.add=A opera\u00E7\u00E3o adicionando o manuseador do grupo. Apenas um manuseador de grupo \u00E9 permitido.
grouping-handler.remove=A opera\u00E7\u00E3o removendo o manuseador do grupo.
grouping-handler.type=Se \u00E9 que o manuseador \u00E9 um manuseador "Local" \u00FAnico para o cluster, que realiza as decis\u00F5es de manuseamento, ou o manuseador "Remoto" que converte com o manuseador local.
grouping-handler.grouping-handler-address=A refer\u00EAncia a uma conex\u00E3o de cluster e o endere\u00E7o que ela usa.
grouping-handler.timeout=Quanto tempo deve-se esperar para que uma decis\u00E3o de manuseamento seja tomada. Uma exce\u00E7\u00E3o ser\u00E1 lan\u00E7ada durante o envio caso o intervalo seja alcan\u00E7ado, garantindo desta forma que a ordem estrita \u00E9 mantida.
in-vm-acceptor=Define uma maneira pela qual as conex\u00F5es em VM podem ser realizadas ao servidor HornetQ.
remote-acceptor=Define uma maneira pela qual as conex\u00F5es remotas podem ser realizadas ao servidor HornetQ.
acceptor=Um aceitante define uma maneira pela qual as conex\u00F5es podem ser realizadas para o servidor HornetQ.
acceptor.remote=Um aceitante remoto
acceptor.in-vm=Um aceitante IN-VM
acceptor.add=Opera\u00E7\u00E3o de adi\u00E7\u00E3o de um aceitante
acceptor.add.params=Um conjunto de pares de valor de chave entendido pela classe de cria\u00E7\u00E3o do aceitante e usado para configur\u00E1-lo.
acceptor.remove=Opera\u00E7\u00E3o de adi\u00E7\u00E3o de um aceitante
acceptor.started=Se \u00E9 que esse aceitante foi inicializado.
acceptor.start=Inicia o aceitante.
acceptor.stop=Interrompe o aceitante.
acceptor.param=Um par de valor de chave entendido pela classe de cria\u00E7\u00E3o do aceitante e usado para configur\u00E1-lo.
address-setting=A configura\u00E7\u00E3o de endere\u00E7o define alguns atributos que est\u00E3o definidos em rela\u00E7\u00E3o a um curinga de endere\u00E7o ao inv\u00E9s de uma fila espec\u00EDfica.
address-setting.add=Opera\u00E7\u00E3o de adi\u00E7\u00E3o de uma configura\u00E7\u00E3o de endere\u00E7o
address-setting.remove=Opera\u00E7\u00E3o de remo\u00E7\u00E3o de uma configura\u00E7\u00E3o de endere\u00E7o
address-setting.address-full-policy=Determina o que acontece quando um endere\u00E7o torna-se cheio onde o tamanho m\u00E1ximo de bites \u00E9 especificado.
address-setting.dead-letter-address=O endere\u00E7o de carta inativa
address-setting.last-value-queue=Define se \u00E9 que a fila apenas usa os \u00FAltimos valores ou n\u00E3o
address-setting.max-delivery-attempts=Define quanto tempo uma mensagem cancelada pode ser re-entregue antes do envio ao endere\u00E7o de carta inativa
address-setting.max-size-bytes=O tamanho m\u00E1ximo de bites.
address-setting.message-counter-history-day-limit=Dia limite para o hist\u00F3rico de contador de mensagem.
address-setting.expiry-address=Define se \u00E9 que enviar a mensagem expirada.
address-setting.redelivery-delay=Define quanto tempo de espera antes da tentativa de re-entrega da mensagem cancelada
address-setting.redistribution-delay=Define quanto tempo de espera quando o \u00FAltimo consumidor +e encerrado na fila antes da redistribui\u00E7\u00E3o de mensagem.
address-setting.page-size-bytes=O tamanho da pagina\u00E7\u00E3o.
address-setting.page-max-cache-size=O n\u00FAmero de arquivos da p\u00E1gina a serem mantidos em mem\u00F3ria para otimizar o IO durante a pagina\u00E7\u00E3o de navega\u00E7\u00E3o.
address-setting.send-to-dla-on-no-route=Caso esse par\u00E2metro seja configurado como verdadeiro para aquele endere\u00E7o, e caso a mensagem n\u00E3o esteja roteada a quaisquer filas isto ser\u00E1 enviado ao endere\u00E7o de carta inativa (ECI ou dead letter address - DLA) para aquele endere\u00E7o (no caso disto existir).
connector=Um conector pode ser usado pelo cliente para definir como ele conecta a um servidor.
remote-connector=Usado por um cliente remoto para definir como isto \u00E9 conectado a um servidor.
in-vm-connector=Usado por um cliente em MV para definir como isto \u00E9 conectado a um servidor.
connector.add=Opera\u00E7\u00E3o de adi\u00E7\u00E3o de um conector
connector.add.params=Um conjunto de pares de valor de chave entendido pela classe de cria\u00E7\u00E3o do conector e usado para configur\u00E1-lo.
connector.remove=Opera\u00E7\u00E3o de remo\u00E7\u00E3o do conector
connector.param=Um par de valor de chave entendido pela classe de cria\u00E7\u00E3o do conector e usado para configur\u00E1-lo.
core-address=O recurso apenas do per\u00EDodo de rodagem representando um "endere\u00E7o" HornetQ. Zero ou mais filas podem ser vinculadas a um endere\u00E7o \u00FAnico. Quando uma mensagem \u00E9 roteada, ela \u00E9 roteada para determinar o conjunto das filas vinculadas ao endere\u00E7o de mensagem. 
core-address.roles=A lista das fun\u00E7\u00F5es de seguran\u00E7a (nome e permiss\u00F5es) associada com o endere\u00E7o.
core-address.role.name=O nome da fun\u00E7\u00E3o de seguran\u00E7a.
core-address.role.send=Se \u00E9 que a fun\u00E7\u00E3o possui permiss\u00E3o de envio ao endere\u00E7o.
core-address.role.consume=Se \u00E9 que a fun\u00E7\u00E3o possui permiss\u00E3o de consumo do endere\u00E7o.
core-address.role.createDurableQueue=Se \u00E9 que a fun\u00E7\u00E3o possui permiss\u00E3o para criar uma fila dur\u00E1vel.
core-address.role.deleteDurableQueue=Se \u00E9 que a fun\u00E7\u00E3o possui permiss\u00E3o para deletar uma fila dur\u00E1vel.
core-address.role.createNonDurableQueue=Se \u00E9 que a fun\u00E7\u00E3o possui permiss\u00E3o para criar uma fila n\u00E3o-dur\u00E1vel.
core-address.role.deleteNonDurableQueue=Se \u00E9 que a fun\u00E7\u00E3o possui permiss\u00E3o para deletar uma fila n\u00E3o-dur\u00E1vel.
core-address.role.manage=Se \u00E9 que a fun\u00E7\u00E3o possui permiss\u00E3o para gerenciar o endere\u00E7o.
core-address.queue-names=Os nomes das filas associadas com o endere\u00E7o.
core-address.number-of-bytes-per-page=O n\u00FAmero de bites associados por cada p\u00E1gina para este endere\u00E7o.
core-address.number-of-pages=O n\u00FAmero de p\u00E1ginas usadas por este endere\u00E7o.
core-address.binding-names=Os nomes de todos os bindings (ambas filas e desvios) vinculados a este endere\u00E7o.
core-address.get-roles-as-json=Retorna as fun\u00E7\u00F5es (nome e permiss\u00F5es) associadas a esse endere\u00E7o usando a serializa\u00E7\u00E3o JSON.
core-address.get-roles-as-json.reply=O formato JSON de sequ\u00EAncia.
queue=Uma fila.
queue.add=Opera\u00E7\u00E3o de adi\u00E7\u00E3o de uma fila principal.
queue.remove=Opera\u00E7\u00E3o de remo\u00E7\u00E3o de uma fila existente.
queue.name=O nome \u00FAnico da fila.
queue.queue-address=O endere\u00E7o da fila define qual endere\u00E7o \u00E9 usado para rotea\u00E7\u00E3o das mensagens.
queue.filter=A defini\u00E7\u00E3o do filtro da mensagem da fila. Um filtro vazio ou indefinido coincidir\u00E1 com todas as mensagens.
queue.durable=Define se \u00E9 que a fila \u00E9 dur\u00E1vel.
queue.id=A id da fila.
queue.paused=Se \u00E9 que a fila est\u00E1 em pausa.
queue.temporary=Se \u00E9 que a fila \u00E9 tempor\u00E1ria.
queue.message-count=O n\u00FAmero de mensagens atuais nessa fila.
queue.scheduled-count=O n\u00FAmero de mensagens esquematizadas nessa fila.
queue.consumer-count=O n\u00FAmero de clientes consumindo as mensagens dessa fila.
queue.delivering-count=O n\u00FAmero de mensagens que essa fila est\u00E1 entregando a seus consumidores.
queue.messages-added=O n\u00FAmero de mensagens adicionadas a essa fila desde que ela foi criada.
queue.list-scheduled-messages=Lista as mensagens esquematizadas para entrega.
queue.list-scheduled-messages.reply=A lista onde cada elemento \u00E9 um mapa de propriedades de mensagens para o valor das mesmas.
queue.list-scheduled-messages-as-json=Lista as mensagens esquematizadas para entrega como uma sequ\u00EAncia no formato JSON.
queue.list-scheduled-messages-as-json.reply=Uma sequ\u00EAncia no formato JSOn representando uma lista onde cada elemento \u00E9 um mapa das propriedades de mensagem para o valor das mesmas.
queue.message.messageID=A id da mensagem.
queue.message.userID=O userID - \u00E9 um UUID especificado do usu\u00E1rio opcional que pode ser determinado para identificar a mensagem.
queue.message.address=O endere\u00E7o que essa mensagem \u00E9 enviada.
queue.message.type=Tmessage type. 0 \= Default; 2 \= Object; 3 \= Text; 4 \= Bytes; 5 \= Map; 6 \= Stream
queue.message.durable=Se \u00E9 que a mensagem \u00E9 dur\u00E1vel ou n\u00E3o.
queue.message.expiration=O per\u00EDodo de expira\u00E7\u00E3o dessa mensagem.
queue.message.timestamp=O timestamp da mensagem. O timestamp corresponde ao per\u00EDodo que essa mensagem foi manuseada pelo servidor HornetQ.
queue.message.priority=A prioridade da mensagem. Os valores variam de 0 (menor prioridade) para 9 (maior prioridade).
queue.list-messages=Lista todas as mensagens na fila que coincidem o filtro
queue.list-messages.reply=A lista onde cada elemento \u00E9 um mapa das propriedades de mensagem para o valor das mesmas.
queue.list-messages-as-json=Lista todas as mensagens na fila que coincidem com o filtro e as retornam como uma sequ\u00EAncia no formato JSON.
queue.count-messages=Retorna o n\u00FAmero de mensagens na fila coincidente com o filtro gerado.
queue.remove-message=Remove a mensagem correspondente \u00E0 id de mensagem gerada.
queue.remove-message.reply=Verdadeiro caso a mensagem foi removida, do contr\u00E1rio ser\u00E1 falso.
queue.message-id=A id da mensagem.
queue.remove-messages=Remove as mensagens coincidentes com o filtro gerado a partir da destina\u00E7\u00E3o.
queue.remove-messages.reply=O n\u00FAmero de mensagens removidas.
queue.expire-message=Expira a mensagem correspondente \u00E0 id da mensagem gerada.
queue.expire-message.reply=Verdadeiro caso a mensagem estiver expirada, do contr\u00E1rio ser\u00E1 falso.
queue.expire-messages=Expira as mensagens correspondentes ao filtro gerado.
queue.expire-messages.reply=O n\u00FAmero de mensagens expiradas.
queue.send-message-to-dead-letter-address=Envia a mensagem correspondente \u00E0 id de mensagem gerada ao Endere\u00E7o da Carta Inativa da fila.
queue.send-message-to-dead-letter-address.reply=Verdadeiro caso a mensagem foi enviada ao endere\u00E7o da carta inativa, do contr\u00E1rio ser\u00E1 falso.
queue.send-messages-to-dead-letter-address=Envia as mensagens correspondentes ao filtro gerado a esse Endere\u00E7o da Carta Inativa da fila.
queue.send-messages-to-dead-letter-address.reply=O n\u00FAmero de mensagens enviadas.
queue.change-message-priority=Altera a prioridade da mensagem correspondente \u00E0 id de mensagem gerada.
queue.change-message-priority.new-priority=A nova prioridade (entre 0 e 9).
queue.change-message-priority.reply=Verdadeiro caso a mensagem de prioridade tenha sido alterada, do contr\u00E1rio ser\u00E1 falso.
queue.change-messages-priority=Altera a prioridade das mensagens correspondentes ao filtro gerado.
queue.change-messages-priority.reply=O n\u00FAmero de mensagens alteradas.
queue.move-message=Move a mensagem correspondente \u00E0 id de mensagem gerada \u00E0 outra fila.
queue.move-message.other-queue-name=O nome da fila para mover a mensagem.
queue.move-message.reject-duplicates=Rejeita as mensagens identificadas como duplicada.
queue.move-message.reply=Verdadeiro caso a mensagem foi movida, do contr\u00E1rio ser\u00E1 falso.
queue.move-messages=Move as mensagens correspondentes do filtro gerado \u00E0 outra fila.
queue.move-messages.reply=O n\u00FAmero de mensagens movidas.
queue.list-message-counter=Lista os detalhes do contador de mensagem.
queue.list-message-counter.reply=Detalha o contador de mensagem.
queue.list-message-counter-as-json=Lista o contador de mensagem como uma sequ\u00EAncia no formato JSON.
queue.list-message-counter-as-json.reply=Uma sequ\u00EAncia no formato JSON.
queue.list-message-counter-as-html=Lista o contador de mensagem como uma sequ\u00EAncia no formato HTML.
queue.list-message-counter-as-html.reply=Uma sequ\u00EAncia no formato HTML.
queue.list-message-counter-history=Lista o hist\u00F3rico do contador de mensagem.
queue.list-message-counter-history.reply=Detalha o hist\u00F3rico do contador de mensagem.
queue.list-message-counter-history-as-json=Lista o hist\u00F3rico do contador de mensagem como uma sequ\u00EAncia no formato JSON.
queue.list-message-counter-history-as-json.reply=Uma sequ\u00EAncia no formato JSON.
queue.list-message-counter-history-as-html=Lista o hist\u00F3rico do contador de mensagem.
queue.list-message-counter-history-as-html.reply=A sequ\u00EAncia no formato HTML como uma sequ\u00EAncia no formato HTML.
queue.reset-message-counter=Re-inicia a mensagem do contador de mensagem.
queue.pause=Pausa a fila.
queue.resume=Resume a fila.
queue.list-consumers=Lista todos os consumidores existentes na fila.
queue.list-consumers.reply=A lista, que cujos elementos detalham o consumidor da fila.
queue.list-consumers-as-json=Uma sequ\u00EAncia no formato JSON.
queue.list-consumers-as-json.reply=Uma sequ\u00EAncia no formato JSON.
broadcast-group=Um grupo de difus\u00E3o significa que um servidor difunde os conectores sobre a rede.
broadcast-group.add=Adiciona o grupo de difus\u00E3o.
broadcast-group.remove=Remove o grupo de difus\u00E3o.
broadcast-group.local-bind-address=O endere\u00E7o bind local que o soquete do datagrama est\u00E1 vinculado. Caso voc\u00EA possuir interfaces de rede m\u00FAltiplas no seu servidor, voc\u00EA especificar\u00E1 qual delas deseja usar para difus\u00F5es pela configura\u00E7\u00E3o desse atributo. Caso esse atributo n\u00E3o seja especificado, o soquete ser\u00E1 vinculado ao endere\u00E7o curinga, um endere\u00E7o IP escolhido pelo kernel.
broadcast-group.local-bind-port=A porta local pela qual o soquete do datagrama est\u00E1 vinculado. Normalmente, voc\u00EA apenas usaria o valor padr\u00E3o de -1, significando que uma porta an\u00F4nima deve ser usada. Esse par\u00E2metro \u00E9 sempre especificado em conjun\u00E7\u00E3o com o endere\u00E7o bind local.
broadcast-group.group-address=O endere\u00E7o multicast pelo qual os dados ser\u00E3o difundidos. Ele \u00E9 um endere\u00E7o IP de classe D no valor de224.0.0.0 to 239.255.255.255, inclusive. O endere\u00E7o 224.0.0.0 est\u00E1 reservado e n\u00E3o est\u00E1 dispon\u00EDvel para uso.
broadcast-group.group-port=O n\u00FAmero da porta UDP usada para difus\u00E3o.
broadcast-group.broadcast-period=O per\u00EDodo em mil\u00E9simos de segundos entre as difus\u00F5es consecutivas.
broadcast-group.connectors=Especifica os nomes dos conectores que ser\u00E3o difundidos.
broadcast-group.socket-binding=O binding do soquete do grupo de difus\u00E3o.
broadcast-group.started=Se \u00E9 que o grupo de difus\u00E3o foi inicializado.
broadcast-group.start=Inicia o grupo de difus\u00E3o.
broadcast-group.stop=Interrompe o grupo de difus\u00E3o.
broadcast-group.get-connector-pairs-as-json=Retorna os pares dos conectores de back-up ativos que est\u00E3o difundidos pelo grupo de difus\u00E3o usando a serializa\u00E7\u00E3o JSON.
discovery-group=O grupo multicast de escuta para recebimento de difus\u00E3o de outros servidores anunciando seus conectores.
discovery-group.add=Adiciona um grupo de descoberta.
discovery-group.remove=Remove um grupo de descoberta.
discovery-group.local-bind-address=O endere\u00E7o bind local que o soquete do datagrama est\u00E1 vinculado.
discovery-group.group-address=O endere\u00E7o IP multicast do grupo para escuta.
discovery-group.group-port=A porta UDP do grupo multicast.
discovery-group.refresh-timeout=O per\u00EDodo que o grupo de descoberta espera ap\u00F3s receber a \u00FAltima difus\u00E3o de um servidor em particular antes de remover a entrada do par do conector do servidor de sua lista. 
discovery-group.initial-wait-timeout=O per\u00EDodo de espera, em mil\u00E9simos de segundos, por uma difus\u00E3o inicial para fornecer pelo menos um n\u00F3 no cluster.
discovery-group.socket-binding=O binding do soquete do grupo de descoberta.
bridge=A fun\u00E7\u00E3o de uma ponte \u00E9 consumir mensagens de uma fila de fonte e envi\u00E1-las a um endere\u00E7o de destino, normalmente num servidor HornetQ diferente.
bridge.add=Opera\u00E7\u00E3o de adi\u00E7\u00E3o de uma ponte.
bridge.remove=Opera\u00E7\u00E3o de remo\u00E7\u00E3o de uma ponte.
bridge.queue-name=O nome \u00FAnico da fila local que a ponte consome.
bridge.forwarding-address=O endere\u00E7o no servidor de destino que a mensagem ser\u00E1 enviada. Caso o endere\u00E7o de envio n\u00E3o seja especificado, a destina\u00E7\u00E3o original da mensagem ser\u00E1 mantida.
bridge.ha=Se \u00E9 que ou n\u00E3o a ponte deve suportar a alta disponibilidade. Verdadeiro significa que a ponte ir\u00E1 conectar a qualquer servidor num cluster e suportar a falha.
bridge.filter=Uma sequ\u00EAncia de filtro opcional. Caso especificada, apenas as mensagens que coincidirem com a express\u00E3o do filtro especificado ser\u00E3o enviadas. A sequ\u00EAncia do filtro segue uma s\u00EDntese da express\u00E3o do filtro HornetQ descrita na documenta\u00E7\u00E3o HornetQ.
bridge.transformer-class-name=O nome da classe do usu\u00E1rio definido que implanta a interface org.hornetq.core.server.cluster.Transformer.
bridge.retry-interval=O per\u00EDodo em mil\u00E9simos de segundos entre as tentativas de reconex\u00E3o, caso a conex\u00E3o ao servidor do destino falhar.
bridge.retry-interval-multiplier=O multiplicador a ser aplicado ao tempo desde a \u00FAltima tentativa em computar o per\u00EDodo \u00E0 nova tentativa. Isto permite que voc\u00EA implante uma retirada exponencial entre as novas tentativas.
bridge.reconnect-attempts=O n\u00FAmero total de tentativas de reconex\u00E3o que a ponte realizar\u00E1 antes de desistir e encerrar. O valor -1 significa um n\u00FAmero ilimitado de tentativas.
bridge.failover-on-server-shutdown=Se \u00E9 que a ponte tentar\u00E1 falhar no servidor de back-up (caso especificado) quando o servidor de destino estiver claramente desligado ao inv\u00E9s de travado.
bridge.use-duplicate-detection=Se \u00E9 que a ponte ir\u00E1 automaticamente inserir a propriedade de id duplicada em cada mensagem que ela enviar.
bridge.confirmation-window-size=O tamanho da janela de confirma\u00E7\u00E3o a ser usada pela conex\u00E3o para envio de mensagens ao n\u00F3 de destino.
bridge.user=O nome do usu\u00E1rio para uso quando criando a conex\u00E3o da ponte ao servidor remoto. Caso ele n\u00E3o seja especificado, o usu\u00E1rio do cluster padr\u00E3o especificado pelo atributo do usu\u00E1rio do cluster, no recurso do sub-sistema da mensagem da raiz, ser\u00E1 usado.
bridge.password=A senha para uso na cria\u00E7\u00E3o da conex\u00E3o da ponte para o servidor remoto. Caso ela n\u00E3o seja especificada, a senha do cluster padr\u00E3o especificada pelo atributo da senha do cluster, no recurso do sub-sistema da mensagem da raiz, ser\u00E1 usada.
bridge.static-connectors=A lista de nomes dos conectores definidos estaticamente usados pela ponte. Isto deve ser indefinida (nula) caso o 'discovery-group-name' esteja definido.
bridge.discovery-group-name=O nome do grupo de descoberta usado por essa ponte. Ele deve ser indefinido (nulo), caso o 'static-connectors' seja indefinido.
bridge.started=Se \u00E9 que a ponte foi inicializada.
bridge.start=Inicia a ponte.
bridge.stop=Interrompe a ponte.
divert=A messaging resource that allows you to transparently divert messages routed to one address to some other address, without making any changes to any client application logic.
divert.add=Operation adding a divert
divert.remove=Operation removing a divert
divert.routing-name=Routing name of the divert
divert.divert-address=Address to divert from
divert.forwarding-address=Address to divert to
divert.filter=An optional filter string. If specified then only messages which match the filter expression specified will be diverted. The filter string follows the HornetQ filter expression syntax described in the HornetQ documentation.
divert.exclusive=Whether the divert is exclusive, meaning that the message is diverted to the new address, and does not go to the old address at all.
divert.transformer-class-name=The name of a class used to transform the message's body or properties before it is diverted.
cluster-connection=Cluster connections group servers into clusters so that messages can be load balanced between the nodes of the cluster.
cluster-connection.add=Operation adding a cluster connection
cluster-connection.remove=Operation removing a cluster connection
cluster-connection.cluster-connection-address=Each cluster connection only applies to messages sent to an address that starts with this value.
cluster-connection.connector-ref=The confirmation-window-size to use for the connection used to forward messages to a target node.
cluster-connection.retry-interval=The period in milliseconds between subsequent attempts to reconnect to a target server, if the connection to the target server has failed.
cluster-connection.use-duplicate-detection=Whether the bridge will automatically insert a duplicate id property into each message that it forwards.
cluster-connection.forward-when-no-consumers=Whether messages will be distributed round robin between other nodes of the cluster irrespective of whether there are matching or indeed any consumers on other nodes. If this is set to false (the default) then HornetQ will only forward messages to other nodes of the cluster if the address to which they are being forwarded has queues which have consumers, and if those consumers have message filters (selectors) at least one of those selectors must match the message.
cluster-connection.max-hops=The maximum number of times a message can be forwarded. HornetQ can be configured to also load balance messages to nodes which might be connected to it only indirectly with other HornetQ servers as intermediates in a chain.
cluster-connection.confirmation-window-size=The confirmation-window-size to use for the connection used to forward messages to a target node.
cluster-connection.static-connectors=The statically defined list of connectors to which this cluster connection will make connections. Must be undefined (null) if 'discovery-group-name' is defined.
cluster-connection.allow-direct-connections-only=Whether, if a node learns of the existence of a node that is more than 1 hop away, we do not create a bridge for direct cluster connection. Only relevant if 'static-connectors' is defined.
cluster-connection.discovery-group-name=The discovery group used to obtain the list of other servers in the cluster to which this cluster connection will make connections. Must be undefined (null) if 'static-connectors' is defined.
cluster-connection.node-id=The node ID used by this cluster connection.
cluster-connection.get-nodes=Returns a map of the nodes connected to this cluster connection, where keys are node IDs and values are the addresses used to connect to the nodes.
cluster-connection.get-nodes.reply=A map where keys are node IDs and values are the addresses used to connect to the nodes.
cluster-connection.get-static-connectors-as-json=Returns the list of static connectors as a string in JSON format.
cluster-connection.started=Whether the cluster connection is started.
cluster-connection.start=Starts the cluster connection.
cluster-connection.stop=Stops the cluster connection.
connector-service=TODO
connector-service.add=Operation adding a connector service
connector-service.remove=Operation removing a connector service
connector-service.factory-class=Class name of the factory class that can instantiate the connector service.
connector-service.param=A key/value pair understood by the connector service's factory-class
connector-service.param.add=Adds a key/value pair understood by the connector service's factory-class
connector-service.param.remove=Removes a key/value pair understood by the connector service's factory-class
connector-service.param.value=A por\u00E7\u00E3o de valor do par chave/valor entendido pelo factory-class do servi\u00E7o conector.
factory-class=A classe de cria\u00E7\u00E3o.
jndi-binding=O nome do binding para o JNDI.
jms=A configura\u00E7\u00E3o do subsistema JMS.
jms.connection-factories=As cria\u00E7\u00F5es da conex\u00E3o JMS.
jms.queues=As filas JMS.
jms.topics=Os t\u00F3picos JMS.
jms.pooled-connection-factories=As cria\u00E7\u00F5es da conex\u00E3o JMS Gerenciada.
jms.add=Adiciona o sub-sistema jms.
jms-queue=Define a fila JMS.
jms-queue.add=Adiciona a fila JMS.
jms-queue.remove=Remove a fila JMS.
jms-queue.entries=Os nomes JNDI que a fila ser\u00E1 vinculada.
jms-queue.selector=O seletor da fila.
jms-queue.durable=Se \u00E9 que a fila \u00E9 dur\u00E1vel ou n\u00E3o.
jms-queue.queue-address=O endere\u00E7o da fila define qual endere\u00E7o \u00E9 usado para rotea\u00E7\u00E3o das mensagens.
jms-queue.expiry-address=O endere\u00E7o de envio de mensagens expiradas.
jms-queue.dead-letter-address=O endere\u00E7o de envio de mensagens inativas.
jms-queue.paused=Se \u00E9 que a fila est\u00E1 em pausa.
jms-queue.temporary=Se \u00E9 que a fila \u00E9 tempor\u00E1ria.
jms-queue.message-count=O n\u00FAmero de mensagens atuais nessa fila.
jms-queue.scheduled-count=O n\u00FAmero de mensagens esquematizadas nessa fila.
jms-queue.consumer-count=O n\u00FAmero de clientes consumindo as mensagens dessa fila.
jms-queue.delivering-count=O n\u00FAmero de mensagens que essa fila est\u00E1 enviando a seus consumidores.
jms-queue.messages-added=O n\u00FAmero de mensagens adicionadas a essa fila desde que ela foi criada.
jms-queue.add-jndi=Adiciona a fila a outro binding JNDI
jms-queue.message.JMSPriority=A prioridade da mensagem.
jms-queue.message.JMSTimestamp=O timestamp da mensagem, em mil\u00E9simos de segundos, desde o epoch.
jms-queue.message.JMSExpiration=O per\u00EDodo de expira\u00E7\u00E3o da mensagem.
jms-queue.message.JMSDeliveryMode=O modo de entrega para a mensagem, PERSISTENTE ou N\u00C3O-PERSISTENTE.
jms-queue.message.JMSMessageID=A id da mensagem.
jms-topic=Define o t\u00F3pico JMS.
jms-topic.add=Adiciona o t\u00F3pico JMS.
jms-topic.remove=Remove o t\u00F3pico JMS.
jms-topic.entries=Os nomes jndi que o t\u00F3pico ser\u00E1 vinculado.
jms-topic.topic-address=O endere\u00E7o que t\u00F3pico direciona-se.
jms-topic.temporary=Se \u00E9 que o t\u00F3pico \u00E9 tempor\u00E1rio.
jms-topic.message-count=O n\u00FAmero de mensagens atuais nessa fila.
jms-topic.delivering-count=O n\u00FAmero de mensagens que essa fila est\u00E1 entregando a seus consumidores.
jms-topic.messages-added=O n\u00FAmero de mensagens adicionadas a essa fila desde que ela foi criada.
jms-topic.durable-message-count=O n\u00FAmero de mensagens para todos os assinantes deste t\u00F3pico.
jms-topic.non-durable-message-count=O n\u00FAmero de mensagens para todos os assinantes n\u00E3o-dur\u00E1veis desse t\u00F3pico.
jms-topic.subscription-count=O n\u00FAmero de assinantes (dur\u00E1veis e n\u00E3o-dur\u00E1veis) para esse t\u00F3pico.
jms-topic.durable-subscription-count=O n\u00FAmero de assinantes dur\u00E1veis para esse t\u00F3pico.
jms-topic.non-durable-subscription-count=O n\u00FAmero de assinantes n\u00E3o-dur\u00E1veis para esse t\u00F3pico.
jms-topic.list-all-subscriptions=Lista todos os assinantes.
jms-topic.list-all-subscriptions.reply=Uma lista, cada um dos elementos descreve uma subscri\u00E7\u00E3o \u00FAnica.
jms-topic.list-all-subscriptions-as-json=Lista todas as subscri\u00E7\u00F5es como uma sequ\u00EAncia no formato JSON.
jms-topic.list-all-subscriptions-as-json.reply=A sequ\u00EAncia formatada do JSON.
jms-topic.list-durable-subscriptions=Lista apenas as subscri\u00E7\u00F5es dur\u00E1veis.
jms-topic.list-durable-subscriptions.reply=A lista, cada um dos elementos descreve uma subscri\u00E7\u00E3o \u00FAnica.
jms-topic.list-durable-subscriptions-as-json=Lista apenas as subscri\u00E7\u00F5es dur\u00E1veis, como uma sequ\u00EAncia no formato JSON.
jms-topic.list-non-durable-subscriptions=Lista apenas as subscri\u00E7\u00F5es n\u00E3o-dur\u00E1veis.
jms-topic.list-non-durable-subscriptions.reply=A lista, cada um dos elementos descreve uma subscri\u00E7\u00E3o \u00FAnica.
jms-topic.list-non-durable-subscriptions-as-json=Lista apenas as subscri\u00E7\u00F5es n\u00E3o-dur\u00E1veis, como uma sequ\u00EAncia no formato JSON.
jms-topic.list-subscriptions.queueName=O nome completo da fila.
jms-topic.list-subscriptions.clientID=A id do cliente.
jms-topic.list-subscriptions.selector=Um seletor da fila.
jms-topic.list-subscriptions.name=O nome da fila.
jms-topic.list-subscriptions.durable=Se \u00E9 que a fila \u00E9 dur\u00E1vel ou n\u00E3o.
jms-topic.list-subscriptions.messageCount=O n\u00FAmero de mensagens nessa fila.
jms-topic.list-subscriptions.deliveringCount=O n\u00FAmero de mensagens que essa fila est\u00E1 enviando a seus clientes.consumidores.
jms-topic.list-subscriptions.consumers=O n\u00FAmero de consumidores.
jms-topic.list-subscriptions.consumers.consumerID=A id do cliente.
jms-topic.list-subscriptions.consumers.connectionID=A id da conex\u00E3o.
jms-topic.list-subscriptions.consumers.sessionID=A id da sess\u00E3o do cliente.
jms-topic.list-subscriptions.consumers.browseOnly=Se \u00E9 que o consumidor est\u00E1 apenas navegando na fila.
jms-topic.list-subscriptions.consumers.creationTime=O per\u00EDodo que o consumidor foi criado, em mil\u00E9simos de segundo desde o epoch.
jms-topic.list-messages-for-subscription=Lista todas as mensagens para a subscri\u00E7\u00E3o gerada.
jms-topic.list-messages-for-subscription.queue-name=O nome da fila representando uma subscri\u00E7\u00E3o.
jms-topic.list-messages-for-subscription.reply=A lista onde cada elemento \u00E9 um mapa de propriedades de mensagens para o valor.
jms-topic.list-messages-for-subscription-as-json=Lista todas as mensagens para uma subscri\u00E7\u00E3o gerada como uma sequ\u00EAncia no formato JSON.
jms-topic.count-messages-for-subscription=Conta o n\u00FAmero de mensagens coincidentes com o filtro para uma subscri\u00E7\u00E3o gerada.
jms-topic.client-id=A ID do cliente.
jms-topic.subscription-name=O nome da subscri\u00E7\u00E3o dur\u00E1vel.
jms-topic.filter=O filtro de mensagem JMS.
jms-topic.drop-durable-subscription=Descarta uma subscri\u00E7\u00E3o dur\u00E1vel
jms-topic.drop-all-subscriptions=Descarta todas as subscri\u00E7\u00F5es desse t\u00F3pico.
jms-topic.add-jndi=Adiciona a fila a outro binding JNDI
transport-config.param=O par\u00E2metro
transport-config.param.value=O valor do par\u00E2metro
transport-config.param.add=Opera\u00E7\u00E3o de adi\u00E7\u00E3o a um novo par\u00E2metro
transport-config.param.remove=Opera\u00E7\u00E3o de remo\u00E7\u00E3o de um par\u00E2metro existente
transport-config.param.optional=Par\u00E2metros opcionais
connection-factory=Define uma cria\u00E7\u00E3o da conex\u00E3o.
connection-factory.add=Adiciona uma cria\u00E7\u00E3o da conex\u00E3o.
connection-factory.remove=Remove uma cria\u00E7\u00E3o da conex\u00E3o.
connection-factory.factory-type=O tipo de cria\u00E7\u00E3o da conex\u00E3o. 0 \= jms cf, 1 \= queue cf, 2 \= topic cf, 3 \= xa cf, 4 \= xa queue cf, 5 \= xa topic cf
connection-factory.initial-message-packet-size=O tamanho inicial de mensagens criadas atrav\u00E9s dessa cria\u00E7\u00E3o.
pooled-connection-factory=Define uma cria\u00E7\u00E3o da conex\u00E3o gerenciada.
pooled-connection-factory.add=Adiciona uma cria\u00E7\u00E3o da conex\u00E3o gerenciada.
pooled-connection-factory.remove=Remove uma cria\u00E7\u00E3o de conex\u00E3o gerenciada.
connection-factory.auto-group=Se \u00E9 que o agrupamento de mensagem est\u00E1 sendo usado automaticamente.
connection-factory.block-on-acknowledge=Verdadeiro para configurar o bloqueio na confirma\u00E7\u00E3o.
connection-factory.block-on-durable-send=Verdadeiro para configurar o bloqueio no envio de dura\u00E7\u00E3o.
connection-factory.block-on-non-durable-send=Verdadeiro para configurar o bloqueio no envio n\u00E3o dur\u00E1vel.
connection-factory.cache-large-message-client=Verdadeiro para efetuar o cache em mensagens grandes.
connection-factory.call-timeout=O intervalo da chamada.
connection-factory.client-failure-check-period=O per\u00EDodo de checagem da falha do cliente.
connection-factory.client-id=A id do cliente.
connection-factory.compress-large-messages=Se \u00E9 que as mensagens grandes devem ser compressadas.
connection-factory.confirmation-window-size=A confirma\u00E7\u00E3o do tamanho da janela.
connection-factory.connection-factory=Define a cria\u00E7\u00E3o da conex\u00E3o.
connection-factory.connection-ttl=O ttl da conex\u00E3o.
connection-factory.connector=Define os conectores. Eles s\u00E3o armazenados num mapa pelo nome do conector, com os conectores de back-up armazenados como o valor, ou um valor indefinido caso n\u00E3o haja conector back-up.
connection-factory.consumer-max-rate=A taxa m\u00E1xima do consumidor.
connection-factory.consumer-window-size=O tamanho da janela do consumidor.
connection-factory.discovery-group-name=O nome do grupo da descoberta.
connection-factory.discovery-initial-wait-timeout=O intervalo de espera inicial da descoberta.
connection-factory.dups-ok-batch-size=O tamanho do lote ok de dups.
connection-factory.entries=Os nomes jndi que a cria\u00E7\u00E3o da conex\u00E3o deve ser vinculada.
connection-factory.failover-on-initial-connection=Verdadeiro para a falha na conex\u00E3o inicial.
connection-factory.failover-on-server-shutdown=Verdadeiro para a falha no encerramento do servidor.
connection-factory.group-id=A id do grupo.
connection-factory.ha=Se \u00E9 que a cria\u00E7\u00E3o da conex\u00E3o suporta a Alta Disponibilidade.
connection-factory.connection-load-balancing-policy-class-name=O nome da classe de implementa\u00E7\u00E3o na pol\u00EDtica de balanceamento de carga ao lado do cliente que o cliente pode usar para balancear a carga das sess\u00F5es atrav\u00E9s de n\u00F3s diferentes num cluster.
connection-factory.max-retry-interval=O intervalo de nova tentativa m\u00E1ximo.
connection-factory.min-large-message-size=O tamanho m\u00EDnimo de mensagem grande. 
connection-factory.pre-acknowledge=Verdadeiro para pr\u00E9-confirma\u00E7\u00E3o.
connection-factory.producer-max-rate=A taxa m\u00E1xima do produtor.
connection-factory.producer-window-size=O tamanho da janela do produtor.
connection-factory.reconnect-attempts=As tentativas de nova conex\u00E3o. 
connection-factory.retry-interval=O intervalo de nova conex\u00E3o.
connection-factory.retry-interval-multiplier=O multiplicador de intervalo de nova conex\u00E3o.
connection-factory.scheduled-thread-pool-max-size=O tamanho m\u00E1ximo do pool do thread esquematizado.
connection-factory.thread-pool-max-size=O tamanho m\u00E1ximo do pool do thread.
connection-factory.transaction-batch-size=O tamanho do lote de transa\u00E7\u00E3o.
connection-factory.use-global-pools=Verdadeiro para uso de pools globais.
connection-factory.add-jndi=Adiciona a cria\u00E7\u00E3o a outro binding JNDI 
pooled-connection-factory.auto-group=O grupo autom\u00E1tico.
pooled-connection-factory.block-on-acknowledge=Verdadeiro para configurar o bloqueio na confirma\u00E7\u00E3o.
pooled-connection-factory.block-on-durable-send=Verdadeiro para configurar no envio dur\u00E1vel.
pooled-connection-factory.block-on-non-durable-send=Verdadeiro para configurar no envio n\u00E3o-dur\u00E1vel.
pooled-connection-factory.cache-large-message-client=Verdadeiro para efetuar o cache nas mensagens grandes.
pooled-connection-factory.call-timeout=O intervalo da chamada.
pooled-connection-factory.client-failure-check-period=O per\u00EDodo da checagem da falha do cliente.
pooled-connection-factory.client-id=A id do cliente.
pooled-connection-factory.confirmation-window-size=O tamanho da janela da confirma\u00E7\u00E3o.
pooled-connection-factory.connection-factory=Define a cria\u00E7\u00E3o da conex\u00E3o.
pooled-connection-factory.connection-ttl=O ttl da conex\u00E3o.
pooled-connection-factory.connector=Define os conectores. Esses s\u00E3o armazenados num mapa pelo nome do conector, com os conectores de back-up armazenados como um valor, ou um valor indefinido caso n\u00E3o haja conector de back-up.
pooled-connection-factory.consumer-max-rate=A taxa m\u00E1xima de consumidor.
pooled-connection-factory.consumer-window-size=O tamanho da janela do consumidor.
pooled-connection-factory.discovery-group-name=O nome do grupo de descoberta.
pooled-connection-factory.discovery-initial-wait-timeout=O intervalo de espera inicial da descoberta.
pooled-connection-factory.dups-ok-batch-size=O tamanho do lote ok do dups.
pooled-connection-factory.entries=Os nomes jndi que a cria\u00E7\u00E3o da conex\u00E3o deve ser vinculada.
pooled-connection-factory.failover-on-initial-connection=Verdadeiro para a falha na conex\u00E3o inicial.
pooled-connection-factory.failover-on-server-shutdown=Verdadeiro para a falha no encerramento do servidor.
pooled-connection-factory.group-id=A id do grupo.\n
pooled-connection-factory.ha=Se \u00E9 que a cria\u00E7\u00E3o da conex\u00E3o suporta a Alta Disponibilidade
pooled-connection-factory.connection-load-balancing-policy-class-name=O nome da classe implantando uma pol\u00EDtica de balanceamento de carga ao lado do cliente que o cliente pode usar para as sess\u00F5es de balanceamento de carga atrav\u00E9s de diferentes n\u00F3s num cluster. 
pooled-connection-factory.max-retry-interval=O intervalo de nova tentativa m\u00E1ximo.
pooled-connection-factory.min-large-message-size=O tamanho m\u00EDnimo de mensagem grande.
pooled-connection-factory.pre-acknowledge=Verdadeiro para a pr\u00E9-confirma\u00E7\u00E3o.
pooled-connection-factory.producer-max-rate=A taxa m\u00E1xima do produtor.
pooled-connection-factory.producer-window-size=O tamanho da janela do produtor.
pooled-connection-factory.reconnect-attempts=A tentativa de nova conex\u00E3o.
pooled-connection-factory.retry-interval=O intervalo de nova tentativa.
pooled-connection-factory.retry-interval-multiplier=O multiplicador do intervalo de nova tentativa.
pooled-connection-factory.scheduled-thread-pool-max-size=O tamanho m\u00E1ximo do thread esquematizado.
pooled-connection-factory.thread-pool-max-size=O tamanho m\u00E1ximo do pool do thread.
pooled-connection-factory.transaction-batch-size=O tamanho do lote da transa\u00E7\u00E3o.
pooled-connection-factory.use-global-pools=Os pools globais para uso.
pooled-connection-factory.use-jndi=Uso do JNDI para localizar o destino para as conex\u00F5es de entrada
pooled-connection-factory.jndi-params=Os par\u00E2metros JNDI para uso da localiza\u00E7\u00E3o do destino de conex\u00F5es de entrada.
pooled-connection-factory.use-local-tx=Uso da transa\u00E7\u00E3o local para sess\u00F5es de entrada
pooled-connection-factory.user=O username padr\u00E3o para uso com essa f\u00E1brica de conex\u00E3o. Isto \u00E9 apenas necess\u00E1rio quando direcionando a cria\u00E7\u00E3o da conex\u00E3o a um host remoto.
pooled-connection-factory.password=A senha padr\u00E3o para uso com essa cria\u00E7\u00E3o de conex\u00E3o. Isto \u00E9 apenas necess\u00E1rio quando direcionando a uma cria\u00E7\u00E3o de conex\u00E3o a um host remoto.
pooled-connection-factory.setup-attempts=O n\u00FAmero de vezes para instala\u00E7\u00E3o do ponto de extremidade MDB
pooled-connection-factory.setup-interval=O intervalo entre as tentativas na instala\u00E7\u00E3o do ponto de extremidade MDB.
pooled-connection-factory.transaction=TODO
server-id=A id do servidor.
security-setting=A configura\u00E7\u00E3o de seguran\u00E7a permite conjuntos de permiss\u00F5es a serem definidos em refer\u00EAncia as filas baseadas em seus endere\u00E7os.
security-setting.add=Adiciona uma nova configura\u00E7\u00E3o de seguran\u00E7a.
security-setting.remove=Remove uma configura\u00E7\u00E3o de seguran\u00E7a existente.
security-role=A fun\u00E7\u00E3o de seguran\u00E7a.
security-role.add=Adiciona uma fun\u00E7\u00E3o de seguran\u00E7a.
security-role.remove=Remove uma fun\u00E7\u00E3o de seguran\u00E7a existente.
security-role.name=O nome da fun\u00E7\u00E3o de seguran\u00E7a.
security-role.send=Essa permiss\u00E3o concede o usu\u00E1rio o envio de mensagem para coincidir endere\u00E7os.
security-role.consume=Essa permiss\u00E3o concede ao usu\u00E1rio o consumo de uma mensagem a partir da fila vinculada para coincidir endere\u00E7os.
security-role.create-durable-queue=Essa permiss\u00E3o concede ao usu\u00E1rio a cria\u00E7\u00E3o da fila dur\u00E1vel.
security-role.delete-durable-queue=Essa permiss\u00E3o concede ao usu\u00E1rio a remo\u00E7a\u00F5 de uma fila dur\u00E1vel.
security-role.create-non-durable-queue=Essa permiss\u00E3o concede ao usu\u00E1rio a cria\u00E7\u00E3o da fila tempor\u00E1ria.
security-role.delete-non-durable-queue=Essa permiss\u00E3o concede ao usu\u00E1rio a remo\u00E7\u00E3o da fila tempor\u00E1ria.
security-role.manage=Essa permiss\u00E3o concede ao usu\u00E1rio a invoca\u00E7\u00E3o das opera\u00E7\u00F5es de gerenciamento pelo envio das mensagens de gerenciamento para o endere\u00E7o de gerenciamento.
socket-binding=A refer\u00EAncia binding do soquete.
deployed=Os recursos do per\u00EDodo de rodagem expostos pelos recursos de mensagem inclu\u00EDdos nessa implanta\u00E7\u00E3o.
