messaging=El sub-sistema de mensajer\u00EDa.
messaging.add=Operaci\u00F3n agregando el sub-sistema de mensajer\u00EDa.
messaging.remove=Operaci\u00F3n borrando el sub-sistema de mensajer\u00EDa.
messaging.hornetq-server=Servidores HornetQ proporcionados por el sub-sistema de mensajer\u00EDa
hornetq-server=Una instancia del servidor HornetQ.
hornetq-server.add=Operaci\u00F3n agregando un servidor HornetQ.
hornetq-server.remove=Operaci\u00F3n borrando un servidor HornetQ.
hornetq-server.name=No utilizado.
hornetq-server.clustered=Si el servidor est\u00E1 en cl\u00FAsters.
hornetq-server.persistence-enabled=Si el servidor utilizar\u00E1 el diario basado en archivos para persistencia.
hornetq-server.scheduled-thread-pool-max-size=El n\u00FAmero de hilos que tiene el pool principal de hilos programado.
hornetq-server.thread-pool-max-size=El n\u00FAmero de hilos que tiene el pool de hilos principal .  -1 significa que no hay l\u00EDmite.
hornetq-server.security-domain=El dominio de seguridad a utilizar para verificar la informaci\u00F3n de usuarios y roles. 
hornetq-server.security-enabled=Si la seguridad est\u00E1 habilitada.
hornetq-server.security-invalidation-interval=\u00BFCu\u00E1nto tiempo (en min) debe esperar antes de invalidar la cache de seguridad?
hornetq-server.wild-card-routing-enabled=Si el servidor soporta el enrutamiento de comodines.
hornetq-server.management-address=Direcci\u00F3n a la cual enviar mensajes de administraci\u00F3n.
hornetq-server.management-notification-address=El nombre de la direcci\u00F3n a la que los usuarios se conectan para recibir notificaciones de administraci\u00F3n.
hornetq-server.cluster-user=El usuario utilizado por conexiones de cl\u00FAster para comunicarse entre los nodos agrupados. 
hornetq-server.cluster-password=La contrase\u00F1a utilizada por conexiones de cl\u00FAster para comunicarse entre los nodos agrupados. 
hornetq-server.jmx-management-enabled=Si HornetQ debe exponer su API de administraci\u00F3n interna a trav\u00E9s de  JMX.  Esto se recomienda, ya que el acceso a los MBeans puede conducir a una configuraci\u00F3n inconsistente.
hornetq-server.jmx-domain=El dominio de JMX utilizado para registrar  MBeans HornetQ  en el MBeanServer.
hornetq-server.message-counter-enabled=Si los contadores de mensajes est\u00E1n habilitados. 
hornetq-server.message-counter-sample-period=El periodo de ejemplo (en minutos) a usar para contadores de mensajes.
hornetq-server.message-counter-max-day-history=\u00BFPor cu\u00E1ntos d\u00EDas mantener la historia del contador de mensajes? 
hornetq-server.connection-ttl-override=Si se establece, sobrescribir\u00E1 el tiempo (en minutos) para mantener una conexi\u00F3n viva sin recibir un ping.
hornetq-server.async-connection-execution-enabled=Si los paquetes entrantes en el servidor deben ser entregados a un hilo desde el pool de hilos para procesamiento. Falso si debe ser entregado en el hilo remoto.
hornetq-server.transaction-timeout=El tiempo (en minutos) antes de que una transacci\u00F3n pueda retirarse del administrador de recursos despu\u00E9s de create time.
hornetq-server.transaction-timeout-scan-period=Frecuencia (en minutos) para escanear  transacciones que han expirado.
hornetq-server.message-expiry-scan-period=Frecuencia (en minutos) para escanear mensajes que han expirado.
hornetq-server.message-expiry-thread-priority=La prioridad del hilo de mensajes de expiraci\u00F3n.
hornetq-server.id-cache-size=El tama\u00F1o de cache para pre-crear los ID de mensajes
hornetq-server.persist-id-cache=Si los ID son persistentes para el diario
hornetq-server.remoting-interceptors=La lista de clases de interceptores utilizados por el servidor.
hornetq-server.backup=Si este servidor es un servidor de respaldo.
hornetq-server.allow-failback=Si este servidor se apagar\u00E1 autom\u00E1ticamente si  se vuelve a subir el servidor vivo original.
hornetq-server.failback-delay=El tiempo de espera antes de que ocurra la recuperaci\u00F3n en el reinicio del servidor vivo.  
hornetq-server.failover-on-shutdown=Si este servidor de respaldo (si es un servidor de respaldo) debe activarse en un apagado normal de servidor.
hornetq-server.shared-store=Si este servidor est\u00E1 utilizando un almacenamiento compartido para recuperaci\u00F3n.
hornetq-server.persist-delivery-count-before-delivery=SI el contador de entregas es persistente antes de la entrega. Falso significa que esto solamente ocurre despu\u00E9s de que se haya cancelado un mensaje.
hornetq-server.live-connector-ref=El nombre del conector utilizado para el conector vivo. Si este servidor no es una copia de respaldo que utiliza  no HA compartido, es el valor 'indefinido'. 
hornetq-server.create-bindings-dir=Si el servidor debe crear el directorio de enlaces en el inicio.  
hornetq-server.create-journal-dir=Si el servidor debe crear el directorio del diario en el inicio.
hornetq-server.journal-type=El tipo diario a utilizar.
hornetq-server.journal-buffer-timeout=El tiempo de expiraci\u00F3n (en nano'segundos) utilizado para vaciar buffers internos en el diario. 
hornetq-server.journal-buffer-size=Tama\u00F1o del buffer interno en el diario.
hornetq-server.journal-sync-transactional=Si se debe esperar a que los datos de transacci\u00F3n se sincronicen con el diario antes de devolver una respuesta al cliente. 
hornetq-server.journal-sync-non-transactional=Si se debe esperar  a que ning\u00FAn dato de transacci\u00F3n se sincronice con el diario antes de devolver una respuesta al cliente. 
hornetq-server.log-journal-write-rate=Si peri\u00F3dicamente se deben registrar la taza de escritura del diario y la taza de vaciado.
hornetq-server.journal-file-size=El tama\u00F1o (en bytes) de cada archivo de diario.
hornetq-server.journal-min-files=El n\u00FAmero de archivos de diario a pre-crear
hornetq-server.journal-compact-percentage=El porcentaje de datos vivos en los cuales consideramos compactar el diario.
hornetq-server.journal-compact-min-files=El n\u00FAmero de archivos de datos de diario antes de poder  empezar a compactar.
hornetq-server.journal-max-io=El n\u00FAmero m\u00E1ximo de solicitudes de escritura que pueden estar en cola AIO en cualquier momento.
hornetq-server.perf-blast-pages=TODO
hornetq-server.run-sync-speed-test=Si debe realizar al inicio una prueba de diagn\u00F3stico sobre qu\u00E9 tan r\u00E1pido puede sincronizarse su disco. Es \u00FAtil para determinar problemas de rendimiento.
hornetq-server.server-dump-interval=La frecuencia de vaciado de informaci\u00F3n del tiempo de ejecuci\u00F3n b\u00E1sico al registro del servidor . Un valor inferior a 1 desactiva esta funcionalidad. 
hornetq-server.memory-warning-threshold=Porcentaje de memoria disponible que si se excede,  da lugar a un registro de advertencia. 
hornetq-server.memory-measure-interval=La frecuencia para muestra de memoria JVM en ms (o -1 para desactivar el muestreo de memoria) 
hornetq-server.started=Si se inicia este servidor.
hornetq-server.version=La versi\u00F3n del servidor.
match=Expresi\u00F3n coincidi\u00F3 con una direcci\u00F3n de cola. 
hornetq-server.get-connectors-as-json=Retorna los conectores configurados para este servidor mediante serializaci\u00F3n de JSON.
hornetq-server.get-connectors-as-json.reply=Una cadena en formato JSON.
hornetq-server.enable-message-counters=Habilita contadores de mensajes.
hornetq-server.disable-message-counters=Inhabilita contadores de mensajes.
hornetq-server.reset-all-message-counters=Restablece todos los contadores de mensajes.
hornetq-server.reset-all-message-counter-histories=Restablece la historia de loa contadores de mensajes.
hornetq-server.list-prepared-transactions=Lista todas las transacciones preparadas, clasificadas por fecha, la menos reciente al comienzo. 
hornetq-server.list-prepared-transactions.reply=Una lista de todas las cadenas. Las cadenas son representaci\u00F3n de base-64 de la transacci\u00F3n XID y se pueden utilizar para guardar o  cambiar las transacciones de forma heur\u00EDstica. 
hornetq-server.list-prepared-transaction-details-as-json=Lista todas las transacciones preparadas, clasificadas por fecha, la menos reciente primero, con informaci\u00F3n, en formato JSON. 
hornetq-server.list-prepared-transaction-details-as-json.reply=La cadena devuelta es una cadena JSON que contiene una serie de detalles de la transacci\u00F3n.
