messaging=Le sous-syst\u00E8me de messagerie.
messaging.add=Op\u00E9ration qui ajoute le sous-syst\u00E8me de messagerie
messaging.remove=Op\u00E9ration qui supprime le sous-syst\u00E8me de messagerie
messaging.hornetq-server=Les serveurs HornetQ fournis par le sous-syst\u00E8me de messagerie
hornetq-server=Une instance de serveur HornetQ.
hornetq-server.add=Op\u00E9ration d'ajout d'un serveur HornetQ.
hornetq-server.remove=Op\u00E9ration de suppression d'un serveur HornetQ.
hornetq-server.name=Non utilis\u00E9.
hornetq-server.clustered=Si le serveur est clusteris\u00E9.
hornetq-server.persistence-enabled=Si le serveur va utiliser le journal bas\u00E9 fichier pour la persistance.
hornetq-server.scheduled-thread-pool-max-size=Le nombre de threads contenus dans le pool de threads programm\u00E9.
hornetq-server.thread-pool-max-size=Le nombre de threads contenus dans un pool. -1 signifie \u00ABaucune limite\u00BB.
hornetq-server.security-domain=Le domaine de s\u00E9curit\u00E9 \u00E0 utiliser pour v\u00E9rifier les informations utilisateur et r\u00F4le.
hornetq-server.security-enabled=Si la s\u00E9curit\u00E9 est activ\u00E9e.
hornetq-server.security-invalidation-interval=La dur\u00E9e (en ms) d'attente avant d'invalider le cache de s\u00E9curit\u00E9.
hornetq-server.wild-card-routing-enabled=Si le serveur prend en charge \u00ABwild card routing\u00BB.
hornetq-server.management-address=Adresse \u00E0 laquelle envoyer les messages de gestion.
hornetq-server.management-notification-address=Le nom de l'adresse li\u00E9e au consommateur pour qu'il puisse recevoir ses notifications de gestion.
hornetq-server.cluster-user=L'utilisateur utilis\u00E9 par les connexions du cluster pour communiquer entre les n\u0153uds de cluster.
hornetq-server.cluster-password=Le mot de passe utilis\u00E9 par les connexions du cluster pour communiquer entre les n\u0153uds clusteris\u00E9s.
hornetq-server.jmx-management-enabled=Si HornetQ doit exposer son API de gestion interne via JMX. Non recommand\u00E9, car l'acc\u00E8s \u00E0 ces MBeans peut occasionner un configuration inconsistante.
hornetq-server.jmx-domain=Le domaine JMX utilis\u00E9 pour enregistrer les MBeans HornetQ dans le MBeanServer.
hornetq-server.message-counter-enabled=Si les compteurs de messages peuvent \u00EAtre activ\u00E9s.
hornetq-server.message-counter-sample-period=L'\u00E9chantillon de p\u00E9riode (en ms) \u00E0 utiliser pour les compteurs de messages.
hornetq-server.message-counter-max-day-history=Nombre de jours pendant lesquels on peut conserver l'historique du nombre de messages.
hornetq-server.connection-ttl-override=Si d\u00E9fini, cela remplacera la dur\u00E9e n\u00E9cessaire (en ms) pour garder une connexion sans recevoir un ping.
hornetq-server.async-connection-execution-enabled=Si les paquets entrants sur le serveur doivent \u00EAtre pass\u00E9s \u00E0 un thread du pool de threads pour pouvoir \u00EAtre trait\u00E9s. False si ils doivent \u00EAtre pass\u00E9s au thread distant.
hornetq-server.transaction-timeout=La dur\u00E9e (en ms) avant qu'une transaction puisse \u00EAtre retir\u00E9e du gestionnaire de ressources apr\u00E8s la cr\u00E9ation.
hornetq-server.transaction-timeout-scan-period=Fr\u00E9quence de balayage des transaction de timeout (en ms).
hornetq-server.message-expiry-scan-period=Fr\u00E9quence de balayage des messages expir\u00E9s (en ms).
hornetq-server.message-expiry-thread-priority=La priorit\u00E9 des messages expirants du thread.
hornetq-server.id-cache-size=La taille du cache pour pr\u00E9-cr\u00E9er des ID de messages.
hornetq-server.persist-id-cache=Si les ID sont persist\u00E9s dans le journal.
hornetq-server.remoting-interceptors=La liste des classes d'intercepteurs utilis\u00E9s par ce serveur.
hornetq-server.backup=Si ce serveur est un serveur de sauvegarde.
hornetq-server.allow-failback=Si le serveur doit automatiquement s'arr\u00EAter quand le serveur live revient.
hornetq-server.failback-delay=Dur\u00E9e d'attente avant la restauration automatique au red\u00E9marrage du serveur live.
hornetq-server.failover-on-shutdown=Si ce serveur de sauvegarde (s'il s'agit bien d'un serveur de sauvegarde) doit appara\u00EEtre en live au moment de la fermeture d'un serveur normal.
hornetq-server.shared-store=Si ce serveur utilise un store partag\u00E9 en cas de basculement.
hornetq-server.persist-delivery-count-before-delivery=Si le nombre de livraisons est persist\u00E9 avant que la livraison n'ait eu lieu. False signifie que cela n'aura lieu qu'une fois qu'un message aura \u00E9t\u00E9 annul\u00E9.
hornetq-server.live-connector-ref=Le nom du connecteur utilis\u00E9 pour se connecter au connecteur live. Si ce serveur est pas utilis\u00E9 pour une sauvegarde qui utilise \u00ABshared nothing HA\u00BB, sa valeur sera "undefined" (non d\u00E9fini).
hornetq-server.create-bindings-dir=Si le serveur doit cr\u00E9er le r\u00E9pertoire des liaisons au d\u00E9marrage.
hornetq-server.create-journal-dir=Si le serveur doit cr\u00E9er le r\u00E9pertoire du journal au d\u00E9marrage.
hornetq-server.journal-type=Le type de journal \u00E0 utiliser.
hornetq-server.journal-buffer-timeout=Le timeout (en nanosecondes) utilis\u00E9 pour vider les tampons internes dans le journal.
hornetq-server.journal-buffer-size=La taille du tampon interne dans le journal.
hornetq-server.journal-sync-transactional=Si on doit attendre que les donn\u00E9es de transaction soient synchronis\u00E9es dans le journal avant de renvoyer une r\u00E9ponse au client.
hornetq-server.journal-sync-non-transactional=Si on doit attendre que les donn\u00E9es de non transaction soient synchronis\u00E9es dans le journal avant de renvoyer une r\u00E9ponse au client.
hornetq-server.log-journal-write-rate=Si on doit journaliser p\u00E9riodiquement le taux d'\u00E9criture et le taux de vidage du journal.
hornetq-server.journal-file-size=La taille (en octets) de chaque fichier de journal.
hornetq-server.journal-min-files=Combien de fichiers de journaux faut-il pr\u00E9-cr\u00E9er ?
hornetq-server.journal-compact-percentage=Le pourcentage de donn\u00E9es live sur lesquels on estime pouvoir compacter le journal.
hornetq-server.journal-compact-min-files=Le nombre minimum de fichiers de donn\u00E9es de journaux avant de commencer \u00E0 compacter.
hornetq-server.journal-max-io=Le nombre maximum de demandes d'\u00E9critures qui peuvent exister dans la file d'attente AIO \u00E0 un moment donn\u00E9.
hornetq-server.perf-blast-pages=TODO
hornetq-server.run-sync-speed-test=si au d\u00E9marrage, on doit effectuer un test de diagnostic sur la vitesse de sync de votre disque. Utile quand on d\u00E9termine les probl\u00E8mes de performance.
hornetq-server.server-dump-interval=Fr\u00E9quence de vidage des informations de temps d'ex\u00E9cution de base dans le journal du serveur. La fonctionnalit\u00E9 est consid\u00E9r\u00E9e d\u00E9sactiv\u00E9e lorsque la valeur est inf\u00E9rieure \u00E0 1.
hornetq-server.memory-warning-threshold=Pourcentage de m\u00E9moire disponible qui, si elle est d\u00E9pass\u00E9e, se traduira par la journalisation d'un avertissement.
hornetq-server.memory-measure-interval=Fr\u00E9quence pour \u00E9chantillonner la m\u00E9moire JVM en ms (ou -1 pour d\u00E9sactiver l'\u00E9chantillonnage m\u00E9moire)
hornetq-server.started=Si ce serveur a d\u00E9marr\u00E9.
hornetq-server.version=La version du serveur.
match=Expression correspondant \u00E0 une adresse de file d'attente.
hornetq-server.get-connectors-as-json=Retourne les connecteurs configur\u00E9s pour ce serveur avec la s\u00E9rialisation JSON.
hornetq-server.get-connectors-as-json.reply=Une cha\u00EEne dans le format JSON.
hornetq-server.enable-message-counters=Activer les compteurs de messages.
hornetq-server.disable-message-counters=D\u00E9sactiver les compteurs de messages.
hornetq-server.reset-all-message-counters=R\u00E9initialiser tous les compteurs de messages.
hornetq-server.reset-all-message-counter-histories=R\u00E9initialiser l'historique de tous les compteurs de messages.
hornetq-server.list-prepared-transactions=Liste toutes les transactions pr\u00E9par\u00E9es, class\u00E9es par date, avec la plus ancienne pour commencer.
hornetq-server.list-prepared-transactions.reply=Une liste de cha\u00EEnes de caract\u00E8res. Les Strings sont en repr\u00E9sentation Base-64 du XID de transaction et peuvent \u00EAtre utilis\u00E9s pour valider de mani\u00E8re heuristique ou pour restaurer les transactions.
hornetq-server.list-prepared-transaction-details-as-json=Liste toutes les transactions pr\u00E9par\u00E9es, class\u00E9es par date, avec la plus ancienne pour commencer, et les informations, en format JSON. 
hornetq-server.list-prepared-transaction-details-as-json.reply=Le String renvoy\u00E9 est une cha\u00EEne JSON qui contient un tableau de d\u00E9tails de transactions.
hornetq-server.list-prepared-transaction-details-as-html=Liste toutes les transactions pr\u00E9par\u00E9es, class\u00E9es par date, avec la plus ancienne pour commencer, et les informations, en format HTML. 
hornetq-server.list-prepared-transaction-details-as-html.reply=Le String renvoy\u00E9 est une cha\u00EEne HTML qui contient un tableau de d\u00E9tails de transactions.
hornetq-server.list-heuristic-committed-transactions=Liste les transactions qui ont \u00E9t\u00E9 valid\u00E9es de fa\u00E7on heuristique.
hornetq-server.list-heuristic-committed-transactions.reply=Une liste de cha\u00EEnes de caract\u00E8res. Les Strings sont en repr\u00E9sentation Base-64 du XID de transaction.
hornetq-server.list-heuristic-rolled-back-transactions=Liste les transactions qui ont \u00E9t\u00E9 restaur\u00E9es de mani\u00E8re heuristique.
hornetq-server.list-heuristic-rolled-back-transactions.reply=Une liste de cha\u00EEnes de caract\u00E8res. Les Strings sont en repr\u00E9sentation Base-64 du XID de transaction.
hornetq-server.commit-prepared-transaction=Valide une transaction pr\u00E9par\u00E9e de mani\u00E8re heuristique.
hornetq-server.commit-prepared-transaction.transaction-as-base-64=La repr\u00E9sentation Base64 d'un XID de transaction.
hornetq-server.commit-prepared-transaction.reply=True si la transaction a \u00E9t\u00E9 valid\u00E9e avec succ\u00E8s, sinon false.
hornetq-server.rollback-prepared-transaction=Restaure une transaction pr\u00E9par\u00E9e de mani\u00E8re heuristique.
hornetq-server.rollback-prepared-transaction.transaction-as-base-64=La repr\u00E9sentation Base64 d'un XID de transaction.
hornetq-server.rollback-prepared-transaction.reply=True si la transaction a \u00E9t\u00E9 restaur\u00E9e avec succ\u00E8s, sinon false.
hornetq-server.list-remote-addresses=Liste les adresses de tous les clients qui sont connect\u00E9s \u00E0 l'adresse donn\u00E9e. Si un argument d'adresse ip est donn\u00E9, seuls les clients sont les cha\u00EEnes d'adresses distantes incluent la cha\u00EEne d'adresse ip seront retourn\u00E9s.
hornetq-server.list-remote-addresses.ip-address=Une adresse IP dans un format de cha\u00EEne.
hornetq-server.list-remote-addresses.reply=Une liste de cha\u00EEnes qui repr\u00E9sentent des adresses de clients distants.
hornetq-server.close-connections-for-address=Choisissez toutes les connexions des clients qui sont connect\u00E9s \u00E0 ce serveur, et dont l'adresse contient l'adresse IP indiqu\u00E9e.
hornetq-server.close-connections-for-address.ip-address=Une adresse IP sous format de cha\u00EEne.
hornetq-server.close-connections-for-address.reply=True si une connexion \u00E9tait ferm\u00E9e, sinon false.
hornetq-server.list-connection-ids=Liste les ID de toutes les connexions li\u00E9es \u00E0 ce serveur.
hornetq-server.list-connection-ids.reply=Une liste de cha\u00EEnes qui repr\u00E9sentent chacune un ID de connexion.
hornetq-server.list-producers-info-as-json=Pour toutes les sessions, liste les informations sur les producteurs de messages qui utilisent la s\u00E9rialisation JSON.
hornetq-server.list-producers-info-as-json.reply=Le String renvoy\u00E9 est une cha\u00EEne JSON qui contient un tableau d'informations sur le producteur.
hornetq-server.list-sessions=Liste tous les ID de session de l'ID de connexion indiqu\u00E9.
hornetq-server.list-sessions.connection-id=L'id de connexion.
hornetq-server.list-sessions.reply=Une liste de cha\u00EEnes qui repr\u00E9sentent chacune un ID de session.
hornetq-server.get-roles=Obtenez les r\u00F4les de s\u00E9curit\u00E9 pour faire correspondre un adresse particuli\u00E8re.
hornetq-server.get-roles.address-match=Une adresse correspondante.
hornetq-server.get-roles.reply=Une liste, avec chaque \u00E9l\u00E9ment correspondant \u00E0 un ensemble de propri\u00E9t\u00E9s qui d\u00E9crivent un r\u00F4le de s\u00E9curit\u00E9.
hornetq-server.get-roles-as-json=Obtenez les r\u00F4les ( sous forme de cha\u00EEne JSON) pour faire correspondre une adresse particuli\u00E8re.
hornetq-server.get-roles-as-json.address-match=Une adresse correspondante.
hornetq-server.get-roles-as-json.reply=Le String renvoy\u00E9 est une cha\u00EEne JSON qui contient un tableau d'informations sur le r\u00F4le de s\u00E9curit\u00E9.
hornetq-server.get-address-settings-as-json=Renvoie les param\u00E8tres de configuration de l'adresse sous forme de cha\u00EEne JSON pour faire correspondre une adresse particuli\u00E8re.
hornetq-server.get-address-settings-as-json.address-match=Une adresse correspondante.
hornetq-server.get-address-settings-as-json.reply=Le String renvoy\u00E9 est une cha\u00EEne JSON qui contient un tableau d'informations de configuration d'adresse.
hornetq-server.force-failover=Force le serveur de la messagerie de stopper et de notifier les clients en cas de basculement.
jms-server.list-connections-as-json=Liste toutes les connexions JMS.
jms-server.list-connections-as-json.reply=Le String renvoy\u00E9 est une cha\u00EEne JSON qui contient un tableau d'objets JMSConnectionInfo.
jms-server.list-consumers-as-json=Liste tous les consommateurs qui appartiennent \u00E0 la Connexion JMS indiqu\u00E9e par l'id de connexion.
jms-server.list-consumers-as-json.connection-id=L'id de connexion.
jms-server.list-consumers-as-json.reply=Le String renvoy\u00E9 est une cha\u00EEne JSON qui contient un tableau d'objets JMSConsumerInfo.
jms-server.list-all-consumers-as-json=Liste tous les consommateurs.
jms-server.list-all-consumers-as-json.reply=Le String renvoy\u00E9 est une cha\u00EEne JSON qui contient un tableau d'objets JMSConsumerInfo.
jms-server.list-target-destinations=Liste toutes les adresses auxquelles la session d\u00E9sign\u00E9e a envoy\u00E9 des messages.
jms-server.list-target-destinations.session-id=L'id de session.
jms-server.list-target-destinations.reply=Le String renvoy\u00E9 est une cha\u00EEne JSON qui contient un tableau de noms d'adresses.
jms-server.get-last-sent-message-id=Renvoie l'ID du dernier message qui a \u00E9t\u00E9 envoy\u00E9 d'une session donn\u00E9e \u00E0 l'adresse donn\u00E9e.
jms-server.get-last-sent-message-id.session-id=L'id de la session.
jms-server.get-last-sent-message-id.reply=L'id du message.
jms-server.get-session-creation-time=Obtenez l'heure de cr\u00E9ation de la session.
jms-server.get-session-creation-time.session-id=L'id de la session.
jms-server.get-session-creation-time.reply=L'heure de cr\u00E9ation, repr\u00E9sent\u00E9e sous forme d'une cha\u00EEne qui montre le nombre de millisecondes depuis l'\u00E9poque.
jms-server.list-sessions-as-json=Liste toutes les ID de sessions de l'ID de connexion sp\u00E9cifi\u00E9e.
jms-server.list-sessions-as-json.connection-id=L'id de connexion.
jms-server.list-sessions-as-json.reply=Le String renvoy\u00E9 est une cha\u00EEne JSON qui contient un tableau d'ids de session.
jms-server.list-prepared-transaction-jms-details-as-json=Liste toutes les transactions pr\u00E9par\u00E9es, class\u00E9es par date, avec la plus ancienne pour commencer, et les informations en format JMS, en format JSON.
jms-server.list-prepared-transaction-jms-details-as-json.reply=Le String renvoy\u00E9 est une cha\u00EEne JSON qui contient un tableau de d\u00E9tails de transactions.
jms-server.list-prepared-transaction-jms-details-as-html=Liste toutes les transactions pr\u00E9par\u00E9es, class\u00E9es par date, avec la plus ancienne pour commencer, et les informations en JMS, en format HTML. 
jms-server.list-prepared-transaction-jms-details-as-html.reply=Le String renvoy\u00E9 est une cha\u00EEne HTML qui contient un tableau de d\u00E9tails de transactions.
path=Un chemin de syst\u00E8me de fichiers qui pointe vers l'une des locations o\u00F9 HornetQ stocke des donn\u00E9es persistantes.
path.add=Ajoute un chemin de syst\u00E8me de fichiers.
path.remove=Supprime un chemin d'acc\u00E8s.
path.path=Le chemin d'acc\u00E8s de syst\u00E8me de fichiers r\u00E9els. Consid\u00E9r\u00E9 comme un chemin d'acc\u00E8s absolu, \u00E0 moins que l'attribut \u00ABrelative-to\u00BB ne soit sp\u00E9cifi\u00E9, auquel cas la valeur sera trait\u00E9e comme \u00E9tant relative \u00E0 ce chemin. <p>Si trait\u00E9 comme un chemin d'acc\u00E8s complet, le v\u00E9ritable chemin d'acc\u00E8s de runtime sp\u00E9cifi\u00E9 par la valeur de cet attribut sera d\u00E9termin\u00E9 comme suit \: </p>si cette valeur est d\u00E9j\u00E0 absolue, alors la valeur sera directement utilis\u00E9e. Sinon le chemin d'acc\u00E8s runtime sera r\u00E9solu d'une mani\u00E8re d\u00E9pendante du syst\u00E8me. Sur les syst\u00E8mes UNIX, un chemin d'acc\u00E8s relatif est irr\u00E9vocable si on le r\u00E9sout sur le r\u00E9pertoire utilisateur actuel. Sur les syst\u00E8mes Microsoft Windows, un chemin d'acc\u00E8s relatif sera rendu irr\u00E9vocable si on le r\u00E9sout sur le r\u00E9pertoire courant du lecteur nomm\u00E9 par le chemin d'acc\u00E8s, le cas \u00E9ch\u00E9ant ; si ce n'est pas le cas, sur le r\u00E9pertoire utilisateur actuel.
path.relative-to=Le nom d'un autre nom de chemin d'acc\u00E8s, ou de l'un des chemins d'acc\u00E8s standards fournis par le syst\u00E8me. Si \u00ABrelative-to\u00BB est fourni, la valeur de l'attribut \u00AB path \u00BB (chemin) est consid\u00E9r\u00E9e comme relative au chemin sp\u00E9cifi\u00E9 par cet attribut. Les chemins d'acc\u00E8s standards fournis par le syst\u00E8me comprennent \: <ul><li>jboss.home - le r\u00E9pertoire racine de la distribution de JBoss AS</li><li>user.home - r\u00E9pertoire d'acceuil de l'utilisateur</li><li> user.dir - r\u00E9pertoire de travail actuel de l'utilisateur</li><li>java.home - r\u00E9pertoire d'installation de java</li><li>jboss.server.base.dir - exemple de r\u00E9pertoire racine d'un serveur individuel</li><li>jboss.server.data.dir - r\u00E9pertoire utilis\u00E9 par le serveur pour le stockage de fichiers de donn\u00E9es persistantes</li><li>jboss.server.log.dir - le r\u00E9pertoire utilis\u00E9 par le serveur pour le stockage de fichiers log</li><li>jboss.server.tmp.dir - le r\u00E9pertoire utilis\u00E9 par le serveur pour le stockage de fichiers temporaires</li><li>jboss.domain.servers.dir - r\u00E9pertoire sous lequel un contr\u00F4leur h\u00F4te va cr\u00E9er la zone de travail pour chaque instance de serveur</li></ul>
bindings-directory.path=Le r\u00E9pertoire dans lequel le journal des liaisons se trouve. La valeur par d\u00E9faut est ${jboss.server.data.dir}/messaging/bindings.
journal-directory.path=Le r\u00E9pertoire dans lequel le journal des messages se trouve. La valeur par d\u00E9faut est ${jboss.server.data.dir}/messaging/journal.
large-messages-directory.path=Le r\u00E9pertoire dans lequel le journal des messages volumineux se trouve. La valeur par d\u00E9faut est ${jboss.server.data.dir}/messaging/largemessages.
paging-directory.path=Le r\u00E9pertoire dans lequel des fichiers d'\u00E9change (pagination) se trouvent. La valeur par d\u00E9faut est ${jboss.server.data.dir}/messaging/paging.
grouping-handler=Prend des d\u00E9cisions sur quel n\u0153ud du cluster doit g\u00E9rer un message qui poss\u00E8de un id de groupe.
grouping-handler.add=L'op\u00E9ration qui rajoute le handler de groupage. Un handler de groupage uniquement est autoris\u00E9.
grouping-handler.remove=Op\u00E9ration de suppression du handler de groupage.
grouping-handler.type=Si le handler est l'unique handler "Local" du cluster, qui prend des d\u00E9cisions de manipulation, ou un handler "Remote" qui converse avec le handler local.
grouping-handler.grouping-handler-address=Une r\u00E9f\u00E9rence \u00E0 une connexion de clsuter et \u00E0 l'adresse qu'il utilise.
grouping-handler.timeout=Dur\u00E9e \u00E0 attendre pour qu'une d\u00E9cision soit prise; une exception sera envoy\u00E9e au moment de l'envoi si ce timeout a \u00E9t\u00E9 atteint, pour veiller \u00E0 ce qu'un ordonnancement strict soit conserv\u00E9.
in-vm-acceptor=D\u00E9finit la fa\u00E7on dont les connexions in-VM peuvent \u00EAtre effectu\u00E9es vers le serveur HornetQ.
remote-acceptor=D\u00E9finit la fa\u00E7on dont les connexions \u00E0 distance peuvent op\u00E9rer vers le serveur HornetQ.
acceptor=Un accepteur d\u00E9finit la fa\u00E7on dont les connexions peuvent \u00EAtre effectu\u00E9es vers le serveur HornetQ.
acceptor.remote=Un acceptateur \u00E0 distance
acceptor.in-vm=Un acceptateur IN-VM
acceptor.add=Op\u00E9ration de rajout d'acceptateur
acceptor.add.params=Un ensemble de paires de key-value comprises par la classe de fabrique (factory-class) de l'acceptateur et utilis\u00E9 pour la configurer.
acceptor.remove=Op\u00E9ration de rajout d'acceptateur
acceptor.started=Si cet acceptateur a d\u00E9marr\u00E9.
acceptor.start=D\u00E9marrage de l'acceptateur.
acceptor.stop=Arr\u00EAt de l'acceptateur.
acceptor.param=Une paire key-value comprise par la classe de fabrique (factory-class) de l'acceptateur et utilis\u00E9 pour la configurer.
address-setting=Une configuration d'adresse d\u00E9finit certains attributs qui sont d\u00E9finis par rapport \u00E0 une 
address-setting.add=Op\u00E9ration ajoutant un param\u00E8tre de d\u00E9finition d'adresse
address-setting.remove=Op\u00E9ration qui supprime un param\u00E8tre de d\u00E9finition d'adresse
address-setting.address-full-policy=D\u00E9termine ce qui arrive quand une adresse dont la taille-ma-octets est indiqu\u00E9e, est presque remplie. (PAGE, DROP ou BLOCK)
address-setting.dead-letter-address=L'adresse des messages morts
address-setting.last-value-queue=D\u00E9finit si une file d'attente utilise uniquement les derni\u00E8res valeurs ou non
address-setting.max-delivery-attempts=D\u00E9finit combien de fois on peut renvoyer un message annul\u00E9 avant de l'envoyer \u00E0 l'adresse des messages mortes.
address-setting.max-size-bytes=La taille d'octets maximum.
address-setting.message-counter-history-day-limit=Limite de jours pour l'historique du compteur de messages.
address-setting.expiry-address=D\u00E9finit o\u00F9 envoyer un message qui a expir\u00E9.
address-setting.redelivery-delay=D\u00E9finit la dur\u00E9e d'attente avant d'essayer \u00E0 nouveau de d\u00E9livrer un message qui a \u00E9t\u00E9 annul\u00E9.
address-setting.redistribution-delay=D\u00E9finit la dur\u00E9e d'attente entre le moment de la fermeture du dernier consommateur d'une file d'attente et la redistribution d'un message.
address-setting.page-size-bytes=La taille de pagination.
address-setting.page-max-cache-size=Le nombre de fichiers de pagination \u00E0 garder en m\u00E9moire pour optimiser les IO au cours de la navigation de pagination.
address-setting.send-to-dla-on-no-route=Si ce param\u00E8tre est d\u00E9fini sur true pour cette adresse, et si le message n'est pas dirig\u00E9 vers une file d'attente, il sera alors envoy\u00E9 \u00E0 la DKA (Dead Letter Address / Bo\u00EEte aux lettres mortes), si elle existe.
connector=Un connecteur peut \u00EAtre utilis\u00E9e par un client pour d\u00E9finir comment se connecter \u00E0 un serveur.
remote-connector=Utils\u00E9 par un client distant pour d\u00E9finir comment se connecter \u00E0 un serveur.
in-vm-connector=Utilis\u00E9 par un client in-VM pour d\u00E9finir comment se connecter \u00E0 un serveur.
connector.add=Op\u00E9ration d'ajout d'un connecteur
connector.add.params=Un ensemble de paires key-value comprises par la classe de fabrique (factory-class) du connecteur et utilis\u00E9 pour sa configuration.
connector.remove=Op\u00E9ration du suppression d'un connecteur
connector.param=Une paire key-value comprise par la classe de fabrique (factory-class) du connecteur et utilis\u00E9e pour la configurer.
core-address=Une ressource de runtime uniquement qui repr\u00E9sente une adresse HornetQ. On peut relier une adresse unique \u00E0 0 ou plusieurs files d'attente. Quand un message est rout\u00E9, ils est rout\u00E9 vers les files d'attente li\u00E9es \u00E0 l'adresse du message.
core-address.roles=Une liste de r\u00F4les de s\u00E9curit\u00E9 (nom et permissions) associ\u00E9s \u00E0 l'adresse.
core-address.role.name=Le nom du r\u00F4le de s\u00E9curit\u00E9.
core-address.role.send=Si le r\u00F4le a la permission d'envoyer \u00E0 l'adresse.
core-address.role.consume=Si le r\u00F4le a la permission de consommer \u00E0 partir de cette adresse.
core-address.role.createDurableQueue=Si le r\u00F4le a la permission de cr\u00E9er une file d'attente durable.
core-address.role.deleteDurableQueue=Si le r\u00F4le a la permission de supprimer une file d'attente durable.
core-address.role.createNonDurableQueue=Si le r\u00F4le a la permission de cr\u00E9er une file d'attente non durable.
core-address.role.deleteNonDurableQueue=Si le r\u00F4le a la permission de supprimer une file d'attente non durable.
core-address.role.manage=Si le r\u00F4le a la permission de g\u00E9rer l'adresse.
core-address.queue-names=Les noms des files d'attente associ\u00E9es \u00E0 l'adresse.
core-address.number-of-bytes-per-page=Le nombre d'octets utilis\u00E9s par chaque page pour cette adresse.
core-address.number-of-pages=Le nombre de pages utilis\u00E9es par cette adresse.
core-address.binding-names=Les noms de toutes les liaisons (files d'attente et d\u00E9tournements) li\u00E9es \u00E0 cette adresse.
core-address.get-roles-as-json=Renvoie les r\u00F4les (nom et permissions) associ\u00E9s \u00E0 cette adresse et utilisant la s\u00E9rialisation JSON.
core-address.get-roles-as-json.reply=Une cha\u00EEne dans le format JSON.
queue=Une file d'attente.
queue.add=Op\u00E9ration d'ajout de file d'attente principale.
queue.remove=Op\u00E9ration de suppression de file d'attente existante.
queue.name=Le nom unique de la file d'attente.
queue.queue-address=L'adresse de la file d'attente d\u00E9finit l'adresse qui est utilis\u00E9e pour diriger les messages.
queue.filter=Une d\u00E9finition de filtre de message de file d'attente. Une filtre vide ou non d\u00E9fini pourra correspondre \u00E0 tous les messages.
queue.durable=D\u00E9finit si la file d'attente est durable.
queue.id=L'id de la file d'attente.
queue.paused=Si la file d'attente est en mode pause.
queue.temporary=Si la file d'attente est temporaire.
queue.message-count=Le nombre de messages actuellement dans cette file d'attente.
queue.scheduled-count=Le nombre de messages programm\u00E9s dans cette file d'attente.
queue.consumer-count=Le nombre de consommateurs qui consomment les messages de cette file d'attente.
queue.delivering-count=Le nombre de messages que cette file d'attente d\u00E9livre actuellement \u00E0 ses consommateurs.
queue.messages-added=Le nombre de messages qui ont \u00E9t\u00E9 ajout\u00E9s \u00E0 cette file d'attente depuis sa cr\u00E9ation.
queue.list-scheduled-messages=La liste des messages programm\u00E9s pour la distribution.
queue.list-scheduled-messages.reply=Liste dont chaque \u00E9l\u00E9ment correspond \u00E0 une mappe de propri\u00E9t\u00E9s de messages par rapport \u00E0 leur valeur.
queue.list-scheduled-messages-as-json=Liste tous les messages programm\u00E9s pour la distribution sous forme de cha\u00EEne dans le format JSON.
queue.list-scheduled-messages-as-json.reply=Une cha\u00EEne dans le format JSON qui repr\u00E9sente une liste o\u00F9 chaque \u00E9l\u00E9ment est une mappe de propri\u00E9t\u00E9s de message correspondant \u00E0 leur valeur.
queue.message.messageID=L'id du message.
queue.message.userID=userID - il s'agit d'un UUID optinnel sp\u00E9cifi\u00E9 par l'utilisateur pouvant \u00EAtre d\u00E9fini pour identifier le message.
queue.message.address=L'adresse de destination de ce message.
queue.message.type=Tmessage type. 0 \= Default; 2 \= Object; 3 \= Text; 4 \= Bytes; 5 \= Map; 6 \= Stream
queue.message.durable=Si le message est durable ou non.
queue.message.expiration=La dur\u00E9e d'expiration de ce message.
queue.message.timestamp=L'horodatage du message. L'horodatage correspond \u00E0 l'heure \u00E0 laquelle ce message a \u00E9t\u00E9 trait\u00E9 par un serveur HornetQ.
queue.message.priority=La priorit\u00E9 du message. Les valeurs sont comprises entre 0 (priorit\u00E9 moindre) \u00E0 9 (haute priorit\u00E9).
queue.list-messages=Liste tous les messages de la file d'attente qui correspondent au filtre.
queue.list-messages.reply=Liste dont chaque \u00E9l\u00E9ment correspond \u00E0 une mappe de propri\u00E9t\u00E9s de messages par rapport \u00E0 leur valeur.
queue.list-messages-as-json=Lister tous les messages de la file d'attente qui correspondent au filtre et les renvoyer sous forme de cha\u00EEne dans le format JSON.
queue.count-messages=Renvoie le nombre de messages de la file d'attente qui correspondent au filtre donn\u00E9.
queue.remove-message=Supprime le message qui correspond \u00E0 l'id de message donn\u00E9.
queue.remove-message.reply=True si le message a \u00E9t\u00E9 retir\u00E9, sinon false.
queue.message-id=Un id de message.
queue.remove-messages=Supprime les messages qui correspondent au filtre donn\u00E9 \u00E0 partir dela destination.
queue.remove-messages.reply=Le nombre de messages supprim\u00E9s.
queue.expire-message=Expire le message qui correspond au message-id donn\u00E9.
queue.expire-message.reply=True si le message a expir\u00E9, sinon false.
queue.expire-messages=Expire les messages qui correspondent au filtre donn\u00E9.
queue.expire-messages.reply=Le nombre de messages qui ont expir\u00E9.
queue.send-message-to-dead-letter-address=Envoie le message qui correspond \u00E0 l'id de message donn\u00E9 vers l'adresse Lettres Mortes (DLA) de cette file d'attente.
queue.send-message-to-dead-letter-address.reply=True si le message a \u00E9t\u00E9 envoy\u00E9 \u00E0 l'adresse Lettres Mortes (DLA), sinon false.
queue.send-messages-to-dead-letter-address=Envoie le message qui correspond au filtre donn\u00E9 vers l'adresse Lettres Mortes (DLA) de cette file d'attente.
queue.send-messages-to-dead-letter-address.reply=Le nombre de messages envoy\u00E9s.
queue.change-message-priority=Changer la priorit\u00E9 du message qui correspond \u00E0 l'id du message donn\u00E9e.
queue.change-message-priority.new-priority=La nouvelle priorit\u00E9 (entre 0 et 9).
queue.change-message-priority.reply=True si la priorit\u00E9 du message a chang\u00E9, sinon false.
queue.change-messages-priority=Changer la priorit\u00E9 des messages qui correspondent au filtre donn\u00E9.
queue.change-messages-priority.reply=Le nombre de messages modifi\u00E9s.
queue.move-message=D\u00E9placer le message qui correspond \u00E0 l'id du message donn\u00E9 vers une autre file d'attente.
queue.move-message.other-queue-name=Le nom de la file d'attente vers laquelle d\u00E9placer le message.
queue.move-message.reject-duplicates=Rejette les messages qui sont identifi\u00E9s comme \u00E9tant des messages en double.
queue.move-message.reply=True si le message a \u00E9t\u00E9 d\u00E9plac\u00E9, sinon false.
queue.move-messages=D\u00E9placer les messages correspondant au filtre donn\u00E9 sur une autre file d'attente.
queue.move-messages.reply=Le nombre de messages d\u00E9plac\u00E9s.
queue.list-message-counter=Lister les informations du compteur de messages.
queue.list-message-counter.reply=Informations du compteur de messages.
queue.list-message-counter-as-json=Liste le compteur de messages sous forme de cha\u00EEne dans le format JSON.
queue.list-message-counter-as-json.reply=Une cha\u00EEne dans le format JSON.
queue.list-message-counter-as-html=Liste le compteur de messages sous forme de cha\u00EEne dans le format HTML.
queue.list-message-counter-as-html.reply=Une cha\u00EEne dans le format HTML.
queue.list-message-counter-history=Lister l'historique du compteur de messages.
queue.list-message-counter-history.reply=Informations de l'historique du compteur de messages.
queue.list-message-counter-history-as-json=Liste l'historique du compteur de messages sous forme de cha\u00EEne dans le format JSON.
queue.list-message-counter-history-as-json.reply=Une cha\u00EEne dans le format JSON
queue.list-message-counter-history-as-html=Lister l'historique du compteur de messages.
queue.list-message-counter-history-as-html.reply=Une cha\u00EEne dans le format HTML sous forme de cha\u00EEne dans le format HTML.
queue.reset-message-counter=R\u00E9initialiser les compteurs de messages.
queue.pause=Pauser la file d'attente.
queue.resume=Reprise de la file d'attente.
queue.list-consumers=Liste tous les consommateurs existants sur la file d'attente.
queue.list-consumers.reply=Une liste, dont chaque \u00E9l\u00E9ment donne les d\u00E9tails d'un consommateur de file d'attente.
queue.list-consumers-as-json=Une cha\u00EEne dans le format JSON.
queue.list-consumers-as-json.reply=Une cha\u00EEne dans le format JSON
broadcast-group=Un groupe de diffusion repr\u00E9sente un moyen de diffusion de connecteurs sur le r\u00E9seau par un serveur.
broadcast-group.add=Ajouter un groupe de diffusion.
broadcast-group.remove=Supprimer un groupe de diffusion.
broadcast-group.local-bind-address=L'adresse de liaison locale li\u00E9e au socket du datagramme. Si vous poss\u00E9dez des interfaces de r\u00E9seau multiples sur votre serveur, vous devriez indiquer laquelle vous souhaiteriez utiliser pour les diffusions en d\u00E9finissant cet attribut. Si cet attribut n'est pas sp\u00E9cifi\u00E9, alors le socket sera reli\u00E9 \u00E0 l'adresse g\u00E9n\u00E9rique, une adresse IP choisie par le noyau.
broadcast-group.local-bind-port=Le port local li\u00E9 au socket du datagramme. Normalement, vous vous contentez d'utiliser la valeur par d\u00E9faut -1, ce qui indique qu'un port anonyme doit \u00EAtre utilis\u00E9. Ce param\u00E8tre est toujours indiqu\u00E9 en conjonction avec une adresse li\u00E9e localement.
broadcast-group.group-address=L'adresse multidiffusion vers laquelle les donn\u00E9es seront diffus\u00E9es. Il s'agit d'une adresse IP de classe D comprise entre 224.0.0.0 et 239.255.255.255 compris. L'adresse suivante 224.0.0.0 est r\u00E9serv\u00E9e et n'est pas disponible pour utilisation.
broadcast-group.group-port=Le num\u00E9ro de port UDP utilis\u00E9 pour la diffusion.
broadcast-group.broadcast-period=Dur\u00E9e d'attente entre les diffusions cons\u00E9cutives en millisecondes.
broadcast-group.connectors=Indique les noms des connecteurs qui seront diffus\u00E9s.
broadcast-group.socket-binding=La liaison de socket du groupe de diffusion.
broadcast-group.started=Si le groupe de diffusion a d\u00E9marr\u00E9.
broadcast-group.start=D\u00E9marrage du groupe de diffusion.
broadcast-group.stop=Interrompt le groupe de diffusion.
broadcast-group.get-connector-pairs-as-json=Renvoie les paires de connecteurs live-backup diffus\u00E9s par ce groupe de diffusion par la s\u00E9rialisation JSON.
discovery-group=Groupe multidiffusion \u00E0 \u00E9couter pour recevoir une diffusion d'autres serveurs qui annoncent leurs connecteurs.
discovery-group.add=Ajouter un groupe Discovery.
discovery-group.remove=Supprimer un groupe Discovery.
discovery-group.local-bind-address=L'adresse de liaison locale \u00E0 laquelle le socket du diagramme est li\u00E9.
discovery-group.group-address=Adresse IP multidiffusion du groupe sur lequel \u00E9couter.
discovery-group.group-port=Port UDP du gruope multidiffusion.
discovery-group.refresh-timeout=P\u00E9riode d'attente pour le groupe Discovery une fois qu'il a re\u00E7u la derni\u00E8re diffusion d'un serveur particulier avant de supprimer de sa liste l'entr\u00E9e de paire pour le connecteur de ce serveur.
discovery-group.initial-wait-timeout=Dur\u00E9e, en ms, d'attente pour qu'une diffusion initiale puisse nous donner un n\u0153ud au moins dans le cluster.
discovery-group.socket-binding=La liaison de socket du groupe Discovery.
bridge=La fonction d'un pont est de consommer des messages \u00E0 partir d'une file d'attente source, et de les envoyer vers une adresse cible, normalement vers un serveur HornetQ.
bridge.add=Op\u00E9ration d'ajout d'un pont.
bridge.remove=Op\u00E9ration de suppression d'un pont.
bridge.queue-name=Le nom unique de la file d'attente locale \u00E0 partir de laquelle le pont consomme.
bridge.forwarding-address=L'adresse vers laquelle le message sera envoy\u00E9 sur le serveur cible. Si aucune adresse de destination n'est pas sp\u00E9cifi\u00E9e, alors la destination d'origine du message sera conserv\u00E9e.
bridge.ha=Si ce pont doit oui ou non supporter une haute disponibilit\u00E9. True signifie qu'il va se connecter \u00E0 n'importe quel serveur disponible dans un cluster et qu'il supportera le basculement.
bridge.filter=Cha\u00EEne de filtre en option. Si indiqu\u00E9, alors seuls les messages qui correspondent \u00E0 l'expression de filtre sp\u00E9cifi\u00E9e seront transmis. La cha\u00EEne de filtre suit la syntaxe de l'expression du filtre HornetQ d\u00E9crite dans la documentation HornetQ.
bridge.transformer-class-name=Le nom d'une classe d\u00E9finie par l'utilisateur qui impl\u00E9mente l'interface org.hornetq.core.server.cluster.Transformer.
bridge.retry-interval=Dur\u00E9e en millisecondes entre les diff\u00E9rentes tentatives de reconnexion, si la connexion vers le serveur cible a \u00E9chou\u00E9.
bridge.retry-interval-multiplier=Un multiplicateur \u00E0 appliquer \u00E0 l'heure entre la derni\u00E8re tentative de calcul de l'heure et la prochaine tentative. Cela vous permet d'impl\u00E9menter un intervalle exponentiel entre les diff\u00E9rentes tentatives.
bridge.reconnect-attempts=Le nombre total de tentatives de reconnexion par le pont avant qu'il abandonne et se ferme. La valeur -1 indique un nombre illimit\u00E9 de tentatives.
bridge.failover-on-server-shutdown=Si le pont va tenter un basculement sur un serveur de sauvegarde (si sp\u00E9cifi\u00E9) lorsque le serveur cible est ferm\u00E9 proprement plut\u00F4t qu'\u00E9cras\u00E9.
bridge.use-duplicate-detection=Si le pont va automatiquement ins\u00E9rer une propri\u00E9t\u00E9 id en double dans chaque message qu'il transmet.
bridge.confirmation-window-size=La confirmation de taille de fen\u00EAtre \u00E0 utiliser pour la connexion qui sert \u00E0 transf\u00E9rer des messages vers le n\u0153ud cible.
bridge.user=Le nom d'utilisateur \u00E0 utiliser lors de la cr\u00E9ation de la connexion de pont vers le serveur distant. Si non sp\u00E9cifi\u00E9, l'utilisateur de cluster par d\u00E9faut sp\u00E9cifi\u00E9 par l'attribut de cluster-user de la ressource du sous-syst\u00E8me de la messagerie racine sera utilis\u00E9.
bridge.password=Le mot de passe \u00E0 utiliser lors de la cr\u00E9ation de la connexion de pont vers le serveur distant. S'il n'est pas sp\u00E9cifi\u00E9, le mot de passe du cluster par d\u00E9faut sp\u00E9cifi\u00E9 par l'attribut cluster-password de la ressource du sous-syst\u00E8me de la messagerie racine sera utilis\u00E9.
bridge.static-connectors=Une liste de noms de connecteurs d\u00E9finis statistiquement et utilis\u00E9s par ce pont. Doit \u00EAtre non d\u00E9finie (null) si le 'discovery-group-name' est d\u00E9fini.
bridge.discovery-group-name=Le nom du groupe Discovery utilis\u00E9 par ce pont. Doit \u00EAtre non d\u00E9fini (null) si les 'static-connectors' sont d\u00E9finis.
bridge.started=Si le pont a d\u00E9marr\u00E9.
bridge.start=D\u00E9marre le pont.
bridge.stop=Arr\u00EAte le pont.
divert=Une ressource de messagerie qui vous permet de d\u00E9tourner de fa\u00E7on transparente les messages destin\u00E9s \u00E0 une adresse vers d'autres adresses, sans aucun changement \u00E0 la logique de l'application du client.
divert.add=Op\u00E9ration d'ajout d'un d\u00E9tournement.
divert.remove=Op\u00E9ration de suppression d'un d\u00E9tournement.
divert.routing-name=Nom de routage du d\u00E9tournement.
divert.divert-address=Adresse \u00E0 partir de laquelle pr\u00E9c\u00E9der au d\u00E9tournement
divert.forwarding-address=Adresse vers laquelle d\u00E9tourner
divert.filter=Cha\u00EEne de filtre en option. Si indiqu\u00E9, alors seuls les messages qui correspondent \u00E0 l'expression de filtre sp\u00E9cifi\u00E9e seront d\u00E9tourn\u00E9s. La cha\u00EEne de filtre suit la syntaxe de l'expression du filtre HornetQ d\u00E9crite dans la documentation HornetQ.
divert.exclusive=Si le d\u00E9tournement est exclusif, c'est \u00E0 dire si le message est d\u00E9tourn\u00E9 vers la nouvelle adresse, et ne va pas \u00E0 l'ancienne adresse dutout.
divert.transformer-class-name=Le nom de la classe utilis\u00E9e pour transformer le corps de message ou ses propri\u00E9t\u00E9s savant qu'il soit d\u00E9tourn\u00E9.
cluster-connection=Regroupe les serveurs de groupes de connexions dans des clusters pour que les messages puissent \u00EAtre \u00E9quilibr\u00E9s en charge entre les n\u0153uds du cluster.
cluster-connection.add=Op\u00E9ration d'ajout d'une connexion de cluster
cluster-connection.remove=Op\u00E9ration du suppression d'une connexion de cluster
cluster-connection.cluster-connection-address=Chaque connexion de cluster ne s'applique uniquement qu'aux messages envoy\u00E9s \u00E0 une adresse qui commence par cette valeur.
cluster-connection.connector-ref=La confirmation de taille de fen\u00EAtre \u00E0 utiliser pour la connexion qui sert \u00E0 transf\u00E9rer des messages vers un n\u0153ud cible.
cluster-connection.retry-interval=Dur\u00E9e en millisecondes entre les diff\u00E9rentes tentatives de reconnexion vers un serveur cible, si la connexion vers le serveur cible a \u00E9chou\u00E9.
cluster-connection.use-duplicate-detection=Si le pont va automatiquement ins\u00E9rer une propri\u00E9t\u00E9 id en double dans chaque message qu'il transmet.
cluster-connection.forward-when-no-consumers=Si les messages vont \u00EAtre distribu\u00E9s de fa\u00E7on r\u00E9p\u00E9titive et altern\u00E9e entre les autres n\u0153uds du cluster, ind\u00E9pendamment du fait qu'ils puissent correspondre \u00E0 ou qu'ils aient des consommateurs sur les autres n\u0153uds. Si d\u00E9fini sur false (la valeur par d\u00E9faut), alors HornetQ transmettra uniquement des messages aux autres n\u0153uds du cluster si l'adresse \u00E0 laquelle ils sont transmis a des files d'attente qui ont les consommateurs, et si les consommateurs ont des filtres de message (s\u00E9lecteurs), alors au moins un de ces s\u00E9lecteurs devra correspondre au message.
cluster-connection.max-hops=Le nombre maximum de tentatives d'envoi d'un message. HornetQ peut \u00EAtre configur\u00E9 pour pouvoir \u00E9galement \u00E9quilibrer les charges de messages vers des n\u0153uds qui lui sont sans doute connect\u00E9s de fa\u00E7on indirecte avec d'autres serveurs HornetQ en tant qu'interm\u00E9diaires dans la cha\u00EEne. .
cluster-connection.confirmation-window-size=La confirmation de taille de fen\u00EAtre \u00E0 utiliser pour la connexion qui sert \u00E0 transf\u00E9rer des messages vers un n\u0153ud cible.
cluster-connection.static-connectors=Une liste de connecteurs d\u00E9finis statistiquement et vers lesquels cette connexion de cluster ira faire des connexions. Doit \u00EAtre non d\u00E9finie (null) si le 'discovery-group-name' est d\u00E9fini.
cluster-connection.allow-direct-connections-only=Le cas o\u00F9, si un n\u0153ud apprend l'existence d'un n\u0153ud qui est sup\u00E9rieur \u00E0 1 saut, nous ne pourront pas cr\u00E9er de pont pour connexion directe de cluster. Seulement applicable si les connecteurs \u00AB statiques \u00BB sont d\u00E9finis.
cluster-connection.discovery-group-name=Le groupe Discovery utilis\u00E9 pour obtenir une liste des autres serveurs du cluster vers lesquels cette connexion de cluster fera des connexions. Doit \u00EAtre non d\u00E9finie (null) si 'static-connectors' est d\u00E9fini.
cluster-connection.node-id=L'ID du n\u0153ud utilis\u00E9 par cette connexion de cluster.
cluster-connection.get-nodes=Renvoie une mappe des n\u0153uds qui sont connect\u00E9s \u00E0 cette connexion du cluster, pour lesquels les cl\u00E9s correspondent \u00E0 des ID de n\u0153uds et les valeurs correspondent \u00E0 des adresses qui sont utilis\u00E9es pour se connecter aux n\u0153uds. 
cluster-connection.get-nodes.reply=Une mappe o\u00F9 les cl\u00E9s sont des ID de n\u0153uds et les valeurs sont les adresses qui sont utilis\u00E9es pour se connecter aux n\u0153uds.
cluster-connection.get-static-connectors-as-json=Renvoie une liste de connecteurs statiques sous forme de cha\u00EEne dans le format JSON.
cluster-connection.started=Si la connexion de cluster a d\u00E9marr\u00E9.
cluster-connection.start=D\u00E9marre la connexion de cluster.
cluster-connection.stop=Interrompt la connexion de cluster.
connector-service=TODO
connector-service.add=Op\u00E9ration d'ajout d'un service de connecteur
connector-service.remove=Op\u00E9ration du suppression d'un service de connecteur
connector-service.factory-class=Nom de classe de la classe de la fabrique qui peut instancier le service de connecteur.
connector-service.param=Une paire cl\u00E9/valeur comprise par la classe de fabrique du service du connecteur.
connector-service.param.add=Ajoute une paire cl\u00E9/valeur comprise par la classe de fabrique du service du connecteur.
connector-service.param.remove=Supprime une paire cl\u00E9/valeur comprise par la classe de fabrique du service du connecteur.
