messaging=\u30E1\u30C3\u30BB\u30FC\u30B8\u30F3\u30B0\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0
messaging.add=\u30E1\u30C3\u30BB\u30FC\u30B8\u30F3\u30B0\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u306E\u8FFD\u52A0\u64CD\u4F5C
messaging.remove=\u30E1\u30C3\u30BB\u30FC\u30B8\u30F3\u30B0\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u306E\u524A\u9664\u64CD\u4F5C
messaging.hornetq-server=\u30E1\u30C3\u30BB\u30FC\u30B8\u30F3\u30B0\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u63D0\u4F9B\u306E HornetQ \u30B5\u30FC\u30D0\u30FC
hornetq-server=HornetQ \u30B5\u30FC\u30D0\u30FC\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9
hornetq-server.add=HornetQ \u30B5\u30FC\u30D0\u30FC\u8FFD\u52A0\u64CD\u4F5C
hornetq-server.remove=HornetQ \u30B5\u30FC\u30D0\u30FC\u524A\u9664\u64CD\u4F5C
hornetq-server.name=\u4F7F\u308F\u308C\u3066\u3044\u307E\u305B\u3093\u3002
hornetq-server.clustered=\u30B5\u30FC\u30D0\u30FC\u304C\u30AF\u30E9\u30B9\u30BF\u30FC\u5316\u3055\u308C\u3066\u3044\u308B\u304B\u3069\u3046\u304B
hornetq-server.persistence-enabled=\u6C38\u7D9A\u5316\u3067\u304D\u308B\u3088\u3046\u30B5\u30FC\u30D0\u30FC\u304C\u30D5\u30A1\u30A4\u30EB\u30D9\u30FC\u30B9\u306E\u30B8\u30E3\u30FC\u30CA\u30EB\u3092\u4F7F\u3046\u304B\u3069\u3046\u304B
hornetq-server.scheduled-thread-pool-max-size=\u30B9\u30B1\u30B8\u30E5\u30FC\u30EB\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u308B\u4E3B\u8981\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u306B\u542B\u307E\u308C\u3066\u3044\u308B\u30B9\u30EC\u30C3\u30C9\u6570
hornetq-server.thread-pool-max-size=\u4E3B\u8981\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u306B\u542B\u307E\u308C\u308B\u30B9\u30EC\u30C3\u30C9\u6570\u3002-1 \u306F\u5236\u9650\u306A\u3057\u3002
hornetq-server.security-domain=\u30E6\u30FC\u30B6\u30FC\u3068\u30ED\u30FC\u30EB\u60C5\u5831\u3092\u691C\u8A3C\u3059\u308B\u305F\u3081\u306B\u5229\u7528\u3059\u308B\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30C9\u30E1\u30A4\u30F3
hornetq-server.security-enabled=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u3092\u6709\u52B9\u306B\u3059\u308B\u304B\u3069\u3046\u304B
hornetq-server.security-invalidation-interval=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30AD\u30E3\u30C3\u30B7\u30E5\u3092\u7121\u52B9\u306B\u3059\u308B\u307E\u3067\u306E\u5F85\u6A5F\u6642\u9593 (\u30DF\u30EA\u79D2)
hornetq-server.wild-card-routing-enabled=\u30B5\u30FC\u30D0\u30FC\u304C\u30EF\u30A4\u30EB\u30C9\u30AB\u30FC\u30C9\u30EB\u30FC\u30C6\u30A3\u30F3\u30B0\u306B\u5BFE\u5FDC\u3059\u308B\u304B\u3069\u3046\u304B
hornetq-server.management-address=\u7BA1\u7406\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u9001\u4FE1\u5148\u30A2\u30C9\u30EC\u30B9
hornetq-server.management-notification-address=\u7BA1\u7406\u901A\u77E5\u3092\u53D7\u4FE1\u3059\u308B\u305F\u3081\u306B\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u304C\u30D0\u30A4\u30F3\u30C9\u3059\u308B\u30A2\u30C9\u30EC\u30B9\u540D
hornetq-server.cluster-user=\u30AF\u30E9\u30B9\u30BF\u30FC\u5316\u30CE\u30FC\u30C9\u306E\u9593\u3067\u901A\u4FE1\u3092\u884C\u3046\u305F\u3081\u306B\u30AF\u30E9\u30B9\u30BF\u30FC\u63A5\u7D9A\u3067\u5229\u7528\u3059\u308B\u30E6\u30FC\u30B6\u30FC
hornetq-server.cluster-password=\u30AF\u30E9\u30B9\u30BF\u30FC\u5316\u30CE\u30FC\u30C9\u306E\u9593\u3067\u901A\u4FE1\u3092\u884C\u3046\u305F\u3081\u306B\u30AF\u30E9\u30B9\u30BF\u30FC\u63A5\u7D9A\u3067\u5229\u7528\u3059\u308B\u30D1\u30B9\u30EF\u30FC\u30C9
hornetq-server.jmx-management-enabled=HornetQ \u304C\u5185\u90E8\u7BA1\u7406 API \u3092 JMX \u7D4C\u7531\u3067\u516C\u958B\u3059\u3079\u304D\u304B\u3069\u3046\u304B\u3002\u3053\u308C\u3089\u306E MBean \u306B\u30A2\u30AF\u30BB\u30B9\u3059\u308B\u3068\u8A2D\u5B9A\u306B\u4E00\u8CAB\u6027\u304C\u306A\u304F\u306A\u308B\u53EF\u80FD\u6027\u304C\u3042\u308B\u305F\u3081\u304A\u52E7\u3081\u3057\u3066\u3044\u307E\u305B\u3093\u3002
hornetq-server.jmx-domain=MBeanServer \u306B\u5185\u90E8 HornetQ MBean \u3092\u767B\u9332\u3059\u308B\u305F\u3081\u306B\u5229\u7528\u3059\u308B JMX \u30C9\u30E1\u30A4\u30F3
hornetq-server.message-counter-enabled=\u30E1\u30C3\u30BB\u30FC\u30B8\u30AB\u30A6\u30F3\u30BF\u30FC\u3092\u6709\u52B9\u306B\u3059\u308B\u304B\u3069\u3046\u304B
hornetq-server.message-counter-sample-period=\u30E1\u30C3\u30BB\u30FC\u30B8\u30AB\u30A6\u30F3\u30BF\u30FC\u306B\u5229\u7528\u3059\u308B\u30B5\u30F3\u30D7\u30EB\u671F\u9593 (\u30DF\u30EA\u79D2)
hornetq-server.message-counter-max-day-history=\u30E1\u30C3\u30BB\u30FC\u30B8\u30AB\u30A6\u30F3\u30BF\u30FC\u5C65\u6B74\u3092\u4FDD\u6301\u3059\u308B\u65E5\u306B\u3061
hornetq-server.connection-ttl-override=\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u3001ping \u306E\u53D7\u4FE1\u306A\u3057\u306B\u63A5\u7D9A\u3092\u4FDD\u6301\u3059\u308B\u6642\u9593 (\u30DF\u30EA\u79D2) \u3092\u30AA\u30FC\u30D0\u30FC\u30E9\u30A4\u30C9\u3057\u307E\u3059\u3002
hornetq-server.async-connection-execution-enabled=\u30B5\u30FC\u30D0\u30FC\u306E\u53D7\u4FE1\u30D1\u30B1\u30C3\u30C8\u304C\u51E6\u7406\u306E\u305F\u3081\u306B\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u304B\u3089\u30B9\u30EC\u30C3\u30C9\u306E 1 \u3064\u306B\u79FB\u52D5\u3059\u308B\u304B\u3069\u3046\u304B\u3002\u30EA\u30E2\u30FC\u30C6\u30A3\u30F3\u30B0\u30B9\u30EC\u30C3\u30C9\u3067\u51E6\u7406\u3057\u305F\u307B\u3046\u304C\u3044\u3044\u5834\u5408\u306F false\u3002
hornetq-server.transaction-timeout=\u4F5C\u6210\u6642\u9593\u306E\u5F8C\u3001\u30EA\u30BD\u30FC\u30B9\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u304B\u3089\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u3092\u524A\u9664\u3059\u308B\u307E\u3067\u306E\u5F85\u6A5F\u6642\u9593 (\u30DF\u30EA\u79D2)
hornetq-server.transaction-timeout-scan-period=\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u306E\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u3092\u3069\u306E\u3088\u3046\u306A\u983B\u5EA6\u3067\u30B9\u30AD\u30E3\u30F3\u3059\u308B\u304B (\u30DF\u30EA\u79D2)
hornetq-server.message-expiry-scan-period=\u5931\u52B9\u6E08\u307F\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u3069\u306E\u3088\u3046\u306A\u983B\u5EA6\u3067\u30B9\u30AD\u30E3\u30F3\u3059\u308B\u304B (\u30DF\u30EA\u79D2)
hornetq-server.message-expiry-thread-priority=\u30B9\u30EC\u30C3\u30C9\u5931\u52B9\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u512A\u5148\u9806\u4F4D
hornetq-server.id-cache-size=\u30E1\u30C3\u30BB\u30FC\u30B8 ID \u4F5C\u6210\u524D\u306E\u30AD\u30E3\u30C3\u30B7\u30E5\u30B5\u30A4\u30BA
hornetq-server.persist-id-cache=ID \u3092\u6C38\u7D9A\u5316\u3057\u30B8\u30E3\u30FC\u30CA\u30EB\u306B\u5165\u308C\u308B\u304B\u3069\u3046\u304B
hornetq-server.remoting-interceptors=\u3053\u306E\u30B5\u30FC\u30D0\u30FC\u304C\u4F7F\u3046\u30A4\u30F3\u30BF\u30FC\u30BB\u30D7\u30BF\u30FC\u30AF\u30E9\u30B9\u306E\u4E00\u89A7
hornetq-server.backup=\u3053\u306E\u30B5\u30FC\u30D0\u30FC\u304C\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u30B5\u30FC\u30D0\u30FC\u304B\u3069\u3046\u304B
hornetq-server.allow-failback=\u5143\u306E\u30E9\u30A4\u30D6\u30B5\u30FC\u30D0\u30FC\u304C\u5FA9\u6D3B\u3057\u305F\u5834\u5408\u3001\u3053\u306E\u30B5\u30FC\u30D0\u30FC\u304C\u81EA\u52D5\u3067\u30B7\u30E3\u30C3\u30C8\u30C0\u30A6\u30F3\u3059\u308B\u304B\u3069\u3046\u304B
hornetq-server.failback-delay=\u30E9\u30A4\u30D6\u30B5\u30FC\u30D0\u30FC\u306E\u518D\u8D77\u52D5\u3067\u30D5\u30A7\u30FC\u30EB\u30D0\u30C3\u30AF\u304C\u767A\u751F\u3059\u308B\u307E\u3067\u5F85\u6A5F\u3059\u308B\u6642\u9593
hornetq-server.failover-on-shutdown=\u3053\u306E\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u30B5\u30FC\u30D0\u30FC\u304C\u901A\u5E38\u306E\u30B5\u30FC\u30D0\u30FC\u30B7\u30E3\u30C3\u30C8\u30C0\u30A6\u30F3\u6642\u306B\u30E9\u30A4\u30D6\u3068\u306A\u308B\u3079\u304D\u304B (\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u30B5\u30FC\u30D0\u30FC\u306E\u5834\u5408)
hornetq-server.shared-store=\u3053\u306E\u30B5\u30FC\u30D0\u30FC\u304C\u30D5\u30A7\u30FC\u30EB\u30AA\u30FC\u30D0\u30FC\u7528\u306B\u5171\u6709\u30B9\u30C8\u30A2\u3092\u4F7F\u3046\u304B\u3069\u3046\u304B
hornetq-server.persist-delivery-count-before-delivery=\u30C7\u30EA\u30D0\u30EA\u30FC\u524D\u306B\u30C7\u30EA\u30D0\u30EA\u30FC\u30AB\u30A6\u30F3\u30C8\u3092\u6C38\u7D9A\u5316\u3059\u308B\u304B\u3069\u3046\u304B\u3002False \u306F\u30E1\u30C3\u30BB\u30FC\u30B8\u304C\u30AD\u30E3\u30F3\u30BB\u30EB\u3055\u308C\u305F\u5F8C\u306B\u306E\u307F\u767A\u751F\u3059\u308B\u3053\u3068\u306B\u306A\u308A\u307E\u3059\u3002
hornetq-server.live-connector-ref=\u30E9\u30A4\u30D6\u306E\u30B3\u30CD\u30AF\u30BF\u30FC\u3078\u63A5\u7D9A\u3059\u308B\u305F\u3081\u306B\u5229\u7528\u3059\u308B\u30B3\u30CD\u30AF\u30BF\u30FC\u540D\u3002\u3053\u306E\u30B5\u30FC\u30D0\u30FC\u304C\u975E\u5171\u6709\u578B\u306EHA \u3092\u4F7F\u3046\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u3067\u306A\u3044\u5834\u5408\u3001\u305D\u306E\u5024\u306F "undefined" \u3068\u3057\u307E\u3059\u3002
hornetq-server.create-bindings-dir=\u3053\u306E\u30B5\u30FC\u30D0\u30FC\u304C\u8D77\u52D5\u6642\u306B bindings \u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u3092\u4F5C\u6210\u3059\u308B\u3079\u304D\u304B\u3069\u3046\u304B
hornetq-server.create-journal-dir=\u3053\u306E\u30B5\u30FC\u30D0\u30FC\u304C\u8D77\u52D5\u6642\u306B journal \u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u3092\u4F5C\u6210\u3059\u308B\u3079\u304D\u304B\u3069\u3046\u304B
hornetq-server.journal-type=\u5229\u7528\u3059\u308B\u30B8\u30E3\u30FC\u30CA\u30EB\u306E\u30BF\u30A4\u30D7
hornetq-server.journal-buffer-timeout=\u30B8\u30E3\u30FC\u30CA\u30EB\u3067\u5185\u90E8\u30D0\u30C3\u30D5\u30A1\u30FC\u3092\u30D5\u30E9\u30C3\u30B7\u30E5\u3059\u308B\u306E\u306B\u5229\u7528\u3059\u308B\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8 (\u30CA\u30CE\u79D2)
hornetq-server.journal-buffer-size=\u30B8\u30E3\u30FC\u30CA\u30EB\u4E0A\u306E\u5185\u90E8\u30D0\u30C3\u30D5\u30A1\u30FC\u30B5\u30A4\u30BA
hornetq-server.journal-sync-transactional=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306B\u30EC\u30B9\u30DD\u30F3\u30B9\u3092\u8FD4\u3059\u307E\u3067\u3001\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30C7\u30FC\u30BF\u304C\u30B8\u30E3\u30FC\u30CA\u30EB\u3078\u3068\u540C\u671F\u3059\u308B\u306E\u3092\u5F85\u3064\u304B\u3069\u3046\u304B
hornetq-server.journal-sync-non-transactional=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306B\u30EC\u30B9\u30DD\u30F3\u30B9\u3092\u8FD4\u3059\u307E\u3067\u3001\u975E\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30C7\u30FC\u30BF\u304C\u30B8\u30E3\u30FC\u30CA\u30EB\u3078\u3068\u540C\u671F\u3059\u308B\u306E\u3092\u5F85\u3064\u304B\u3069\u3046\u304B
hornetq-server.log-journal-write-rate=\u5B9A\u671F\u7684\u306B\u30B8\u30E3\u30FC\u30CA\u30EB\u306E\u66F8\u304D\u8FBC\u307F\u30EC\u30FC\u30C8\u3068\u30D5\u30E9\u30C3\u30B7\u30E5\u30EC\u30FC\u30C8\u3092\u30ED\u30B0\u3059\u308B\u304B\u3069\u3046\u304B
hornetq-server.journal-file-size=\u5404\u30B8\u30E3\u30FC\u30CA\u30EB\u30D5\u30A1\u30A4\u30EB\u306E\u30B5\u30A4\u30BA (\u30D0\u30A4\u30C8)
hornetq-server.journal-min-files=\u4E8B\u524D\u306B\u4F5C\u6210\u3059\u3079\u304D\u30B8\u30E3\u30FC\u30CA\u30EB\u30D5\u30A1\u30A4\u30EB\u306E\u6570
hornetq-server.journal-compact-percentage=\u30B8\u30E3\u30FC\u30CA\u30EB\u306E\u5727\u7E2E\u3092\u691C\u8A0E\u3059\u308B\u30E9\u30A4\u30D6\u30C7\u30FC\u30BF\u306E\u5272\u5408
hornetq-server.journal-compact-min-files=\u5727\u7E2E\u958B\u59CB\u524D\u306E\u30B8\u30E3\u30FC\u30CA\u30EB\u30C7\u30FC\u30BF\u30D5\u30A1\u30A4\u30EB\u6700\u5C0F\u6570
hornetq-server.journal-max-io=\u3044\u3064\u3067\u3082 AIO \u30AD\u30E5\u30FC\u306B\u5165\u308C\u308B\u3053\u3068\u306E\u53EF\u80FD\u306A\u66F8\u304D\u8FBC\u307F\u30EA\u30AF\u30A8\u30B9\u30C8\u306E\u6700\u5927\u6570
hornetq-server.perf-blast-pages=TODO
hornetq-server.run-sync-speed-test=\u8D77\u52D5\u6642\u306B\u30C7\u30A3\u30B9\u30AF\u306E\u540C\u671F\u306E\u901F\u5EA6\u306B\u3064\u3044\u3066\u8A3A\u65AD\u30C6\u30B9\u30C8\u3092\u5B9F\u884C\u3059\u308B\u304B\u3069\u3046\u304B\u3002\u30D1\u30D5\u30A9\u30FC\u30DE\u30F3\u30B9\u306E\u554F\u984C\u3092\u5224\u5225\u3059\u308B\u969B\u306B\u4FBF\u5229\u3002
hornetq-server.server-dump-interval=\u57FA\u672C\u7684\u306A\u30E9\u30F3\u30BF\u30A4\u30E0\u60C5\u5831\u3092\u30B5\u30FC\u30D0\u30FC\u30ED\u30B0\u306B\u30C0\u30F3\u30D7\u3059\u308B\u983B\u5EA6\u30021 \u672A\u6E80\u306E\u5024\u306F\u3053\u306E\u6A5F\u80FD\u3092\u7121\u52B9\u306B\u3057\u307E\u3059\u3002
hornetq-server.memory-warning-threshold=\u5229\u7528\u53EF\u80FD\u306A\u30E1\u30E2\u30EA\u306E\u5272\u5408\u3002\u3053\u306E\u91CF\u3092\u8D85\u3048\u308B\u3068\u3001\u8B66\u544A\u30ED\u30B0\u3092\u767A\u884C\u3057\u307E\u3059\u3002
hornetq-server.memory-measure-interval=\u30B5\u30F3\u30D7\u30EB JVM \u30E1\u30E2\u30EA\u306E\u983B\u5EA6 (\u30DF\u30EA\u79D2) \u3002-1 \u306F\u30E1\u30E2\u30EA\u30B5\u30F3\u30D7\u30EA\u30F3\u30B0\u3092\u7121\u52B9\u306B\u3057\u307E\u3059\u3002
hornetq-server.started=\u3053\u306E\u30B5\u30FC\u30D3\u30B9\u3092\u958B\u59CB\u3059\u308B\u304B\u3069\u3046\u304B
hornetq-server.version=\u30B5\u30FC\u30D0\u30FC\u306E\u30D0\u30FC\u30B8\u30E7\u30F3
match=\u30AD\u30E5\u30FC\u30A2\u30C9\u30EC\u30B9\u3068\u4E00\u81F4\u3059\u308B\u8868\u73FE
hornetq-server.get-connectors-as-json=JSON \u306E\u30B7\u30EA\u30A2\u30EB\u5316\u3092\u5229\u7528\u3057\u3066\u3053\u306E\u30B5\u30FC\u30D0\u30FC\u7528\u306B\u8A2D\u5B9A\u3057\u305F\u30B3\u30CD\u30AF\u30BF\u30FC\u3092\u8FD4\u3057\u307E\u3059\u3002
hornetq-server.get-connectors-as-json.reply=JSON \u5F62\u5F0F\u306E\u6587\u5B57\u5217
hornetq-server.enable-message-counters=\u30E1\u30C3\u30BB\u30FC\u30B8\u30AB\u30A6\u30F3\u30BF\u30FC\u3092\u6709\u52B9\u306B\u3057\u307E\u3059\u3002
hornetq-server.disable-message-counters=\u30E1\u30C3\u30BB\u30FC\u30B8\u30AB\u30A6\u30F3\u30BF\u30FC\u3092\u7121\u52B9\u306B\u3057\u307E\u3059\u3002
hornetq-server.reset-all-message-counters=\u30E1\u30C3\u30BB\u30FC\u30B8\u30AB\u30A6\u30F3\u30BF\u30FC\u3092\u3059\u3079\u3066\u30EA\u30BB\u30C3\u30C8\u3057\u307E\u3059\u3002
hornetq-server.reset-all-message-counter-histories=\u30E1\u30C3\u30BB\u30FC\u30B8\u30AB\u30A6\u30F3\u30BF\u30FC\u306E\u5C65\u6B74\u3092\u3059\u3079\u3066\u30EA\u30BB\u30C3\u30C8\u3057\uFF4D\u3055\u3046\u3002
hornetq-server.list-prepared-transactions=\u6E96\u5099\u306E\u3067\u304D\u305F\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u3092\u3059\u3079\u3066\u3001\u65E5\u4ED8\u5225\u306B\u5206\u985E\u3057\u6700\u3082\u53E4\u3044\u3082\u306E\u304B\u3089\u9806\u756A\u306B\u4E00\u89A7\u8868\u793A\u3057\u307E\u3059\u3002
hornetq-server.list-prepared-transactions.reply=\u6587\u5B57\u5217\u4E00\u89A7\u3002\u6587\u5B57\u5217\u306F\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3 XID \u306E Base-64 \u8868\u73FE\u3067\u3001\u30D2\u30E5\u30FC\u30EA\u30B9\u30C6\u30A3\u30C3\u30AF\u306B\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u3092\u30B3\u30DF\u30C3\u30C8\u3042\u308B\u3044\u306F\u30ED\u30FC\u30EB\u30D0\u30C3\u30AF\u3059\u308B\u969B\u306B\u5229\u7528\u53EF\u80FD\u3067\u3059\u3002
hornetq-server.list-prepared-transaction-details-as-json=\u6E96\u5099\u306E\u3067\u304D\u305F\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u3092\u3059\u3079\u3066\u3001\u65E5\u4ED8\u5225\u306B\u5206\u985E\u3057\u6700\u3082\u53E4\u3044\u3082\u306E\u304B\u3089\u9806\u756A\u306B JSON \u5F62\u5F0F\u3067\u8A73\u7D30\u306B\u308F\u305F\u308A\u4E00\u89A7\u8868\u793A\u3057\u307E\u3059\u3002
hornetq-server.list-prepared-transaction-details-as-json.reply=\u8FD4\u3057\u305F\u6587\u5B57\u5217\u306F JSON \u6587\u5B57\u5217\u3067\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u306E\u8A73\u7D30\u30A2\u30EC\u30A4\u3092\u542B\u307F\u307E\u3059\u3002
hornetq-server.list-prepared-transaction-details-as-html=\u6E96\u5099\u306E\u3067\u304D\u305F\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u3092\u3059\u3079\u3066\u3001\u65E5\u4ED8\u5225\u306B\u5206\u985E\u3057\u6700\u3082\u53E4\u3044\u3082\u306E\u304B\u3089\u9806\u756A\u306B HTML \u5F62\u5F0F\u3067\u8A73\u7D30\u306B\u308F\u305F\u308A\u4E00\u89A7\u8868\u793A\u3057\u307E\u3059\u3002
hornetq-server.list-prepared-transaction-details-as-html.reply=\u8FD4\u3057\u305F\u6587\u5B57\u5217\u306F HTML \u6587\u5B57\u5217\u3067\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u306E\u8A73\u7D30\u30C6\u30FC\u30D6\u30EB\u3092\u542B\u307F\u307E\u3059\u3002
hornetq-server.list-heuristic-committed-transactions=\u30D2\u30E5\u30FC\u30EA\u30B9\u30C6\u30A3\u30C3\u30AF\u306B\u30B3\u30DF\u30C3\u30C8\u3055\u308C\u305F\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u3092\u4E00\u89A7\u8868\u793A
hornetq-server.list-heuristic-committed-transactions.reply=\u6587\u5B57\u5217\u4E00\u89A7\u3002\u6587\u5B57\u5217\u306F\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3 XID \u306E Base-64 \u8868\u73FE\u3067\u3059\u3002
hornetq-server.list-heuristic-rolled-back-transactions=\u30D2\u30E5\u30FC\u30EA\u30B9\u30C6\u30A3\u30C3\u30AF\u306B\u30ED\u30FC\u30EB\u30D0\u30C3\u30AF\u3055\u308C\u305F\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u3092\u4E00\u89A7\u8868\u793A
hornetq-server.list-heuristic-rolled-back-transactions.reply=\u6587\u5B57\u5217\u4E00\u89A7\u3002\u6587\u5B57\u5217\u306F\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3 XID \u306E Base-64 \u8868\u73FE\u3067\u3059\u3002
hornetq-server.commit-prepared-transaction=\u6E96\u5099\u3055\u308C\u305F\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u3092\u30D2\u30E5\u30FC\u30EA\u30B9\u30C6\u30A3\u30C3\u30AF\u306B\u30B3\u30DF\u30C3\u30C8\u3057\u307E\u3059\u3002
hornetq-server.commit-prepared-transaction.transaction-as-base-64=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3 XID \u306E Base64 \u8868\u73FE
hornetq-server.commit-prepared-transaction.reply=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u304C\u6B63\u5E38\u306B\u30B3\u30DF\u30C3\u30C8\u3055\u308C\u305F\u5834\u5408\u306F True\u3001\u305D\u3046\u3067\u306A\u3044\u5834\u5408\u306F false\u3002
hornetq-server.rollback-prepared-transaction=\u6E96\u5099\u3055\u308C\u305F\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u3092\u30D2\u30E5\u30FC\u30EA\u30B9\u30C6\u30A3\u30C3\u30AF\u306B\u30ED\u30FC\u30EB\u30D0\u30C3\u30AF\u3057\u307E\u3059\u3002
hornetq-server.rollback-prepared-transaction.transaction-as-base-64=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3 XID \u306E Base64 \u8868\u73FE
hornetq-server.rollback-prepared-transaction.reply=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u304C\u6B63\u5E38\u306B\u30ED\u30FC\u30EB\u30D0\u30C3\u30AF\u3055\u308C\u305F\u5834\u5408\u306F True\u3001\u305D\u3046\u3067\u306A\u3044\u5834\u5408\u306F false\u3002
hornetq-server.list-remote-addresses=\u6307\u5B9A\u306E\u30A2\u30C9\u30EC\u30B9\u306B\u63A5\u7D9A\u3057\u305F\u5168\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306E\u30A2\u30C9\u30EC\u30B9\u3092\u4E00\u89A7\u8868\u793A\u3002ip-address \u306E\u5F15\u6570\u304C\u63D0\u793A\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u3001\u30EA\u30E2\u30FC\u30C8\u30A2\u30C9\u30EC\u30B9\u306E\u6587\u5B57\u5217\u306B ip-address \u306E\u6587\u5B57\u5217\u3092\u542B\u3080\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306E\u307F\u3092\u8FD4\u3057\u307E\u3059\u3002
hornetq-server.list-remote-addresses.ip-address=\u6587\u5B57\u5217\u5F62\u5F0F\u306E IP \u30A2\u30C9\u30EC\u30B9
hornetq-server.list-remote-addresses.reply=\u6587\u5B57\u5217\u304C\u30EA\u30E2\u30FC\u30C8\u306E\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30A2\u30C9\u30EC\u30B9\u3068\u306A\u3063\u3066\u3044\u308B\u3001\u6587\u5B57\u5217\u306E\u4E00\u89A7
hornetq-server.close-connections-for-address=\u30EA\u30E2\u30FC\u30C8\u30A2\u30C9\u30EC\u30B9\u306B\u6307\u5B9A\u306E IP \u30A2\u30C9\u30EC\u30B9\u3092\u542B\u3080\u30B5\u30FC\u30D0\u30FC\u306B\u63A5\u7D9A\u3057\u3066\u3044\u308B\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u63A5\u7D9A\u3092\u3059\u3079\u3066\u9589\u3058\u307E\u3059\u3002
hornetq-server.close-connections-for-address.ip-address=\u6587\u5B57\u5217\u5F62\u5F0F\u306E IP \u30A2\u30C9\u30EC\u30B9
hornetq-server.close-connections-for-address.reply=\u63A5\u7D9A\u304C\u9589\u3058\u3089\u308C\u305F\u5834\u5408\u306F true\u3001\u305D\u3046\u3067\u306A\u3044\u5834\u5408\u306F false
hornetq-server.list-connection-ids=\u3053\u306E\u30B5\u30FC\u30D0\u30FC\u306B\u63A5\u7D9A\u3059\u308B\u63A5\u7D9A ID \u3059\u3079\u3066\u3092\u4E00\u89A7\u8868\u793A
hornetq-server.list-connection-ids.reply=\u5404\u6587\u5B57\u5217\u304C\u63A5\u7D9A ID \u3068\u306A\u3063\u3066\u3044\u308B\u6587\u5B57\u5217\u4E00\u89A7
hornetq-server.list-producers-info-as-json=\u5168\u30BB\u30C3\u30B7\u30E7\u30F3\u306B\u5BFE\u3057\u3066\u3001JSON \u30B7\u30EA\u30A2\u30EB\u5316\u3092\u4F7F\u3044\u30E1\u30C3\u30BB\u30FC\u30B8\u30D7\u30ED\u30C7\u30E5\u30FC\u30B5\u30FC\u306B\u95A2\u3059\u308B\u60C5\u5831\u3092\u4E00\u89A7\u8868\u793A
hornetq-server.list-producers-info-as-json.reply=\u8FD4\u3057\u305F\u6587\u5B57\u5217\u306F JSON \u6587\u5B57\u5217\u3067\u30D7\u30ED\u30C7\u30E5\u30FC\u30B5\u30FC\u306E\u8A73\u7D30\u30A2\u30EC\u30A4\u3092\u542B\u307F\u307E\u3059\u3002
hornetq-server.list-sessions=\u6307\u5B9A\u306E\u63A5\u7D9A ID \u306E\u30BB\u30C3\u30B7\u30E7\u30F3 ID \u3092\u3059\u3079\u3066\u4E00\u89A7\u8868\u793A
hornetq-server.list-sessions.connection-id=\u63A5\u7D9A id
hornetq-server.list-sessions.reply=\u5404\u6587\u5B57\u5217\u304C\u30BB\u30C3\u30B7\u30E7\u30F3 ID \u3068\u306A\u3063\u3066\u3044\u308B\u6587\u5B57\u5217\u4E00\u89A7
hornetq-server.get-roles=\u7279\u5B9A\u306E\u30A2\u30C9\u30EC\u30B9\u30DE\u30C3\u30C1\u306B\u95A2\u3059\u308B\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30ED\u30FC\u30EB\u3092\u53D6\u5F97\u3057\u307E\u3059\u3002
hornetq-server.get-roles.address-match=\u30A2\u30C9\u30EC\u30B9\u30DE\u30C3\u30C1
hornetq-server.get-roles.reply=\u5404\u8981\u7D20\u306E\u4E00\u89A7\u3002\u5404\u8981\u7D20\u306F\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30ED\u30FC\u30EB\u306B\u3064\u3044\u3066\u8AAC\u660E\u3059\u308B\u30D7\u30ED\u30D1\u30C6\u30A3\u30BB\u30C3\u30C8\u3068\u306A\u3063\u3066\u3044\u307E\u3059\u3002
hornetq-server.get-roles-as-json=\u7279\u5B9A\u306E\u30A2\u30C9\u30EC\u30B9\u30DE\u30C3\u30C1\u306B\u95A2\u3059\u308B\u30ED\u30FC\u30EB (JSON \u6587\u5B57\u5217\u3068\u3057\u3066) \u3092\u53D6\u5F97\u3057\u307E\u3059\u3002
hornetq-server.get-roles-as-json.address-match=\u30A2\u30C9\u30EC\u30B9\u30DE\u30C3\u30C1
hornetq-server.get-roles-as-json.reply=\u8FD4\u3057\u305F\u6587\u5B57\u5217\u306F JSON \u6587\u5B57\u5217\u3067\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30ED\u30FC\u30EB\u306E\u8A73\u7D30\u30A2\u30EC\u30A4\u3092\u542B\u307F\u307E\u3059\u3002
hornetq-server.get-address-settings-as-json=\u3042\u308B\u30A2\u30C9\u30EC\u30B9\u30DE\u30C3\u30C1\u306B\u5BFE\u3057\u3001JSON \u6587\u5B57\u5217\u3068\u3057\u3066\u30A2\u30C9\u30EC\u30B9\u8A2D\u5B9A\u3092\u8FD4\u3057\u307E\u3059\u3002
hornetq-server.get-address-settings-as-json.address-match=\u30A2\u30C9\u30EC\u30B9\u30DE\u30C3\u30C1
hornetq-server.get-address-settings-as-json.reply=\u8FD4\u3057\u305F\u6587\u5B57\u5217\u306F JSON \u6587\u5B57\u5217\u3067\u30A2\u30C9\u30EC\u30B9\u8A2D\u5B9A\u306E\u8A73\u7D30\u30A2\u30EC\u30A4\u3092\u542B\u307F\u307E\u3059\u3002
hornetq-server.force-failover=\u30E1\u30C3\u30BB\u30FC\u30B8\u30F3\u30B0\u30B5\u30FC\u30D0\u30FC\u3092\u5F37\u5236\u7D42\u4E86\u3057\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306B\u30D5\u30A7\u30FC\u30EB\u30AA\u30FC\u30D0\u30FC\u306E\u901A\u77E5\u3092\u51FA\u3057\u307E\u3059\u3002
jms-server.list-connections-as-json=JMS \u63A5\u7D9A\u3092\u3059\u3079\u3066\u4E00\u89A7\u8868\u793A
jms-server.list-connections-as-json.reply=\u8FD4\u3057\u305F\u6587\u5B57\u5217\u306F JSON \u6587\u5B57\u5217\u3067JMSConnectionInfo \u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306E\u30A2\u30EC\u30A4\u3092\u542B\u307F\u307E\u3059\u3002
jms-server.list-consumers-as-json=connection-id \u6307\u5B9A\u306E JMS \u63A5\u7D9A\u306B\u6240\u5C5E\u3059\u308B\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u3092\u3059\u3079\u3066\u4E00\u89A7\u8868\u793A
jms-server.list-consumers-as-json.connection-id=\u63A5\u7D9A id
jms-server.list-consumers-as-json.reply=\u8FD4\u3057\u305F\u6587\u5B57\u5217\u306F JSON \u6587\u5B57\u5217\u3067JMSConsumerInfo \u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306E\u30A2\u30EC\u30A4\u3092\u542B\u307F\u307E\u3059\u3002
jms-server.list-all-consumers-as-json=\u5168\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u3092\u4E00\u89A7\u8868\u793A
jms-server.list-all-consumers-as-json.reply=\u8FD4\u3057\u305F\u6587\u5B57\u5217\u306F JSON \u6587\u5B57\u5217\u3067JMSConsumerInfo \u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306E\u30A2\u30EC\u30A4\u3092\u542B\u307F\u307E\u3059\u3002
jms-server.list-target-destinations=\u6307\u5B9A\u306E\u30BB\u30C3\u30B7\u30E7\u30F3\u304C\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u9001\u4FE1\u3059\u308B\u30A2\u30C9\u30EC\u30B9\u3092\u3059\u3079\u3066\u4E00\u89A7\u8868\u793A
jms-server.list-target-destinations.session-id=\u30BB\u30C3\u30B7\u30E7\u30F3 id
jms-server.list-target-destinations.reply=\u8FD4\u3057\u305F\u6587\u5B57\u5217\u306F JSON \u6587\u5B57\u5217\u3067\u30A2\u30C9\u30EC\u30B9\u540D\u306E\u30A2\u30EC\u30A4\u3092\u542B\u307F\u307E\u3059\u3002
jms-server.get-last-sent-message-id=\u6307\u5B9A\u306E\u30BB\u30C3\u30B7\u30E7\u30F3\u304B\u3089\u6307\u5B9A\u306E\u30A2\u30C9\u30EC\u30B9\u306B\u9001\u4FE1\u3057\u305F\u6700\u5F8C\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u306E ID \u3092\u8FD4\u3057\u307E\u3059\u3002
jms-server.get-last-sent-message-id.session-id=\u30BB\u30C3\u30B7\u30E7\u30F3 id
jms-server.get-last-sent-message-id.reply=\u30E1\u30C3\u30BB\u30FC\u30B8 id
jms-server.get-session-creation-time=\u30BB\u30C3\u30B7\u30E7\u30F3\u306E\u4F5C\u6210\u6642\u9593\u3092\u53D6\u5F97\u3057\u307E\u3059\u3002
jms-server.get-session-creation-time.session-id=\u30BB\u30C3\u30B7\u30E7\u30F3 id
jms-server.get-session-creation-time.reply=\u30A8\u30DD\u30C3\u30AF\u304B\u3089\u306E\u4F5C\u6210\u6642\u9593\u3002\u30DF\u30EA\u79D2\u6570\u3092\u8868\u793A\u3059\u308B\u6587\u5B57\u5217\u3068\u3057\u3066\u8868\u793A\u3057\u307E\u3059\u3002
jms-server.list-sessions-as-json=\u6307\u5B9A\u306E\u63A5\u7D9A ID \u306E\u30BB\u30C3\u30B7\u30E7\u30F3 ID \u3092\u3059\u3079\u3066\u4E00\u89A7\u8868\u793A
jms-server.list-sessions-as-json.connection-id=\u63A5\u7D9A id
jms-server.list-sessions-as-json.reply=\u8FD4\u3057\u305F\u6587\u5B57\u5217\u306F JSON \u6587\u5B57\u5217\u3067\u30BB\u30C3\u30B7\u30E7\u30F3 id \u306E\u30A2\u30EC\u30A4\u3092\u542B\u307F\u307E\u3059\u3002
jms-server.list-prepared-transaction-jms-details-as-json=\u6E96\u5099\u306E\u3067\u304D\u305F\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u3092\u3059\u3079\u3066\u3001\u65E5\u4ED8\u5225\u306B\u5206\u985E\u3057\u6700\u3082\u53E4\u3044\u3082\u306E\u304B\u3089\u9806\u756A\u306BJMS \u5F62\u5F0F\u306E\u8A73\u7D30\u3092\u542B\u3081\u3001 JSON \u5F62\u5F0F\u3067\u4E00\u89A7\u8868\u793A\u3057\u307E\u3059\u3002
jms-server.list-prepared-transaction-jms-details-as-json.reply=\u8FD4\u3057\u305F\u6587\u5B57\u5217\u306F JSON \u6587\u5B57\u5217\u3067\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u306E\u8A73\u7D30\u30A2\u30EC\u30A4\u3092\u542B\u307F\u307E\u3059\u3002
jms-server.list-prepared-transaction-jms-details-as-html=\u6E96\u5099\u306E\u3067\u304D\u305F\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u3092\u3059\u3079\u3066\u3001\u65E5\u4ED8\u5225\u306B\u5206\u985E\u3057\u6700\u3082\u53E4\u3044\u3082\u306E\u304B\u3089\u9806\u756A\u306BJMS \u3067\u306E\u8A73\u7D30\u3092\u542B\u3081 HTML \u5F62\u5F0F\u3067\u4E00\u89A7\u8868\u793A\u3057\u307E\u3059\u3002
jms-server.list-prepared-transaction-jms-details-as-html.reply=\u8FD4\u3057\u305F\u6587\u5B57\u5217\u306F HTML \u6587\u5B57\u5217\u3067\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u306E\u8A73\u7D30\u30C6\u30FC\u30D6\u30EB\u3092\u542B\u307F\u307E\u3059\u3002
jms-server.address-name=\u3000
path=HornetQ \u304C\u6C38\u7D9A\u30C7\u30FC\u30BF\u3092\u4FDD\u5B58\u3059\u308B\u5834\u6240\u306E1\u3064\u3092\u53C2\u7167\u3059\u308B\u30D5\u30A1\u30A4\u30EB\u30B7\u30B9\u30C6\u30E0\u30D1\u30B9
path.add=\u30D5\u30A1\u30A4\u30EB\u30B7\u30B9\u30C6\u30E0\u30D1\u30B9\u306E\u8FFD\u52A0
path.remove=\u30D1\u30B9\u306E\u524A\u9664
path.path=\u5B9F\u969B\u306E\u30D5\u30A1\u30A4\u30EB\u30B7\u30B9\u30C6\u30E0\u30D1\u30B9\u3002'relative-to' \u5C5E\u6027\u3068\u3057\u3066\u6307\u5B9A\u3055\u308C\u3066\u3044\u306A\u3044\u9650\u308A\u3001\u7D76\u5BFE\u30D1\u30B9\u3068\u3057\u3066\u51E6\u7406\u3055\u308C\u307E\u3059\u3002'relative-to' \u5C5E\u6027\u3068\u3057\u3066\u3044\u308B\u5834\u5408\u306F\u3001\u305D\u306E\u30D1\u30B9\u3092\u8D77\u70B9\u306B\u3057\u305F\u76F8\u5BFE\u30D1\u30B9\u3068\u3057\u3066\u5024\u304C\u51E6\u7406\u3055\u308C\u307E\u3059\u3002<p>\u7D76\u5BFE\u30D1\u30B9\u3068\u3057\u3066\u51E6\u7406\u3055\u308C\u308B\u5834\u5408\u3001\u3053\u306E\u5C5E\u6027\u5024\u304C\u6307\u5B9A\u3059\u308B\u5B9F\u969B\u306E\u30E9\u30F3\u30BF\u30A4\u30E0\u30D1\u30B9\u540D\u306F\u4EE5\u4E0B\u306E\u3088\u3046\u306B\u6C7A\u5B9A\u3055\u308C\u307E\u3059\u3002</p>\u3053\u306E\u5024\u304C\u3059\u3067\u306B\u7D76\u5BFE\u30D1\u30B9\u306E\u5834\u5408\u3001\u5024\u306F\u76F4\u63A5\u5229\u7528\u3055\u308C\u307E\u3059\u3002\u305D\u3046\u3067\u306A\u3044\u5834\u5408\u3001\u30E9\u30F3\u30BF\u30A4\u30E0\u30D1\u30B9\u540D\u304C\u30B7\u30B9\u30C6\u30E0\u306B\u4F9D\u5B58\u3059\u308B\u5F62\u3067\u89E3\u6C7A\u3055\u308C\u307E\u3059\u3002UNIX \u30B7\u30B9\u30C6\u30E0\u3067\u306F\u3001\u76F8\u5BFE\u30D1\u30B9\u540D\u306F\u73FE\u5728\u306E\u30E6\u30FC\u30B6\u30FC\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u306B\u5BFE\u3057\u3066\u89E3\u6C7A\u3059\u308B\u3053\u3068\u3067\u7D76\u5BFE\u30D1\u30B9\u306B\u5909\u63DB\u3055\u308C\u307E\u3059\u3002Microsoft Windows \u30B7\u30B9\u30C6\u30E0\u3067\u306F\u3001\u30D1\u30B9\u540D\u3067\u6307\u5B9A\u3057\u3066\u3044\u308B\u30C9\u30E9\u30A4\u30D6\u306E\u73FE\u5728\u306E\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u304C\u3042\u308C\u3070\u305D\u308C\u306B\u5BFE\u3057\u3066\u89E3\u6C7A\u3059\u308B\u3053\u3068\u3067\u3001\u76F8\u5BFE\u30D1\u30B9\u304C\u7D76\u5BFE\u30D1\u30B9\u306B\u5909\u63DB\u3055\u308C\u307E\u3059\u3002\u306A\u3044\u5834\u5408\u306F\u3001\u73FE\u5728\u306E\u30E6\u30FC\u30B6\u30FC\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u306B\u5BFE\u3057\u3066\u89E3\u6C7A\u3055\u308C\u308B\u3053\u3068\u3067\u7D76\u5BFE\u30D1\u30B9\u306B\u5909\u63DB\u3055\u308C\u307E\u3059\u3002
path.relative-to=\u4EE5\u524D\u306B\u540D\u524D\u6307\u5B9A\u3055\u308C\u305F\u30D1\u30B9\u306E\u540D\u524D\u3001\u3042\u308B\u3044\u306F\u30B7\u30B9\u30C6\u30E0\u304C\u63D0\u4F9B\u3057\u305F\u6A19\u6E96\u30D1\u30B9\u306E1\u3064\u3002'relative-to' \u304C\u6307\u5B9A\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u306F\u3001'path' \u5C5E\u6027\u306E\u5024\u306F\u3053\u306E\u5C5E\u6027\u304C\u6307\u5B9A\u3057\u305F\u30D1\u30B9\u3092\u8D77\u70B9\u3068\u3057\u305F\u76F8\u5BFE\u30D1\u30B9\u3068\u3057\u3066\u51E6\u7406\u3055\u308C\u307E\u3059\u3002\u30B7\u30B9\u30C6\u30E0\u304C\u63D0\u4F9B\u3059\u308B\u6A19\u6E96\u30D1\u30B9\u306F\u4EE5\u4E0B\u306E\u901A\u308A\u3067\u3059\u3002<ul><li>jboss.home - JBoss AS \u30C7\u30A3\u30B9\u30C8\u30EA\u30D3\u30E5\u30FC\u30B7\u30E7\u30F3\u306E root \u30C7\u30A3\u30EC\u30AF\u30C8\u30EA</li><li>user.home - \u30E6\u30FC\u30B6\u30FC\u306E\u30DB\u30FC\u30E0\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA</li><li>user.dir - \u30E6\u30FC\u30B6\u30FC\u306E\u73FE\u5728\u4F5C\u696D\u4E2D\u306E\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA</li><li>java.home - java \u306E\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u8A2D\u5B9A\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA</li><li>jboss.server.base.dir - \u5404\u30B5\u30FC\u30D0\u30FC\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306E root \u30C7\u30A3\u30EC\u30AF\u30C8\u30EA</li><li>jboss.server.data.dir - \u30B5\u30FC\u30D0\u30FC\u304C\u6C38\u7D9A\u30C7\u30FC\u30BF\u306E\u30D5\u30A1\u30A4\u30EB\u4FDD\u5B58\u306B\u4F7F\u3046\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA</li><li>jboss.server.log.dir - \u30B5\u30FC\u30D0\u30FC\u304C\u30ED\u30B0\u30D5\u30A1\u30A4\u30EB\u306E\u4FDD\u5B58\u306B\u4F7F\u3046\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA</li><li>jboss.server.tmp.dir - \u30B5\u30FC\u30D0\u30FC\u304C\u4E00\u6642\u7684\u306A\u30D5\u30A1\u30A4\u30EB\u4FDD\u5B58\u306B\u4F7F\u3046\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA</li><li>jboss.domain.servers.dir - \u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u914D\u4E0B\u3067\u500B\u5225\u30B5\u30FC\u30D0\u30FC\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306E\u4F5C\u696D\u30A8\u30EA\u30A2\u3092\u4F5C\u6210\u3059\u308B\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA</li></ul>
bindings-directory.path=\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u30B8\u30E3\u30FC\u30CA\u30EB\u304C\u5B58\u5728\u3059\u308B\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u306F ${jboss.server.data.dir}/messaging/bindings \u3067\u3059\u3002
journal-directory.path=\u30E1\u30C3\u30BB\u30FC\u30B8\u30B8\u30E3\u30FC\u30CA\u30EB\u304C\u5B58\u5728\u3059\u308B\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u306F ${jboss.server.data.dir}/messaging/journal \u3067\u3059\u3002
large-messages-directory.path=\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u4FDD\u5B58\u5148\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u306F ${jboss.server.data.dir}/messaging/largemessages \u3067\u3059\u3002
paging-directory.path=\u30DA\u30FC\u30B8\u30D5\u30A1\u30A4\u30EB\u306E\u4FDD\u5B58\u5148\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u306F\u3001 ${jboss.server.data.dir}/messaging/paging \u3067\u3059\u3002
grouping-handler=\u30AF\u30E9\u30B9\u30BF\u30FC\u306E\u3069\u306E\u30CE\u30FC\u30C9\u304C\u5272\u308A\u5F53\u3066\u6E08\u307F\u306E\u30B0\u30EB\u30FC\u30D7 id \u3092\u6301\u3064\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u51E6\u7406\u3059\u3079\u304D\u304B\u3001\u610F\u601D\u6C7A\u5B9A\u3092\u884C\u3044\u307E\u3059\u3002
grouping-handler.add=\u30B0\u30EB\u30FC\u30D7\u5316\u30CF\u30F3\u30C9\u30E9\u30FC\u306E\u8FFD\u52A0\u64CD\u4F5C\u3002\u30B0\u30EB\u30FC\u30D7\u5316\u30CF\u30F3\u30C9\u30E9\u30FC\u306E\u307F\u3092\u5229\u7528\u53EF\u80FD\u3067\u3059\u3002
grouping-handler.remove=\u30B0\u30EB\u30FC\u30D7\u5316\u30CF\u30F3\u30C9\u30E9\u30FC\u306E\u524A\u9664\u64CD\u4F5C
grouping-handler.type=\u30CF\u30F3\u30C9\u30E9\u30FC\u304C\u51E6\u7406\u306E\u6C7A\u5B9A\u3092\u4E0B\u3059\u30AF\u30E9\u30B9\u30BF\u30FC\u3067\u5358\u4E00\u306E 'Local' \u30CF\u30F3\u30C9\u30E9\u30FC\u3067\u3042\u308B\u304B\u3001\u30ED\u30FC\u30AB\u30EB\u30CF\u30F3\u30C9\u30E9\u30FC\u3068\u3084\u308A\u53D6\u308A\u3092\u884C\u3046 'Remote' \u30CF\u30F3\u30C9\u30E9\u30FC\u304B
grouping-handler.grouping-handler-address=\u30AF\u30E9\u30B9\u30BF\u30FC\u63A5\u7D9A\u3078\u306E\u53C2\u7167\u3068\u30AF\u30E9\u30B9\u30BF\u30FC\u304C\u4F7F\u3046\u30A2\u30C9\u30EC\u30B9
grouping-handler.timeout=\u51E6\u7406\u6C7A\u5B9A\u3092\u4E0B\u3059\u307E\u3067\u306E\u5F85\u6A5F\u6642\u9593\u3002\u3053\u306E\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u306E\u6642\u9593\u306B\u9054\u3059\u308B\u3068\u9001\u4FE1\u4E2D\u306B\u4F8B\u5916\u304C\u767A\u884C\u3055\u308C\u3001\u53B3\u5BC6\u306A\u9806\u4F4D\u4ED8\u3051\u304C\u4FDD\u305F\u308C\u308B\u3088\u3046\u306B\u3057\u307E\u3059\u3002
in-vm-acceptor=HornetQ \u30B5\u30FC\u30D0\u30FC\u3078\u306E in-VM \u63A5\u7D9A\u306E\u65B9\u6CD5\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002
remote-acceptor=HornetQ \u30B5\u30FC\u30D0\u30FC\u3078\u306E\u30EA\u30E2\u30FC\u30C8\u63A5\u7D9A\u306E\u65B9\u6CD5\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002
acceptor=HornetQ \u30B5\u30FC\u30D0\u30FC\u3078\u306E\u63A5\u65B9\u6CD5\u3092\u5B9A\u7FA9\u3059\u308B\u30A2\u30AF\u30BB\u30D7\u30BF\u30FC
acceptor.remote=\u30EA\u30E2\u30FC\u30C8\u30A2\u30AF\u30BB\u30D7\u30BF\u30FC
acceptor.in-vm=IN-VM \u30A2\u30AF\u30BB\u30D7\u30BF\u30FC
acceptor.add=\u30A2\u30AF\u30BB\u30D7\u30BF\u30FC\u8FFD\u52A0\u64CD\u4F5C
acceptor.add.params=\u30A2\u30AF\u30BB\u30D7\u30BF\u30FC\u306E factory-class \u304C\u7406\u89E3\u3057\u3001\u8A2D\u5B9A\u306B\u5229\u7528\u3059\u308B key-value \u30DA\u30A2\u30BB\u30C3\u30C8
acceptor.remove=\u30A2\u30AF\u30BB\u30D7\u30BF\u30FC\u8FFD\u52A0\u64CD\u4F5C
acceptor.started=\u3053\u306E\u30A2\u30AF\u30BB\u30D7\u30BF\u30FC\u3092\u958B\u59CB\u3059\u308B\u304B\u3069\u3046\u304B
acceptor.start=\u30A2\u30AF\u30BB\u30D7\u30BF\u30FC\u306E\u958B\u59CB
acceptor.stop=\u30A2\u30AF\u30BB\u30D7\u30BF\u30FC\u97F3\u7A0B\u6C0F
acceptor.param=\u30A2\u30AF\u30BB\u30D7\u30BF\u30FC\u306E factory-class \u304C\u7406\u89E3\u3057\u3001\u8A2D\u5B9A\u306B\u5229\u7528\u3059\u308B key-value \u30DA\u30A2
address-setting=\u30A2\u30C9\u30EC\u30B9\u8A2D\u5B9A\u306F\u4E00\u90E8\u306E\u5C5E\u6027\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u304C\u3001\u3053\u308C\u3089\u306F\u7279\u5B9A\u306E\u30AD\u30E5\u30FC\u3067\u306F\u306A\u304F\u30A2\u30C9\u30EC\u30B9\u306E\u30EF\u30A4\u30EB\u30C9\u30AB\u30FC\u30C9\u306B\u5BFE\u3057\u3066\u5B9A\u7FA9\u3055\u308C\u307E\u3059\u3002
address-setting.add=address-setting \u306E\u8FFD\u52A0\u64CD\u4F5C
address-setting.remove=\u65E2\u5B58\u306E address-setting \u306E\u524A\u9664\u64CD\u4F5C
address-setting.address-full-policy=max-size-bytes \u3092\u6307\u5B9A\u3057\u305F\u30A2\u30C9\u30EC\u30B9\u304C\u3044\u3063\u3071\u3044\u306B\u306A\u3063\u305F\u5834\u5408\u306B\u3069\u3046\u3059\u308B\u304B\u6C7A\u5B9A (PAGE\u3001DROP\u3001BLOCK)
address-setting.dead-letter-address=\u30C7\u30C3\u30C9\u30EC\u30BF\u30FC\u30A2\u30C9\u30EC\u30B9
address-setting.last-value-queue=\u30AD\u30E5\u30FC\u304C\u6700\u5F8C\u306E\u5024\u3092\u5229\u7528\u3059\u308B\u304B\u5426\u304B\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002
address-setting.max-delivery-attempts=dead-letter-address \u306B\u9001\u4FE1\u3059\u308B\u524D\u306B\u3001\u30AD\u30E3\u30F3\u30BB\u30EB\u3055\u308C\u305F\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u518D\u9001\u3059\u308B\u56DE\u6570\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002
address-setting.max-size-bytes=\u6700\u5927\u30D0\u30A4\u30C8\u30B5\u30A4\u30BA
address-setting.message-counter-history-day-limit=1\u65E5\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u30AB\u30A6\u30F3\u30BF\u30FC\u5C65\u6B74\u306E\u5236\u9650
address-setting.expiry-address=\u5931\u52B9\u3057\u305F\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u9001\u4FE1\u5148\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002
address-setting.redelivery-delay=\u30AD\u30E3\u30F3\u30BB\u30EB\u3055\u308C\u305F\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u518D\u9001\u3092\u8A66\u884C\u3059\u308B\u524D\u306B\u5F85\u6A5F\u3059\u308B\u6642\u9593\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002
address-setting.redistribution-delay=\u6700\u5F8C\u306E\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u304C\u30AD\u30E5\u30FC\u3067\u9589\u3058\u3089\u308C\u305F\u5834\u5408\u3001\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u518D\u9001\u3092\u884C\u3046\u524D\u306B\u3069\u306E\u7A0B\u5EA6\u5F85\u6A5F\u3059\u308B\u304B\u5B9A\u7FA9\u3057\u307E\u3059\u3002
address-setting.page-size-bytes=\u30DA\u30FC\u30B8\u30F3\u30B0\u30B5\u30A4\u30BA
address-setting.page-max-cache-size=\u30DA\u30FC\u30B8\u30F3\u30B0\u306E\u30CA\u30D3\u30B2\u30FC\u30B7\u30E7\u30F3\u6642\u306E IO \u3092\u6700\u9069\u5316\u3059\u308B\u305F\u3081\u306B\u3001\u30E1\u30E2\u30EA\u5185\u306B\u4FDD\u6301\u3059\u308B\u30DA\u30FC\u30B8\u30D5\u30A1\u30A4\u30EB\u306E\u6570\u3002
address-setting.send-to-dla-on-no-route=\u3053\u306E\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u304C\u305D\u306E\u30A2\u30C9\u30EC\u30B9\u306B\u5BFE\u3057\u3066 true \u306B\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u3067\u3001\u30E1\u30C3\u30BB\u30FC\u30B8\u304C\u3069\u306E\u30AD\u30E5\u30FC\u306B\u3082\u30EB\u30FC\u30C6\u30A3\u30F3\u30B0\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u305D\u306E\u30A2\u30C9\u30EC\u30B9\u306E\u30C7\u30C3\u30C9\u30EC\u30BF\u30FC\u30A2\u30C9\u30EC\u30B9 (DLA) \u304C\u3042\u308C\u3070\u305D\u3061\u3089\u306B\u9001\u4FE1\u3055\u308C\u307E\u3059\u3002
connector=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u304C\u30B3\u30CD\u30AF\u30BF\u30FC\u3092\u4F7F\u3044\u3001\u30B5\u30FC\u30D0\u30FC\u3078\u306E\u63A5\u7D9A\u65B9\u6CD5\u3092\u5B9A\u7FA9\u3059\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u3059\u3002
remote-connector=\u30EA\u30E2\u30FC\u30C8\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u304C\u5229\u7528\u3057\u30B5\u30FC\u30D0\u30FC\u3078\u306E\u63A5\u7D9A\u65B9\u6CD5\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002
in-vm-connector=in-VM \u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u304C\u4F7F\u3044\u30B5\u30FC\u30D0\u30FC\u3078\u306E\u63A5\u7D9A\u65B9\u6CD5\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002
connector.add=\u30B3\u30CD\u30AF\u30BF\u30FC\u306E\u8FFD\u52A0\u64CD\u4F5C
connector.add.params=\u30B3\u30CD\u30AF\u30BF\u30FC\u306E factory-class \u304C\u7406\u89E3\u3057\u3001\u8A2D\u5B9A\u306B\u5229\u7528\u3059\u308B key-value \u30DA\u30A2\u30BB\u30C3\u30C8
connector.remove=\u30B3\u30CD\u30AF\u30BF\u30FC\u306E\u524A\u9664\u64CD\u4F5C
connector.param=\u30B3\u30CD\u30AF\u30BF\u30FC\u306E factory-class \u304C\u7406\u89E3\u3057\u3001\u8A2D\u5B9A\u306B\u5229\u7528\u3059\u308B key-value \u30DA\u30A2
core-address=HornetQ "address" \u3092\u793A\u3059\u30E9\u30F3\u30BF\u30A4\u30E0\u306E\u307F\u306E\u30EA\u30BD\u30FC\u30B9\u30021\u3064\u306E\u30A2\u30C9\u30EC\u30B9\u306B0\u500B\u4EE5\u4E0A\u306E\u30AD\u30E5\u30FC\u3092\u30D0\u30A4\u30F3\u30C9\u3067\u304D\u307E\u3059\u3002\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u30EB\u30FC\u30C6\u30A3\u30F3\u30B0\u3059\u308B\u969B\u3001\u305D\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u30A2\u30C9\u30EC\u30B9\u306B\u30D0\u30A4\u30F3\u30C9\u3059\u308B\u30AD\u30E5\u30FC\u306E\u30BB\u30C3\u30C8\u306B\u30EB\u30FC\u30C6\u30A3\u30F3\u30B0\u3057\u307E\u3059\u3002
core-address.roles=\u30A2\u30C9\u30EC\u30B9\u306B\u95A2\u9023\u4ED8\u3051\u3089\u308C\u305F\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30ED\u30FC\u30EB (\u540D\u524D\u3068\u6A29\u9650) \u306E\u4E00\u89A7
core-address.role.name=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30ED\u30FC\u30EB\u540D
core-address.role.send=\u30ED\u30FC\u30EB\u304C\u305D\u306E\u30A2\u30C9\u30EC\u30B9\u306B\u9001\u4FE1\u3059\u308B\u6A29\u9650\u3092\u6301\u3064\u304B\u3069\u3046\u304B
core-address.role.consume=\u30ED\u30FC\u30EB\u304C\u305D\u306E\u30A2\u30C9\u30EC\u30B9\u304B\u3089\u30B3\u30F3\u30B7\u30E5\u30FC\u30E0\u3059\u308B\u6A29\u9650\u3092\u6301\u3064\u304B\u3069\u3046\u304B
core-address.role.createDurableQueue=\u30ED\u30FC\u30EB\u304C\u6C38\u7D9A\u30AD\u30E5\u30FC\u306E\u4F5C\u6210\u6A29\u9650\u3092\u6301\u3064\u304B\u3069\u3046\u304B
core-address.role.deleteDurableQueue=\u30ED\u30FC\u30EB\u304C\u6C38\u7D9A\u30AD\u30E5\u30FC\u306E\u524A\u9664\u6A29\u9650\u3092\u6301\u3064\u304B\u3069\u3046\u304B
core-address.role.createNonDurableQueue=\u30ED\u30FC\u30EB\u304C\u975E\u6C38\u7D9A\u30AD\u30E5\u30FC\u306E\u4F5C\u6210\u6A29\u9650\u3092\u6301\u3064\u304B\u3069\u3046\u304B
core-address.role.deleteNonDurableQueue=\u30ED\u30FC\u30EB\u304C\u975E\u6C38\u7D9A\u30AD\u30E5\u30FC\u306E\u524A\u9664\u6A29\u9650\u3092\u6301\u3064\u304B\u3069\u3046\u304B
core-address.role.manage=\u30ED\u30FC\u30EB\u304C\u305D\u306E\u30A2\u30C9\u30EC\u30B9\u306B\u7BA1\u7406\u3059\u308B\u6A29\u9650\u3092\u6301\u3064\u304B\u3069\u3046\u304B
core-address.queue-names=\u30A2\u30C9\u30EC\u30B9\u306B\u95A2\u9023\u4ED8\u3051\u3089\u308C\u305F\u30AD\u30E5\u30FC\u306E\u540D\u524D
core-address.number-of-bytes-per-page=\u3053\u306E\u30A2\u30C9\u30EC\u30B9\u306B\u5BFE\u3057\u3066\u5404\u30DA\u30FC\u30B8\u3067\u5229\u7528\u3055\u308C\u308B\u30D0\u30A4\u30C8\u6570
core-address.number-of-pages=\u3053\u306E\u30A2\u30C9\u30EC\u30B9\u3067\u5229\u7528\u3055\u308C\u308B\u30DA\u30FC\u30B8\u6570
core-address.binding-names=\u3053\u306E\u30A2\u30C9\u30EC\u30B9\u306B\u30D0\u30A4\u30F3\u30C9\u3055\u308C\u308B\u5168\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0 (\u30AD\u30E5\u30FC\u3068\u8FC2\u56DE) \u306E\u540D\u524D
core-address.get-roles-as-json=JSON \u30B7\u30EA\u30A2\u30EB\u5316\u3092\u4F7F\u3044\u3001\u3053\u306E\u30A2\u30C9\u30EC\u30B9\u306B\u95A2\u9023\u4ED8\u3051\u3089\u308C\u308B\u30ED\u30FC\u30EB (\u540D\u524D\u3068\u6A29\u9650) \u3092\u8FD4\u3057\u307E\u3059\u3002
core-address.get-roles-as-json.reply=\u6587\u5B57\u5217\u306E JSON \u5F62\u5F0F
queue=\u30AD\u30E5\u30FC
queue.add=\u30B3\u30A2\u30AD\u30E5\u30FC\u306E\u8FFD\u52A0\u64CD\u4F5C
queue.remove=\u65E2\u5B58\u30AD\u30E5\u30FC\u306E\u524A\u9664\u64CD\u4F5C
queue.name=\u4E00\u610F\u306E\u30AD\u30E5\u30FC\u540D
queue.queue-address=\u30AD\u30E5\u30FC\u30A2\u30C9\u30EC\u30B9\u306F\u3001\u30EB\u30FC\u30C6\u30A3\u30F3\u30B0\u30E1\u30C3\u30BB\u30FC\u30B8\u306B\u3069\u306E\u30A2\u30C9\u30EC\u30B9\u3092\u4F7F\u7528\u3059\u308B\u304B\u5B9A\u7FA9\u3057\u307E\u3059\u3002
queue.filter=\u30AD\u30E5\u30FC\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u30D5\u30A3\u30EB\u30BF\u30FC\u5B9A\u7FA9\u3002\u672A\u5B9A\u7FA9\u3042\u308B\u3044\u306F\u7A7A\u306E\u30D5\u30A3\u30EB\u30BF\u306F\u5168\u30E1\u30C3\u30BB\u30FC\u30B8\u3068\u30DE\u30C3\u30C1\u3057\u307E\u3059\u3002
queue.durable=\u30AD\u30E5\u30FC\u304C\u6C38\u7D9A\u7684\u304B\u5B9A\u7FA9\u3057\u307E\u3059\u3002
queue.id=\u30AD\u30E5\u30FC\u306E id
queue.paused=\u30AD\u30E5\u30FC\u304C\u4E00\u6642\u505C\u6B62\u3055\u308C\u308B\u304B\u3069\u3046\u304B
queue.temporary=\u30AD\u30E5\u30FC\u304C\u4E00\u6642\u7684\u306A\u3082\u306E\u304B\u3069\u3046\u304B
queue.message-count=\u3053\u306E\u30AD\u30E5\u30FC\u306B\u3042\u308B\u73FE\u5728\u30E1\u30C3\u30BB\u30FC\u30B8\u6570
queue.scheduled-count=\u3053\u306E\u30AD\u30E5\u30FC\u306B\u3042\u308B\u30B9\u30B1\u30B8\u30E5\u30FC\u30EB\u3055\u308C\u305F\u30E1\u30C3\u30BB\u30FC\u30B8\u6570
queue.consumer-count=\u3053\u306E\u30AD\u30E5\u30FC\u304B\u3089\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u6D88\u8CBB\u3059\u308B\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u6570
queue.delivering-count=\u3053\u306E\u30AD\u30E5\u30FC\u304C\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u306B\u73FE\u5728\u9001\u4FE1\u3059\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u6570
queue.messages-added=\u4F5C\u6210\u6642\u304B\u3089\u3053\u306E\u30AD\u30E5\u30FC\u306B\u8FFD\u52A0\u3055\u308C\u305F\u30E1\u30C3\u30BB\u30FC\u30B8\u6570
queue.list-scheduled-messages=\u914D\u4FE1\u304C\u4E88\u5B9A\u3055\u308C\u3066\u3044\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u4E00\u89A7
queue.list-scheduled-messages.reply=\u5404\u8981\u7D20\u304C\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u30D7\u30ED\u30D1\u30C6\u30A3\u3068\u5024\u306E\u30DE\u30C3\u30D4\u30F3\u30B0\u3068\u306A\u3063\u3066\u3044\u308B\u4E00\u89A7
queue.list-scheduled-messages-as-json=JSON \u5F62\u5F0F\u306E\u6587\u5B57\u5217\u3068\u3057\u3066\u914D\u4FE1\u304C\u4E88\u5B9A\u3055\u308C\u3066\u3044\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u4E00\u89A7\u8868\u793A
queue.list-scheduled-messages-as-json.reply=\u5404\u8981\u7D20\u304C\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u30D7\u30ED\u30D1\u30C6\u30A3\u3068\u5024\u306E\u30DE\u30C3\u30D4\u30F3\u30B0\u3068\u306A\u3063\u3066\u3044\u308B\u4E00\u89A7\u3092\u793A\u3059 JSON \u5F62\u5F0F\u306E\u6587\u5B57\u5217
queue.message.messageID=\u30E1\u30C3\u30BB\u30FC\u30B8 id
queue.message.userID=userID - \u3053\u308C\u306F\u3001\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u7279\u5B9A\u7528\u306B\u8A2D\u5B9A\u53EF\u80FD\u306A UUID \u3092\u6307\u5B9A\u3059\u308B\u30AA\u30D7\u30B7\u30E7\u30F3\u306E\u30E6\u30FC\u30B6\u30FC\u3002
queue.message.address=\u3053\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u9001\u4FE1\u5148\u30A2\u30C9\u30EC\u30B9
queue.message.type=Tmessage type. 0 \= Default; 2 \= Object; 3 \= Text; 4 \= Bytes; 5 \= Map; 6 \= Stream
queue.message.durable=\u3053\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u304C\u6C38\u7D9A\u7684\u304B\u3069\u3046\u304B
queue.message.expiration=\u3053\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u6709\u52B9\u671F\u9650
queue.message.timestamp=\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u30BF\u30A4\u30E0\u30B9\u30BF\u30F3\u30D7\u3002\u30BF\u30A4\u30E0\u30B9\u30BF\u30F3\u30D7\u306F\u3001HornetQ \u30B5\u30FC\u30D0\u30FC\u304C\u3053\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u51E6\u7406\u3059\u308B\u6642\u9593\u306B\u3042\u305F\u308A\u307E\u3059\u3002
queue.message.priority=\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u512A\u5148\u9806\u4F4D\u3002\u5024\u306F 0 (\u512A\u5148\u9806\u4F4D\u304C\u4F4E\u3044) \u304B\u3089 9 (\u512A\u5148\u9806\u4F4D\u304C\u9AD8\u3044) \u3068\u306A\u3063\u3066\u3044\u307E\u3059\u3002
queue.list-messages=\u30D5\u30A3\u30EB\u30BF\u30FC\u3068\u30DE\u30C3\u30C1\u3059\u308B\u30AD\u30E5\u30FC\u306E\u4E2D\u306B\u3042\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u3059\u3079\u3066\u4E00\u89A7\u8868\u793A
queue.list-messages.reply=\u5404\u8981\u7D20\u304C\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u30D7\u30ED\u30D1\u30C6\u30A3\u3068\u5024\u306E\u30DE\u30C3\u30D4\u30F3\u30B0\u3068\u306A\u3063\u3066\u3044\u308B\u4E00\u89A7
queue.list-messages-as-json=\u30D5\u30A3\u30EB\u30BF\u30FC\u3068\u30DE\u30C3\u30C1\u3059\u308B\u30AD\u30E5\u30FC\u306B\u3042\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u3059\u3079\u3066\u3092\u4E00\u89A7\u8868\u793A\u3057\u3001\u305D\u308C\u3089\u3092 JSON \u5F62\u5F0F\u306E\u6587\u5B57\u5217\u3067\u8FD4\u3057\u307E\u3059\u3002
queue.count-messages=\u6307\u5B9A\u306E\u30D5\u30A3\u30EB\u30BF\u30FC\u3068\u4E00\u81F4\u3059\u308B\u30AD\u30E5\u30FC\u306B\u3042\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u6570\u3092\u8FD4\u3057\u307E\u3059\u3002
queue.remove-message=\u6307\u5B9A\u306E message-id \u306B\u8A72\u5F53\u3059\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u524A\u9664\u3057\u307E\u3059\u3002
queue.remove-message.reply=\u30E1\u30C3\u30BB\u30FC\u30B8\u304C\u524A\u9664\u3055\u308C\u305F\u5834\u5408\u306F true\u3001\u305D\u3046\u3067\u306A\u3044\u5834\u5408\u306F false
queue.message-id=\u30E1\u30C3\u30BB\u30FC\u30B8 id
queue.remove-messages=\u6307\u5B9A\u306E\u30D5\u30A3\u30EB\u30BF\u30FC\u3068\u4E00\u81F4\u3059\u308B\u30C7\u30B9\u30C6\u30A3\u30CD\u30FC\u30B7\u30E7\u30F3\u304B\u3089\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u524A\u9664
queue.remove-messages.reply=\u524A\u9664\u3057\u305F\u30E1\u30C3\u30BB\u30FC\u30B8\u6570
queue.expire-message=\u6307\u5B9A\u306E message-id \u306B\u8A72\u5F53\u3059\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u5931\u52B9\u3057\u307E\u3059\u3002
queue.expire-message.reply=\u30E1\u30C3\u30BB\u30FC\u30B8\u304C\u5931\u52B9\u3057\u305F\u5834\u5408\u306F true\u3001\u305D\u3046\u3067\u306A\u3044\u5834\u5408\u306F false
queue.expire-messages=\u6307\u5B9A\u306E\u30D5\u30A3\u30EB\u30BF\u30FC\u3068\u30DE\u30C3\u30C1\u3057\u305F\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u5931\u52B9\u3057\u307E\u3059\u3002
queue.expire-messages.reply=\u5931\u52B9\u3057\u305F\u30E1\u30C3\u30BB\u30FC\u30B8\u6570
queue.send-message-to-dead-letter-address=\u6307\u5B9A\u306E message-id \u306B\u8A72\u5F53\u3059\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u3001\u3053\u306E\u30AD\u30E5\u30FC\u306E\u30C7\u30C3\u30C9\u30EC\u30BF\u30FC\u30A2\u30C9\u30EC\u30B9\u306B\u9001\u4FE1\u3057\u307E\u3059\u3002
queue.send-message-to-dead-letter-address.reply=\u30E1\u30C3\u30BB\u30FC\u30B8\u304C\u30C7\u30C3\u30C9\u30EC\u30BF\u30FC\u30A2\u30C9\u30EC\u30B9\u306B\u9001\u4FE1\u3055\u308C\u305F\u5834\u5408\u306F true\u3001\u305D\u3046\u3067\u306A\u3044\u5834\u5408\u306F false
queue.send-messages-to-dead-letter-address=\u6307\u5B9A\u306E\u30D5\u30A3\u30EB\u30BF\u30FC\u306B\u8A72\u5F53\u3059\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u3001\u3053\u306E\u30AD\u30E5\u30FC\u306E\u30C7\u30C3\u30C9\u30EC\u30BF\u30FC\u30A2\u30C9\u30EC\u30B9\u306B\u9001\u4FE1\u3057\u307E\u3059\u3002
queue.send-messages-to-dead-letter-address.reply=\u9001\u4FE1\u6E08\u307F\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u6570
queue.change-message-priority=\u6307\u5B9A\u306E message-id \u306B\u8A72\u5F53\u3059\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u512A\u5148\u9806\u4F4D\u3092\u5909\u66F4\u3057\u307E\u3059\u3002
queue.change-message-priority.new-priority=\u65B0\u3057\u3044\u512A\u5148\u9806\u4F4D (0-9)
queue.change-message-priority.reply=\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u512A\u5148\u9806\u4F4D\u304C\u5909\u66F4\u3055\u308C\u305F\u5834\u5408\u306F true\u3001\u305D\u3046\u3067\u306A\u3044\u5834\u5408\u306F false
queue.change-messages-priority=\u6307\u5B9A\u306E\u30D5\u30A3\u30EB\u30BF\u30FC\u306B\u8A72\u5F53\u3059\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u512A\u5148\u9806\u4F4D\u3092\u5909\u66F4\u3057\u307E\u3059\u3002
queue.change-messages-priority.reply=\u5909\u66F4\u3055\u308C\u305F\u30E1\u30C3\u30BB\u30FC\u30B8\u6570
queue.move-message=\u6307\u5B9A\u306E message-id \u306B\u8A72\u5F53\u3059\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u5225\u306E\u30AD\u30E5\u30FC\u306B\u79FB\u52D5\u3057\u307E\u3059\u3002
queue.move-message.other-queue-name=\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u79FB\u52D5\u5148\u30AD\u30E5\u30FC\u306E\u540D\u524D
queue.move-message.reject-duplicates=\u91CD\u8907\u30E1\u30C3\u30BB\u30FC\u30B8\u3068\u7279\u5B9A\u3055\u308C\u305F\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u62D2\u5426\u3057\u307E\u3059\u3002
queue.move-message.reply=\u30E1\u30C3\u30BB\u30FC\u30B8\u304C\u79FB\u52D5\u3055\u308C\u305F\u5834\u5408\u306F true\u3001\u305D\u3046\u3067\u306A\u3044\u5834\u5408\u306F false
queue.move-messages=\u6307\u5B9A\u306E\u30D5\u30A3\u30EB\u30BF\u30FC\u306B\u8A72\u5F53\u3059\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u5225\u306E\u30AD\u30E5\u30FC\u306B\u79FB\u52D5\u3057\u307E\u3059\u3002
queue.move-messages.reply=\u79FB\u52D5\u3057\u305F\u30E1\u30C3\u30BB\u30FC\u30B8\u6570
queue.list-message-counter=\u30E1\u30C3\u30BB\u30FC\u30B8\u30AB\u30A6\u30F3\u30BF\u30FC\u306E\u8A73\u7D30\u3092\u4E00\u89A7\u8868\u793A
queue.list-message-counter.reply=\u30E1\u30C3\u30BB\u30FC\u30B8\u30AB\u30A6\u30F3\u30BF\u30FC\u306E\u8A73\u7D30
queue.list-message-counter-as-json=JSON \u5F62\u5F0F\u306E\u6587\u5B57\u5217\u3068\u3057\u3066\u30E1\u30C3\u30BB\u30FC\u30B8\u30AB\u30A6\u30F3\u30BF\u30FC\u3092\u4E00\u89A7\u8868\u793A
queue.list-message-counter-as-json.reply=JSON \u5F62\u5F0F\u306E\u6587\u5B57\u5217
queue.list-message-counter-as-html=HTML \u5F62\u5F0F\u306E\u6587\u5B57\u5217\u3068\u3057\u3066\u30E1\u30C3\u30BB\u30FC\u30B8\u30AB\u30A6\u30F3\u30BF\u30FC\u3092\u4E00\u89A7\u8868\u793A
queue.list-message-counter-as-html.reply=HTML \u5F62\u5F0F\u306E\u6587\u5B57\u5217
queue.list-message-counter-history=\u30E1\u30C3\u30BB\u30FC\u30B8\u30AB\u30A6\u30F3\u30BF\u5C65\u6B74\u3092\u4E00\u89A7\u8868\u793A\u3057\u307E\u3059\u3002
queue.list-message-counter-history.reply=\u30E1\u30C3\u30BB\u30FC\u30B8\u30AB\u30A6\u30F3\u30BF\u30FC\u5C65\u6B74\u306E\u8A73\u7D30
queue.list-message-counter-history-as-json=JSON \u5F62\u5F0F\u306E\u6587\u5B57\u5217\u3068\u3057\u3066\u30E1\u30C3\u30BB\u30FC\u30B8\u30AB\u30A6\u30F3\u30BF\u30FC\u5C65\u6B74\u3092\u4E00\u89A7\u8868\u793A
queue.list-message-counter-history-as-json.reply=JSON \u5F62\u5F0F\u306E\u6587\u5B57\u5217
queue.list-message-counter-history-as-html=\u30E1\u30C3\u30BB\u30FC\u30B8\u30AB\u30A6\u30F3\u30BF\u5C65\u6B74\u3092\u4E00\u89A7\u8868\u793A\u3057\u307E\u3059\u3002
queue.reset-message-counter=\u30E1\u30C3\u30BB\u30FC\u30B8\u30AB\u30A6\u30F3\u30BF\u30FC\u306E\u30EA\u30BB\u30C3\u30C8
queue.pause=\u30AD\u30E5\u30FC\u306E\u4E00\u6642\u505C\u6B62
queue.resume=\u30AD\u30E5\u30FC\u306E\u518D\u958B
queue.list-consumers=\u30AD\u30E5\u30FC\u306E\u65E2\u5B58\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u3092\u3059\u3079\u3066\u4E00\u89A7\u8868\u793A
queue.list-consumers.reply=\u30AD\u30E5\u30FC\u306E\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u3092\u8AAC\u660E\u3059\u308B\u5404\u8981\u7D20\u306E\u4E00\u89A7\u3002
queue.list-consumers-as-json=JSON \u5F62\u5F0F\u306E\u6587\u5B57\u5217
queue.list-consumers-as-json.reply=JSON \u5F62\u5F0F\u306E\u6587\u5B57\u5217
broadcast-group=\u30D6\u30ED\u30FC\u30C9\u30AD\u30E3\u30B9\u30C8\u30B0\u30EB\u30FC\u30D7\u306F\u3001\u30B5\u30FC\u30D0\u30FC\u304C\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u7D4C\u7531\u3067\u30B3\u30CD\u30AF\u30BF\u30FC\u3092\u30D6\u30ED\u30FC\u30C9\u30AD\u30E3\u30B9\u30C8\u3059\u308B\u624B\u6BB5\u3067\u3059\u3002
broadcast-group.add=\u30D6\u30ED\u30FC\u30C9\u30AD\u30E3\u30B9\u30C8\u30B0\u30EB\u30FC\u30D7\u306E\u8FFD\u52A0
broadcast-group.remove=\u30D6\u30ED\u30FC\u30C9\u30AD\u30E3\u30B9\u30C8\u30B0\u30EB\u30FC\u30D7\u306E\u524A\u9664
broadcast-group.local-bind-address=\u30C7\u30FC\u30BF\u30B0\u30E9\u30E0\u30BD\u30B1\u30C3\u30C8\u306E\u30D0\u30A4\u30F3\u30C9\u5148\u3068\u306A\u308B\u30ED\u30FC\u30AB\u30EB\u306E\u30D0\u30A4\u30F3\u30C9\u30A2\u30C9\u30EC\u30B9\u3002\u8907\u6570\u306E\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u304C\u30B5\u30FC\u30D0\u30FC\u4E0A\u306B\u3042\u308B\u5834\u5408\u3001\u30D6\u30ED\u30FC\u30C9\u30AD\u30E3\u30B9\u30C8\u306B\u5229\u7528\u3057\u305F\u3044\u3082\u306E\u3092\u3053\u306E\u5C5E\u6027\u3092\u8A2D\u5B9A\u3059\u308B\u3053\u3068\u3067\u6307\u5B9A\u3057\u307E\u3059\u3002\u3053\u306E\u5C5E\u6027\u304C\u6307\u5B9A\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u3001\u30BD\u30B1\u30C3\u30C8\u304C\u30EF\u30A4\u30EB\u30C9\u30AB\u30FC\u30C9\u30A2\u30C9\u30EC\u30B9\u3001\u3064\u307E\u308A\u30AB\u30FC\u30CD\u30EB\u304C\u9078\u629E\u3059\u308B IP \u30A2\u30C9\u30EC\u30B9\u306B\u30D0\u30A4\u30F3\u30C9\u3055\u308C\u307E\u3059\u3002\u3001
broadcast-group.local-bind-port=\u30C7\u30FC\u30BF\u30B0\u30E9\u30E0\u30BD\u30B1\u30C3\u30C8\u306E\u30D0\u30A4\u30F3\u30C9\u5148\u3068\u306A\u308B\u30ED\u30FC\u30AB\u30EB\u30DD\u30FC\u30C8\u3002\u901A\u5E38\u3001\u30C7\u30D5\u30A9\u30EB\u30C8\u5024\u3067\u3042\u308B -1 \u3092\u4F7F\u3044\u307E\u3059\u3002-1 \u306F\u7121\u540D\u30DD\u30FC\u30C8\u3092\u4F7F\u3046\u3079\u304D\u3067\u3042\u308B\u3068\u6307\u5B9A\u3057\u307E\u3059\u3002\u3053\u306E\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u306F\u5E38\u306B\u3001local-bind-address \u3068\u3042\u308F\u305B\u3066\u6307\u5B9A\u3057\u307E\u3059\u3002
broadcast-group.group-address=\u30C7\u30FC\u30BF\u3092\u30D6\u30ED\u30FC\u30C9\u30AD\u30E3\u30B9\u30C8\u3059\u308B\u30DE\u30EB\u30C1\u30AD\u30E3\u30B9\u30C8\u30A2\u30C9\u30EC\u30B9\u3002224.0.0.0 \u304B\u3089 239.255.255.255 (\u5404\u5024\u3092\u542B\u3080) \u306E\u30AF\u30E9\u30B9 D IP \u30A2\u30C9\u30EC\u30B9\u3067\u3059\u3002\u30A2\u30C9\u30EC\u30B9 244.0.0.0 \u306F\u4E88\u7D04\u3055\u308C\u3066\u304A\u308A\u3001\u5229\u7528\u3067\u304D\u307E\u305B\u3093\u3002
broadcast-group.group-port=\u30D6\u30ED\u30FC\u30C9\u30AD\u30E3\u30B9\u30C8\u306B\u5229\u7528\u3059\u308B UDP \u30DD\u30FC\u30C8\u756A\u53F7
broadcast-group.broadcast-period=\u30D6\u30ED\u30FC\u30C9\u30AD\u30E3\u30B9\u30C8\u3068\u6B21\u306E\u30D6\u30ED\u30FC\u30C9\u30AD\u30E3\u30B9\u30C8\u306E\u9593\u306E\u671F\u9593 (\u30DF\u30EA\u79D2)
broadcast-group.connectors=\u30D6\u30ED\u30FC\u30C9\u30AD\u30E3\u30B9\u30C8\u3092\u884C\u3046\u30B3\u30CD\u30AF\u30BF\u30FC\u306E\u540D\u524D\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
broadcast-group.socket-binding=\u30D6\u30ED\u30FC\u30C9\u30AD\u30E3\u30B9\u30C8\u30B0\u30EB\u30FC\u30D7\u306E\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0
broadcast-group.started=\u30D6\u30ED\u30FC\u30C9\u30AD\u30E3\u30B9\u30C8\u30B0\u30EB\u30FC\u30D7\u3092\u958B\u59CB\u3059\u308B\u304B\u3069\u3046\u304B
broadcast-group.start=\u30D6\u30ED\u30FC\u30C9\u30AD\u30E3\u30B9\u30C8\u30B0\u30EB\u30FC\u30D7\u306E\u958B\u59CB
broadcast-group.stop=\u30D6\u30ED\u30FC\u30C9\u30AD\u30E3\u30B9\u30C8\u30B0\u30EB\u30FC\u30D7\u306E\u505C\u6B62
broadcast-group.get-connector-pairs-as-json=JSON \u30B7\u30EA\u30A2\u30EB\u5316\u3092\u4F7F\u3063\u3066\u30D6\u30ED\u30FC\u30C9\u30AD\u30E3\u30B9\u30C8\u30B0\u30EB\u30FC\u30D7\u304C\u30D6\u30ED\u30FC\u30C9\u30AD\u30E3\u30B9\u30C8\u3059\u308Blive-backup \u30B3\u30CD\u30AF\u30BF\u30FC\u306E\u30DA\u30A2\u3092\u8FD4\u3057\u307E\u3059\u3002
discovery-group=\u30B3\u30CD\u30AF\u30BF\u30FC\u3092\u30A2\u30CA\u30A6\u30F3\u30B9\u3059\u308B\u4ED6\u306E\u30B5\u30FC\u30D0\u30FC\u304B\u3089\u30D6\u30ED\u30FC\u30C9\u30AD\u30E3\u30B9\u30C8\u3092\u53D7\u4FE1\u3059\u308B\u305F\u3081\u306B\u30EA\u30C3\u30B9\u30F3\u3059\u308B\u30DE\u30EB\u30C1\u30AD\u30E3\u30B9\u30C8\u30B0\u30EB\u30FC\u30D7
discovery-group.add=\u30C7\u30A3\u30B9\u30AB\u30D0\u30EA\u30B0\u30EB\u30FC\u30D7\u306E\u8FFD\u52A0
discovery-group.remove=\u30C7\u30A3\u30B9\u30AB\u30D0\u30EA\u30B0\u30EB\u30FC\u30D7\u306E\u524A\u9664
discovery-group.local-bind-address=\u30C7\u30FC\u30BF\u30B0\u30E9\u30E0\u30BD\u30B1\u30C3\u30C8\u306E\u30D0\u30A4\u30F3\u30C9\u5148\u3067\u3042\u308B\u30ED\u30FC\u30AB\u30EB\u306E\u30D0\u30A4\u30F3\u30C9\u30A2\u30C9\u30EC\u30B9
discovery-group.group-address=\u30EA\u30C3\u30B9\u30F3\u3059\u308B\u30B0\u30EB\u30FC\u30D7\u306E\u30DE\u30EB\u30C1\u30AD\u30E3\u30B9\u30C8 IP \u30A2\u30C9\u30EC\u30B9
discovery-group.group-port=\u30DE\u30EB\u30C1\u30AD\u30E3\u30B9\u30C8\u30B0\u30EB\u30FC\u30D7\u306E UDP \u30DD\u30FC\u30C8
discovery-group.refresh-timeout=\u7279\u5B9A\u306E\u30B5\u30FC\u30D0\u30FC\u304B\u3089\u6700\u5F8C\u306E\u30D6\u30ED\u30FC\u30C9\u30AD\u30E3\u30B9\u30C8\u3092\u53D7\u4FE1\u3057\u3066\u304B\u3089\u4E00\u89A7\u304B\u3089\u30B5\u30FC\u30D0\u30FC\u306E\u30B3\u30CD\u30AF\u30BF\u30FC\u30DA\u30A2\u30A8\u30F3\u30C8\u30EA\u3092\u524A\u9664\u3059\u308B\u307E\u3067\u30C7\u30A3\u30AB\u30D0\u30EA\u30B0\u30EB\u30FC\u30D7\u304C\u5F85\u6A5F\u3059\u308B\u6642\u9593
discovery-group.initial-wait-timeout=\u30D6\u30ED\u30FC\u30C9\u30AD\u30E3\u30B9\u30C8\u304C\u59CB\u3081\u3066\u30AF\u30E9\u30B9\u30BF\u30FC\u306B1\u3064\u4EE5\u4E0A\u306E\u30CE\u30FC\u30C9\u3092\u63D0\u4F9B\u3059\u308B\u307E\u3067\u5F85\u6A5F\u3059\u308B\u671F\u9593 (\u30DF\u30EA\u79D2)
discovery-group.socket-binding=\u30C7\u30A3\u30B9\u30AB\u30D0\u30EA\u30B0\u30EB\u30FC\u30D7\u306E\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0
bridge=\u30D6\u30EA\u30C3\u30B8\u306E\u6A5F\u80FD\u306F\u3001\u30BD\u30FC\u30B9\u30AD\u30E5\u30FC\u304B\u3089\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u6D88\u8CBB\u3057\u3001\u901A\u5E38\u5225\u306E HornetQ \u30B5\u30FC\u30D0\u30FC\u4E0A\u306B\u3042\u308B\u5BFE\u8C61\u30A2\u30C9\u30EC\u30B9\u306B\u8EE2\u9001\u3057\u307E\u3059\u3002
bridge.add=\u30D6\u30EA\u30C3\u30B8\u306E\u8FFD\u52A0\u64CD\u4F5C
bridge.remove=\u30D6\u30EA\u30C3\u30B8\u306E\u524A\u9664\u64CD\u4F5C
bridge.queue-name=\u30D6\u30EA\u30C3\u30B8\u304C\u30B3\u30F3\u30B7\u30E5\u30FC\u30E0\u3059\u308B\u30ED\u30FC\u30AB\u30EB\u30AD\u30E5\u30FC\u306E\u4E00\u610F\u540D
bridge.forwarding-address=\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u9001\u4FE1\u5148\u3068\u306A\u308B\u5BFE\u8C61\u30B5\u30FC\u30D0\u30FC\u4E0A\u306E\u30A2\u30C9\u30EC\u30B9\u3002\u8EE2\u9001\u30A2\u30C9\u30EC\u30B9\u304C\u6307\u5B9A\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u3001\u5143\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u9001\u4FE1\u5148\u304C\u4FDD\u305F\u308C\u307E\u3059\u3002
bridge.ha=\u3053\u306E\u30D6\u30EA\u30C3\u30B8\u304C\u9AD8\u53EF\u7528\u6027\u306B\u5BFE\u5FDC\u3059\u3079\u304D\u304B\u3002True \u306F\u30AF\u30E9\u30B9\u30BF\u30FC\u5185\u3067\u5229\u7528\u53EF\u80FD\u306A\u30B5\u30FC\u30D0\u30FC\u306B\u63A5\u7D9A\u3057\u3001\u30D5\u30A7\u30A4\u30EB\u30AA\u30FC\u30D0\u30FC\u306B\u5BFE\u5FDC\u3059\u308B\u3068\u3044\u3046\u610F\u5473\u3067\u3059\u3002
bridge.filter=\u30AA\u30D7\u30B7\u30E7\u30F3\u306E\u30D5\u30A3\u30EB\u30BF\u30FC\u6587\u5B57\u5217\u3002\u6307\u5B9A\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u306F\u3001\u30D5\u30A3\u30EB\u30BF\u30FC\u8868\u73FE\u306B\u30DE\u30C3\u30C1\u3059\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u307F\u304C\u8EE2\u9001\u3055\u308C\u307E\u3059\u3002\u30D5\u30A3\u30EB\u30BF\u30FC\u306E\u6587\u5B57\u5217\u306FHornetQ \u6587\u66F8\u3067\u8AAC\u660E\u3055\u308C\u3066\u3044\u308B HornetQ \u30D5\u30A3\u30EB\u30BF\u30FC\u8868\u73FE\u306E\u69CB\u6587\u306B\u5F93\u3044\u307E\u3059\u3002
bridge.transformer-class-name=user-defined \u30AF\u30E9\u30B9\u540D\u3067\u3001org.hornetq.core.server.cluster.Transformer \u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u3092\u5B9F\u88C5\u3057\u307E\u3059\u3002
bridge.retry-interval=\u5BFE\u8C61\u30B5\u30FC\u30D0\u30FC\u3078\u306E\u63A5\u7D9A\u306B\u5931\u6557\u3057\u305F\u5834\u5408\u3001\u518D\u63A5\u7D9A\u3092\u8A66\u884C\u3057\u3066\u304B\u3089\u6B21\u306E\u8A66\u884C\u307E\u3067\u306E\u671F\u9593 (\u30DF\u30EA\u79D2)\u3002
bridge.retry-interval-multiplier=\u6B21\u306E\u518D\u8A66\u884C\u307E\u3067\u306E\u6642\u9593\u3092\u7B97\u51FA\u3059\u308B\u305F\u3081\u306B\u6700\u5F8C\u306E\u518D\u8A66\u884C\u304B\u3089\u306E\u6642\u9593\u3092\u9069\u7528\u3059\u308B\u4E57\u6570\u3002\u3053\u308C\u306B\u3088\u308A\u5404\u518D\u8A66\u884C\u306E\u9593\u306E\u518D\u9001\u671F\u9593\u3092\u7B97\u51FA\u3059\u308B\u65B9\u6CD5\u3092\u5B9F\u88C5\u3059\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u3059\u3002
bridge.reconnect-attempts=\u4E2D\u65AD\u3001\u7D42\u4E86\u3059\u308B\u307E\u3048\u306B\u30D6\u30EA\u30C3\u30B8\u304C\u518D\u8A66\u884C\u3092\u884C\u3046\u5408\u8A08\u6570\u3002-1 \u306F\u7121\u5236\u9650\u306B\u518D\u8A66\u884C\u3092\u884C\u3044\u307E\u3059\u3002
bridge.failover-on-server-shutdown=\u5BFE\u8C61\u30B5\u30FC\u30D0\u30FC\u304C\u30AF\u30E9\u30C3\u30B7\u30E5\u3059\u308B\u306E\u3067\u306F\u306A\u304F\u3001\u30AF\u30EA\u30FC\u30F3\u306B\u30B7\u30E3\u30C3\u30C8\u30C0\u30A6\u30F3\u3057\u305F\u5834\u5408\u306B\u3001\u30D6\u30EA\u30C3\u30B8\u304C\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u30B5\u30FC\u30D0\u30FC (\u6307\u5B9A\u3055\u308C\u3066\u3044\u308B\u5834\u5408) \u3078\u30D5\u30A7\u30A4\u30EB\u30AA\u30FC\u30D0\u30FC\u3092\u8A66\u884C\u3059\u308B\u304B\u3069\u3046\u304B
bridge.use-duplicate-detection=\u30D6\u30EA\u30C3\u30B8\u304C\u8EE2\u9001\u3059\u308B\u5404\u30E1\u30C3\u30BB\u30FC\u30B8\u306B\u81EA\u52D5\u7684\u306B id \u30D7\u30ED\u30D1\u30C6\u30A3\u3092\u633F\u5165\u3059\u308B\u304B\u3069\u3046\u304B
bridge.confirmation-window-size=\u5BFE\u8C61\u30CE\u30FC\u30C9\u306B\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u8EE2\u9001\u3059\u308B\u306E\u306B\u4F7F\u3046\u63A5\u7D9A\u306B\u5229\u7528\u3059\u308B confirmation-window-size 
bridge.user=\u30EA\u30E2\u30FC\u30C8\u30B5\u30FC\u30D0\u30FC\u3078\u306E\u30D6\u30EA\u30C3\u30B8\u63A5\u7D9A\u306E\u4F5C\u6210\u6642\u306B\u4F7F\u3046\u30E6\u30FC\u30B6\u30FC\u540D\u3002\u6307\u5B9A\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u3001\u30EB\u30FC\u30C8\u30E1\u30C3\u30BB\u30FC\u30B8\u30F3\u30B0\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u30EA\u30BD\u30FC\u30B9\u306E clustrer-user \u5C5E\u6027\u3067\u6307\u5B9A\u3055\u308C\u308B\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u30AF\u30E9\u30B9\u30BF\u30FC\u30E6\u30FC\u30B6\u30FC\u3092\u5229\u7528\u3057\u307E\u3059\u3002
bridge.password=\u30EA\u30E2\u30FC\u30C8\u30B5\u30FC\u30D0\u30FC\u3078\u306E\u30D6\u30EA\u30C3\u30B8\u63A5\u7D9A\u3092\u4F5C\u6210\u6642\u306B\u4F7F\u3046\u30D1\u30B9\u30EF\u30FC\u30C9\u3002\u6307\u5B9A\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u3001\u30EB\u30FC\u30C8\u30E1\u30C3\u30BB\u30FC\u30B8\u30F3\u30B0\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u30EA\u30BD\u30FC\u30B9\u306Ecluster-password \u5C5E\u6027\u3067\u6307\u5B9A\u3055\u308C\u308B\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u30AF\u30E9\u30B9\u30BF\u30FC\u30D1\u30B9\u30EF\u30FC\u30C9\u3092\u5229\u7528\u3057\u307E\u3059\u3002
bridge.static-connectors=\u3053\u306E\u30D6\u30EA\u30C3\u30B8\u304C\u4F7F\u3046\u30B3\u30CD\u30AF\u30BF\u30FC\u3092\u9759\u7684\u306B\u5B9A\u7FA9\u3059\u308B\u540D\u524D\u306E\u4E00\u89A7\u3002'discovery-group-name' \u304C\u5B9A\u7FA9\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u3001\u672A\u5B9A\u7FA9 (null) \u3067\u306A\u3051\u308C\u3070\u306A\u308A\u307E\u305B\u3093\u3002
bridge.discovery-group-name=\u3053\u306E\u30D6\u30EA\u30C3\u30B8\u304C\u4F7F\u3046\u30C7\u30A3\u30AB\u30D0\u30EA\u30B0\u30EB\u30FC\u30D7\u540D\u3002'static-connectors' \u304C\u5B9A\u7FA9\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u3001\u672A\u5B9A\u7FA9 (null) \u3067\u306A\u3051\u308C\u3070\u306A\u308A\u307E\u305B\u3093\u3002
bridge.started=\u30D6\u30EA\u30C3\u30B8\u3092\u958B\u59CB\u3059\u308B\u304B\u3069\u3046\u304B
bridge.start=\u30D6\u30EA\u30C3\u30B8\u3092\u958B\u59CB\u3057\u307E\u3059\u3002
bridge.stop=\u30D6\u30EA\u30C3\u30B8\u3092\u505C\u6B62\u3057\u307E\u3059\u3002
divert=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u306E\u30ED\u30B8\u30C3\u30AF\u306B\u5909\u66F4\u3092\u52A0\u3048\u308B\u3053\u3068\u306A\u304F\u3001\u3042\u308B\u30A2\u30C9\u30EC\u30B9\u3092\u5225\u306E\u30A2\u30C9\u30EC\u30B9\u306B\u30EB\u30FC\u30C6\u30A3\u30F3\u30B0\u3059\u308B\u3088\u3046\u900F\u660E\u7684\u306B\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u8FC2\u56DE\u53EF\u80FD\u306B\u3059\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u30F3\u30B0\u30EA\u30BD\u30FC\u30B9\u3002
divert.add=\u8FC2\u56DE\u306E\u8FFD\u52A0\u64CD\u4F5C
divert.remove=\u8FC2\u56DE\u306E\u524A\u9664\u64CD\u4F5C
divert.routing-name=\u8FC2\u56DE\u306E\u30EB\u30FC\u30C6\u30A3\u30F3\u30B0\u540D
divert.divert-address=\u8FC2\u56DE\u5143\u306E\u30A2\u30C9\u30EC\u30B9
divert.forwarding-address=\u8FC2\u56DE\u5148\u306E\u30A2\u30C9\u30EC\u30B9
divert.filter=\u30AA\u30D7\u30B7\u30E7\u30F3\u306E\u30D5\u30A3\u30EB\u30BF\u30FC\u6587\u5B57\u5217\u3002\u6307\u5B9A\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u306F\u3001\u30D5\u30A3\u30EB\u30BF\u30FC\u8868\u73FE\u306B\u30DE\u30C3\u30C1\u3059\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u307F\u304C\u8FC2\u56DE\u3055\u308C\u307E\u3059\u3002\u30D5\u30A3\u30EB\u30BF\u30FC\u306E\u6587\u5B57\u5217\u306FHornetQ \u6587\u66F8\u3067\u8AAC\u660E\u3055\u308C\u3066\u3044\u308B HornetQ \u30D5\u30A3\u30EB\u30BF\u30FC\u8868\u73FE\u306E\u69CB\u6587\u306B\u5F93\u3044\u307E\u3059\u3002
divert.exclusive=\u8FC2\u56DE\u304C\u6392\u4ED6\u7684\u304B\u3069\u3046\u304B\u3002\u3064\u307E\u308A\u3001\u30E1\u30C3\u30BB\u30FC\u30B8\u304C\u65B0\u898F\u30A2\u30C9\u30EC\u30B9\u306B\u8FC2\u56DE\u3055\u308C\u3001\u53E4\u3044\u30A2\u30C9\u30EC\u30B9\u306B\u306F\u9032\u307E\u306A\u3044\u3068\u3044\u3046\u610F\u5473\u3067\u3059\u3002
divert.transformer-class-name=\u8FC2\u56DE\u524D\u306B\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u30DC\u30C7\u30A3\u3042\u308B\u3044\u306F\u30D7\u30ED\u30D1\u30C6\u30A3\u3092\u5909\u63DB\u3059\u308B\u306E\u306B\u5229\u7528\u3059\u308B\u30AF\u30E9\u30B9\u540D
cluster-connection.add=\u30AF\u30E9\u30B9\u30BF\u30FC\u63A5\u7D9A\u306E\u8FFD\u52A0\u64CD\u4F5C
cluster-connection.remove=\u30AF\u30E9\u30B9\u30BF\u30FC\u63A5\u7D9A\u306E\u524A\u9664\u64CD\u4F5C
cluster-connection.cluster-connection-address=\u5404\u30AF\u30E9\u30B9\u30BF\u30FC\u63A5\u7D9A\u306F\u3001\u3053\u306E\u5024\u3067\u59CB\u307E\u308B\u30A2\u30C9\u30EC\u30B9\u3078\u9001\u4FE1\u3055\u308C\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u306B\u306E\u307F\u9069\u7528\u3055\u308C\u307E\u3059\u3002
cluster-connection.connector-ref=\u5BFE\u8C61\u30CE\u30FC\u30C9\u306B\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u8EE2\u9001\u3059\u308B\u306E\u306B\u4F7F\u3046\u63A5\u7D9A\u306B\u5229\u7528\u3059\u308B confirmation-window-size 
cluster-connection.retry-interval=\u5BFE\u8C61\u30B5\u30FC\u30D0\u30FC\u3078\u306E\u63A5\u7D9A\u306B\u5931\u6557\u3057\u305F\u5834\u5408\u3001\u5BFE\u8C61\u30B5\u30FC\u30D0\u30FC\u3078\u306E\u518D\u63A5\u7D9A\u3092\u8A66\u884C\u3057\u3066\u304B\u3089\u6B21\u306E\u8A66\u884C\u307E\u3067\u306E\u671F\u9593 (\u30DF\u30EA\u79D2)\u3002
cluster-connection.use-duplicate-detection=\u30D6\u30EA\u30C3\u30B8\u304C\u8EE2\u9001\u3059\u308B\u5404\u30E1\u30C3\u30BB\u30FC\u30B8\u306B\u81EA\u52D5\u7684\u306B id \u30D7\u30ED\u30D1\u30C6\u30A3\u3092\u633F\u5165\u3059\u308B\u304B\u3069\u3046\u304B
cluster-connection.forward-when-no-consumers=\u4ED6\u306E\u30CE\u30FC\u30C9\u3067\u4E00\u81F4\u3059\u308B\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u304C\u3042\u308B\u304B\u3001\u306A\u3044\u304B\u306B\u62D8\u308F\u3089\u305A\u3001\u30E1\u30C3\u30BB\u30FC\u30B8\u304C\u30AF\u30E9\u30B9\u30BF\u30FC\u306E\u307B\u304B\u306E\u30CE\u30FC\u30C9\u3068\u306E\u9593\u3067\u30E9\u30A6\u30F3\u30C9\u30ED\u30D3\u30F3\u3067\u5206\u6563\u3055\u308C\u308B\u304B\u3069\u3046\u304B\u3002\u3053\u308C\u304C false (\u30C7\u30D5\u30A9\u30EB\u30C8) \u306B\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u3001\u8EE2\u9001\u5148\u306E\u30A2\u30C9\u30EC\u30B9\u306B\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u306E\u30AD\u30E5\u30FC\u304C\u3042\u308C\u3070\u3001HornetQ \u306F\u30AF\u30E9\u30B9\u30BF\u30FC\u306E\u307B\u304B\u306E\u30CE\u30FC\u30C9\u306B\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u8EE2\u9001\u3059\u308B\u3060\u3051\u3067\u3059\u3002\u307E\u305F\u3001\u3053\u308C\u3089\u306E\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u306B\u30E1\u30C3\u30BB\u30FC\u30B8\u30D5\u30A3\u30EB\u30BF\u30FC (\u30BB\u30EC\u30AF\u30BF\u30FC) \u304C\u3042\u308B\u5834\u5408\u306F\u3001\u5C11\u306A\u304F\u3068\u3082\u3053\u308C\u3089\u306E\u30BB\u30EC\u30AF\u30BF\u30FC\u306E1\u3064\u304C\u305D\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u3068\u4E00\u81F4\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
cluster-connection.max-hops=\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u8EE2\u9001\u53EF\u80FD\u306A\u6700\u5927\u56DE\u6570\u3002HornetQ \u3092\u8A2D\u5B9A\u3057\u3001\u30CE\u30FC\u30C9\u306B\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u8CA0\u8377\u5206\u6563\u3082\u884C\u3044\u307E\u3059\u3002\u3053\u306E\u30CE\u30FC\u30C9\u306F\u30C1\u30A7\u30FC\u30F3\u306E\u4EF2\u4ECB\u3068\u3057\u3066\u4ED6\u306E HornetQ \u30B5\u30FC\u30D0\u30FC\u3068\u9593\u63A5\u7684\u306B\u306E\u307F\u63A5\u7D9A\u3055\u308C\u308B\u3053\u3068\u3082\u3042\u308A\u307E\u3059\u3002
cluster-connection.confirmation-window-size=\u5BFE\u8C61\u30CE\u30FC\u30C9\u306B\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u8EE2\u9001\u3059\u308B\u306E\u306B\u4F7F\u3046\u63A5\u7D9A\u306B\u5229\u7528\u3059\u308B confirmation-window-size 
cluster-connection.static-connectors=\u3053\u306E\u30AF\u30E9\u30B9\u30BF\u30FC\u63A5\u7D9A\u304C\u63A5\u7D9A\u3059\u308B\u5148\u3092\u9759\u7684\u306B\u5B9A\u7FA9\u3057\u305F\u30B3\u30CD\u30AF\u30BF\u30FC\u4E00\u89A7\u3002'discovery-group-name' \u304C\u5B9A\u7FA9\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u3001\u672A\u5B9A\u7FA9 (null) \u3067\u306A\u3051\u308C\u3070\u306A\u308A\u307E\u305B\u3093\u3002
cluster-connection.allow-direct-connections-only=\u9014\u4E2D\u306B\u30CE\u30FC\u30C9\u304C\uFF11\u3064\u4EE5\u4E0A\u4ECB\u3059\u308B\u3053\u3068\u3092\u30CE\u30FC\u30C9\u304C\u628A\u63E1\u3059\u308B\u5834\u5408\u306F\u3001\u30AF\u30E9\u30B9\u30BF\u30FC\u306E\u76F4\u63A5\u63A5\u7D9A\u306B\u30D6\u30EA\u30C3\u30B8\u306F\u4F5C\u6210\u3057\u307E\u305B\u3093\u3002'static-connectors' \u304C\u5B9A\u7FA9\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u306B\u306E\u307F\u8A72\u5F53\u3057\u307E\u3059\u3002
cluster-connection.discovery-group-name=\u30AF\u30E9\u30B9\u30BF\u30FC\u306E\u63A5\u7D9A\u5148\u3068\u306A\u308B\u30AF\u30E9\u30B9\u30BF\u30FC\u3067\u4ED6\u306E\u30B5\u30FC\u30D0\u30FC\u4E00\u89A7\u3092\u53D6\u5F97\u3059\u308B\u305F\u3081\u306B\u5229\u7528\u3059\u308B\u30C7\u30A3\u30B9\u30AB\u30D0\u30EA\u30B0\u30EB\u30FC\u30D7\u3002'static-connectors' \u304C\u5B9A\u7FA9\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u306F\u672A\u5B9A\u7FA9 (null) \u3067\u306A\u3051\u308C\u3070\u306A\u308A\u307E\u305B\u3093\u3002
cluster-connection.node-id=\u3053\u306E\u30AF\u30E9\u30B9\u30BF\u30FC\u63A5\u7D9A\u306B\u3088\u308A\u4F7F\u7528\u3055\u308C\u308B\u30CE\u30FC\u30C9 ID
cluster-connection.get-nodes=\u30B3\u30CD\u30AF\u30BF\u30FC\u63A5\u7D9A\u306B\u63A5\u7D9A\u3059\u308B\u30CE\u30FC\u30C9\u306E\u30DE\u30C3\u30D7\u3092\u8FD4\u3057\u307E\u3059\u3002\u3053\u3053\u3067\u306F\u3001\u30AD\u30FC\u304C\u30CE\u30FC\u30C9 ID \u3067\u3001\u5024\u306F\u30CE\u30FC\u30C9\u306B\u63A5\u7D9A\u3059\u308B\u969B\u306B\u5229\u7528\u3059\u308B\u30A2\u30C9\u30EC\u30B9\u3068\u306A\u3063\u3066\u3044\u307E\u3059\u3002
cluster-connection.get-nodes.reply=\u30AD\u30FC\u304C\u30CE\u30FC\u30C9 ID \u3068\u306A\u3063\u3066\u3044\u308B\u30DE\u30C3\u30D7\u3001\u5024\u306F\u30CE\u30FC\u30C9\u306B\u63A5\u7D9A\u3059\u308B\u969B\u306B\u5229\u7528\u3059\u308B\u30A2\u30C9\u30EC\u30B9\u3067\u3059\u3002
cluster-connection.get-static-connectors-as-json=JSON \u5F62\u5F0F\u306E\u6587\u5B57\u5217\u3068\u3057\u3066\u9759\u7684\u30B3\u30CD\u30AF\u30BF\u30FC\u306E\u4E00\u89A7\u3092\u8FD4\u3057\u307E\u3059\u3002
cluster-connection.started=\u30AF\u30E9\u30B9\u30BF\u30FC\u63A5\u7D9A\u3092\u958B\u59CB\u3059\u308B\u304B\u3069\u3046\u304B
cluster-connection.start=\u30AF\u30E9\u30B9\u30BF\u30FC\u63A5\u7D9A\u306E\u958B\u59CB
cluster-connection.stop=\u30AF\u30E9\u30B9\u30BF\u30FC\u63A5\u7D9A\u306E\u505C\u6B62
connector-service=TODO
connector-service.add=\u30B3\u30CD\u30AF\u30BF\u30FC\u30B5\u30FC\u30D3\u30B9\u306E\u8FFD\u52A0\u64CD\u4F5C
connector-service.remove=\u30B3\u30CD\u30AF\u30BF\u30FC\u30B5\u30FC\u30D3\u30B9\u306E\u524A\u9664\u64CD\u4F5C
connector-service.factory-class=\u30B3\u30CD\u30AF\u30BF\u30FC\u30B5\u30FC\u30D3\u30B9\u3092\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u5316\u53EF\u80FD\u306A\u30D5\u30A1\u30AF\u30C8\u30EA\u30AF\u30E9\u30B9\u306E\u30AF\u30E9\u30B9\u540D
connector-service.param=\u30B3\u30CD\u30AF\u30BF\u30FC\u30B5\u30FC\u30D3\u30B9\u306E factory-class \u306B\u3088\u308A\u7406\u89E3\u3055\u308C\u308B key/value \u30DA\u30A2
connector-service.param.add=\u30B3\u30CD\u30AF\u30BF\u30FC\u30B5\u30FC\u30D3\u30B9\u306E factory-class \u306B\u3088\u308A\u7406\u89E3\u3055\u308C\u308B key/value \u30DA\u30A2\u3092\u8FFD\u52A0
connector-service.param.remove=\u30B3\u30CD\u30AF\u30BF\u30FC\u30B5\u30FC\u30D3\u30B9\u306E factory-class \u306B\u3088\u308A\u7406\u89E3\u3055\u308C\u308B key/value \u30DA\u30A2\u3092\u524A\u9664
connector-service.param.value=\u30B3\u30CD\u30AF\u30BF\u30FC\u30B5\u30FC\u30D3\u30B9\u306E factory-class \u306B\u3088\u308A\u7406\u89E3\u3055\u308C\u308B key/value \u30DA\u30A2\u306E\u5024\u306E\u4E00\u90E8
factory-class=\u30D5\u30A1\u30AF\u30C8\u30EA\u30AF\u30E9\u30B9
jndi-binding=JNDI \u5411\u3051\u306E\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u540D
jms=JMS \u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u306E\u8A2D\u5B9A
jms.connection-factories=JMS \u63A5\u7D9A\u30D5\u30A1\u30AF\u30C8\u30EA
jms.queues=JMS \u30AD\u30E5\u30FC
jms.topics=JMS \u30C8\u30D4\u30C3\u30AF\u30B9
jms.pooled-connection-factories=\u7BA1\u7406\u3055\u308C\u3066\u3044\u308B JMS \u63A5\u7D9A\u30D5\u30A1\u30AF\u30C8\u30EA
jms.add=jms \u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u306E\u8FFD\u52A0
jms-queue=JMS \u30AD\u30E5\u30FC\u306E\u5B9A\u7FA9
jms-queue.add=JMS \u30AD\u30E5\u30FC\u306E\u8FFD\u52A0
jms-queue.remove=JMS \u30AD\u30E5\u30FC\u306E\u524A\u9664
jms-queue.entries=\u30AD\u30E5\u30FC\u306E\u30D0\u30A4\u30F3\u30C9\u5148\u3068\u306A\u308B jndi \u540D
jms-queue.selector=\u30AD\u30E5\u30FC\u30BB\u30EC\u30AF\u30BF\u30FC
jms-queue.durable=\u30AD\u30E5\u30FC\u304C\u6C38\u7D9A\u7684\u304B\u3069\u3046\u304B
jms-queue.queue-address=\u30AD\u30E5\u30FC\u30A2\u30C9\u30EC\u30B9\u306F\u3001\u30EB\u30FC\u30C6\u30A3\u30F3\u30B0\u30E1\u30C3\u30BB\u30FC\u30B8\u306B\u3069\u306E\u30A2\u30C9\u30EC\u30B9\u3092\u4F7F\u7528\u3059\u308B\u304B\u5B9A\u7FA9\u3057\u307E\u3059\u3002
jms-queue.expiry-address=\u5931\u52B9\u3057\u305F\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u9001\u4FE1\u5148\u30A2\u30C9\u30EC\u30B9
jms-queue.dead-letter-address=\u30C7\u30C3\u30C9\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u9001\u4FE1\u5148\u30A2\u30C9\u30EC\u30B9
jms-queue.paused=\u30AD\u30E5\u30FC\u304C\u4E00\u6642\u505C\u6B62\u3055\u308C\u308B\u304B\u3069\u3046\u304B
jms-queue.temporary=\u30AD\u30E5\u30FC\u304C\u4E00\u6642\u7684\u306A\u3082\u306E\u304B\u3069\u3046\u304B
jms-queue.message-count=\u3053\u306E\u30AD\u30E5\u30FC\u306B\u3042\u308B\u73FE\u5728\u30E1\u30C3\u30BB\u30FC\u30B8\u6570
jms-queue.scheduled-count=\u3053\u306E\u30AD\u30E5\u30FC\u306B\u3042\u308B\u30B9\u30B1\u30B8\u30E5\u30FC\u30EB\u3055\u308C\u305F\u30E1\u30C3\u30BB\u30FC\u30B8\u6570
jms-queue.consumer-count=\u3053\u306E\u30AD\u30E5\u30FC\u304B\u3089\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u6D88\u8CBB\u3059\u308B\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u6570
jms-queue.delivering-count=\u3053\u306E\u30AD\u30E5\u30FC\u304C\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u306B\u73FE\u5728\u9001\u4FE1\u3059\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u6570
jms-queue.messages-added=\u4F5C\u6210\u6642\u304B\u3089\u3053\u306E\u30AD\u30E5\u30FC\u306B\u8FFD\u52A0\u3055\u308C\u305F\u30E1\u30C3\u30BB\u30FC\u30B8\u6570
jms-queue.add-jndi=\u30AD\u30E5\u30FC\u3092\u5225\u306E JNDI \u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u306B\u8FFD\u52A0
jms-queue.message.JMSPriority=\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u512A\u5148\u9806\u4F4D
jms-queue.message.JMSTimestamp=\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u30BF\u30A4\u30E0\u30B9\u30BF\u30F3\u30D7 (\u30A8\u30DD\u30C3\u30AF\u304B\u3089\u306E\u30DF\u30EA\u79D2)
jms-queue.message.JMSExpiration=\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u5931\u52B9\u6642\u9593
jms-queue.message.JMSDeliveryMode=\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u914D\u4FE1\u30E2\u30FC\u30C9 (PERSISTENT\u3001NON_PERSISTENT)
jms-queue.message.JMSMessageID=\u30E1\u30C3\u30BB\u30FC\u30B8 id
jms-topic=JMS \u30C8\u30D4\u30C3\u30AF\u306E\u5B9A\u7FA9
jms-topic.add=JMS \u30C8\u30D4\u30C3\u30AF\u306E\u8FFD\u52A0
jms-topic.remove=JMS \u30C8\u30D4\u30C3\u30AF\u306E\u524A\u9664
jms-topic.entries=\u30C8\u30D4\u30C3\u30AF\u306E\u30D0\u30A4\u30F3\u30C9\u5148\u3068\u306A\u308B jndi \u540D
jms-topic.topic-address=\u30C8\u30D4\u30C3\u30AF\u306E\u53C2\u7167\u5148\u30A2\u30C9\u30EC\u30B9
jms-topic.temporary=\u30C8\u30D4\u30C3\u30AF\u304C\u4E00\u6642\u7684\u306A\u3082\u306E\u304B\u3069\u3046\u304B
jms-topic.message-count=\u3053\u306E\u30AD\u30E5\u30FC\u306B\u3042\u308B\u73FE\u5728\u30E1\u30C3\u30BB\u30FC\u30B8\u6570
jms-topic.delivering-count=\u3053\u306E\u30AD\u30E5\u30FC\u304C\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u306B\u73FE\u5728\u9001\u4FE1\u3059\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u6570
jms-topic.messages-added=\u4F5C\u6210\u6642\u304B\u3089\u3053\u306E\u30AD\u30E5\u30FC\u306B\u8FFD\u52A0\u3055\u308C\u305F\u30E1\u30C3\u30BB\u30FC\u30B8\u6570
jms-topic.durable-message-count=\u3053\u306E\u30C8\u30D4\u30C3\u30AF\u306E\u6C38\u7D9A\u30B5\u30D6\u30B9\u30AF\u30E9\u30A4\u30D0\u30FC\u3059\u3079\u3066\u306B\u5BFE\u3059\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u6570
jms-topic.non-durable-message-count=\u3053\u306E\u30C8\u30D4\u30C3\u30AF\u306E\u975E\u6C38\u7D9A\u30B5\u30D6\u30B9\u30AF\u30E9\u30A4\u30D0\u30FC\u3059\u3079\u3066\u306B\u5BFE\u3059\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u6570
jms-topic.subscription-count=\u3053\u306E\u30C8\u30D4\u30C3\u30AF\u306E (\u6C38\u7D9A\u3042\u308B\u3044\u306F\u975E\u6C38\u7D9A) \u30B5\u30D6\u30B9\u30AF\u30E9\u30A4\u30D0\u30FC\u6570
jms-topic.durable-subscription-count=\u3053\u306E\u30C8\u30D4\u30C3\u30AF\u306E\u6C38\u7D9A\u30B5\u30D6\u30B9\u30AF\u30E9\u30A4\u30D0\u30FC\u6570
jms-topic.non-durable-subscription-count=\u3053\u306E\u30C8\u30D4\u30C3\u30AF\u306E\u975E\u6C38\u7D9A\u30B5\u30D6\u30B9\u30AF\u30E9\u30A4\u30D0\u30FC\u6570
jms-topic.list-all-subscriptions=\u5168\u30B5\u30D6\u30B9\u30AF\u30EA\u30D7\u30B7\u30E7\u30F3\u3092\u4E00\u89A7\u8868\u793A
jms-topic.list-all-subscriptions.reply=\u5358\u4E00\u30B5\u30D6\u30B9\u30AF\u30EA\u30D7\u30B7\u30E7\u30F3\u3092\u8AAC\u660E\u3059\u308B\u5404\u8981\u7D20\u306E\u4E00\u89A7\u3002
jms-topic.list-all-subscriptions-as-json=JSON \u5F62\u5F0F\u306E\u6587\u5B57\u5217\u3068\u3057\u3066\u5168\u30B5\u30D6\u30B9\u30AF\u30EA\u30D7\u30B7\u30E7\u30F3\u3092\u4E00\u89A7\u8868\u793A
jms-topic.list-all-subscriptions-as-json.reply=JSON \u5F62\u5F0F\u306E\u6587\u5B57\u5217
jms-topic.list-durable-subscriptions=\u6C38\u7D9A\u30B5\u30D6\u30B9\u30AF\u30EA\u30D7\u30B7\u30E7\u30F3\u306E\u307F\u3092\u4E00\u89A7\u8868\u793A
jms-topic.list-durable-subscriptions.reply=\u5358\u4E00\u30B5\u30D6\u30B9\u30AF\u30EA\u30D7\u30B7\u30E7\u30F3\u3092\u8AAC\u660E\u3059\u308B\u5404\u8981\u7D20\u306E\u4E00\u89A7\u3002
jms-topic.list-durable-subscriptions-as-json=JSON \u5F62\u5F0F\u306E\u6587\u5B57\u5217\u3068\u3057\u3066\u6C38\u7D9A\u30B5\u30D6\u30B9\u30AF\u30EA\u30D7\u30B7\u30E7\u30F3\u306E\u307F\u3092\u4E00\u89A7\u8868\u793A
jms-topic.list-non-durable-subscriptions=\u975E\u6C38\u7D9A\u30B5\u30D6\u30B9\u30AF\u30EA\u30D7\u30B7\u30E7\u30F3\u306E\u307F\u3092\u4E00\u89A7\u8868\u793A
jms-topic.list-non-durable-subscriptions.reply=\u5358\u4E00\u30B5\u30D6\u30B9\u30AF\u30EA\u30D7\u30B7\u30E7\u30F3\u3092\u8AAC\u660E\u3059\u308B\u5404\u8981\u7D20\u306E\u4E00\u89A7\u3002
jms-topic.list-non-durable-subscriptions-as-json=JSON \u5F62\u5F0F\u306E\u6587\u5B57\u5217\u3068\u3057\u3066\u975E\u6C38\u7D9A\u30B5\u30D6\u30B9\u30AF\u30EA\u30D7\u30B7\u30E7\u30F3\u306E\u307F\u3092\u4E00\u89A7\u8868\u793A
jms-topic.list-subscriptions.queueName=\u30AD\u30E5\u30FC\u306E\u30D5\u30EB\u30CD\u30FC\u30E0
jms-topic.list-subscriptions.clientID=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8 id
jms-topic.list-subscriptions.selector=\u30AD\u30E5\u30FC\u30BB\u30EC\u30AF\u30BF\u30FC
jms-topic.list-subscriptions.name=\u30AD\u30E5\u30FC\u306E\u540D\u524D
jms-topic.list-subscriptions.durable=\u30AD\u30E5\u30FC\u304C\u6C38\u7D9A\u7684\u304B\u3069\u3046\u304B
jms-topic.list-subscriptions.messageCount=\u3053\u306E\u30AD\u30E5\u30FC\u306B\u3042\u308B\u73FE\u5728\u30E1\u30C3\u30BB\u30FC\u30B8\u6570
jms-topic.list-subscriptions.deliveringCount=\u3053\u306E\u30AD\u30E5\u30FC\u304C\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u306B\u73FE\u5728\u9001\u4FE1\u3059\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u6570
jms-topic.list-subscriptions.consumers=\u30AD\u30E5\u30FC\u306E\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC
jms-topic.list-subscriptions.consumers.consumerID=\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC id
jms-topic.list-subscriptions.consumers.connectionID=\u63A5\u7D9A id
jms-topic.list-subscriptions.consumers.sessionID=\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u306E\u30BB\u30C3\u30B7\u30E7\u30F3 id
jms-topic.list-subscriptions.consumers.browseOnly=\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u306F\u30AD\u30E5\u30FC\u306E\u53C2\u7167\u306E\u307F\u3092\u884C\u3046\u304B\u3069\u3046\u304B
jms-topic.list-subscriptions.consumers.creationTime=\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u304C\u4F5C\u6210\u3055\u308C\u305F\u6642\u9593 (\u30A8\u30DD\u30C3\u30AF\u304B\u3089\u306E\u30DF\u30EA\u79D2)
jms-topic.list-messages-for-subscription=\u6307\u5B9A\u306E\u30B5\u30D6\u30B9\u30AF\u30EA\u30D7\u30B7\u30E7\u30F3\u306B\u95A2\u3059\u308B\u5168\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u4E00\u89A7\u8868\u793A
jms-topic.list-messages-for-subscription.queue-name=\u30B5\u30D6\u30B9\u30AF\u30EA\u30D7\u30B7\u30E7\u30F3\u3092\u8868\u3059\u30AD\u30E5\u30FC\u306E\u540D\u524D
jms-topic.list-messages-for-subscription.reply=\u5404\u8981\u7D20\u304C\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u30D7\u30ED\u30D1\u30C6\u30A3\u3068\u5024\u306E\u30DE\u30C3\u30D4\u30F3\u30B0\u3068\u306A\u3063\u3066\u3044\u308B\u4E00\u89A7
jms-topic.list-messages-for-subscription-as-json=JSON \u5F62\u5F0F\u306E\u6587\u5B57\u5217\u3068\u3057\u3066\u6307\u5B9A\u306E\u30B5\u30D6\u30B9\u30AF\u30EA\u30D7\u30B7\u30E7\u30F3\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u3059\u3079\u3066\u4E00\u89A7\u8868\u793A
jms-topic.count-messages-for-subscription=\u6307\u5B9A\u306E\u30B5\u30D6\u30B9\u30AF\u30EA\u30D7\u30B7\u30E7\u30F3\u306B\u5BFE\u3059\u308B\u30D5\u30A3\u30EB\u30BF\u30FC\u3068\u30DE\u30C3\u30C1\u3059\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u6570\u3092\u30AB\u30A6\u30F3\u30C8
jms-topic.client-id=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8 ID
jms-topic.subscription-name=\u6C38\u7D9A\u30B5\u30D6\u30B9\u30AF\u30EA\u30D7\u30B7\u30E7\u30F3\u540D
jms-topic.filter=JMS \u30E1\u30C3\u30BB\u30FC\u30B8\u30D5\u30A3\u30EB\u30BF\u30FC
jms-topic.drop-durable-subscription=\u6C38\u7D9A\u30B5\u30D6\u30B9\u30AF\u30EA\u30D7\u30B7\u30E7\u30F3\u3092\u505C\u6B62
jms-topic.drop-all-subscriptions=\u3053\u306E\u30C8\u30D4\u30C3\u30AF\u304B\u3089\u306E\u30B5\u30D6\u30B9\u30AF\u30EA\u30D7\u30B7\u30E7\u30F3\u3092\u3059\u3079\u3066\u505C\u6B62
jms-topic.add-jndi=\u30AD\u30E5\u30FC\u3092\u5225\u306E JNDI \u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u306B\u8FFD\u52A0
transport-config.param=\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC
transport-config.param.value=\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u306E\u5024
transport-config.param.add=\u65B0\u898F\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u306E\u8FFD\u52A0\u64CD\u4F5C
transport-config.param.remove=\u65E2\u5B58\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u306E\u524A\u9664\u64CD\u4F5C
transport-config.param.optional=\u4EFB\u610F\u306E\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC
connection-factory=\u63A5\u7D9A\u30D5\u30A1\u30AF\u30C8\u30EA\u306E\u5B9A\u7FA9
connection-factory.add=\u63A5\u7D9A\u30D5\u30A1\u30AF\u30C8\u30EA\u306E\u8FFD\u52A0
connection-factory.remove=\u63A5\u7D9A\u30D5\u30A1\u30AF\u30C8\u30EA\u306E\u524A\u9664
connection-factory.factory-type=\u63A5\u7D9A\u30D5\u30A1\u30AF\u30C8\u30EA\u306E\u578B\u3002 0 \= jms cf, 1 \= queue cf, 2 \= topic cf, 3 \= xa cf, 4 \= xa queue cf, 5 \= xa topic cf
connection-factory.initial-message-packet-size=\u3053\u306E\u30D5\u30A1\u30AF\u30C8\u30EA\u7D4C\u7531\u3067\u4F5C\u6210\u3055\u308C\u305F\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u521D\u671F\u30B5\u30A4\u30BA
pooled-connection-factory=\u7BA1\u7406\u63A5\u7D9A\u30D5\u30A1\u30AF\u30C8\u30EA\u306E\u5B9A\u7FA9
pooled-connection-factory.add=\u7BA1\u7406\u63A5\u7D9A\u30D5\u30A1\u30AF\u30C8\u30EA\u306E\u8FFD\u52A0
pooled-connection-factory.remove=\u7BA1\u7406\u63A5\u7D9A\u30D5\u30A1\u30AF\u30C8\u30EA\u306E\u524A\u9664
connection-factory.auto-group=\u81EA\u52D5\u3067\u30E1\u30C3\u30BB\u30FC\u30B8\u5206\u985E\u3092\u5229\u7528\u3059\u308B\u304B\u3069\u3046\u304B
connection-factory.block-on-acknowledge=True \u306F\u78BA\u8A8D\u3092\u30D6\u30ED\u30C3\u30AF\u3059\u308B\u3088\u3046\u306B\u8A2D\u5B9A\u3057\u307E\u3059\u3002
connection-factory.block-on-durable-send=True \u306F\u6C38\u7D9A\u9001\u4FE1\u3092\u30D6\u30ED\u30C3\u30AF\u3059\u308B\u3088\u3046\u8A2D\u5B9A\u3057\u307E\u3059\u3002
connection-factory.block-on-non-durable-send=True \u306F\u975E\u6C38\u7D9A\u9001\u4FE1\u3092\u30D6\u30ED\u30C3\u30AF\u3059\u308B\u3088\u3046\u8A2D\u5B9A\u3057\u307E\u3059\u3002
connection-factory.cache-large-message-client=True \u306F\u5927\u5BB9\u91CF\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u30AD\u30E3\u30C3\u30B7\u30E5\u3057\u307E\u3059\u3002
connection-factory.call-timeout=\u547C\u3073\u51FA\u3057\u306E\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8
connection-factory.client-failure-check-period=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306E\u554F\u984C\u78BA\u8A8D\u671F\u9593
connection-factory.client-id=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8 id
connection-factory.compress-large-messages=\u5927\u5BB9\u91CF\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u5727\u7E2E\u3059\u3079\u304D\u304B\u3069\u3046\u304B
connection-factory.confirmation-window-size=\u78BA\u8A8D\u30A6\u30A3\u30F3\u30C9\u30A6\u30B5\u30A4\u30BA
connection-factory.connection-factory=\u63A5\u7D9A\u30D5\u30A1\u30AF\u30C8\u30EA\u306E\u5B9A\u7FA9
connection-factory.connection-ttl=\u63A5\u7D9A ttl
connection-factory.connector=\u30B3\u30CD\u30AF\u30BF\u30FC\u306E\u5B9A\u7FA9\u3002\u5024\u3068\u3057\u3066\u4FDD\u5B58\u3055\u308C\u308B\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u30B3\u30CD\u30AF\u30BF\u30FC\u3001\u3042\u308B\u3044\u306F\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u30B3\u30CD\u30AF\u30BF\u30FC\u304C\u306A\u3044\u5834\u5408\u306F\u672A\u5B9A\u7FA9\u306E\u5024\u3068\u5408\u308F\u305B\u3066\u3001\u30B3\u30CD\u30AF\u30BF\u30FC\u540D\u3067\u30DE\u30C3\u30D7\u5185\u306B\u4FDD\u5B58\u3055\u308C\u307E\u3059\u3002
connection-factory.consumer-max-rate=\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u306E\u6700\u5927\u30EC\u30FC\u30C8
connection-factory.consumer-window-size=\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u306E\u30A6\u30A3\u30F3\u30C9\u30A6\u30B5\u30A4\u30BA
connection-factory.discovery-group-name=\u30C7\u30A3\u30B9\u30AB\u30D0\u30EA\u306E\u30B0\u30EB\u30FC\u30D7\u540D
connection-factory.discovery-initial-wait-timeout=\u30C7\u30A3\u30B9\u30AB\u30D0\u30EA\u306E\u521D\u671F\u5F85\u6A5F\u6642\u9593\u306E\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8
connection-factory.dups-ok-batch-size=dups ok batch size
connection-factory.entries=\u63A5\u7D9A\u30D5\u30A1\u30AF\u30C8\u30EA\u306E\u30D0\u30A4\u30F3\u30C9\u5148\u306B\u306A\u308B\u3079\u304D jndi \u540D
connection-factory.failover-on-initial-connection=True \u306F\u521D\u671F\u63A5\u7D9A\u6642\u306B\u30D5\u30A7\u30FC\u30EB\u30AA\u30FC\u30D0\u30FC\u3057\u307E\u3059\u3002
connection-factory.failover-on-server-shutdown=True \u306F\u30B5\u30FC\u30D0\u30FC\u306E\u30B7\u30E3\u30C3\u30C8\u30C0\u30A6\u30F3\u6642\u306B\u30D5\u30A7\u30FC\u30EB\u30AA\u30FC\u30D0\u30FC\u3057\u307E\u3059\u3002
connection-factory.group-id=\u30B0\u30EB\u30FC\u30D7 id
connection-factory.ha=\u63A5\u7D9A\u30D5\u30A1\u30AF\u30C8\u30EA\u304C\u9AD8\u53EF\u7528\u6027\u3092\u30B5\u30DD\u30FC\u30C8\u3059\u308B\u304B\u3069\u3046\u304B
connection-factory.connection-load-balancing-policy-class-name=\u30AF\u30E9\u30B9\u30BF\u30FC\u5185\u306E\u69D8\u3005\u306A\u30CE\u30FC\u30C9\u306E\u9593\u3067\u30BB\u30C3\u30B7\u30E7\u30F3\u306E\u8CA0\u8377\u5206\u6563\u3092\u884C\u3046\u969B\u306B\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u304C\u5229\u7528\u53EF\u80FD\u306A\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u5074\u306E\u8CA0\u8377\u5206\u6563\u30DD\u30EA\u30B7\u30FC\u3092\u5B9F\u88C5\u3059\u308B\u30AF\u30E9\u30B9\u540D\u3002
connection-factory.max-retry-interval=\u518D\u8A66\u884C\u306E\u6700\u5927\u9593\u9694
connection-factory.min-large-message-size=\u5927\u5BB9\u91CF\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u6700\u5C0F\u30B5\u30A4\u30BA
connection-factory.pre-acknowledge=True \u306F\u4E8B\u524D\u78BA\u8A8D\u3092\u884C\u3044\u307E\u3059\u3002
connection-factory.producer-max-rate=\u30D7\u30ED\u30C7\u30E5\u30FC\u30B5\u30FC\u306E\u6700\u5927\u30EC\u30FC\u30C8
connection-factory.producer-window-size=\u30D7\u30ED\u30C7\u30E5\u30FC\u30B5\u30FC\u306E\u30A6\u30A3\u30F3\u30C9\u30A6\u30B5\u30A4\u30BA
connection-factory.reconnect-attempts=\u518D\u63A5\u7D9A\u8A66\u884C
connection-factory.retry-interval=\u518D\u8A66\u884C\u306E\u9593\u9694
connection-factory.retry-interval-multiplier=\u518D\u8A66\u884C\u9593\u9694\u306E\u4E57\u6570
connection-factory.scheduled-thread-pool-max-size=\u4E88\u7D04\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u306E\u6700\u5927\u30B5\u30A4\u30BA
connection-factory.thread-pool-max-size=\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u306E\u6700\u5927\u30B5\u30A4\u30BA
connection-factory.transaction-batch-size=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u306E\u30D0\u30C3\u30C1\u30B5\u30A4\u30BA
connection-factory.use-global-pools=True \u306F\u30B0\u30ED\u30FC\u30D0\u30EB\u30D7\u30FC\u30EB\u3092\u4F7F\u3044\u307E\u3059\u3002
connection-factory.add-jndi=\u30D5\u30A1\u30AF\u30C8\u30EA\u3092\u5225\u306E JNDI \u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u306B\u8FFD\u52A0
pooled-connection-factory.auto-group=autogroup
pooled-connection-factory.block-on-acknowledge=True \u306F\u78BA\u8A8D\u3092\u30D6\u30ED\u30C3\u30AF\u3059\u308B\u3088\u3046\u306B\u8A2D\u5B9A\u3057\u307E\u3059\u3002
pooled-connection-factory.block-on-durable-send=True \u306F\u6C38\u7D9A\u9001\u4FE1\u3092\u30D6\u30ED\u30C3\u30AF\u3059\u308B\u3088\u3046\u8A2D\u5B9A\u3057\u307E\u3059\u3002
pooled-connection-factory.block-on-non-durable-send=True \u306F\u975E\u6C38\u7D9A\u9001\u4FE1\u3092\u30D6\u30ED\u30C3\u30AF\u3059\u308B\u3088\u3046\u8A2D\u5B9A\u3057\u307E\u3059\u3002
pooled-connection-factory.cache-large-message-client=True \u306F\u5927\u5BB9\u91CF\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u30AD\u30E3\u30C3\u30B7\u30E5\u3057\u307E\u3059\u3002
pooled-connection-factory.call-timeout=\u547C\u3073\u51FA\u3057\u306E\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8
pooled-connection-factory.client-failure-check-period=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306E\u554F\u984C\u78BA\u8A8D\u671F\u9593
pooled-connection-factory.client-id=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8 id
pooled-connection-factory.confirmation-window-size=\u78BA\u8A8D\u30A6\u30A3\u30F3\u30C9\u30A6\u30B5\u30A4\u30BA
pooled-connection-factory.connection-factory=\u63A5\u7D9A\u30D5\u30A1\u30AF\u30C8\u30EA\u306E\u5B9A\u7FA9
pooled-connection-factory.connection-ttl=\u63A5\u7D9A ttl
pooled-connection-factory.connector=\u30B3\u30CD\u30AF\u30BF\u30FC\u306E\u5B9A\u7FA9\u3002\u5024\u3068\u3057\u3066\u4FDD\u5B58\u3055\u308C\u308B\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u30B3\u30CD\u30AF\u30BF\u30FC\u3001\u3042\u308B\u3044\u306F\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u30B3\u30CD\u30AF\u30BF\u30FC\u304C\u306A\u3044\u5834\u5408\u306F\u672A\u5B9A\u7FA9\u306E\u5024\u3068\u5408\u308F\u305B\u3066\u3001\u30B3\u30CD\u30AF\u30BF\u30FC\u540D\u3067\u30DE\u30C3\u30D7\u5185\u306B\u4FDD\u5B58\u3055\u308C\u307E\u3059\u3002
pooled-connection-factory.consumer-max-rate=\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u306E\u6700\u5927\u30EC\u30FC\u30C8
pooled-connection-factory.consumer-window-size=\u30B3\u30F3\u30B7\u30E5\u30FC\u30DE\u30FC\u306E\u30A6\u30A3\u30F3\u30C9\u30A6\u30B5\u30A4\u30BA
pooled-connection-factory.discovery-group-name=\u30C7\u30A3\u30B9\u30AB\u30D0\u30EA\u306E\u30B0\u30EB\u30FC\u30D7\u540D
pooled-connection-factory.discovery-initial-wait-timeout=\u30C7\u30A3\u30B9\u30AB\u30D0\u30EA\u306E\u521D\u671F\u5F85\u6A5F\u6642\u9593\u306E\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8
pooled-connection-factory.dups-ok-batch-size=dups ok batch size
pooled-connection-factory.entries=\u63A5\u7D9A\u30D5\u30A1\u30AF\u30C8\u30EA\u306E\u30D0\u30A4\u30F3\u30C9\u5148\u306B\u306A\u308B\u3079\u304D jndi \u540D
pooled-connection-factory.failover-on-initial-connection=True \u306F\u521D\u671F\u63A5\u7D9A\u6642\u306B\u30D5\u30A7\u30FC\u30EB\u30AA\u30FC\u30D0\u30FC\u3057\u307E\u3059\u3002
pooled-connection-factory.failover-on-server-shutdown=True \u306F\u30B5\u30FC\u30D0\u30FC\u306E\u30B7\u30E3\u30C3\u30C8\u30C0\u30A6\u30F3\u6642\u306B\u30D5\u30A7\u30FC\u30EB\u30AA\u30FC\u30D0\u30FC\u3057\u307E\u3059\u3002
pooled-connection-factory.group-id=\u30B0\u30EB\u30FC\u30D7 id
pooled-connection-factory.ha=\u63A5\u7D9A\u30D5\u30A1\u30AF\u30C8\u30EA\u304C\u9AD8\u53EF\u7528\u6027\u3092\u30B5\u30DD\u30FC\u30C8\u3059\u308B\u304B\u3069\u3046\u304B
pooled-connection-factory.connection-load-balancing-policy-class-name=\u30AF\u30E9\u30B9\u30BF\u30FC\u5185\u306E\u69D8\u3005\u306A\u30CE\u30FC\u30C9\u306E\u9593\u3067\u30BB\u30C3\u30B7\u30E7\u30F3\u306E\u8CA0\u8377\u5206\u6563\u3092\u884C\u3046\u969B\u306B\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u304C\u5229\u7528\u53EF\u80FD\u306A\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u5074\u306E\u8CA0\u8377\u5206\u6563\u30DD\u30EA\u30B7\u30FC\u3092\u5B9F\u88C5\u3059\u308B\u30AF\u30E9\u30B9\u540D\u3002
pooled-connection-factory.max-retry-interval=\u518D\u8A66\u884C\u306E\u6700\u5927\u9593\u9694
pooled-connection-factory.min-large-message-size=\u5927\u5BB9\u91CF\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u6700\u5C0F\u30B5\u30A4\u30BA
pooled-connection-factory.pre-acknowledge=True \u306F\u4E8B\u524D\u78BA\u8A8D\u3092\u884C\u3044\u307E\u3059\u3002
pooled-connection-factory.producer-max-rate=\u30D7\u30ED\u30C7\u30E5\u30FC\u30B5\u30FC\u306E\u6700\u5927\u30EC\u30FC\u30C8
pooled-connection-factory.producer-window-size=\u30D7\u30ED\u30C7\u30E5\u30FC\u30B5\u30FC\u306E\u30A6\u30A3\u30F3\u30C9\u30A6\u30B5\u30A4\u30BA
pooled-connection-factory.reconnect-attempts=\u518D\u63A5\u7D9A\u8A66\u884C
pooled-connection-factory.retry-interval=\u518D\u8A66\u884C\u306E\u9593\u9694
pooled-connection-factory.retry-interval-multiplier=\u518D\u8A66\u884C\u9593\u9694\u306E\u4E57\u6570
pooled-connection-factory.scheduled-thread-pool-max-size=\u4E88\u7D04\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u306E\u6700\u5927\u30B5\u30A4\u30BA
pooled-connection-factory.thread-pool-max-size=\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u306E\u6700\u5927\u30B5\u30A4\u30BA
pooled-connection-factory.transaction-batch-size=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u306E\u30D0\u30C3\u30C1\u30B5\u30A4\u30BA
pooled-connection-factory.use-global-pools=True \u306F\u30B0\u30ED\u30FC\u30D0\u30EB\u30D7\u30FC\u30EB\u3092\u4F7F\u3044\u307E\u3059\u3002
pooled-connection-factory.use-jndi=JNDI \u3092\u4F7F\u3044\u53D7\u4FE1\u63A5\u7D9A\u306E\u30C7\u30B9\u30C6\u30A3\u30CD\u30FC\u30B7\u30E7\u30F3\u3092\u7A81\u304D\u6B62\u3081\u307E\u3059\u3002
pooled-connection-factory.jndi-params=\u53D7\u4FE1\u63A5\u7D9A\u306E\u30C7\u30B9\u30C6\u30A3\u30CD\u30FC\u30B7\u30E7\u30F3\u3092\u7A81\u304D\u6B62\u3081\u308B\u305F\u3081\u306B\u5229\u7528\u3059\u308BJNDI \u30D1\u30E9\u30E1\u30FC\u30BF\u30FC
pooled-connection-factory.use-local-tx=\u53D7\u4FE1\u30BB\u30C3\u30B7\u30E7\u30F3\u306B\u30ED\u30FC\u30AB\u30EB\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u3092\u5229\u7528
pooled-connection-factory.user=\u3053\u306E\u63A5\u7D9A\u30D5\u30A1\u30AF\u30C8\u30EA\u3068\u3042\u308F\u305B\u3066\u5229\u7528\u3059\u308B\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u30E6\u30FC\u30B6\u30FC\u540D\u3002\u3053\u308C\u306F\u3001\u63A5\u7D9A\u30D5\u30A1\u30AF\u30C8\u30EA\u304C\u30EA\u30E2\u30FC\u30C8\u30DB\u30B9\u30C8\u3092\u53C2\u7167\u3057\u3066\u3044\u308B\u5834\u5408\u306B\u306E\u307F\u5FC5\u8981\u3067\u3059\u3002
pooled-connection-factory.password=\u3053\u306E\u63A5\u7D9A\u30D5\u30A1\u30AF\u30C8\u30EA\u3068\u3042\u308F\u305B\u3066\u5229\u7528\u3059\u308B\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u30D1\u30B9\u30EF\u30FC\u30C9\u3002\u3053\u308C\u306F\u3001\u63A5\u7D9A\u30D5\u30A1\u30AF\u30C8\u30EA\u304C\u30EA\u30E2\u30FC\u30C8\u30DB\u30B9\u30C8\u3092\u53C2\u7167\u3057\u3066\u3044\u308B\u5834\u5408\u306B\u306E\u307F\u5FC5\u8981\u3067\u3059\u3002
pooled-connection-factory.setup-attempts=MDB \u30A8\u30F3\u30C9\u30DD\u30A4\u30F3\u30C8\u3092\u8A2D\u5B9A\u3059\u308B\u56DE\u6570
pooled-connection-factory.setup-interval=MDB \u30A8\u30F3\u30C9\u30DD\u30A4\u30F3\u30C8\u306E\u8A2D\u5B9A\u3092\u8A66\u884C\u3059\u308B\u969B\u306E\u9593\u9694
pooled-connection-factory.transaction=TODO
server-id=\u30B5\u30FC\u30D0\u30FC id
security-setting=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u8A2D\u5B9A\u3067\u3001\u30A2\u30C9\u30EC\u30B9\u3092\u30D9\u30FC\u30B9\u306B\u30AD\u30E5\u30FC\u306B\u5BFE\u3057\u3066\u6A29\u9650\u3092\u5B9A\u7FA9\u3059\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u3059\u3002
security-setting.add=\u65B0\u898F\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u8A2D\u5B9A\u3092\u8FFD\u52A0
security-setting.remove=\u65E2\u5B58\u306E\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u8A2D\u5B9A\u3092\u524A\u9664
security-role=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30ED\u30FC\u30EB
security-role.add=\u65B0\u898F\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30ED\u30FC\u30EB\u306E\u8FFD\u52A0
security-role.remove=\u65E2\u5B58\u306E\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30ED\u30FC\u30EB\u3092\u524A\u9664
security-role.name=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30ED\u30FC\u30EB\u540D
security-role.send=\u3053\u306E\u6A29\u9650\u306B\u3088\u308A\u3001\u30E6\u30FC\u30B6\u30FC\u304C\u4E00\u81F4\u3059\u308B\u30A2\u30C9\u30EC\u30B9\u306B\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u9001\u4FE1\u3059\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u3059\u3002
security-role.consume=\u3053\u306E\u6A29\u9650\u306B\u3088\u308A\u3001\u30E6\u30FC\u30B6\u30FC\u304C\u4E00\u81F4\u3059\u308B\u30A2\u30C9\u30EC\u30B9\u304C\u30D0\u30A4\u30F3\u30C9\u3055\u308C\u3066\u3044\u308B\u30AD\u30E5\u30FC\u304B\u3089\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u30B3\u30F3\u30B7\u30E5\u30FC\u30E0\u3067\u304D\u308B\u3088\u3046\u306B\u306A\u308A\u307E\u3059\u3002
security-role.create-durable-queue=\u3053\u306E\u6A29\u9650\u306B\u3088\u308A\u30E6\u30FC\u30B6\u30FC\u306F\u6C38\u7D9A\u30AD\u30E5\u30FC\u3092\u4F5C\u6210\u3067\u304D\u307E\u3059\u3002
security-role.delete-durable-queue=\u3053\u306E\u6A29\u9650\u306B\u3088\u308A\u30E6\u30FC\u30B6\u30FC\u306F\u6C38\u7D9A\u30AD\u30E5\u30FC\u3092\u524A\u9664\u3067\u304D\u307E\u3059\u3002
security-role.create-non-durable-queue=\u3053\u306E\u6A29\u9650\u306B\u3088\u308A\u30E6\u30FC\u30B6\u30FC\u306F\u4E00\u6642\u7684\u306A\u30AD\u30E5\u30FC\u3092\u4F5C\u6210\u3067\u304D\u307E\u3059\u3002
security-role.delete-non-durable-queue=\u3053\u306E\u6A29\u9650\u306B\u3088\u308A\u30E6\u30FC\u30B6\u30FC\u306F\u4E00\u6642\u7684\u306A\u30AD\u30E5\u30FC\u3092\u524A\u9664\u3067\u304D\u307E\u3059\u3002
security-role.manage=\u3053\u306E\u6A29\u9650\u306B\u3088\u308A\u30E6\u30FC\u30B6\u30FC\u306F\u3001\u7BA1\u7406\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u7BA1\u7406\u30A2\u30C9\u30EC\u30B9\u306B\u9001\u4FE1\u3059\u308B\u3053\u3068\u3067\u3001\u7BA1\u7406\u64CD\u4F5C\u3092\u547C\u3073\u51FA\u3059\u3053\u3068\u304C\u3067\u304D\u307E\u3059\u3002
socket-binding=\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u53C2\u7167
deployed=\u3053\u306E\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u306B\u542B\u307E\u308C\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u30F3\u30B0\u30EA\u30BD\u30FC\u30B9\u306B\u3088\u308A\u516C\u958B\u3055\u308C\u308B\u30E9\u30F3\u30BF\u30A4\u30E0\u30EA\u30BD\u30FC\u30B9
