domain=Der Root-Knoten des Management-Modells auf der Domain-Ebene.
domain.extension=Eine Liste von Erweiterungsmodulen.
domain.path=Eine Liste benannter Dateisystem-Pfade. Die Pfade k\u00F6nnen vollst\u00E4ndig festgelegt sein oder nicht (d.h. die tats\u00E4chlichen Pfade beinhalten).
domain.profile=Eine Liste von in der Domain verf\u00FCgbaren Profilen
domain.interface=Eine Liste von in der Domain verf\u00FCgbaren benannten Netzwerk-Interface. Die Interfaces k\u00F6nnen vollst\u00E4ndig festgelegt sein oder nicht (d.h. die Kriterien zur Bestimmung der IP-Adresse beinhalten).
domain.socket-binding-group=Eine Liste von in der Domain verf\u00FCgbaren Socket-Binding-Gruppen
domain.system-properties=Eine Liste von an allen Servern in der Domain einzustellenden System-Properties. 
domain.system-property=Eine an allen Servern in der Domain einzustellende System-Property. 
domain.deployment=Eine Liste von in der Domain verf\u00FCgbaren Deployments
domain.server-group=Eine Liste von in der Domain verf\u00FCgbaren Servergruppen
domain.local-host-name=Der Name des lokal laufenden Host-Controllers.
domain.host=Aktuell in der Domain laufende Host-Controller
domain.process-type=Der Prozesstyp, der von dieser Root-Ressource repr\u00E4sentiert wird. Entweder "Domain Controller" oder "Host Controller".
domain.release-version=Die Version der JBoss Application Server Release, die auf dem Host-Controller l\u00E4uft, der als Domain-Controller fungiert.
domain.release-codename=Der Codename der JBoss Application Server Release, die auf dem Host-Controller l\u00E4uft, der als Domain-Controller fungiert.
domain.product-name=Der Name des JBoss AS basierten Produkts, das auf dem Host-Controller l\u00E4uft, der als Domain-Controller fungiert.
domain.product-version=Die Version der JBoss AS basierten Produkt-Release, das auf dem Host-Controller l\u00E4uft, der als Domain-Controller fungiert.
domain.management-major-version=Die Hauptversion des JBoss AS Management-Interface, das vom Host-Controller, der als Domain-Controller fungiert, bereitgestellt wird.
domain.management-minor-version=Die Nebenversion des JBoss AS Management-Interface, das vom Host-Controller, der als Domain-Controller fungiert, bereitgestellt wird.
domain.deployment.remove=Entfernen eines Deployments von der Liste der in der Domain verf\u00FCgbaren Inhalte. Das Deployment darf derzeit nicht zu Servergruppen zugewiesen sein.
domain.servers.restart=Startet alle aktuell in der Domain laufenden Server neu.
domain.servers.start=Startet alle konfigurierten Server in der Domain, die zum aktuellen Zeitpunkt nicht laufen. 
domain.servers.stop=Stoppt alle aktuell in der Domain laufenden Server.
server-group=Die Servergruppen-Konfiguration.
server-group.add=Hinzuf\u00FCgen einer neuen Servergruppe.
server-group.add.jvm=Der jvm-Name.
server-group.remove=Entfernen einer bestehenden Servergruppe.
server-group.profile=Der Profilname.
server-group.jvm=Die benannte jvm.
server-group.socket-binding-group=Die standardm\u00E4\u00DFig verwendete Socket-Binding-Gruppe f\u00FCr mit dieser Gruppe assoziierten Server. 
server-group.socket-binding-port-offset=Der Standard-Offset, der auf die Port-Werte aufgeschlagen wird, die von der Socket-Binding-Gruppe angegeben sind.
server-group.management-subsystem-endpoint=Setzen Sie dies auf 'true', damit die Server in der Servergruppe sich mit dem Host-Controller r\u00FCckverbinden unter Verwendung des Endpunkts von ihrem Remoting-Untersystem. Damit dies funktionieren kann, muss dieses Untersystem vorhanden sein.
server-group.deployment=Eine Liste von in der Servergruppe verf\u00FCgbaren Deployments.
server-group.system-properties=Eine Liste von an allen Servern in dieser Servergruppe  einzustellenden Systemeigenschaften. 
server-group.system-property=Eine an allen Servern in dieser Servergruppe einzustellende Systemeigenschaften. 
server-group.deployment.remove=Entfernen eines Deployments von der Liste der auf Servern in der Gruppe verf\u00FCgbaren Inhalte. Falls das Deployment derzeit in Laufzeitsystemen bereitgestellt wird, wird diese Bereitstellung zun\u00E4chst zur\u00FCckgenommen.
server-group.servers.restart=Startet alle Server neu, die zu der Servergruppe geh\u00F6ren, die aktuell in der Domain l\u00E4uft.
domain.resolve-expression-on-domain.expression=Der aufzul\u00F6sende Ausdruck.
