domain=\u57DF\u7EA7\u7BA1\u7406\u6A21\u578B\u7684\u6839\u8282\u70B9\u3002
domain.extension=\u6269\u5C55\u6A21\u5757\u5217\u8868\u3002
domain.path=\u547D\u540D\u6587\u4EF6\u7CFB\u7EDF\u8DEF\u5F84\u7684\u5217\u8868\u3002\u8FD9\u4E9B\u8DEF\u5F84\u53EF\u80FD\u4E5F\u53EF\u80FD\u4E0D\u662F\u662F\u5168\u9650\u5B9A\u7684\uFF08\u4E5F\u5C31\u662F\u5305\u542B\u5B9E\u9645\u7684\u8DEF\u5F84\uFF09\u3002
domain.profile=\u8FD9\u4E2A\u57DF\u91CC\u53EF\u7528\u7684\u914D\u7F6E\u96C6\u7684\u5217\u8868\u3002
domain.interface=\u8FD9\u4E2A\u57DF\u91CC\u7684\u53EF\u7528\u7F51\u7EDC\u63A5\u53E3\u5217\u8868\u3002\u8FD9\u4E9B\u63A5\u53E3\u53EF\u80FD\u4E5F\u53EF\u80FD\u4E0D\u662F\u5168\u9650\u5B9A\u7684\uFF08\u4E5F\u5C31\u662F\u5305\u542B\u4E86\u51B3\u5B9A IP \u5730\u5740\u7684\u6807\u51C6\uFF09\u3002
domain.socket-binding-group=\u8FD9\u4E2A\u57DF\u91CC\u53EF\u7528\u7684\u5957\u63A5\u5B57\u7ED1\u5B9A\u7EC4\u7684\u5217\u8868\u3002
domain.system-properties=\u5728\u8FD9\u4E2A\u57DF\u91CC\u7684\u6240\u6709\u670D\u52A1\u5668\u4E0A\u8BBE\u7F6E\u7684\u7CFB\u7EDF\u5C5E\u6027\u7684\u5217\u8868\u3002
domain.system-property=\u5728\u8FD9\u4E2A\u57DF\u91CC\u7684\u6240\u6709\u670D\u52A1\u5668\u4E0A\u8BBE\u7F6E\u7684\u7CFB\u7EDF\u5C5E\u6027\u3002
domain.deployment=\u8FD9\u4E2A\u57DF\u91CC\u53EF\u7528\u90E8\u7F72\u7684\u5217\u8868\u3002
domain.server-group=\u8FD9\u4E2A\u57DF\u91CC\u53EF\u7528\u7684\u670D\u52A1\u5668\u7EC4\u7684\u5217\u8868\u3002
domain.local-host-name=\u5728\u672C\u5730\u8FD0\u884C\u7684\u4E3B\u673A\u63A7\u5236\u5668\u7684\u540D\u79F0\u3002
domain.host=\u5F53\u524D\u8FD0\u884C\u5728\u8FD9\u4E2A\u57DF\u91CC\u7684\u4E3B\u673A\u63A7\u5236\u5668\u3002
domain.process-type=\u8FD9\u4E2A\u6839\u8D44\u6E90\u4EE3\u8868\u7684\u8FDB\u7A0B\u7684\u7C7B\u578B\u3002\u4E3A "Domain Controller" \u6216 "Host Controller"\u3002
domain.release-version=\u5145\u5F53\u57DF\u63A7\u5236\u5668\u7684\u4E3B\u673A\u63A7\u5236\u5668\u8FD0\u884C\u7684 JBoss AS \u7684\u7248\u672C\u3002
domain.release-codename=\u5145\u5F53\u57DF\u63A7\u5236\u5668\u7684\u4E3B\u673A\u63A7\u5236\u5668\u8FD0\u884C\u7684 JBoss AS \u7684\u4EE3\u53F7\u3002
domain.product-name=\u5145\u5F53\u57DF\u63A7\u5236\u5668\u7684\u4E3B\u673A\u63A7\u5236\u5668\u8FD0\u884C\u7684\u57FA\u4E8E JBoss AS \u7684\u4EA7\u54C1\u7684\u540D\u79F0\u3002
domain.product-version=\u5145\u5F53\u57DF\u63A7\u5236\u5668\u7684\u4E3B\u673A\u63A7\u5236\u5668\u8FD0\u884C\u7684\u57FA\u4E8E JBoss AS \u7684\u4EA7\u54C1\u7684\u7248\u672C\u3002
domain.management-major-version=\u5145\u5F53\u57DF\u63A7\u5236\u5668\u7684\u4E3B\u673A\u63A7\u5236\u5668\u63D0\u4F9B\u7684 JBoss AS \u7BA1\u7406\u63A5\u53E3\u7684\u4E3B\u8981\u7248\u672C\u3002
domain.management-minor-version=\u5145\u5F53\u57DF\u63A7\u5236\u5668\u7684\u4E3B\u673A\u63A7\u5236\u5668\u63D0\u4F9B\u7684 JBoss AS \u7BA1\u7406\u63A5\u53E3\u7684\u6B21\u8981\u7248\u672C\u3002
domain.deployment.remove=\u4ECE\u57DF\u91CC\u53EF\u7528\u7684\u5185\u5BB9\u5217\u8868\u91CC\u5220\u9664\u90E8\u7F72\u3002\u8FD9\u4E2A\u90E8\u7F72\u76EE\u524D\u4E0D\u80FD\u6620\u5C04\u5230\u4EFB\u4F55\u670D\u52A1\u5668\u7EC4\u3002
domain.servers.restart=\u91CD\u542F\u5F53\u524D\u8FD0\u884C\u5728\u57DF\u91CC\u7684\u6240\u6709\u670D\u52A1\u5668\u3002
domain.servers.start=\u542F\u52A8\u8FD9\u4E2A\u57DF\u91CC\u76EE\u524D\u672A\u8FD0\u884C\u7684\u6240\u6709\u5DF2\u914D\u7F6E\u7684\u670D\u52A1\u5668\u3002
domain.servers.stop=\u505C\u6B62\u5F53\u524D\u8FD0\u884C\u5728\u57DF\u91CC\u7684\u6240\u6709\u670D\u52A1\u5668\u3002
server-group=\u670D\u52A1\u5668\u7EC4\u7684\u914D\u7F6E\u3002
server-group.add=\u6DFB\u52A0\u4E00\u4E2A\u65B0\u7684\u670D\u52A1\u5668\u7EC4\u3002
server-group.add.jvm=JVM \u7684\u540D\u79F0\u3002
server-group.remove=\u5220\u9664\u73B0\u6709\u7684\u65B0\u670D\u52A1\u5668\u7EC4\u3002
server-group.profile=\u914D\u7F6E\u96C6\u7684\u540D\u79F0\u3002
server-group.jvm=\u547D\u540D\u7684 JVM\u3002
server-group.socket-binding-group=\u7528\u4E8E\u548C\u8FD9\u4E2A\u7EC4\u5173\u8054\u7684\u670D\u52A1\u5668\u7684\u9ED8\u8BA4\u5957\u63A5\u5B57\u7ED1\u5B9A\u7EC4\u3002
server-group.socket-binding-port-offset=\u5957\u63A5\u5B57\u7ED1\u5B9A\u7EC4\u7ED9\u5B9A\u7684\u7AEF\u53E3\u503C\u6240\u6DFB\u52A0\u7684\u9ED8\u8BA4\u504F\u79FB\u91CF\u3002
server-group.management-subsystem-endpoint=\u8BBE\u7F6E\u4E3A true \u5C06\u5C5E\u4E8E\u670D\u52A1\u5668\u7EC4\u7684\u670D\u52A1\u5668\u901A\u8FC7 remoting \u5B50\u7CFB\u7EDF\u91CC\u7684\u7AEF\u70B9\u8FDE\u63A5\u56DE\u4E3B\u673A\u63A7\u5236\u5668\u3002\u5982\u8981\u6B63\u5E38\u8FD0\u884C\uFF0C\u8FD9\u4E2A\u5B50\u7CFB\u7EDF\u5FC5\u987B\u5B58\u5728\u3002
server-group.deployment=\u53EF\u7528\u4E8E\u670D\u52A1\u5668\u7EC4\u91CC\u90E8\u7F72\u5217\u8868\u3002
server-group.system-properties=\u5728\u8FD9\u4E2A\u670D\u52A1\u5668\u7EC4\u91CC\u7684\u6240\u6709\u670D\u52A1\u5668\u4E0A\u8BBE\u7F6E\u7684\u7CFB\u7EDF\u5C5E\u6027\u7684\u5217\u8868\u3002
server-group.system-property=\u5728\u8FD9\u4E2A\u670D\u52A1\u5668\u7EC4\u91CC\u7684\u6240\u6709\u670D\u52A1\u5668\u4E0A\u8BBE\u7F6E\u7684\u7CFB\u7EDF\u5C5E\u6027\u3002
server-group.deployment.remove=\u4ECE\u53EF\u7528\u7684\u5185\u5BB9\u5217\u8868\u91CC\u5220\u9664\u90E8\u7F72\u3002\u5982\u679C\u8FD9\u4E2A\u90E8\u7F72\u76EE\u524D\u5DF2\u90E8\u7F72\u5728\u8FD0\u884C\u73AF\u5883\u91CC\uFF0C\u5B83\u5C06\u9996\u5148\u88AB\u5378\u8F7D\u3002
server-group.servers.restart=\u91CD\u542F\u5C5E\u4E8E\u8FD0\u884C\u5728\u8FD9\u4E2A\u57DF\u91CC\u7684\u670D\u52A1\u5668\u7EC4\u7684\u6240\u6709\u670D\u52A1\u5668\u3002
server-group.servers.start=\u542F\u52A8\u5C5E\u4E8E\u8FD9\u4E2A\u57DF\u91CC\u76EE\u524D\u672A\u8FD0\u884C\u7684\u670D\u52A1\u5668\u7EC4\u7684\u6240\u6709\u670D\u52A1\u5668\u3002
server-group.servers.stop=\u505C\u6B62\u5C5E\u4E8E\u8FD0\u884C\u5728\u8FD9\u4E2A\u57DF\u91CC\u7684\u670D\u52A1\u5668\u7EC4\u7684\u6240\u6709\u670D\u52A1\u5668\u3002
rollout-plans=\u5BF9\u5B58\u50A8\u5728\u57DF\u5185\u5BB9\u5E93\u91CC\u7684\u7BA1\u7406\u5BA2\u6237\u6709\u7528\u7684 rollout \u8BA1\u5212\u7684\u4E00\u7CFB\u5217\u7BA1\u7406\u66F4\u65B0\u7684\u5B58\u50A8\u4FE1\u606F\u3002\u8FD9\u4E2A\u8D44\u6E90\u4E0B\u9762\u7684\u5B50\u8D44\u6E90\u4E3A\u7BA1\u7406\u5BA2\u6237\u63D0\u4F9B\u5BF9\u8FD9\u4E9B\u8BA1\u5212\u7684\u8BBF\u95EE\uFF0C\u5141\u8BB8\u5BA2\u6237\u901A\u8FC7\u5F15\u7528\u540D\u5B57\u6765\u4F7F\u7528\u8BA1\u5212\uFF0C\u4ECE\u800C\u907F\u514D\u6BCF\u6B21\u90FD\u9700\u8981\u91CD\u65B0\u521B\u5EFA\u3002
rollout-plans.hash=\u8FD9\u4E2A rollout \u8BA1\u5212\u5185\u5BB9\u7684 hash\u3002\u4E3B\u673A\u63A7\u5236\u5668\u5728\u5185\u90E8\u4F7F\u7528\u5B83\u4EEC\u6765\u5B9A\u4F4D rollout \u8BA1\u5212\u5185\u5BB9\u3002
rollout-plans.add=\u589E\u52A0\u5BB9\u91CF\u4EE5\u5B58\u50A8\u547D\u540D rollout \u8BA1\u5212\u3002
rollout-plans.remove=\u5220\u9664\u5BB9\u91CF\u4EE5\u5B58\u50A8\u547D\u540D rollout \u8BA1\u5212\u3002
rollout-plan=\u5DF2\u5B58\u50A8\u7684 rollout \u8BA1\u5212\u3002
rollout-plan.hash=\u8FD9\u4E2A rollout \u8BA1\u5212\u5185\u5BB9\u7684 hash\u3002
rollout-plan.content=\ JBoss DMR \u5F62\u5F0F\u7684 rollout \u8BA1\u5212\u5185\u5BB9\u3002
rollout-plan.add=\u5728\u6301\u4E45\u6027\u5E93\u91CC\u6DFB\u52A0\u4E00\u4E2A rollout \u8BA1\u5212\u3002
rollout-plan.remove=\u4ECE\u6301\u4E45\u6027\u5E93\u91CC\u5220\u9664 rollout \u8BA1\u5212\u3002
rollout-plan.store=\u5728\u521D\u6B21\u68C0\u67E5\u63D0\u4F9B\u7684 'hash' \u53C2\u6570\u7B26\u5408\u5F53\u524D rollout \u8BA1\u5212 hash \u4E4B\u540E\uFF0C\u66F4\u65B0\u73B0\u6709\u6301\u4E45\u6027 rollout \u8BA1\u5212\u7684\u5185\u5BB9\u3002\u5982\u679C hash \u4E0D\u5339\u914D\u5219\u4F1A\u5931\u8D25\u3002\u5BF9\u4E8E 'content' \u5C5E\u6027\u4F7F\u7528\u8FD9\u4E2A\u64CD\u4F5C\u800C\u4E0D\u662F 'write-attribute' \u64CD\u4F5C\u53EF\u4EE5\u5BF9\u66F4\u65B0\u4E0D\u548C\u8C03\u7528\u8005\u672A\u77E5\u7684\u4EE5\u524D\u7684\u66F4\u65B0\u51B2\u7A81\u63D0\u4F9B\u4FDD\u8BC1\u3002
rollout-plan.store.hash=\u8C03\u7528\u8005\u76F8\u4FE1\u662F\u6B63\u88AB\u66FF\u6362\u7684 rollout \u8BA1\u5212\u5185\u5BB9\u7684 hash \u7684\u503C\u3002
rollout-plan.store.content=\ JBoss DMR \u5F62\u5F0F\u7684\u5DF2\u66F4\u65B0\u7684 rollout \u8BA1\u5212\u5185\u5BB9\u3002
domain.resolve-expression-on-domain=\u63A5\u53D7\u8868\u8FBE\u5F0F\u4E3A\u8F93\u5165\uFF08\u6216\u8005\u53EF\u4EE5\u89E3\u6790\u4E3A\u8868\u8FBE\u5F0F\u7684\u5B57\u7B26\u4E32\uFF09\u4E14\u6309\u7167\u57DF\u91CC\u6240\u6709\u670D\u52A1\u5668\u4E0A\u7684\u672C\u5730\u7CFB\u7EDF\u5C5E\u6027\u548C\u73AF\u5883\u53D8\u91CF\u89E3\u6790\u7684\u64CD\u4F5C\u3002
domain.resolve-expression-on-domain.expression=\u8981\u89E3\u6790\u7684\u8868\u8FBE\u5F0F\u3002
domain.resolve-expression-on-domain.reply=\u5DF2\u89E3\u6790\u7684\u8868\u8FBE\u5F0F\uFF0C\u6216\u8005\u5982\u679C\u6CA1\u6709\u4EE3\u8868\u4EFB\u4F55\u8868\u8FBE\u5F0F\u5C31\u662F\u539F\u59CB\u8F93\u5165\u503C\u7684\u5B57\u7B26\u4E32\u5F62\u5F0F\u3002
