domain=\u30C9\u30E1\u30A4\u30F3\u30EC\u30D9\u30EB\u306E\u7BA1\u7406\u30E2\u30C7\u30EB\u306E root \u30CE\u30FC\u30C9
domain.extension=\u62E1\u5F35\u6A5F\u80FD\u30E2\u30B8\u30E5\u30FC\u30EB\u306E\u4E00\u89A7
domain.path=\u540D\u524D\u4ED8\u304D\u306E\u30D5\u30A1\u30A4\u30EB\u30B7\u30B9\u30C6\u30E0\u30D1\u30B9\u306E\u4E00\u89A7\u3002\u3053\u308C\u3089\u306E\u30D1\u30B9\u306F\u5B8C\u5168\u6307\u5B9A\u306E\u5834\u5408\u3082\u305D\u3046\u3067\u306A\u3044\u5834\u5408\u3082\u3042\u308A\u307E\u3059 (\u5B9F\u969B\u306E\u30D1\u30B9\u3082\u542B\u3080)\u3002
domain.profile=\u30C9\u30E1\u30A4\u30F3\u3067\u5229\u7528\u53EF\u80FD\u306A\u30D7\u30ED\u30D5\u30A1\u30A4\u30EB\u4E00\u89A7
domain.interface=\u30C9\u30E1\u30A4\u30F3\u3067\u5229\u7528\u53EF\u80FD\u306A\u540D\u524D\u4ED8\u304D\u306E\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u4E00\u89A7\u3002\u3053\u308C\u3089\u306E\u30D1\u30B9\u306F\u5B8C\u5168\u6307\u5B9A\u306E\u5834\u5408\u3082\u305D\u3046\u3067\u306A\u3044\u5834\u5408\u3082\u3042\u308A\u307E\u3059 (IP \u30A2\u30C9\u30EC\u30B9\u306E\u6C7A\u5B9A\u57FA\u6E96\u3082\u542B\u3080)\u3002
domain.socket-binding-group=\u30C9\u30E1\u30A4\u30F3\u3067\u5229\u7528\u53EF\u80FD\u306A\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u30B0\u30EB\u30FC\u30D7\u4E00\u89A7
domain.system-properties=\u30C9\u30E1\u30A4\u30F3\u5185\u306E\u5168\u30B5\u30FC\u30D0\u30FC\u4E0A\u3067\u8A2D\u5B9A\u3059\u308B\u30B7\u30B9\u30C6\u30E0\u30D7\u30ED\u30D1\u30C6\u30A3\u4E00\u89A7
domain.system-property=\u30C9\u30E1\u30A4\u30F3\u5185\u306E\u5168\u30B5\u30FC\u30D0\u30FC\u4E0A\u3067\u8A2D\u5B9A\u3059\u308B\u30B7\u30B9\u30C6\u30E0\u30D7\u30ED\u30D1\u30C6\u30A3
domain.deployment=\u30C9\u30E1\u30A4\u30F3\u3067\u5229\u7528\u53EF\u80FD\u304A\u306A\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u4E00\u89A7
domain.server-group=\u30C9\u30E1\u30A4\u30F3\u3067\u5229\u7528\u53EF\u80FD\u306A\u30B5\u30FC\u30D0\u30FC\u30B0\u30EB\u30FC\u30D7\u4E00\u89A7
domain.local-host-name=\u30ED\u30FC\u30AB\u30EB\u3067\u7A3C\u50CD\u3057\u3066\u3044\u308B\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u540D
domain.host=\u30C9\u30E1\u30A4\u30F3\u3067\u73FE\u5728\u7A3C\u50CD\u4E2D\u306E\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC
domain.process-type=\u3053\u306E root \u30EA\u30BD\u30FC\u30B9\u3067\u8868\u73FE\u3055\u308C\u308B\u30D7\u30ED\u30BB\u30B9\u578B\u3067\u3001"Domain Controller" \u3042\u308B\u3044\u306F "Host Controller" \u306E\u3044\u305A\u308C\u304B\u3067\u3059\u3002
domain.release-version=\u30C9\u30E1\u30A4\u30F3\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u306E\u4EE3\u308F\u308A\u306E\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u304C\u4F5C\u52D5\u3059\u308B JBoss Application Server \u306E\u30D0\u30FC\u30B8\u30E7\u30F3
domain.release-codename=\u30C9\u30E1\u30A4\u30F3\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u306E\u4EE3\u308F\u308A\u306E\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u304C\u4F5C\u52D5\u3059\u308B JBoss Application Server \u306E\u30B3\u30FC\u30C9\u540D\u3002
domain.product-name=\u30C9\u30E1\u30A4\u30F3\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u306E\u4EE3\u308F\u308A\u306E\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u304C\u4F5C\u52D5\u3059\u308B JBoss AS \u30D9\u30FC\u30B9\u306E\u88FD\u54C1\u540D
domain.product-version=\u30C9\u30E1\u30A4\u30F3\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u306E\u4EE3\u308F\u308A\u306E\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u304C\u4F5C\u52D5\u3059\u308B JBoss AS \u30D9\u30FC\u30B9\u88FD\u54C1\u30EA\u30EA\u30FC\u30B9\u306E\u30D0\u30FC\u30B8\u30E7\u30F3
domain.management-major-version=\u30C9\u30E1\u30A4\u30F3\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u306E\u4EE3\u308F\u308A\u306E\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u304C\u63D0\u4F9B\u3059\u308B JBoss AS \u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u306E\u30E1\u30B8\u30E3\u30FC\u30D0\u30FC\u30B8\u30E7\u30F3
domain.management-minor-version=\u30C9\u30E1\u30A4\u30F3\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u306E\u4EE3\u308F\u308A\u306E\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u304C\u63D0\u4F9B\u3059\u308B JBoss AS \u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u306E\u30DE\u30A4\u30CA\u30FC\u30D0\u30FC\u30B8\u30E7\u30F3
domain.deployment.remove=\u30C9\u30E1\u30A4\u30F3\u5168\u4F53\u3067\u5229\u7528\u53EF\u80FD\u306A\u30B3\u30F3\u30C6\u30F3\u30C4\u4E00\u89A7\u304B\u3089\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u3092\u524A\u9664\u3057\u3066\u304F\u3060\u3055\u3044\u3002\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u306F\u73FE\u5728\u3001\u3069\u306E\u30B5\u30FC\u30D0\u30FC\u30B0\u30EB\u30FC\u30D7\u306B\u3082\u30DE\u30C3\u30D4\u30F3\u30B0\u3067\u304D\u307E\u305B\u3093\u3002
domain.servers.restart=\u3053\u306E\u30C9\u30E1\u30A4\u30F3\u3067\u7A3C\u50CD\u4E2D\u306E\u30B5\u30FC\u30D0\u30FC\u3092\u3059\u3079\u3066\u518D\u8D77\u52D5\u3057\u307E\u3059\u3002
domain.servers.start=\u73FE\u5728\u5B9F\u884C\u4E2D\u306E\u30C9\u30E1\u30A4\u30F3\u3067\u8A2D\u5B9A\u6E08\u307F\u306E\u30B5\u30FC\u30D0\u30FC\u3092\u3059\u3079\u3066\u8D77\u52D5\u3057\u307E\u3059\u3002
domain.servers.stop=\u3053\u306E\u30C9\u30E1\u30A4\u30F3\u5185\u3067\u7A3C\u50CD\u4E2D\u306E\u30B5\u30FC\u30D0\u30FC\u3092\u3059\u3079\u3066\u505C\u6B62\u3057\u307E\u3059\u3002
server-group=\u30B5\u30FC\u30D0\u30FC\u30B0\u30EB\u30FC\u30D7\u306E\u8A2D\u5B9A
server-group.add=\u65B0\u898F\u30B5\u30FC\u30D0\u30FC\u30B0\u30EB\u30FC\u30D7\u306E\u8FFD\u52A0
server-group.add.jvm=jvm \u540D
server-group.remove=\u65E2\u5B58\u306E\u65B0\u898F\u30B5\u30FC\u30D0\u30FC\u30B0\u30EB\u30FC\u30D7\u3092\u524A\u9664
server-group.profile=\u30D7\u30ED\u30D5\u30A1\u30A4\u30EB\u540D
server-group.jvm=\u540D\u524D\u306E\u3064\u3044\u305F jvm
server-group.socket-binding-group=\u3053\u306E\u30B0\u30EB\u30FC\u30D7\u306B\u95A2\u9023\u4ED8\u3051\u3089\u308C\u305F\u30B5\u30FC\u30D0\u30FC\u3067\u5229\u7528\u3059\u308B\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u30B0\u30EB\u30FC\u30D7
server-group.socket-binding-port-offset=\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u30B0\u30EB\u30FC\u30D7\u304C\u6E21\u3059\u30DD\u30FC\u30C8\u306E\u5024\u306B\u8FFD\u52A0\u3059\u308B\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u30AA\u30D5\u30BB\u30C3\u30C8
server-group.management-subsystem-endpoint=true \u306B\u8A2D\u5B9A\u3059\u308B\u3068\u3001\u30EA\u30E2\u30FC\u30C8\u306E\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u304B\u3089\u306E\u30A8\u30F3\u30C9\u30DD\u30A4\u30F3\u30C8\u3092\u5229\u7528\u3059\u308B\u3053\u3068\u3067\u3001\u30B5\u30FC\u30D0\u30FC\u30B0\u30EB\u30FC\u30D7\u306B\u6240\u5C5E\u3059\u308B\u30B5\u30FC\u30D0\u30FC\u3092\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u306B\u518D\u63A5\u7D9A\u3059\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u3059\u3002\u3053\u308C\u3092\u6A5F\u80FD\u3055\u305B\u308B\u306B\u306F\u3001\u3053\u306E\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u304C\u5B58\u5728\u3057\u306A\u3051\u308C\u3070\u306A\u308A\u307E\u305B\u3093\u3002
server-group.deployment=\u30B5\u30FC\u30D0\u30FC\u30B0\u30EB\u30FC\u30D7\u3067\u5229\u7528\u53EF\u80FD\u306A\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u4E00\u89A7
server-group.system-properties=\u3053\u306E\u30B5\u30FC\u30D0\u30FC\u30B0\u30EB\u30FC\u30D7\u306B\u3042\u308B\u5168\u30B5\u30FC\u30D0\u30FC\u4E0A\u3067\u8A2D\u5B9A\u3059\u308B\u30B7\u30B9\u30C6\u30E0\u30D7\u30ED\u30D1\u30C6\u30A3\u4E00\u89A7
server-group.system-property=\u3053\u306E\u30B5\u30FC\u30D0\u30FC\u30B0\u30EB\u30FC\u30D7\u306B\u3042\u308B\u5168\u30B5\u30FC\u30D0\u30FC\u4E0A\u3067\u8A2D\u5B9A\u3059\u308B\u30B7\u30B9\u30C6\u30E0\u30D7\u30ED\u30D1\u30C6\u30A3
server-group.deployment.remove=\u3053\u306E\u30B0\u30EB\u30FC\u30D7\u306E\u30B5\u30FC\u30D0\u30FC\u3067\u5229\u7528\u53EF\u80FD\u306A\u30B3\u30F3\u30C6\u30F3\u30C4\u4E00\u89A7\u304B\u3089\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u3092\u524A\u9664\u3057\u3066\u304F\u3060\u3055\u3044\u3002\u73FE\u5728\u3053\u306E\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u304C\u30E9\u30F3\u30BF\u30A4\u30E0\u306B\u30C7\u30D7\u30ED\u30A4\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u306F\u3001\u307E\u305A\u30A2\u30F3\u30C7\u30D7\u30ED\u30A4\u3057\u3066\u304F\u3060\u3055\u3044\u3002
server-group.servers.restart=\u3053\u306E\u30C9\u30E1\u30A4\u30F3\u3067\u7A3C\u50CD\u4E2D\u306E\u30B5\u30FC\u30D0\u30FC\u30B0\u30EB\u30FC\u30D7\u306B\u542B\u307E\u308C\u308B\u5168\u30B5\u30FC\u30D0\u30FC\u3092\u518D\u8D77\u52D5\u3057\u307E\u3059\u3002
server-group.servers.start=\u73FE\u5728\u5B9F\u884C\u3055\u308C\u3066\u3044\u306A\u3044\u30C9\u30E1\u30A4\u30F3\u306B\u3042\u308B\u30B5\u30FC\u30D0\u30FC\u30B0\u30EB\u30FC\u30D7\u306B\u6240\u5C5E\u3059\u308B\u8A2D\u5B9A\u6E08\u307F\u30B5\u30FC\u30D0\u30FC\u3092\u3059\u3079\u3066\u8D77\u52D5\u3057\u307E\u3059\u3002
server-group.servers.stop=\u3053\u306E\u30C9\u30E1\u30A4\u30F3\u3067\u7A3C\u50CD\u4E2D\u306E\u30B5\u30FC\u30D0\u30FC\u30B0\u30EB\u30FC\u30D7\u306B\u542B\u307E\u308C\u308B\u5168\u30B5\u30FC\u30D0\u30FC\u3092\u505C\u6B62\u3057\u307E\u3059\u3002
rollout-plans=\u30C9\u30E1\u30A4\u30F3\u30B3\u30F3\u30C6\u30F3\u30C4\u30EC\u30DD\u30B8\u30C8\u30EA\u306B\u683C\u7D0D\u3055\u308C\u3066\u3044\u308B\u7BA1\u7406\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306B\u3068\u3063\u3066\u4FBF\u5229\u306A\u3001\u540D\u524D\u4ED8\u304D\u306E\u7BA1\u7406\u66F4\u65B0\u30ED\u30FC\u30EB\u30A2\u30A6\u30C8\u30D7\u30E9\u30F3\u306B\u95A2\u3059\u308B\u4FDD\u5B58\u60C5\u5831\u3002\u3053\u306E\u30EA\u30BD\u30FC\u30B9\u306E\u914D\u4E0B\u306B\u3042\u308B\u5B50\u306E\u30EA\u30BD\u30FC\u30B9\u306B\u3088\u308A\u3001\u7BA1\u7406\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u304C\u3053\u308C\u3089\u306E\u30D7\u30E9\u30F3\u306B\u30A2\u30AF\u30BB\u30B9\u3067\u304D\u308B\u3088\u3046\u306B\u306A\u308A\u307E\u3059\u3002\u7D50\u679C\u3001\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u304C\u540D\u524D\u5225\u3067\u30D7\u30E9\u30F3\u3092\u53C2\u7167\u3057\u5229\u7528\u3059\u308B\u3053\u3068\u304C\u3067\u304D\u3001\u4F7F\u3046\u305F\u3073\u306B\u30D7\u30E9\u30F3\u306E\u518D\u4F5C\u6210\u3092\u3059\u308B\u5FC5\u8981\u304C\u306A\u304F\u306A\u308A\u307E\u3059\u3002
rollout-plans.hash=\u5168\u4FDD\u5B58\u30ED\u30FC\u30EB\u30A2\u30A6\u30C8\u30D7\u30E9\u30F3\u306E\u30CF\u30C3\u30B7\u30E5\u3002\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u304C\u5185\u90E8\u3067\u5229\u7528\u3057\u30ED\u30FC\u30EB\u30A2\u30A6\u30C8\u30D7\u30E9\u30F3\u306E\u30B3\u30F3\u30C6\u30F3\u30C4\u306E\u5834\u6240\u3092\u7A81\u304D\u6B62\u3081\u307E\u3059\u3002
rollout-plans.add=\u540D\u524D\u4ED8\u304D\u306E\u30ED\u30FC\u30EB\u30A2\u30A6\u30C8\u30D7\u30E9\u30F3\u3092\u4FDD\u5B58\u3059\u308B\u6A5F\u80FD\u3092\u8FFD\u52A0
rollout-plans.remove=\u540D\u524D\u4ED8\u304D\u306E\u30ED\u30FC\u30EB\u30A2\u30A6\u30C8\u30D7\u30E9\u30F3\u3092\u4FDD\u5B58\u3059\u308B\u6A5F\u80FD\u3092\u524A\u9664
rollout-plan=\u4FDD\u5B58\u3055\u308C\u305F\u30ED\u30FC\u30EB\u30A2\u30A6\u30C8\u30D7\u30E9\u30F3
rollout-plan.hash=\u30ED\u30FC\u30EB\u30A2\u30A6\u30C8\u30D7\u30E9\u30F3\u30B3\u30F3\u30C6\u30F3\u30C4\u306E\u30CF\u30C3\u30B7\u30E5
rollout-plan.content=JBoss DMR \u5F62\u5F0F\u306E\u30ED\u30FC\u30EB\u30A2\u30A6\u30C8\u30D7\u30E9\u30F3\u30B3\u30F3\u30C6\u30F3\u30C4
rollout-plan.add=\u6C38\u7D9A\u30B9\u30C8\u30A2\u3078\u30ED\u30FC\u30EB\u30A2\u30A6\u30C8\u30D7\u30E9\u30F3\u3092\u8FFD\u52A0
rollout-plan.remove=\u6C38\u7D9A\u30B9\u30C8\u30A2\u304B\u3089\u30ED\u30FC\u30EB\u30A2\u30A6\u30C8\u30D7\u30E9\u30F3\u3092\u524A\u9664
rollout-plan.store=\u63D0\u793A\u3057\u305F\u300C\u30CF\u30C3\u30B7\u30E5\u300D\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u304C\u73FE\u5728\u306E\u30ED\u30FC\u30EB\u30A2\u30A6\u30C8\u30D7\u30E9\u30F3\u306E\u30CF\u30C3\u30B7\u30E5\u3068\u4E00\u81F4\u3059\u308B\u304B\u307E\u305A\u78BA\u8A8D\u3057\u3066\u304B\u3089\u3001\u65E2\u5B58\u306E\u6C38\u7D9A\u5316\u3055\u308C\u305F\u30ED\u30FC\u30EB\u30A2\u30A6\u30C8\u30D7\u30E9\u30F3\u306E\u5185\u5BB9\u3092\u66F4\u65B0\u3057\u307E\u3059\u3002\u30CF\u30C3\u30B7\u30E5\u304C\u4E00\u81F4\u3057\u306A\u3044\u5834\u5408\u306F\u5931\u6557\u3057\u307E\u3059\u3002'content' \u5C5E\u6027\u306B\u5BFE\u3057 'write-attribute' \u64CD\u4F5C\u306E\u4EE3\u308F\u308A\u306B\u3053\u306E\u64CD\u4F5C\u3092\u4F7F\u3046\u3053\u3068\u3067\u3001\u4ECA\u56DE\u306E\u66F4\u65B0\u304C\u547C\u3073\u51FA\u3057\u5143\u3067\u306F\u78BA\u8A8D\u3067\u304D\u306A\u3044\u4EE5\u524D\u306E\u66F4\u65B0\u3068\u77DB\u76FE\u3092\u8D77\u3053\u3055\u306A\u3044\u3088\u3046\u306B\u306A\u308A\u307E\u3059\u3002
rollout-plan.store.hash=\u7F6E\u304D\u63DB\u3048\u4E88\u5B9A\u306E\u30ED\u30FC\u30EB\u30A2\u30A6\u30C8\u30D7\u30E9\u30F3\u30B3\u30F3\u30C6\u30F3\u30C4\u306E\u30CF\u30C3\u30B7\u30E5\u3068\u547C\u3073\u51FA\u3057\u5074\u304C\u307F\u306A\u3059\u5024\u3002
rollout-plan.store.content=JBoss DMR \u5F62\u5F0F\u306E\u66F4\u65B0\u6E08\u307F\u30ED\u30FC\u30EB\u30A2\u30A6\u30C8\u30D7\u30E9\u30F3\u30B3\u30F3\u30C6\u30F3\u30C4
domain.resolve-expression-on-domain=\u30A4\u30F3\u30D7\u30C3\u30C8 (\u3042\u308B\u3044\u306F\u89E3\u6790\u3057\u8868\u73FE\u306B\u5909\u63DB\u3055\u308C\u308B\u30B9\u30C8\u30EA\u30F3\u30B0) \u3068\u3057\u3066\u8868\u73FE\u3092\u53D7\u3051\u4ED8\u3051\u3001\u3053\u306E\u30C9\u30E1\u30A4\u30F3\u5185\u306E\u5168\u30B5\u30FC\u30D0\u30FC\u4E0A\u306B\u3042\u308B\u30ED\u30FC\u30AB\u30EB\u306E\u30B7\u30B9\u30C6\u30E0\u30D7\u30ED\u30D1\u30C6\u30A3\u3068\u74B0\u5883\u5909\u6570\u306B\u5BFE\u3057\u3053\u306E\u8868\u73FE\u3092\u89E3\u6C7A\u3059\u308B\u3068\u3044\u3046\u64CD\u4F5C
domain.resolve-expression-on-domain.expression=\u89E3\u6C7A\u306E\u5FC5\u8981\u306E\u3042\u308B\u8868\u73FE
domain.resolve-expression-on-domain.reply=\u89E3\u6C7A\u6E08\u307F\u306E\u8868\u73FE\u3001\u3042\u308B\u3044\u306F\u8868\u73FE\u3067\u306A\u3044\u5834\u5408\u306F\u30B9\u30C8\u30EA\u30F3\u30B0\u5F62\u5F0F\u306E\u5143\u306E\u5165\u529B\u5024
