domain=El nodo ra\u00EDz del modelo de administraci\u00F3n a nivel del dominio.
domain.extension=Una lista de m\u00F3dulos de extensi\u00F3n.
domain.path=Una lista de rutas nombradas del sistema de archivos. Puede que las rutas se especifiquen de manera completa o no (es decir, incluyendo las rutas reales).
domain.profile=Una lista de perfiles disponibles para uso en el dominio
domain.interface=Una lista de interfaces de red nombradas disponibles en el dominio. Puede que las interfaces se especifiquen de manera completa o no (es decir, incluir el criterio sobre c\u00F3mo determinar su direcci\u00F3n IP).
domain.socket-binding-group=Una lista de grupos de enlace de socket disponibles en el dominio
domain.system-properties=Una lista de propiedades del sistema para establecer en todos los servidores en el dominio.
domain.system-property=Una propiedad del sistema para establecer en todos los servidores en el dominio.
domain.deployment=Una lista de implementaciones disponibles en el dominio
domain.server-group=Una lista de grupos de servidores disponibles en el dominio
domain.local-host-name=El nombre del controlador host ejecutando localmente.
domain.host=Los controladores host ejecutando actualmente en el dominio
domain.process-type=El tipo de proceso representado por este recurso ra\u00EDz. Ya sea "controlador de dominior" o "controlador host".
domain.release-version=La versi\u00F3n del lanzamiento del servidor de aplicaciones de JBoss en que est\u00E1 ejecutando este controlador de host que est\u00E1 actuando como el controlador del dominio.
domain.release-codename=El nombre del c\u00F3digo del lanzamiento del servidor de aplicaciones de JBoss en que est\u00E1 ejecutando este controlador de host que est\u00E1 actuando como el controlador del dominio.
domain.product-name=El nombre del producto basado en JBoss AS en que est\u00E1 ejecutando este controlador de host que est\u00E1 actuando como el controlador del dominio.
domain.product-version=La versi\u00F3n del lanzamiento del producto basado en JBoss AS en que est\u00E1 ejecutando este controlador de host que est\u00E1 actuando como el controlador del dominio.
domain.management-major-version=La versi\u00F3n m\u00E1s importante de la interfaz de administraci\u00F3n de JBoss AS que proporciona el controlador de host que est\u00E1 actuando como el controlador del dominio.
domain.management-minor-version=La versi\u00F3n menor de la interfaz de administraci\u00F3n de JBoss AS que proporciona el controlador de host que est\u00E1 actuando como el controlador del dominio.
domain.deployment.remove=Borra una implementaci\u00F3n de la lista de contenido disponible a trav\u00E9s del dominio. Actualmente la implementaci\u00F3n no se puede mapear a ning\u00FAn grupo del servidor.
domain.servers.restart=Reinicia todos los servidores ejecutando actualmente en el dominio.
domain.servers.start=Inicia todos los servidores configurados en el dominio que no est\u00E1n ejecutando actualmente.
domain.servers.stop=Detiene todos los servidores ejecutando actualmente en el dominio.
server-group=La configuraci\u00F3n del grupo de servidores.
server-group.add=Agregar un nuevo grupo de servidores.
server-group.add.jvm=El nombre de la mvj.
server-group.remove=Borra un nuevo grupo de servidores existente.
server-group.profile=El nombre del perfil.
server-group.jvm=La mvj nombrada.
server-group.socket-binding-group=El grupo de enlace de sockets predeterminado utilizado para los servidores asociados con este grupo.
server-group.socket-binding-port-offset=La compensaci\u00F3n predeterminada a agregar a los valores de puerto dados por el grupo de enlace de sockets. 
server-group.management-subsystem-endpoint=Configurado como verdadero para que los servidores que pertenecen al grupo de servidores se reconecten al controlador host  mediante el punto final de su sub-sistema remoto. El sub-sistema debe estar presente para que esto funcione.
server-group.deployment=Una lista de implementaciones disponibles en el grupo de servidores.
server-group.system-properties=Una lista de propiedades del sistema para establecer en este grupo de servidores.
server-group.system-property=Una propiedad del sistema para establecer en todos los servidores en este grupo de servidores.
server-group.deployment.remove=Borra una implementaci\u00F3n de la lista de contenido disponible en los servidores en el grupo. Si la implementaci\u00F3n actualmente se implementa en el tiempo de ejecuci\u00F3n primero se borrar\u00E1 la implementaci\u00F3n.
server-group.servers.restart=Reinicia todos los servidores que pertenecen al grupo de servidores actualmente ejecutando en el dominio.
server-group.servers.start=Inicia todos los servidores configurados que pertenecen al grupo de servidores en el dominio que no est\u00E1n ejecutando actualmente.
server-group.servers.stop=Detiene todos los servidores que pertenecen al grupo de servidores actualmente ejecutando en el dominio.
rollout-plans=Informaci\u00F3n de almacenamiento sobre un grupo de planes de implementaci\u00F3n de actualizaci\u00F3n de administraci\u00F3n nombrados para los clientes de administraci\u00F3n que se almacenan en el repositorio de contenido del dominio. Los recursos hijos bajo este recurso proporcionan acceso a estos planes para los clientes de administraci\u00F3n permiti\u00E9ndoles usar los planes al hacer referencia a ellos por nombre, evitando as\u00ED la necesidad de recrearlos para cada uso.
rollout-plans.hash=El hash de todos los planes de implementaci\u00F3n almacenados. Utilizados internamente por los controladores host para ubicar el contenido del plan de despliegue.
rollout-plans.add=Agrega la funcionalidad para almacenar planes de implementaci\u00F3n nombrados.
rollout-plans.remove=Borra la funcionalidad para almacenar planes de implementaci\u00F3n nombrados.
rollout-plan=Un plan de despliegue almacenado.
rollout-plan.hash=El hash del contenido del plan de desplieguet.
rollout-plan.content=El contenido del plan de despliegue en forma JBoss DMR.
rollout-plan.add=Agrega un plan de despliegue al almacenamiento persistente.
rollout-plan.remove=Borra un plan de despliegue del almacenamiento persistente.
rollout-plan.store=Actualiza el contenido de un plan de despliegue persistido ya existente despu\u00E9s de chequear primero que los par\u00E1metros 'hash' proporcionados coincidan con el hash del plan de despliegue actual. Falla si los hashes no coinciden. El utilizar esta operaci\u00F3n en lugar de la operaci\u00F3n 'write-attribute' para el atributo 'content' proporciona una garant\u00EDa de que la actualizaci\u00F3n no crear\u00E1 conflicto con una actualizaci\u00F3n anterior desconocida para el que realiza la llamada.
rollout-plan.store.hash=El valor que el que realiza la llamada cree que es el hash de contenido del plan de despliegue que se est\u00E1 reemplazando.
rollout-plan.store.content=El contenido actualizado del plan de despliegue en forma JBoss DMR.
domain.resolve-expression-on-domain=Operaci\u00F3n que acepta una expresi\u00F3n como entrada (o una cadena que se puede analizar sint\u00E1cticamente en una expresi\u00F3n) y la resuelve frente a las propiedades locales del sistema y variables del entorno en todos los servidores en el dominio.
domain.resolve-expression-on-domain.expression=La expresi\u00F3n a resolver.
domain.resolve-expression-on-domain.reply=La expresi\u00F3n resuelta o la cadena forman el valor de entrada original si no represent an expression.
