domain=Le n\u0153ud root du mod\u00E8le de gestion niveau-domaine
domain.extension=Une liste des modules d'extension
domain.path=Une liste des chemins de syst\u00E8mes de fichiers. Les chemins peuvent \u00EAtre ou non sp\u00E9cifi\u00E9s compl\u00E8tement (par ex. inclure le chemin r\u00E9el)
domain.profile=Une liste de profils disponibles \u00E0 utiliser dans le domaine
domain.interface=Une liste d'interface de r\u00E9seaux disponibles \u00E0 utiliser dans le domaine. Les interfaces peuvent \u00EAtre ou nom compl\u00E8tement sp\u00E9cifi\u00E9es (par ex. inclure un crit\u00E8re sur la fa\u00E7on de d\u00E9terminer leur adresse IP.
domain.socket-binding-group=Une liste de groupes de liaisons de sockets disponibles \u00E0 utiliser dans le domaine
domain.system-properties=Une liste de propri\u00E9t\u00E9s syst\u00E8me \u00E0 utiliser sur tous les serveurs dans le domaine.
domain.system-property=Une propri\u00E9t\u00E9 syst\u00E8me \u00E0 d\u00E9finir sur tous les serveurs du domaine.
domain.deployment=Une liste des d\u00E9ploiements disponibles disponibles \u00E0 utiliser dans le domaine
domain.server-group=Une liste de groupes de serveurs disponibles \u00E0 utiliser dans le domaine
domain.local-host-name=Le nom d'un contr\u00F4leur h\u00F4te ex\u00E9cutant localement.
domain.host=Contr\u00F4leurs h\u00F4te ex\u00E9cutant actuellement dans le domaine
domain.process-type=Un type de processus repr\u00E9sent\u00E9 par cette ressource root. Soit "Domain Controller" ou "Host Controller".
domain.release-version=Le version de JBoss Application Server qui est ex\u00E9cut\u00E9e par le contr\u00F4leur h\u00F4te qui agit en tant que contr\u00F4leur de domaine.
domain.release-codename=Le code nom de la version de JBoss Application Server qui est ex\u00E9cut\u00E9 par le contr\u00F4leur h\u00F4te qui agit comme contr\u00F4leur de domaine.
domain.product-name=Le nom du produit bas\u00E9 JBoss AS ex\u00E9cut\u00E9 par le contr\u00F4leur h\u00F4te qui agit en tant que contr\u00F4leur de domaine.
domain.product-version=La version JBoss AS qui est ex\u00E9cut\u00E9e par le contr\u00F4leur h\u00F4te qui agit en tant que contr\u00F4leur de domaine.
domain.management-major-version=La version majeure de l'interface de gestion JBoss AS fournie par le contr\u00F4leur h\u00F4te qui agit en tant que contr\u00F4leur de domaine.
domain.management-minor-version=La version mineure de l'interface de gestion JBoss AS fournie par le contr\u00F4leur h\u00F4te qui agit en tant que contr\u00F4leur de domaine.
domain.deployment.remove=Supprime un d\u00E9ploiement de la liste de contenu disponible dans tous les domaines. Le d\u00E9ploiement ne peut pas \u00EAtre actuellement mapp\u00E9 \u00E0 aucun groupe de serveurs.
domain.servers.restart=D\u00E9marre \u00E0 nouveau tous les serveurs en cours d'ex\u00E9cution dans le domaine.
domain.servers.start=D\u00E9marre tous les serveurs configur\u00E9s dans le domaine qui ne sont pas actuellement en cours d'ex\u00E9cution.
domain.servers.stop=Interrompt tous les serveurs en cours d'ex\u00E9cution dans le domaine.
server-group=Le configuration du groupe de serveurs
server-group.add=Ajouter un nouveau groupe de serveurs.
server-group.add.jvm=Le nom jvm.
server-group.remove=Supprime un nouveau groupe de serveurs existant.
server-group.profile=Le nom du profil.
server-group.jvm=Le jvm nomm\u00E9.
server-group.socket-binding-group=Le groupe de liaison de socket par d\u00E9faut utilis\u00E9 pour les serveurs associ\u00E9s \u00E0 ce groupe.
server-group.socket-binding-port-offset=La valeur de compensation par d\u00E9faut \u00E0 ajouter aux valeurs de ports donn\u00E9es par le groupe de liaisons de sockets.
server-group.management-subsystem-endpoint=D\u00E9finir \u00E0 true pour que les serveurs qui appartiennent au groupe de serveurs se connectent \u00E0 nouveau au contr\u00F4leur h\u00F4te par le point de terminaison de leur sous-syst\u00E8me d'acc\u00E8s \u00E0 distance. Le sous-syst\u00E8me doit \u00EAtre pr\u00E9sent pour que cela fonctionne.
server-group.deployment=Une liste de tous les d\u00E9ploiements disponibles \u00E0 utiliser dans le groupe de serveurs.
server-group.system-properties=Une liste des propri\u00E9t\u00E9s syst\u00E8me \u00E0 d\u00E9finir sur tous les serveurs pour ce server-group.
server-group.system-property=Une propri\u00E9t\u00E9 syst\u00E8me \u00E0 d\u00E9finir sur tous les serveurs de ce server-group.
server-group.deployment.remove=Supprimer un d\u00E9ploiement de la liste du contenu disponible \u00E0 utiliser sur les serveurs du groupe. Si le d\u00E9ploiement est actuellement d\u00E9ploy\u00E9 en cours d'ex\u00E9cution, il sera le premier \u00E0 \u00EAtre retir\u00E9.
server-group.servers.restart=D\u00E9marre \u00E0 nouveau tous les serveurs qui appartiennent au groupe de serveurs en cours d'ex\u00E9cution sur le domaine.
server-group.servers.start=D\u00E9marre tous les serveurs configur\u00E9s qui appartiennent au groupe de serveurs du domaine qui ne sont pas en cours d'ex\u00E9cution actuellement.
server-group.servers.stop=Stoppe tous les serveurs qui appartiennent au groupe de serveurs en cours d'ex\u00E9cution sur le domaine.
rollout-plans=Informations de stockage sur un ensemble de plans de lancement de gestion mis \u00E0 jour nomm\u00E9s, utiles aux clients de gestion qui sont stock\u00E9s dans le r\u00E9f\u00E9rentiel de contenu de domaine. Les ressources de l'enfant en vertu de cette ressource donnent acc\u00E8s \u00E0 ces plans aux clients de gestion, permettant aux clients d'utiliser les plans par leur nom, \u00E9vitant ainsi de les recr\u00E9er \u00E0 chaque utilisation.
rollout-plans.hash=Le hachage de tous les plans de lancement stock\u00E9s. Utilis\u00E9 en interne par les contr\u00F4leurs d'h\u00F4te pour situer le contenu du plan de lancement.
rollout-plans.add=Ajoute la possibilit\u00E9 de stocker les plans de lancement nomm\u00E9s.
rollout-plans.remove=Supprime la capacit\u00E9 de stocker des plans de lancement nomm\u00E9s.
rollout-plan=Un plan de lancement stock\u00E9.
rollout-plan.hash=Le hachage du contenu du plan de lancement.
rollout-plan.content=Le contenu du plan de lancement, sous le forme JBoss DMR.
rollout-plan.add=Ajoute un plan de lancement au store persistant.
rollout-plan.remove=Supprime un plan de lancement du store persistant.
rollout-plan.store=Met \u00E0 jour le contenu d'un plan de lancement existant persistant, apr\u00E8s avoir commenc\u00E9 par v\u00E9rifier que le param\u00E8tre 'hash' (hachage) corresponde au hachage du plan de lancement en cours. \u00C9choue si les hachages ne correspondent pas. Utiliser cette op\u00E9ration \u00E0 la place de l'op\u00E9ration 'write-attribute' pour l'attribut 'content' procure une garantie que la mise \u00E0 jour en va pas rentrer en conflit avec une mise \u00E0 jour ant\u00E9rieure, inconnue de l'appelant.
rollout-plan.store.hash=La valeur qui, selon l'appelant, correspond au hachage du contenu du plan de lancement en cours de remplacement. 
domain.resolve-expression-on-domain=Op\u00E9ration qui accepte une expression comme entr\u00E9e ( ou un string qui puisse \u00EAtre analys\u00E9 en expression) et la r\u00E9soudre en fonction des propri\u00E9t\u00E9s du syst\u00E8me local et des variables d'environnement sur tous les serveurs du domaine.
domain.resolve-expression-on-domain.expression=L'expression \u00E0 r\u00E9soudre.
