domain=O n\u00F3 da raiz do modelo de gerenciamento do domain-level.
domain.extension=A lista dos m\u00F3dulos de extens\u00E3o.
domain.path=A lista dos caminhos do filesystem nomeado. Os caminhos podem ou n\u00E3o ser inteiramente especificados. (ex.\: inclui os caminhos atuais.)
domain.profile=Uma lista de perfis dispon\u00EDveis para uso no dom\u00EDnio
domain.interface=A lista de interfaces nomeadas dispon\u00EDveis para uso no dom\u00EDnio. As interfaces podem ou n\u00E3o ser inteiramente especificadas (ex.\: incluem o crit\u00E9rio de como determinar o pr\u00F3prio endere\u00E7o IP.)
domain.socket-binding-group=A lista de grupos de binding de soquete dispon\u00EDveis para uso no dom\u00EDnio
domain.system-properties=A lista das propriedades de sistema para configurar todos os servidores no dom\u00EDnio.
domain.system-property=A propriedade do sistema para configurar todos os servidores no dom\u00EDnio.
domain.deployment=A lista de implanta\u00E7\u00F5es dispon\u00EDveis para uso no dom\u00EDnio
domain.server-group=A lista de grupos de servidores dispon\u00EDveis para uso no dom\u00EDnio
domain.local-host-name=O nome do controlador host de rodagem local.
domain.host=Os controladores do host rodando no dom\u00EDnio
domain.process-type=O tipo de processo representado pelo recurso da raiz. Tanto o "Controlador de Dom\u00EDnio" ou o "Controlador de Host".
domain.release-version=A vers\u00E3o da libera\u00E7\u00E3o do Servidor do Aplicativo JBoss rodando pelo controlador do host que est\u00E1 agindo como o controlador do dom\u00EDnio.
domain.release-codename=O codename da libera\u00E7\u00E3o do Servidor do Aplicativo JBoss rodando pelo controlador do host que age como o controlador do dom\u00EDnio.
domain.product-name=O nome do JBoss As baseado no produto rodando pelo controlador de host que age como o controlador do dom\u00EDnio.
domain.product-version=A vers\u00E3o da libera\u00E7\u00E3o do produto baseado no JBoss AS rodando pelo controlador do host que age como controlador do dom\u00EDnio.
domain.management-major-version=A vers\u00E3o principal da interface de gerenciamento do JBoss AS fornecida pelo controlador do host que age como controlador do dom\u00EDnio.
domain.management-minor-version=A vers\u00E3o inferior da interface de gerenciamento do JBoss AS fornecida pelo controlador do host que age como o controlador do dom\u00EDnio.
domain.deployment.remove=Remove a implanta\u00E7\u00E3o da lista do conte\u00FAdo dispon\u00EDvel para uso atrav\u00E9s do dom\u00EDnio. A implanta\u00E7\u00E3o n\u00E3o pode ser mapeada em quaisquer grupos do servidor.
domain.servers.restart=Reinicia todos os servidores atuais rodando no dom\u00EDnio.
domain.servers.start=Inicia todos os servidores configurados no dom\u00EDnio que n\u00E3o est\u00E1 rodando atualmente.
domain.servers.stop=Interrompe todos os servidores rodando no dom\u00EDnio.
server-group=A configura\u00E7\u00E3o do grupo do servidor.
server-group.add=Adiciona um novo grupo de servidor.
server-group.add.jvm=O nome jvm.
server-group.remove=Remove um novo grupo de servidor existente.
server-group.profile=O nome do perfil.
server-group.jvm=O jvm nomeado.
server-group.socket-binding-group=O grupo binding do soquete padr\u00E3o usado para os servidores associados com esse grupo.
server-group.socket-binding-port-offset=O deslocamento padr\u00E3o a ser adicionado aos valores da porta gerados pelo grupo binding do soquete.
server-group.management-subsystem-endpoint=Configure para verdadeiro para obter servidores pertencentes ao grupo de servidor de re-conex\u00E3o ao controlador do host usando o ponto de extremidade a partir do pr\u00F3prio subsistema remoto. O subsistema deve estar presente para esse trabalho.
server-group.deployment=A lista de implanta\u00E7\u00F5es dispon\u00EDveis para uso no grupo de servidor.
server-group.system-properties=A lista das propriedades de sistema para configurar todos os servidores nesse server-group.
server-group.system-property=A propriedade de sistema a configurar todos os servidores nesse server-group.
server-group.deployment.remove=Remove a implanta\u00E7\u00E3o da lista do conte\u00FAdo dispon\u00EDvel para uso nos servidores do grupo. Caso a implanta\u00E7\u00E3o esteja sendo implantada no per\u00EDodo de rodagem, esta ser\u00E1 a primeira a ser desimplantada.
server-group.servers.restart=Reinicia todos os servidores pertencentes ao grupo de servidor atual rodando no dom\u00EDnio.
server-group.servers.start=Inicia todos os servidores configurados pertencentes ao grupo de servidor no dom\u00EDnio que n\u00E3o est\u00E1 rodando.
server-group.servers.stop=Interrompe todos os servidores pertencentes ao grupo do servidor rodando no dom\u00EDnio.
rollout-plans=Armazena a informa\u00E7\u00E3o a respeito de um conjunto de planos de distribui\u00E7\u00E3o de atualiza\u00E7\u00E3o do gerenciamento \u00FAtil para o gerenciamento de clientes que est\u00E3o armazenados no reposit\u00F3rio do conte\u00FAdo do dom\u00EDnio. Os recursos filho sob esse recurso fornecem acesso aos planos para gerenciamento de clientes, permitindo que clientes usem planos referenciando-os pelo nome, evitando a necessidade de recri\u00E1-los para cada uso.
rollout-plans.hash=O hash de todos os planos de distribui\u00E7\u00E3o armazenados. Usado internamente pelos controladores de host para localizar o conte\u00FAdo do plano de distribui\u00E7\u00E3o.
rollout-plans.add=Adiciona a capacidade de armazenar os planos de distribui\u00E7\u00E3o nomeado.
rollout-plans.remove=Remove a capacidade de armazenar os planos de distribui\u00E7\u00E3o nomeados.
rollout-plan=O plano de distribui\u00E7\u00E3o armazenado.
rollout-plan.hash=O hash do conte\u00FAdo do plano de distribui\u00E7\u00E3o.
rollout-plan.content=O conte\u00FAdo do plano de distribui\u00E7\u00E3o, no formul\u00E1rio do JBoss DMR.
rollout-plan.add=Adiciona um plano de distribui\u00E7\u00E3o ao armazenamento persistente.
rollout-plan.remove=Remove o plano de distribui\u00E7\u00E3o a partir do armazenamento persistente.
rollout-plan.store=Atualiza o conte\u00FAdo de um plano de distribui\u00E7\u00E3o persistente existente, ap\u00F3s checagem de que o par\u00E2metro 'hash' fornecido coincide com o hash do plano de distribui\u00E7\u00E3o atual. Isto falha caso os hashes n\u00E3o coincidam. O uso dessa opera\u00E7\u00E3o ao inv\u00E9s da opera\u00E7\u00E3o 'write-attribute' para o atributo 'content' garante que a atualiza\u00E7\u00E3o n\u00E3o ir\u00E1 conflitar com uma atualiza\u00E7\u00E3o anterior desconhecida ao chamador.
rollout-plan.store.hash=O valor em que o chamador acredita estar o hash do conte\u00FAdo do plano de distribui\u00E7\u00E3o que est\u00E1 sendo substitu\u00EDdo.
rollout-plan.store.content=O conte\u00FAdo do plano de distribui\u00E7\u00E3o atualizado, na formul\u00E1rio do JBoss DMR.
domain.resolve-expression-on-domain=A opera\u00E7\u00E3o que aceita uma express\u00E3o como entrada (ou uma sequ\u00EAncia que pode ser analisada numa express\u00E3o) e a resolve nas propriedades do sistema local e vari\u00E1veis do ambiente em todos os servidores no dom\u00EDnio.
domain.resolve-expression-on-domain.expression=A express\u00E3o a ser resolvida.
domain.resolve-expression-on-domain.reply=A express\u00E3o resolvida, ou o formul\u00E1rio da sequ\u00EAncia do valor de entrada original, caso n\u00E3o tenha representado uma express\u00E3o.
