# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-logging/org/jboss/as/logging/LocalDescriptions, author croe@redhat.com
logging=La configuration du sous-syst\u00E8me de connexion.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-logging/org/jboss/as/logging/LocalDescriptions, author croe@redhat.com
logging.add=Ajouter le sous-syst\u00E8me de connexion.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-logging/org/jboss/as/logging/LocalDescriptions, author croe@redhat.com
logging.remove=Supprimer le sous-syst\u00E8me de connexion.
logging.add-logging-api-dependencies=Indique si oui ou non l'enregistrement des d\u00E9pendances de l'API doivent \u00EAtre ajout\u00E9s aux d\u00E9ploiements pendant le processus de d\u00E9ploiement. Une valeur true ajoutera les d\u00E9pendances pour le d\u00E9ploiement. Une valeur false emp\u00EAchera que les d\u00E9pendances de l'API de journalisation soient trait\u00E9es dans le d\u00E9ploiement.
logging.logging-profile=Un profil qui peut \u00EAtre assign\u00E9 \u00E0 un d\u00E9ploiement pour sa configuration de logging.
logging.logging-profile.add=Ajoute un profil de logging.
logging.logging-profile.remove=Supprime le profil de logging et tous les enregistreurs et gestionnaires de journaux associ\u00E9s.
logging.root-logger=D\u00E9finit l'enregistreur root pour ce contexte de log.
logging.root-logger.remove=Supprimer l'enregistreur root.
logging.root-logger.add=Ajoute l'enregistreur root.
logging.root-logger.add-handler=Ajoute un gestionnaire \u00E0 un enregistreur.
logging.root-logger.add-handler.name=Le nom du gestionnaire \u00E0 ajouter.
logging.root-logger.remove-handler=Supprime un gestionnaire d'un enregistreur.
logging.root-logger.remove-handler.name=Le nom de l'enregistreur \u00E0 supprimer.
logging.root-logger.remove-root-logger=Supprimer l'enregistreur root.
logging.root-logger.remove-root-logger.deprecated=Effectue l'op\u00E9ration Supprimer
logging.root-logger.change-root-log-level=Modifier le niveau d'enregistreur root.
logging.root-logger.change-root-log-level.deprecated=\u00C9ffectuer l'op\u00E9ration write-attribute.
logging.root-logger.root-logger-assign-handler.deprecated=\u00C9ffectuer l'op\u00E9ration add-handler.
logging.root-logger.root-logger-assign-handler=Assigner un gestionnaire \u00E0 l'enregistreur root.
logging.root-logger.root-logger-assign-handler.name=Le nom du gesitonnaire \u00E0 ajouter.
logging.root-logger.root-logger-unassign-handler=Retirer l'assignation d'un Handler de l'enregistreur root.
logging.root-logger.root-logger-unassign-handler.deprecated=\u00C9ffectuer l'op\u00E9ration remove-handler.
logging.root-logger.root-logger-unassign-handler.name=Le nom du gestionnaire \u00E0 supprimer.
logging.root-logger.set-root-logger=\u00C9quivalent \u00E0 l'op\u00E9ration Ajouter
logging.root-logger.set-root-logger.deprecated=\u00C9ffectuer l'op\u00E9ration Ajouter
logging.logger=D\u00E9finit une cat\u00E9gorie de cr\u00E9ateur de journal.
logging.logger.add=Ajouter une nouvelle cat\u00E9gorie de cr\u00E9ateur de journal.
logging.logger.remove=Supprimer une cat\u00E9gorie de cr\u00E9atuer de journal existante.
logging.logger.add-handler=Ajoute un gestionnaire \u00E0 un enregistreur.
logging.logger.add-handler.name=Le nom du gestionnaire \u00E0 ajouter.
logging.logger.remove-handler=Supprime un gestionnaire d'un enregistreur.
logging.logger.remove-handler.name=Le nom de l'enregistreur \u00E0 supprimer.
logging.logger.change-log-level=Changer le niveau d'enregistrement pour un cat\u00E9gorie d'enregistreur.
logging.logger.change-log-level.deprecated=\u00C9ffectuer l'op\u00E9ration write-attribute.
logging.logger.assign-handler=Assigner un Handler \u00E0 un Enregistreur.
logging.logger.assign-handler.deprecated=\u00C9ffectuer l'op\u00E9ration add-handler.
logging.logger.assign-handler.name=Le nom du gestionnaire \u00E0 ajouter.
logging.logger.unassign-handler=Retirer l'assignation d'un Handler d'un Enregistreur.
logging.logger.unassign-handler.deprecated=\u00C9ffectuer l'op\u00E9ration remove-handler.
logging.logger.unassign-handler.name=Le nom du gestionnaire \u00E0 supprimer.
logging.logger.name=Nom du cr\u00E9ateur de journal
logging.logger.use-parent-handlers=Indique si oui ou non cet enregistreur doit envoyer ses sorties \u00E0 son enregistreur-parent.
logging.logger.category=Indique la cat\u00E9gorie pour l'enregistreur.
logging.async-handler=D\u00E9finit un gestionnaire qui \u00E9crit dans les sous-gestionnaires dans un thread asynchrone. Utilis\u00E9 pour les gestionnaires avec des temps de retard.
logging.async-handler.queue-length=La longueur de la file d'attente \u00E0 utiliser avant de vider les \u00E9critures
logging.async-handler.overflow-action=Indique l'action \u00E0 prendre en cas de d\u00E9bordement. Les options valides sont \u00AB bloquer \u00BB (block) et \u00AB annuler \u00BB (discard)
logging.async-handler.subhandlers=Les Handlers associ\u00E9s \u00E0 ce handler async.
logging.async-handler.subhandlers.handler=Le sous-handler associ\u00E9 \u00E0 ce handler async.
logging.console-handler=D\u00E9finit un gestionnaire qui \u00E9crit sur la console.
logging.console-handler.add=Ajouter un nouveau handler de console.
logging.file-handler=D\u00E9finit un gestionnaire qui \u00E9crit dans un fichier.
logging.file-handler.add=Ajouter un nouvel handler de fichiers
logging.periodic-rotating-file-handler=D\u00E9finit un gestionnaire qui \u00E9crit dans un fichier, et qui met le log en rotation apr\u00E8s un certain temps d\u00E9riv\u00E9 du string du suffixe donn\u00E9, et qui doit \u00EAtre dans un format compr\u00E9hensible dans java.text.SimpleDateFormat.
logging.periodic-rotating-file-handler.add=Ajouter un nouveau handler de fichiers de rotations p\u00E9riodiques.
logging.periodic-rotating-file-handler.suffix=D\u00E9finir un string de suffixe. Le string doit \u00EAtre dans un format compr\u00E9hensible pour java.text.SimpleDateFormat. La dur\u00E9e de rotation sera automatiquement calcul\u00E9e sur la base du suffixe.
logging.size-rotating-file-handler.add=Ajouter une nouvelle taille de handler de fichier de rotation.
logging.size-rotating-file-handler.max-backup-index=Le nombre maximum d'archives \u00E0 sauvegarder.
logging.size-rotating-file-handler.rotate-size=La taille \u00E0 partir de laquelle on change de fichier de journalisation.
logging.size-rotating-file-handler.rotate-on-boot=Indique que le fichier doit \u00EAtre mis en rotation \u00E0 chaque fois que l'attribut de fichier est modifi\u00E9. Cela se passe en cours d'initialisation.
logging.custom-handler=D\u00E9finit un gestionnaire de journalisation personnalis\u00E9. Le gestionnaire personnalis\u00E9 doit \u00E9tendre java.util.logging.Handler. 
logging.custom-handler.class=La classe de handler de connexion \u00E0 utiliser.
logging.custom-handler.module=La module dont le handler de connexion d\u00E9pend.
logging.custom-handler.properties=D\u00E9finit les propri\u00E9t\u00E9s qui sont utilis\u00E9es pour le handler de connexion. Toutes les propri\u00E9t\u00E9s doivent \u00EAtre accessibles via une m\u00E9thode setter.
logging.custom-handler.properties.name=D\u00E9finit le nom de la propri\u00E9t\u00E9 \u00E0 d\u00E9finir.
logging.custom-handler.properties.value=D\u00E9finit la valeur de la propri\u00E9t\u00E9.
logging.syslog-handler=D\u00E9finit un gestionnaire syslog.
logging.syslog-handler.add=Ajoute un nouveau gestionnaire syslog.
logging.syslog-handler.remove=Supprime un gestionnaire syslog.
logging.syslog-handler.app-name=Le nom d'app utilis\u00E9 quand on formate le message en format RFC5424. Par d\u00E9faut, le nom de l'app est "java".
logging.syslog-handler.facility=Fonction d\u00E9finie par RFC-5424 (http\://tools.ietf.org/html/rfc5424)and RFC-3164 (http\://tools.ietf.org/html/rfc3164).
logging.syslog-handler.hostname=Le nom de l'h\u00F4te \u00E0 partir de qui les messages sont envoy\u00E9s. Par exemple, le nom de l'h\u00F4te sur lequel le serveur d'applications ex\u00E9cute.
logging.syslog-handler.port=Le port qu'\u00E9coute le serveur syslog.
logging.syslog-handler.server-address=Adresse du serveur syslog.
logging.syslog-handler.syslog-format=Formate le message log suivant la sp\u00E9cification RFC.
logging.pattern-formatter=Un formateur de mod\u00E8les \u00E0 utiliser avec les handlers.
logging.pattern-formatter.add=Ajoute une nouveau formateur de mod\u00E8les.
logging.pattern-formatter.remove=Supprime le formateur de mod\u00E8les.
logging.pattern-formatter.pattern=D\u00E9finit un mod\u00E8le pour le formateur.
logging.pattern-formatter.color-map=L'attribut color-map  permet une liste de couleurs d\u00E9limit\u00E9es par des virgules \u00E0 utiliser pour diff\u00E9rents niveaux, avec un formateur de mod\u00E8le. Le format pour le mod\u00E8le de mappage de couleur est level-name\:color-name. Niveaux valides\: grave (s\u00E9v\u00E8re), fatal (fatal), erreur (error), warn (premier avertissement), warning (second avertissement), info, debug, trace, config, fine (tr\u00E8s bien), finer (plus fin), finest (parfait). Couleurs valides ; noir, vert, rouge, jaune, bleu, magenta, cyan, blanc, noir vif, rouge vif, vert vif, bleu vif, jaune vif, magenta vif, cyan vif, blanc vif.
logging.custom-formatter=Un formateur personnalis\u00E9 \u00E0 utiliser avec les gestinnaires. Noter que la plupart des enregistrements de journalisation sont format\u00E9s en format printf. Les formateurs peuvent avoir besoin d'une invocation org.jboss.logmanager.ExtLogRecord\#getFormattedMessage() pour que le message soit format\u00E9 correctement.
logging.custom-formatter.add=Ajoute une nouveau formateur personnalis\u00E9.
logging.custom-formatter.remove=Supprime le formateur personnalis\u00E9.
logging.custom-formatter.class=La classe de gestionnaire de journalisation \u00E0 utiliser.
logging.custom-formatter.module=Le module dont le gestionnaire de journalisation d\u00E9pend.
logging.custom-formatter.properties=D\u00E9finit les propri\u00E9t\u00E9s utilis\u00E9es pour le gestionnaire de journalisation. Toutes les propri\u00E9t\u00E9s doivent \u00EAtre accessibles par une m\u00E9thode setter.
logging.custom-formatter.properties.name=D\u00E9finit le nom de la propri\u00E9t\u00E9 \u00E0 d\u00E9finir.
logging.custom-formatter.properties.value=D\u00E9finit la valeur de la propri\u00E9t\u00E9.
