# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-logging/org/jboss/as/logging/LocalDescriptions, author Yamamoto Mie
logging=\u30ED\u30AE\u30F3\u30B0\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u306E\u8A2D\u5B9A
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-logging/org/jboss/as/logging/LocalDescriptions, author Yamamoto Mie
logging.add=\u30ED\u30AE\u30F3\u30B0\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u306E\u8FFD\u52A0
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-logging/org/jboss/as/logging/LocalDescriptions, author Yamamoto Mie
logging.remove=\u30ED\u30AE\u30F3\u30B0\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u306E\u524A\u9664
logging.logging-profile=\u30ED\u30AE\u30F3\u30B0\u8A2D\u5B9A\u306B\u5BFE\u3057\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u3078\u306E\u5272\u308A\u5F53\u3066\u304C\u53EF\u80FD\u306A\u30D7\u30ED\u30D5\u30A1\u30A4\u30EB\u3002
logging.logging-profile.add=\u30ED\u30AE\u30F3\u30B0\u30D7\u30ED\u30D5\u30A1\u30A4\u30EB\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
logging.logging-profile.remove=\u30ED\u30AE\u30F3\u30B0\u30D7\u30ED\u30D5\u30A1\u30A4\u30EB\u3068\u95A2\u9023\u3059\u308B\u30ED\u30AC\u30FC\u304A\u3088\u3073\u30CF\u30F3\u30C9\u30E9\u30FC\u3092\u3059\u3079\u3066\u524A\u9664\u3057\u307E\u3059\u3002
logging.root-logger=\u3053\u306E\u30ED\u30B0\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u306B\u5BFE\u3057\u3066\u30EB\u30FC\u30C8\u30ED\u30AC\u30FC\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002
logging.root-logger.remove=\u30EB\u30FC\u30C8\u30ED\u30AC\u30FC\u306E\u524A\u9664
logging.root-logger.remove-root-logger=\u30EB\u30FC\u30C8\u30ED\u30AC\u30FC\u306E\u524A\u9664
logging.root-logger.remove-root-logger.deprecated=\u524A\u9664\u64CD\u4F5C\u3092\u4F7F\u7528
logging.root-logger.add=\u30EB\u30FC\u30C8\u30ED\u30AC\u30FC\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
logging.root-logger.add-handler=\u30ED\u30AC\u30FC\u306B\u30CF\u30F3\u30C9\u30E9\u30FC\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
logging.root-logger.add-handler.name=\u8FFD\u52A0\u3059\u308B\u30CF\u30F3\u30C9\u30E9\u30FC\u306E\u540D\u524D\u3002
logging.root-logger.remove-handler=\u30ED\u30AC\u30FC\u3088\u308A\u30CF\u30F3\u30C9\u30E9\u30FC\u3092\u524A\u9664\u3057\u307E\u3059\u3002
logging.root-logger.remove-handler.name=\u524A\u9664\u3059\u308B\u30ED\u30AC\u30FC\u306E\u540D\u524D\u3002
logging.root-logger.change-root-log-level=\u30EB\u30FC\u30C8\u30ED\u30AC\u30FC\u30EC\u30D9\u30EB\u306E\u5909\u66F4
logging.root-logger.change-root-log-level.deprecated=write-attribute \u64CD\u4F5C\u3092\u4F7F\u7528
logging.root-logger.root-logger-assign-handler.deprecated=add-handler \u64CD\u4F5C\u3092\u4F7F\u7528
logging.root-logger.root-logger-assign-handler=\u30EB\u30FC\u30C8\u30ED\u30AC\u30FC\u306B\u30CF\u30F3\u30C9\u30E9\u30FC\u3092\u5272\u308A\u5F53\u3066
logging.root-logger.root-logger-assign-handler.name=\u8FFD\u52A0\u3059\u308B\u30CF\u30F3\u30C9\u30E9\u30FC\u306E\u540D\u524D
logging.root-logger.root-logger-unassign-handler=\u30EB\u30FC\u30C8\u30ED\u30AC\u30FC\u3078\u306E\u30CF\u30F3\u30C9\u30E9\u30FC\u5272\u308A\u5F53\u3066\u3092\u89E3\u9664
logging.root-logger.root-logger-unassign-handler.deprecated=remove-handler \u64CD\u4F5C\u3092\u4F7F\u7528
logging.root-logger.root-logger-unassign-handler.name=\u524A\u9664\u3059\u308B\u30CF\u30F3\u30C9\u30E9\u30FC\u306E\u540D\u524D\u3002
logging.root-logger.set-root-logger=\u8FFD\u52A0\u64CD\u4F5C\u3068\u540C\u3058
logging.root-logger.set-root-logger.deprecated=\u8FFD\u52A0\u64CD\u4F5C\u3092\u4F7F\u7528
logging.logger=\u30ED\u30AC\u30FC\u30AB\u30C6\u30B4\u30EA\u30FC\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002
logging.logger.add=\u65B0\u898F\u30ED\u30AC\u30FC\u30AB\u30C6\u30B4\u30EA\u30FC\u306E\u8FFD\u52A0
logging.logger.remove=\u65E2\u5B58\u306E\u30ED\u30AC\u30FC\u30AB\u30C6\u30B4\u30EA\u30FC\u306E\u524A\u9664
logging.logger.name=\u30ED\u30AC\u30FC\u306E\u540D\u524D
logging.logger.use-parent-handlers=\u3053\u306E\u30ED\u30AC\u30FC\u304C\u89AA\u30ED\u30AC\u30FC\u306B\u51FA\u529B\u3092\u9001\u4FE1\u3059\u308B\u304B\u3069\u3046\u304B\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
logging.logger.category=\u30ED\u30AC\u30FC\u306E\u30AB\u30C6\u30B4\u30EA\u30FC\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
logging.logger.add-handler=\u30ED\u30AC\u30FC\u306B\u30CF\u30F3\u30C9\u30E9\u30FC\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
logging.logger.add-handler.name=\u8FFD\u52A0\u3059\u308B\u30CF\u30F3\u30C9\u30E9\u30FC\u306E\u540D\u524D\u3002
logging.logger.remove-handler=\u30ED\u30AC\u30FC\u3088\u308A\u30CF\u30F3\u30C9\u30E9\u30FC\u3092\u524A\u9664\u3057\u307E\u3059\u3002
logging.logger.remove-handler.name=\u524A\u9664\u3059\u308B\u30ED\u30AC\u30FC\u306E\u540D\u524D\u3002
logging.logger.change-log-level=\u30ED\u30AC\u30FC\u30AB\u30C6\u30B4\u30EA\u30FC\u306E\u30ED\u30AE\u30F3\u30B0\u30EC\u30D9\u30EB\u3092\u5909\u66F4
logging.logger.change-log-level.deprecated=write-attribute \u64CD\u4F5C\u3092\u4F7F\u7528
logging.logger.assign-handler=\u30ED\u30AC\u30FC\u306B\u30CF\u30F3\u30C9\u30E9\u30FC\u3092\u5272\u308A\u5F53\u3066
logging.logger.assign-handler.deprecated=add-handler \u64CD\u4F5C\u3092\u4F7F\u7528
logging.logger.assign-handler.name=\u8FFD\u52A0\u3059\u308B\u30CF\u30F3\u30C9\u30E9\u30FC\u306E\u540D\u524D
logging.logger.unassign-handler=\u30ED\u30AC\u30FC\u3078\u306E\u30CF\u30F3\u30C9\u30E9\u30FC\u5272\u308A\u5F53\u3066\u3092\u89E3\u9664
logging.logger.unassign-handler.deprecated=remove-handler \u64CD\u4F5C\u3092\u4F7F\u7528
logging.logger.unassign-handler.name=\u524A\u9664\u3059\u308B\u30CF\u30F3\u30C9\u30E9\u30FC\u306E\u540D\u524D\u3002
logging.handler=\u30ED\u30AE\u30F3\u30B0\u30CF\u30F3\u30C9\u30E9\u30FC
logging.handler.add=\u65B0\u898F\u30ED\u30AE\u30F3\u30B0\u30CF\u30F3\u30C9\u30E9\u30FC\u306E\u8FFD\u52A0
logging.handler.remove=\u65E2\u5B58\u306E\u30ED\u30AE\u30F3\u30B0\u30CF\u30F3\u30C9\u30E9\u30FC\u306E\u524A\u9664
logging.handler.name=\u30CF\u30F3\u30C9\u30E9\u30FC\u306E\u540D\u524D\u3002
logging.handler.name.deprecated=\u30CF\u30F3\u30C9\u30E9\u30FC\u306E\u30A2\u30C9\u30EC\u30B9\u306B\u540D\u524D\u304C\u542B\u307E\u308C\u3066\u3044\u308B\u305F\u3081\u3001name \u5C5E\u6027\u306F\u4F7F\u7528\u3057\u306A\u3044\u3067\u304F\u3060\u3055\u3044\u3002
logging.handler.enable=\u30ED\u30AE\u30F3\u30B0\u30CF\u30F3\u30C9\u30E9\u30FC\u3092\u6709\u52B9\u5316
logging.handler.enable.deprecated=enabled \u5C5E\u6027\u306B write-attribute \u3092\u4F7F\u7528
logging.handler.disable=\u30ED\u30AE\u30F3\u30B0\u30CF\u30F3\u30C9\u30E9\u30FC\u3092\u7121\u52B9\u5316
logging.handler.disable.deprecated=enabled \u5C5E\u6027\u306B write-attribute \u3092\u4F7F\u7528
logging.handler.change-log-level=\u30CF\u30F3\u30C9\u30E9\u30FC\u306E\u30ED\u30AE\u30F3\u30B0\u30EC\u30D9\u30EB\u3092\u5909\u66F4
logging.handler.change-log-level.deprecated=write-attribute \u64CD\u4F5C\u3092\u4F7F\u7528
logging.handler.change-file=\u30CF\u30F3\u30C9\u30E9\u30FC\u306E\u30D5\u30A1\u30A4\u30EB\u3092\u5909\u66F4
logging.handler.change-file.deprecated=write-attribute \u64CD\u4F5C\u3092\u4F7F\u7528
logging.handler.change-file.file=\u30CF\u30F3\u30C9\u30E9\u30FC\u306E\u30D5\u30A1\u30A4\u30EB\u3092\u5909\u66F4
logging.handler.update-properties=\u65E2\u5B58\u306E\u30CF\u30F3\u30C9\u30E9\u30FC\u306E\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u3092\u66F4\u65B0
logging.handler.update-properties.deprecated=write-attribute \u64CD\u4F5C\u3092\u4F7F\u7528
logging.handler.add-handler=AsyncHandler \u306B\u30ED\u30AC\u30FC\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
logging.handler.add-handler.name=\u8FFD\u52A0\u3059\u308B\u30CF\u30F3\u30C9\u30E9\u30FC\u306E\u540D\u524D
logging.handler.remove-handler=AsyncHandler \u3088\u308A\u30CF\u30F3\u30C9\u30E9\u30FC\u3092\u524A\u9664\u3057\u307E\u3059\u3002
logging.handler.remove-handler.name=\u524A\u9664\u3059\u308B\u30CF\u30F3\u30C9\u30E9\u30FC\u306E\u540D\u524D\u3002
logging.handler.assign-subhandler=\u30CF\u30F3\u30C9\u30E9\u30FC\u306B\u30B5\u30D6\u30CF\u30F3\u30C9\u30E9\u30FC\u3092\u5272\u308A\u5F53\u3066
logging.handler.assign-subhandler.deprecated=add-handler \u64CD\u4F5C\u3092\u4F7F\u7528
logging.handler.assign-subhandler.name=\u8FFD\u52A0\u3059\u308B\u30CF\u30F3\u30C9\u30E9\u30FC\u306E\u540D\u524D\u3002
logging.handler.unassign-subhandler=\u30B5\u30D6\u30CF\u30F3\u30C9\u30E9\u30FC\u306E\u30CF\u30F3\u30C9\u30E9\u30FC\u3078\u306E\u5272\u308A\u5F53\u3066\u3092\u89E3\u9664
logging.handler.unassign-subhandler.deprecated=remove-handler \u64CD\u4F5C\u3092\u4F7F\u7528
logging.handler.unassign-subhandler.name=\u524A\u9664\u3059\u308B\u30CF\u30F3\u30C9\u30E9\u30FC\u306E\u540D\u524D\u3002
logging.async-handler=\u975E\u540C\u671F\u30B9\u30EC\u30C3\u30C9\u3067\u30B5\u30D6\u30CF\u30F3\u30C9\u30E9\u30FC\u306B\u66F8\u304D\u8FBC\u307F\u3092\u884C\u3046\u30CF\u30F3\u30C9\u30E9\u30FC\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002\u5927\u5E45\u306A\u30E9\u30B0\u304C\u767A\u751F\u3059\u308B\u30CF\u30F3\u30C9\u30E9\u30FC\u306B\u4F7F\u7528\u3057\u307E\u3059\u3002
logging.async-handler.queue-length=\u66F8\u304D\u8FBC\u307F\u3092\u30D5\u30E9\u30C3\u30B7\u30E5\u3059\u308B\u524D\u306B\u4F7F\u7528\u3059\u308B\u30AD\u30E5\u30FC\u9577
logging.async-handler.overflow-action=\u30AA\u30FC\u30D0\u30FC\u30D5\u30ED\u30FC\u304C\u767A\u751F\u3057\u305F\u6642\u306B\u5B9F\u884C\u3059\u308B\u30A2\u30AF\u30B7\u30E7\u30F3\u3092\u6307\u5B9A\u3002\u6709\u52B9\u306A\u30AA\u30D7\u30B7\u30E7\u30F3\u306F block' \u3068 'discard'\u3002
logging.async-handler.add=\u65B0\u898F\u306E ASYNC \u30CF\u30F3\u30C9\u30E9\u30FC\u3092\u8FFD\u52A0
logging.async-handler.subhandlers=\u3053\u306E async \u30CF\u30F3\u30C9\u30E9\u30FC\u3068\u95A2\u9023\u4ED8\u3051\u3089\u308C\u305F\u30CF\u30F3\u30C9\u30E9\u30FC
logging.async-handler.subhandlers.handler=\u3053\u306E async \u30CF\u30F3\u30C9\u30E9\u30FC\u3068\u95A2\u9023\u4ED8\u3051\u3089\u308C\u305F\u30B5\u30D6\u30CF\u30F3\u30C9\u30E9\u30FC
logging.console-handler=\u30B3\u30F3\u30BD\u30FC\u30EB\u306B\u66F8\u304D\u8FBC\u307F\u3092\u884C\u3046\u30CF\u30F3\u30C9\u30E9\u30FC\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002
logging.console-handler.add=\u65B0\u898F\u306E\u30B3\u30F3\u30BD\u30FC\u30EB\u30CF\u30F3\u30C9\u30E9\u30FC\u3092\u8FFD\u52A0
logging.console-handler.target=\u30B3\u30F3\u30BD\u30FC\u30EB\u30CF\u30F3\u30C9\u30E9\u30FC\u306E\u5BFE\u8C61\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002\u5024\u306F SYSTEM_OUT \u3042\u308B\u3044\u306F SYSTEM_ERR \u3067\u3059\u3002
logging.file-handler=\u30D5\u30A1\u30A4\u30EB\u306B\u66F8\u304D\u8FBC\u307F\u3092\u884C\u3046\u30CF\u30F3\u30C9\u30E9\u30FC\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002
logging.file-handler.add=\u65B0\u898F\u30D5\u30A1\u30A4\u30EB\u30CF\u30F3\u30C9\u30E9\u30FC\u306E\u8FFD\u52A0
logging.periodic-rotating-file-handler=\u30D5\u30A1\u30A4\u30EB\u3078\u66F8\u304D\u8FBC\u307F\u3001\u30B5\u30D5\u30A3\u30C3\u30AF\u30B9\u6587\u5B57\u5217\u304B\u3089\u6307\u5B9A\u3055\u308C\u308B\u671F\u9593\u304C\u904E\u304E\u308B\u3068\u30ED\u30B0\u3092\u30ED\u30FC\u30C6\u30FC\u30B7\u30E7\u30F3\u3059\u308B\u30CF\u30F3\u30C9\u30E9\u30FC\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002\u30B5\u30D5\u30A3\u30C3\u30AF\u30B9\u6587\u5B57\u5217\u306F java.text.SimpleDateFormat \u304C\u89E3\u8AAD\u3067\u304D\u308B\u5F62\u5F0F\u3067\u306A\u3051\u308C\u3070\u306A\u308A\u307E\u305B\u3093\u3002
logging.periodic-rotating-file-handler.suffix=\u30B5\u30D5\u30A3\u30C3\u30AF\u30B9\u6587\u5B57\u5217\u3092\u8A2D\u5B9A\u3002\u6587\u5B57\u5217\u306F java.text.SimpleDateFormat \u3067\u89E3\u8AAD\u3067\u304D\u308B\u5F62\u5F0F\u3067\u3059\u3002\u30ED\u30FC\u30C6\u30FC\u30B7\u30E7\u30F3\u306E\u671F\u9593\u306F\u30B5\u30D5\u30A3\u30C3\u30AF\u30B9\u3092\u57FA\u306B\u81EA\u52D5\u8A08\u7B97\u3055\u308C\u307E\u3059\u3002
logging.periodic-rotating-file-handler.add=\u65B0\u3057\u3044\u5B9A\u671F\u30ED\u30FC\u30C6\u30FC\u30B7\u30E7\u30F3\u30D5\u30A1\u30A4\u30EB\u30CF\u30F3\u30C9\u30E9\u30FC\u3092\u8FFD\u52A0
logging.size-rotating-file-handler=\u30D5\u30A1\u30A4\u30EB\u306B\u66F8\u304D\u8FBC\u307F\u3092\u884C\u3044\u3001\u30D5\u30A1\u30A4\u30EB\u30B5\u30A4\u30BA\u304C\u7279\u5B9A\u306E\u6570\u5024\u3092\u8D8A\u3048\u305F\u5F8C\u306B\u30ED\u30B0\u306E\u30ED\u30FC\u30C6\u30FC\u30B7\u30E7\u30F3\u3092\u884C\u3044\u3001\u56FA\u5B9A\u6570\u306E\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u3092\u4FDD\u6301\u3059\u308B\u30CF\u30F3\u30C9\u30E9\u30FC\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002
logging.size-rotating-file-handler.max-backup-index=\u4FDD\u6301\u3059\u308B\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u306E\u6700\u5927\u6570\u3002
logging.size-rotating-file-handler.rotate-size=\u30ED\u30B0\u30D5\u30A1\u30A4\u30EB\u306E\u30ED\u30FC\u30C6\u30FC\u30B7\u30E7\u30F3\u3092\u884C\u3046\u30B5\u30A4\u30BA\u3002
logging.size-rotating-file-handler.rotate-on-boot=\u30D5\u30A1\u30A4\u30EB\u5C5E\u6027\u304C\u5909\u66F4\u3055\u308C\u308B\u305F\u3073\u306B\u30D5\u30A1\u30A4\u30EB\u304C\u30ED\u30FC\u30C6\u30FC\u30B7\u30E7\u30F3\u3055\u308C\u308B\u3079\u304D\u3067\u3042\u308B\u3053\u3068\u3092\u793A\u3057\u307E\u3059\u3002\u3053\u308C\u306F\u5E38\u306B\u521D\u671F\u5316\u6642\u306B\u767A\u751F\u3057\u307E\u3059\u3002
logging.size-rotating-file-handler.add=\u65B0\u3057\u3044\u30B5\u30A4\u30BA\u30ED\u30FC\u30C6\u30FC\u30B7\u30E7\u30F3\u30D5\u30A1\u30A4\u30EB\u30CF\u30F3\u30C9\u30E9\u30FC\u3092\u8FFD\u52A0
logging.custom-handler=\u30AB\u30B9\u30BF\u30E0\u306E\u30ED\u30AE\u30F3\u30B0\u30CF\u30F3\u30C9\u30E9\u30FC\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002\u30AB\u30B9\u30BF\u30E0\u306E\u30CF\u30F3\u30C9\u30E9\u30FC\u306F java.util.logging.Handler \u3092\u62E1\u5F35\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
logging.custom-handler.class=\u4F7F\u7528\u3055\u308C\u308B\u30ED\u30AE\u30F3\u30B0\u30CF\u30F3\u30C9\u30E9\u30FC\u30AF\u30E9\u30B9
logging.custom-handler.module=\u30ED\u30AE\u30F3\u30B0\u30CF\u30F3\u30C9\u30E9\u30FC\u304C\u4F9D\u5B58\u3059\u308B\u30E2\u30B8\u30E5\u30FC\u30EB
logging.custom-handler.properties=\u30ED\u30AE\u30F3\u30B0\u30CF\u30F3\u30C9\u30E9\u30FC\u306B\u4F7F\u7528\u3055\u308C\u308B\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u306F\u3059\u3079\u3066 setter \u30E1\u30BD\u30C3\u30C9\u3088\u308A\u30A2\u30AF\u30BB\u30B9\u53EF\u80FD\u3067\u306A\u3051\u308C\u3070\u306A\u308A\u307E\u305B\u3093\u3002
logging.custom-handler.properties.name=\u8A2D\u5B9A\u3059\u308B\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u306E\u540D\u524D\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002
logging.custom-handler.properties.value=\u30D7\u30ED\u30D1\u30C6\u30A3\u30FC\u306E\u5024\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002
logging.syslog-handler=syslog \u30CF\u30F3\u30C9\u30E9\u30FC\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002
logging.syslog-handler.add=\u65B0\u3057\u3044 syslog \u30CF\u30F3\u30C9\u30E9\u30FC\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
logging.syslog-handler.remove=syslog \u30CF\u30F3\u30C9\u30E9\u30FC\u3092\u524A\u9664\u3057\u307E\u3059\u3002
logging.syslog-handler.app-name=\u30E1\u30C3\u30BB\u30FC\u30B8\u3092 RFC5424 \u5F62\u5F0F\u3067\u30D5\u30A9\u30FC\u30DE\u30C3\u30C8\u3059\u308B\u6642\u306B\u4F7F\u7528\u3055\u308C\u308B\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u540D\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u540D\u306F "java" \u3067\u3059\u3002
logging.syslog-handler.facility=RFC-5424 (http\://tools.ietf.org/html/rfc5424) \u304A\u3088\u3073 RFC-3164 (http\://tools.ietf.org/html/rfc3164) \u306B\u3088\u3063\u3066\u5B9A\u7FA9\u3055\u308C\u308B\u30D5\u30A1\u30B7\u30EA\u30C6\u30A3\u3002
logging.syslog-handler.hostname=\u30E1\u30C3\u30BB\u30FC\u30B8\u304C\u9001\u4FE1\u3055\u308C\u308B\u30DB\u30B9\u30C8\u540D\u3002\u305F\u3068\u3048\u3070\u3001\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u30B5\u30FC\u30D0\u30FC\u304C\u7A3C\u50CD\u3057\u3066\u3044\u308B\u30DB\u30B9\u30C8\u306E\u540D\u524D\u306A\u3069\u3002
logging.syslog-handler.port=syslog \u30B5\u30FC\u30D0\u30FC\u304C\u30EA\u30C3\u30B9\u30F3\u3057\u3066\u3044\u308B\u30DD\u30FC\u30C8\u3002
logging.syslog-handler.server-address=syslog \u30B5\u30FC\u30D0\u30FC\u306E\u30A2\u30C9\u30EC\u30B9\u3002
logging.syslog-handler.syslog-format=RFC \u4ED5\u69D8\u306B\u57FA\u3065\u3044\u3066\u30ED\u30B0\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u30D5\u30A9\u30FC\u30DE\u30C3\u30C8\u3057\u307E\u3059\u3002
logging.common.append=\u30BF\u30FC\u30B2\u30C3\u30C8\u30D5\u30A1\u30A4\u30EB\u3078\u8FFD\u52A0\u3059\u308B\u304B\u3069\u3046\u304B\u3092\u6307\u5B9A
logging.common.autoflush=\u5404\u66F8\u304D\u8FBC\u307F\u306E\u5F8C\u3001\u81EA\u52D5\u7684\u306B\u30D5\u30E9\u30C3\u30B7\u30E5
logging.common.enabled=true \u306B\u8A2D\u5B9A\u3057\u305F\u5834\u5408\u3001\u30CF\u30F3\u30C9\u30E9\u30FC\u304C\u6709\u52B9\u306B\u306A\u308A\u3001\u901A\u5E38\u901A\u308A\u6A5F\u80FD\u3057\u307E\u3059\u3002false \u306B\u8A2D\u5B9A\u3057\u305F\u5834\u5408\u3001\u30ED\u30B0\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u51E6\u7406\u6642\u306B\u30CF\u30F3\u30C9\u30E9\u30FC\u304C\u7121\u8996\u3055\u308C\u307E\u3059\u3002
logging.common.encoding=\u3053\u306E\u30CF\u30F3\u30C9\u30E9\u30FC\u306B\u3088\u3063\u3066\u4F7F\u7528\u3055\u308C\u308B\u6587\u5B57\u30A8\u30F3\u30B3\u30FC\u30C7\u30A3\u30F3\u30B0\u3002
logging.common.formatter=\u30D5\u30A9\u30FC\u30DE\u30C3\u30BF\u30FC\u306E\u30D1\u30BF\u30FC\u30F3\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002
logging.common.handlers=\u3053\u306E\u30ED\u30AC\u30FC\u306B\u95A2\u9023\u3059\u308B\u30CF\u30F3\u30C9\u30E9\u30FC
logging.common.handlers.handler=\u30ED\u30AE\u30F3\u30B0\u30CF\u30F3\u30C9\u30E9\u30FC
logging.common.level=\u3069\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u30EC\u30D9\u30EB\u304C\u3053\u306E\u30ED\u30AC\u30FC\u306B\u3088\u3063\u3066\u30ED\u30B0\u306B\u8A18\u9332\u3055\u308C\u308B\u304B\u3092\u6307\u5B9A\u3059\u308B\u30ED\u30B0\u30EC\u30D9\u30EB\u3002\u3053\u306E\u5024\u3088\u308A\u3082\u4F4E\u3044\u30E1\u30C3\u30BB\u30FC\u30B8\u30EC\u30D9\u30EB\u306F\u7834\u68C4\u3055\u308C\u307E\u3059\u3002
logging.common.filter-spec=\u30D5\u30A3\u30EB\u30BF\u30FC\u3092\u5B9A\u7FA9\u3059\u308B\u30D5\u30A3\u30EB\u30BF\u30FC\u5F0F\u306E\u5024\u3002\u30D5\u30A3\u30EB\u30BF\u30FC\u306E\u4F8B\u306F\u30D1\u30BF\u30FC\u30F3 not(match("JBAS.*")) \u306B\u4E00\u81F4\u3057\u307E\u305B\u3093\u3002
logging.common.filter=\u7C21\u5358\u306A\u30D5\u30A3\u30EB\u30BF\u30FC\u30BF\u30A4\u30D7\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002
logging.common.filter.deprecated=filter-spec \u3092\u4F7F\u7528
logging.common.filter.all=\u30C1\u30A7\u30FC\u30F3\u5185\u306B\u3042\u308B\u8907\u6570\u306E\u30D5\u30A3\u30EB\u30BF\u30FC\u3067\u69CB\u6210\u3055\u308C\u308B\u30D5\u30A3\u30EB\u30BF\u30FC\u3002\u30ED\u30B0\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u30ED\u30AE\u30F3\u30B0\u3067\u304D\u306A\u3044\u3068\u5224\u65AD\u3059\u308B\u30D5\u30A3\u30EB\u30BF\u30FC\u304C\u3042\u308B\u5834\u5408\u3001\u30E1\u30C3\u30BB\u30FC\u30B8\u306F\u30ED\u30B0\u306B\u8A18\u9332\u3055\u308C\u305A\u3001\u5F8C\u7D9A\u306E\u30D5\u30A3\u30EB\u30BF\u30FC\u306F\u30C1\u30A7\u30C3\u30AF\u3055\u308C\u307E\u305B\u3093\u3002
logging.common.filter.any=\u30C1\u30A7\u30FC\u30F3\u5185\u306B\u3042\u308B\u8907\u6570\u306E\u30D5\u30A3\u30EB\u30BF\u30FC\u3067\u69CB\u6210\u3055\u308C\u308B\u30D5\u30A3\u30EB\u30BF\u30FC\u3002\u30ED\u30B0\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u30ED\u30AE\u30F3\u30B0\u3067\u304D\u306A\u3044\u3068\u5224\u65AD\u3059\u308B\u30D5\u30A3\u30EB\u30BF\u30FC\u304C\u3042\u308B\u5834\u5408\u3001\u30E1\u30C3\u30BB\u30FC\u30B8\u306F\u30ED\u30B0\u306B\u8A18\u9332\u3055\u308C\u3001\u5F8C\u7D9A\u306E\u30D5\u30A3\u30EB\u30BF\u30FC\u306F\u30C1\u30A7\u30C3\u30AF\u3055\u308C\u307E\u305B\u3093\u3002
logging.common.filter.accept=\u30ED\u30B0\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u3059\u3079\u3066\u8A31\u53EF\u3057\u307E\u3059\u3002
logging.common.filter.change-level=\u30CD\u30B9\u30C8\u3055\u308C\u305F\u30D5\u30A3\u30EB\u30BF\u30FC\u304C\u305D\u306E\u30EC\u30B3\u30FC\u30C9\u306B\u5BFE\u3057\u3066 true \u3092\u8A55\u4FA1\u3059\u308B\u5834\u5408\u3001\u65B0\u3057\u3044\u30EC\u30D9\u30EB\u3067\u30ED\u30B0\u30EC\u30B3\u30FC\u30C9\u3092\u5909\u66F4\u3059\u308B\u30D5\u30A3\u30EB\u30BF\u30FC\u3002
logging.common.filter.deny=\u30ED\u30B0\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u3059\u3079\u3066\u62D2\u5426\u3057\u307E\u3059\u3002
logging.common.filter.level=\u6307\u5B9A\u30EC\u30D9\u30EB\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u9664\u5916\u3059\u308B\u30D5\u30A3\u30EB\u30BF\u30FC\u3002
logging.common.filter.level-range=\u30EC\u30D9\u30EB\u306E\u7BC4\u56F2\u5185\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u307F\u3092\u30ED\u30B0\u306B\u8A18\u9332\u3059\u308B\u30D5\u30A3\u30EB\u30BF\u30FC\u3002
logging.common.filter.level-range.min-level=\u6700\u4F4E (\u6700\u3082\u6DF1\u523B\u3067\u306A\u3044) \u30EC\u30D9\u30EB\u3092\u542B\u3080
logging.common.filter.level-range.max-level=\u6700\u5927 (\u6700\u3082\u6DF1\u523B\u306A) \u30EC\u30D9\u30EB\u3092\u542B\u3080
logging.common.filter.min-level=\u6700\u4F4E (\u6700\u3082\u6DF1\u523B\u3067\u306A\u3044) \u30EC\u30D9\u30EB\u3092\u542B\u3080
logging.common.filter.min-inclusive=\u6700\u4F4E\u30EC\u30D9\u30EB\u306E\u5024\u304C\u542B\u307E\u308C\u308B\u5834\u5408\u306F true\u3001\u542B\u307E\u308C\u306A\u3044\u5834\u5408\u306F false\u3002
logging.common.filter.max-level=\u6700\u5927 (\u6700\u3082\u6DF1\u523B\u306A) \u30EC\u30D9\u30EB\u3092\u542B\u3080
logging.common.filter.max-inclusive=\u6700\u5927\u30EC\u30D9\u30EB\u306E\u5024\u304C\u542B\u307E\u308C\u308B\u5834\u5408\u306F true\u3001\u542B\u307E\u308C\u306A\u3044\u5834\u5408\u306F false\u3002
logging.common.filter.match=\u6B63\u898F\u8868\u73FE\u30D9\u30FC\u30B9\u306E\u30D5\u30A3\u30EB\u30BF\u30FC\u3002\u6B63\u898F\u8868\u73FE\u3068\u4E00\u81F4\u307E\u305F\u306F\u4E0D\u4E00\u81F4\u3059\u308B\u30ED\u30B0\u30EC\u30B3\u30FC\u30C9\u3092\u9664\u5916\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u307E\u3059\u3002\u6B63\u898F\u8868\u73FE\u306F raw \u30E1\u30C3\u30BB\u30FC\u30B8 (\u672A\u30D5\u30A9\u30FC\u30DE\u30C3\u30C8) \u306B\u5BFE\u3057\u3066\u30C1\u30A7\u30C3\u30AF\u3055\u308C\u307E\u3059\u3002
logging.common.filter.not=\u30CD\u30B9\u30C8\u3055\u308C\u305F\u30D5\u30A3\u30EB\u30BF\u30FC\u3092\u53CD\u8EE2\u3059\u308B\u30D5\u30A3\u30EB\u30BF\u30FC
logging.common.filter.replace=\u30CD\u30B9\u30C8\u3055\u308C\u305F\u30D5\u30A3\u30EB\u30BF\u30FC\u304C\u4E00\u81F4\u3059\u308B\u5834\u5408\u306B\u30E1\u30C3\u30BB\u30FC\u30B8\u306B\u30C6\u30AD\u30B9\u30C8\u306E\u7F6E\u304D\u63DB\u3048\u3092\u9069\u7528\u3059\u308B\u30D5\u30A3\u30EB\u30BF\u30FC\u3002
logging.common.filter.replace.pattern=\u4E00\u81F4\u3055\u305B\u308B\u30D1\u30BF\u30FC\u30F3
logging.common.filter.replace.replacement=\u6587\u5B57\u5217\u306E\u7F6E\u304D\u63DB\u3048
logging.common.filter.replace.replace-all=\u767A\u751F\u3057\u305F\u3082\u306E\u3092\u3059\u3079\u3066\u7F6E\u304D\u63DB\u3048\u308B\u5834\u5408\u306F true\u3002\u6700\u521D\u306B\u767A\u751F\u3057\u305F\u3082\u306E\u3060\u3051\u3092\u7F6E\u304D\u63DB\u3048\u308B\u5834\u5408\u306F false\u3002
logging.common.filter.pattern=\u4E00\u81F4\u3055\u305B\u308B\u30D1\u30BF\u30FC\u30F3
logging.common.filter.replacement=\u6587\u5B57\u5217\u306E\u7F6E\u304D\u63DB\u3048
logging.common.filter.replace-all=\u767A\u751F\u3057\u305F\u3082\u306E\u3092\u3059\u3079\u3066\u7F6E\u304D\u63DB\u3048\u308B\u5834\u5408\u306F true\u3002\u6700\u521D\u306B\u767A\u751F\u3057\u305F\u3082\u306E\u3060\u3051\u3092\u7F6E\u304D\u63DB\u3048\u308B\u5834\u5408\u306F false\u3002
logging.handler.file=\u30D1\u30B9\u304A\u3088\u3073\u4EFB\u610F\u306E\u76F8\u5BFE\u30D1\u30B9\u3067\u69CB\u6210\u3055\u308C\u308B\u30D5\u30A1\u30A4\u30EB\u306E\u8AAC\u660E
logging.handler.file.path=\u30D5\u30A1\u30A4\u30EB\u30B7\u30B9\u30C6\u30E0\u30D1\u30B9
logging.handler.file.relative-to=\u4EE5\u524D\u547D\u540D\u3055\u308C\u305F\u30D1\u30B9\u306E\u540D\u524D\u307E\u305F\u306F\u30B7\u30B9\u30C6\u30E0\u306B\u3088\u3063\u3066\u63D0\u4F9B\u3055\u308C\u308B\u6A19\u6E96\u30D1\u30B9\u306E 1 \u3064\u3002'relative-to' \u304C\u6307\u5B9A\u3055\u308C\u308B\u5834\u5408\u3001'path' \u5C5E\u6027\u306E\u5024\u306F\u3053\u306E\u5C5E\u6027\u306B\u3088\u3063\u3066\u6307\u5B9A\u3055\u308C\u308B\u76F8\u5BFE\u30D1\u30B9\u3068\u3057\u3066\u51E6\u7406\u3055\u308C\u307E\u3059\u3002\u30B7\u30B9\u30C6\u30E0\u306B\u3088\u3063\u3066\u63D0\u4F9B\u3055\u308C\u308B\u6A19\u6E96\u30D1\u30B9\u306B\u306F\u4EE5\u4E0B\u304C\u542B\u307E\u308C\u307E\u3059\u3002<ul><li>jboss.home - JBoss AS \u30C7\u30A3\u30B9\u30C8\u30EA\u30D3\u30E5\u30FC\u30B7\u30E7\u30F3\u306E\u30EB\u30FC\u30C8\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA</li><li>user.home - \u30E6\u30FC\u30B6\u30FC\u306E\u30DB\u30FC\u30E0\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA</li><li>user.dir - \u30E6\u30FC\u30B6\u30FC\u306E\u30AB\u30EC\u30F3\u30C8\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA</li><li>java.home - java \u306E\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA</li><li>jboss.server.base.dir - \u5404\u30B5\u30FC\u30D0\u30FC\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306E\u30EB\u30FC\u30C8\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA</li><li>jboss.server.data.dir - \u30B5\u30FC\u30D0\u30FC\u304C\u6C38\u7D9A\u30C7\u30FC\u30BF\u30D5\u30A1\u30A4\u30EB\u306E\u4FDD\u5B58\u306B\u4F7F\u7528\u3059\u308B\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA</li><li>jboss.server.log.dir - \u30B5\u30FC\u30D0\u30FC\u304C\u30ED\u30B0\u30D5\u30A1\u30A4\u30EB\u306E\u4FDD\u5B58\u306B\u4F7F\u3046\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA</li><li>jboss.server.tmp.dir - \u30B5\u30FC\u30D0\u30FC\u304C\u4E00\u6642\u7684\u306A\u30D5\u30A1\u30A4\u30EB\u306E\u4FDD\u5B58\u306B\u4F7F\u7528\u3059\u308B\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA</li><li>jboss.domain.servers.dir - \u3053\u306E\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u4E0B\u306B\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u304C\u5404\u30B5\u30FC\u30D0\u30FC\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306E\u4F5C\u696D\u9818\u57DF\u3092\u4F5C\u6210\u3057\u307E\u3059</li></ul>
