logging=\u30ED\u30AE\u30F3\u30B0\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u306E\u8A2D\u5B9A
logging.add=\u30ED\u30AE\u30F3\u30B0\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u306E\u8FFD\u52A0
logging.remove=\u30ED\u30AE\u30F3\u30B0\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u306E\u524A\u9664
root.logger=\u3053\u306E\u30ED\u30B0\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u306B\u5BFE\u3057\u3066\u30EB\u30FC\u30C8\u30ED\u30AC\u30FC\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002
root.logger.set=\u30EB\u30FC\u30C8\u30ED\u30AC\u30FC\u306E\u8A2D\u5B9A
root.logger.remove=\u30EB\u30FC\u30C8\u30ED\u30AC\u30FC\u306E\u524A\u9664
root.logger.change-level=\u30EB\u30FC\u30C8\u30ED\u30AC\u30FC\u30EC\u30D9\u30EB\u306E\u5909\u66F4
root.logger.assign-handler=\u30EB\u30FC\u30C8\u30ED\u30AC\u30FC\u306B\u30CF\u30F3\u30C9\u30E9\u30FC\u3092\u5272\u308A\u5F53\u3066
root.logger.unassign-handler=\u30EB\u30FC\u30C8\u30ED\u30AC\u30FC\u3078\u306E\u30CF\u30F3\u30C9\u30E9\u30FC\u5272\u308A\u5F53\u3066\u3092\u89E3\u9664
logger=\u30ED\u30AC\u30FC\u30AB\u30C6\u30B4\u30EA\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002
logger.add=\u65B0\u898F\u30ED\u30AC\u30FC\u30AB\u30C6\u30B4\u30EA\u306E\u8FFD\u52A0
logger.remove=\u65E2\u5B58\u306E\u30ED\u30AC\u30FC\u30AB\u30C6\u30B4\u30EA\u306E\u524A\u9664
logger.level=\u3053\u306E\u30ED\u30AC\u30FC\u3067\u3069\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u30EC\u30D9\u30EB\u3092\u30ED\u30B0\u3059\u308B\u304B\u6307\u5B9A\u3059\u308B\u30ED\u30B0\u30EC\u30D9\u30EB\u3002\u3053\u306E\u5024\u3088\u308A\u4F4E\u3044\u30E1\u30C3\u30BB\u30FC\u30B8\u30EC\u30D9\u30EB\u306F\u524A\u9664\u3055\u308C\u307E\u3059\u3002
logger.handler=\u30ED\u30AE\u30F3\u30B0\u30CF\u30F3\u30C9\u30E9\u30FC
logger.handlers=\u3053\u306E\u30ED\u30AC\u30FC\u3068\u95A2\u9023\u4ED8\u3051\u3089\u308C\u305F\u30CF\u30F3\u30C9\u30E9\u30FC
logger.use-parent-handlers=\u3053\u306E\u30ED\u30AC\u30FC\u304C\u89AA\u30ED\u30AC\u30FC\u306B\u51FA\u529B\u3092\u9001\u4FE1\u3059\u308B\u304B\u3092\u6307\u5B9A
logger.category=\u30ED\u30AC\u30FC\u306E\u30AB\u30C6\u30B4\u30EA\u3092\u6307\u5B9A
logger.change-level=\u30ED\u30AC\u30FC\u30AB\u30C6\u30B4\u30EA\u306E\u30ED\u30AE\u30F3\u30B0\u30EC\u30D9\u30EB\u3092\u5909\u66F4
logger.assign-handler=\u30ED\u30AC\u30FC\u306B\u30CF\u30F3\u30C9\u30E9\u30FC\u3092\u5272\u308A\u5F53\u3066
logger.unassign-handler=\u30ED\u30AC\u30FC\u3078\u306E\u30CF\u30F3\u30C9\u30E9\u30FC\u5272\u308A\u5F53\u3066\u3092\u89E3\u9664
handler=\u30ED\u30AE\u30F3\u30B0\u30CF\u30F3\u30C9\u30E9\u30FC
handler.add=\u65B0\u898F\u30ED\u30AE\u30F3\u30B0\u30CF\u30F3\u30C9\u30E9\u30FC\u306E\u8FFD\u52A0
handler.remove=\u65E2\u5B58\u306E\u30ED\u30AE\u30F3\u30B0\u30CF\u30F3\u30C9\u30E9\u30FC\u306E\u524A\u9664
handler.autoflush=\u5404\u66F8\u304D\u8FBC\u307F\u306E\u3042\u3068\u81EA\u52D5\u7684\u306E\u30D5\u30E9\u30C3\u30B7\u30E5
handler.level=\u3053\u308C\u304C\u3069\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u30EC\u30D9\u30EB\u3092\u30ED\u30B0\u3059\u308B\u304B\u6307\u5B9A\u3059\u308B\u30ED\u30B0\u30EC\u30D9\u30EB\u3002\u3053\u306E\u5024\u3088\u308A\u4F4E\u3044\u30E1\u30C3\u30BB\u30FC\u30B8\u30EC\u30D9\u30EB\u306F\u524A\u9664\u3055\u308C\u307E\u3059\u3002
handler.encoding=\u3053\u306E\u30CF\u30F3\u30C9\u30E9\u304C\u4F7F\u3046\u6587\u5B57\u30A8\u30F3\u30B3\u30FC\u30C7\u30A3\u30F3\u30B0
handler.filter=\u5358\u7D14\u306A\u30D5\u30A3\u30EB\u30BF\u30FC\u30BF\u30A4\u30D7\u3092\u5B9A\u7FA9
handler.filter.all=\u30C1\u30A7\u30FC\u30F3\u5185\u306B\u3042\u308B\u8907\u6570\u306E\u30D5\u30A3\u30EB\u30BF\u30FC\u3067\u69CB\u6210\u3055\u308C\u308B\u30D5\u30A3\u30EB\u30BF\u30FC\u3002\u30D5\u30A3\u30EB\u30BF\u30FC\u306B\u3088\u308A\u3001\u30ED\u30AE\u30F3\u30B0\u3067\u304D\u306A\u3044\u30ED\u30B0\u30E1\u30C3\u30BB\u30FC\u30B8\u304C\u767A\u898B\u3055\u308C\u305F\u5834\u5408\u3001\u305D\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u306F\u30ED\u30B0\u3055\u308C\u305A\u3001\u305D\u306E\u5F8C\u306E\u30D5\u30A3\u30EB\u30BF\u30FC\u306F\u30C1\u30A7\u30C3\u30AF\u3055\u308C\u307E\u305B\u3093\u3002
handler.filter.any=\u30C1\u30A7\u30FC\u30F3\u5185\u306B\u3042\u308B\u8907\u6570\u306E\u30D5\u30A3\u30EB\u30BF\u30FC\u3067\u69CB\u6210\u3055\u308C\u308B\u30D5\u30A3\u30EB\u30BF\u30FC\u3002\u30D5\u30A3\u30EB\u30BF\u30FC\u306B\u3088\u308A\u3001\u30ED\u30AE\u30F3\u30B0\u3067\u304D\u308B\u30ED\u30B0\u30E1\u30C3\u30BB\u30FC\u30B8\u304C\u767A\u898B\u3055\u308C\u305F\u5834\u5408\u3001\u305D\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u306F\u30ED\u30B0\u3055\u308C\u3001\u305D\u306E\u5F8C\u306E\u30D5\u30A3\u30EB\u30BF\u30FC\u306F\u30C1\u30A7\u30C3\u30AF\u3055\u308C\u307E\u305B\u3093\u3002
handler.filter.accept=\u5168\u30ED\u30B0\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u53D7\u3051\u5165\u308C\u307E\u3059\u3002
handler.filter.change-level=\u30CD\u30B9\u30C8\u5316\u3055\u308C\u305F\u30D5\u30A3\u30EB\u30BF\u30FC\u304C\u305D\u306E\u30EC\u30B3\u30FC\u30C9\u306B\u5BFE\u3057 true \u3068\u8A55\u4FA1\u3057\u305F\u5834\u5408\u306B\u65B0\u898F\u30EC\u30D9\u30EB\u3067\u30ED\u30B0\u30EC\u30B3\u30FC\u30C9\u3092\u5909\u66F4\u3059\u308B\u30D5\u30A3\u30EB\u30BF\u30FC
handler.filter.deny=\u5168\u30ED\u30B0\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u62D2\u5426\u3057\u307E\u3059\u3002
handler.filter.level=\u6307\u5B9A\u3057\u305F\u30EC\u30D9\u30EB\u3092\u6301\u3064\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u9664\u5916\u3059\u308B\u30D5\u30A3\u30EB\u30BF\u30FC
handler.filter.level-range=\u30EC\u30D9\u30EB\u7BC4\u56F2\u5185\u306B\u53CE\u307E\u308B\u30E1\u30C3\u30BB\u30FC\u30B8\u306E\u307F\u3092\u30ED\u30B0\u3059\u308B\u30D5\u30A3\u30EB\u30BF\u30FC
handler.filter.level-range.min-level=\u5FC5\u8981\u6700\u5C0F\u9650 (\u6700\u3082\u6DF1\u523B\u3067\u306A\u3044) \u30EC\u30D9\u30EB\u3092\u542B\u3081\u308B
handler.filter.level-range.min-inclusive=min-level \u5024\u3092\u542B\u3081\u308B\u5834\u5408\u306F true\u3001\u542B\u3081\u306A\u3044\u5834\u5408\u306F false
handler.filter.level-range.max-level=\u5FC5\u8981\u6700\u5927\u9650 (\u6700\u3082\u6DF1\u523B\u306A) \u30EC\u30D9\u30EB\u3092\u542B\u3081\u308B
handler.filter.level-range.max-inclusive=max-level \u5024\u3092\u542B\u3081\u308B\u5834\u5408\u306F true\u3001\u542B\u3081\u306A\u3044\u5834\u5408\u306F false
handler.filter.match=\u6B63\u898F\u8868\u73FE\u30D9\u30FC\u30B9\u306E\u30D5\u30A3\u30EB\u30BF\u30FC\u3002\u6B63\u898F\u8868\u73FE\u3068\u4E00\u81F4\u3059\u308B\uFF0F\u3057\u306A\u3044\u30ED\u30B0\u30EC\u30B3\u30FC\u30C9\u3092\u9664\u5916\u3059\u308B\u969B\u306B\u5229\u7528\u3002\u6B63\u898F\u8868\u73FE\u3092\u30ED\u30FC\u30E1\u30C3\u30BB\u30FC\u30B8 (\u30D5\u30A9\u30FC\u30DE\u30C3\u30C8\u3055\u308C\u3066\u3044\u306A\u3044\u3082\u306E) \u3068\u7167\u5408\u3057\u307E\u3059\u3002
handler.filter.not=\u30CD\u30B9\u30C8\u5316\u3057\u305F\u30D5\u30A3\u30EB\u30BF\u30FC\u3092\u53CD\u8EE2\u3059\u308B\u30D5\u30A3\u30EB\u30BF\u30FC
handler.filter.replace=\u30CD\u30B9\u30C8\u5316\u3057\u305F\u30D5\u30A3\u30EB\u30BF\u30FC\u304C\u4E00\u81F4\u3059\u308B\u5834\u5408\u3001\u30E1\u30C3\u30BB\u30FC\u30B8\u306B\u30C6\u30AD\u30B9\u30C8\u306E\u7F6E\u304D\u63DB\u3048\u3092\u9069\u7528\u3059\u308B\u30D5\u30A3\u30EB\u30BF\u30FC
handler.filter.replace.pattern=\u30DE\u30C3\u30C1\u3059\u3079\u304D\u30D1\u30BF\u30FC\u30F3
handler.filter.replace.replacement=\u6587\u5B57\u5217\u306E\u7F6E\u304D\u63DB\u3048
handler.filter.replace.replace-all=\u51FA\u73FE\u3057\u305F\u3082\u306E\u3092\u3059\u3079\u3066\u7F6E\u304D\u63DB\u3048\u308B\u5834\u5408\u306F true\u3002\u6700\u521D\u306B\u51FA\u3066\u304D\u305F\u3082\u306E\u3060\u3051\u306E\u5834\u5408\u306F false
handler.formatter=\u30D5\u30A9\u30FC\u30DE\u30C3\u30BF\u30FC\u3092\u5B9A\u7FA9
handler.name=\u30CF\u30F3\u30C9\u30E9\u30FC\u306E\u540D\u524D
handler.type=\u30CF\u30F3\u30C9\u30E9\u30FC\u306E\u578B
handler.enable=\u30ED\u30AE\u30F3\u30B0\u30CF\u30F3\u30C9\u30E9\u30FC\u3092\u6709\u52B9\u5316
handler.disable=\u30ED\u30AE\u30F3\u30B0\u30CF\u30F3\u30C9\u30E9\u30FC\u3092\u7121\u52B9\u5316
handler.change-level=\u30CF\u30F3\u30C9\u30E9\u30FC\u306E\u30ED\u30AE\u30F3\u30B0\u30EC\u30D9\u30EB\u3092\u5909\u66F4
handler.change-formatter=\u30CF\u30F3\u30C9\u30E9\u30FC\u306E\u30D5\u30A9\u30FC\u30DE\u30C3\u30BF\u30FC\u3092\u5909\u66F4
handler.change-file=\u30CF\u30F3\u30C9\u30E9\u30FC\u306E\u30D5\u30A1\u30A4\u30EB\u3092\u5909\u66F4
handler.properties=\u30ED\u30AE\u30F3\u30B0\u30CF\u30F3\u30C9\u30E9\u30FC\u306B\u5229\u7528\u3059\u308B\u30D7\u30ED\u30D1\u30C6\u30A3\u3092\u5B9A\u7FA9\u3002\u5168\u30D7\u30ED\u30D1\u30C6\u30A3\u306B\u306F setter \u30E1\u30BD\u30C3\u30C9\u3092\u4F7F\u3044\u30A2\u30AF\u30BB\u30B9\u3057\u307E\u3059\u3002
handler.properties.name=\u8A2D\u5B9A\u3059\u3079\u304D\u30D7\u30ED\u30D1\u30C6\u30A3\u540D\u3092\u5B9A\u7FA9
handler.properties.value=\u30D7\u30ED\u30D1\u30C6\u30A3\u306E\u5024\u3092\u5B9A\u7FA9
async.handler=\u975E\u540C\u671F\u30B9\u30EC\u30C3\u30C9\u3067\u30B5\u30D6\u30CF\u30F3\u30C9\u30E9\u30FC\u306B\u66F8\u304D\u8FBC\u307F\u3092\u884C\u3046\u30CF\u30F3\u30C9\u30E9\u30FC\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002\u5927\u5E45\u306A\u9045\u5EF6\u3092\u5165\u308C\u308B\u30CF\u30F3\u30C9\u30E9\u30FC\u306B\u4F7F\u7528\u3057\u307E\u3059\u3002
async.queue-length=\u66F8\u304D\u8FBC\u307F\u3092\u30D5\u30E9\u30C3\u30B7\u30E5\u3059\u308B\u524D\u306B\u5229\u7528\u3059\u308B\u30AD\u30E5\u30FC\u9577
async.overflow-action=\u30AA\u30FC\u30D0\u30FC\u30D5\u30ED\u30FC\u6642\u306B\u53D6\u308B\u3079\u304D\u30A2\u30AF\u30B7\u30E7\u30F3\u3092\u6307\u5B9A\u3002\u6709\u52B9\u306A\u30AA\u30D7\u30B7\u30E7\u30F3\u306F 'block' \u3068 'discard' \u3067\u3059\u3002
async.handler.add=\u65B0\u898F\u306E ASYNC \u30CF\u30F3\u30C9\u30E9\u30FC\u3092\u8FFD\u52A0
async.handler.update=\u65E2\u5B58\u306E ASYNC \u30CF\u30F3\u30C9\u30E9\u30FC\u306E\u30D7\u30ED\u30D1\u30C6\u30A3\u3092\u66F4\u65B0
async.handler.subhandlers=\u3053\u306E async \u30CF\u30F3\u30C9\u30E9\u30FC\u3068\u95A2\u9023\u4ED8\u3051\u3089\u308C\u305F\u30CF\u30F3\u30C9\u30E9\u30FC
async.handler.handler=\u3053\u306E async \u30CF\u30F3\u30C9\u30E9\u30FC\u3068\u95A2\u9023\u4ED8\u3051\u3089\u308C\u305F\u30B5\u30D6\u30CF\u30F3\u30C9\u30E9\u30FC
async.handler.assign-subhandler=ASYNC \u30CF\u30F3\u30C9\u30E9\u30FC\u306B\u30B5\u30D6\u30CF\u30F3\u30C9\u30E9\u30FC\u3092\u5272\u308A\u5F53\u3066
async.handler.unassign-subhandler=ASYNC \u30CF\u30F3\u30C9\u30E9\u30FC\u304B\u3089\u30B5\u30D6\u30CF\u30F3\u30C9\u30E9\u306E\u5272\u308A\u5F53\u3066\u3092\u89E3\u9664
console.handler=\u30B3\u30F3\u30BD\u30FC\u30EB\u306B\u66F8\u304D\u8FBC\u307F\u3092\u884C\u3046\u30CF\u30F3\u30C9\u30E9\u30FC\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002
console.handler.target=\u30B3\u30F3\u30BD\u30FC\u30EB\u30CF\u30F3\u30C9\u30E9\u30FC\u306E\u5BFE\u8C61\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002\u5024\u306F SYSTEM_OUT \u3042\u308B\u3044\u306F SYSTEM_ERR \u3067\u3059\u3002
console.handler.add=\u65B0\u898F\u306E\u30B3\u30F3\u30BD\u30FC\u30EB\u30CF\u30F3\u30C9\u30E9\u30FC\u3092\u8FFD\u52A0
console.handler.update=\u65E2\u5B58\u306E\u30B3\u30F3\u30BD\u30FC\u30EB\u30CF\u30F3\u30C9\u30E9\u30FC\u306E\u30D7\u30ED\u30D1\u30C6\u30A3\u3092\u66F4\u65B0
file.handler=\u30D5\u30A1\u30A4\u30EB\u306B\u66F8\u304D\u8FBC\u307F\u3092\u884C\u3046\u30CF\u30F3\u30C9\u30E9\u30FC\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002
file.handler.file=\u30D1\u30B9\u3068\u30AA\u30D7\u30B7\u30E7\u30F3\u306E\u76F8\u5BFE\u30D1\u30B9\u304B\u3089\u6210\u308B\u30D5\u30A1\u30A4\u30EB\u306E\u8AAC\u660E
file.handler.path=\u30D5\u30A1\u30A4\u30EB\u30B7\u30B9\u30C6\u30E0\u30D1\u30B9
file.handler.relative-to=\u4EE5\u524D\u306B\u540D\u524D\u6307\u5B9A\u3055\u308C\u305F\u30D1\u30B9\u306E\u540D\u524D\u3001\u3042\u308B\u3044\u306F\u30B7\u30B9\u30C6\u30E0\u304C\u63D0\u4F9B\u3057\u305F\u6A19\u6E96\u30D1\u30B9\u306E1\u3064\u3002'relative-to' \u304C\u6307\u5B9A\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u306F\u3001'path' \u5C5E\u6027\u306E\u5024\u306F\u3053\u306E\u5C5E\u6027\u304C\u6307\u5B9A\u3057\u305F\u30D1\u30B9\u3092\u8D77\u70B9\u3068\u3057\u305F\u76F8\u5BFE\u30D1\u30B9\u3068\u3057\u3066\u51E6\u7406\u3055\u308C\u307E\u3059\u3002\u30B7\u30B9\u30C6\u30E0\u304C\u63D0\u4F9B\u3059\u308B\u6A19\u6E96\u30D1\u30B9\u306F\u4EE5\u4E0B\u306E\u901A\u308A\u3067\u3059\u3002<ul><li>jboss.home - JBoss AS \u30C7\u30A3\u30B9\u30C8\u30EA\u30D3\u30E5\u30FC\u30B7\u30E7\u30F3\u306E root \u30C7\u30A3\u30EC\u30AF\u30C8\u30EA</li><li>user.home - \u30E6\u30FC\u30B6\u30FC\u306E\u30DB\u30FC\u30E0\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA</li><li>user.dir - \u30E6\u30FC\u30B6\u30FC\u306E\u73FE\u5728\u4F5C\u696D\u4E2D\u306E\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA</li><li>java.home - java \u306E\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u8A2D\u5B9A\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA</li><li>jboss.server.base.dir - \u5404\u30B5\u30FC\u30D0\u30FC\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306E root \u30C7\u30A3\u30EC\u30AF\u30C8\u30EA</li><li>jboss.server.data.dir - \u30B5\u30FC\u30D0\u30FC\u304C\u6C38\u7D9A\u30C7\u30FC\u30BF\u306E\u30D5\u30A1\u30A4\u30EB\u4FDD\u5B58\u306B\u4F7F\u3046\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA</li><li>jboss.server.log.dir - \u30B5\u30FC\u30D0\u30FC\u304C\u30ED\u30B0\u30D5\u30A1\u30A4\u30EB\u306E\u4FDD\u5B58\u306B\u4F7F\u3046\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA</li><li>jboss.server.tmp.dir - \u30B5\u30FC\u30D0\u30FC\u304C\u4E00\u6642\u7684\u306A\u30D5\u30A1\u30A4\u30EB\u4FDD\u5B58\u306B\u4F7F\u3046\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA</li><li>jboss.domain.servers.dir - \u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u914D\u4E0B\u3067\u500B\u5225\u30B5\u30FC\u30D0\u30FC\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306E\u4F5C\u696D\u30A8\u30EA\u30A2\u3092\u4F5C\u6210\u3059\u308B\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA</li></ul>
file.handler.append=\u5BFE\u8C61\u30D5\u30A1\u30A4\u30EB\u3092\u6DFB\u4ED8\u3059\u308B\u304B\u3092\u6307\u5B9A
file.handler.add=\u65B0\u898F\u30D5\u30A1\u30A4\u30EB\u30CF\u30F3\u30C9\u30E9\u30FC\u306E\u8FFD\u52A0
file.handler.update=\u65E2\u5B58\u306E\u30D5\u30A1\u30A4\u30EB\u30CF\u30F3\u30C9\u30E9\u30FC\u306E\u30D7\u30ED\u30D1\u30C6\u30A3\u3092\u66F4\u65B0
periodic.handler=\u7279\u5B9A\u306E\u63A5\u5C3E\u8F9E\u6587\u5B57\u5217\u304B\u3089\u306E\u671F\u9593\u5F8C\u30ED\u30B0\u3092\u30ED\u30FC\u30C6\u30FC\u30B7\u30E7\u30F3\u3059\u308B\u3088\u3046\u306B\u30D5\u30A1\u30A4\u30EB\u3078\u66F8\u304D\u8FBC\u3080\u30CF\u30F3\u30C9\u30E9\u30FC\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002\u30D5\u30A9\u30FC\u30DE\u30C3\u30C8\u306F java.text.SimpleDateFormat \u3067\u89E3\u8AAD\u3067\u304D\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
periodic.handler.suffix=\u30B5\u30D5\u30A3\u30C3\u30AF\u30B9\u6587\u5B57\u5217\u3092\u8A2D\u5B9A\u3002\u6587\u5B57\u5217\u306F java.text.SimpleDateFormat \u3067\u89E3\u8AAD\u3067\u304D\u308B\u30D5\u30A9\u30FC\u30DE\u30C3\u30C8\u3067\u3059\u3002\u30ED\u30FC\u30C6\u30FC\u30B7\u30E7\u30F3\u306E\u671F\u9593\u306F\u30B5\u30D5\u30A3\u30C3\u30AF\u30B9\u3092\u3082\u3068\u306B\u81EA\u52D5\u8A08\u7B97\u3055\u308C\u307E\u3059\u3002
periodic.handler.add=\u65B0\u305F\u306B\u5B9A\u671F\u30ED\u30FC\u30C6\u30FC\u30B7\u30E7\u30F3\u30D5\u30A1\u30A4\u30EB\u30CF\u30F3\u30C9\u30E9\u30FC\u3092\u8FFD\u52A0
periodic.handler.update=\u65E2\u5B58\u306E\u5B9A\u671F\u30ED\u30FC\u30C6\u30FC\u30B7\u30E7\u30F3\u30D5\u30A1\u30A4\u30EB\u30CF\u30F3\u30C9\u30E9\u30FC\u306E\u30D7\u30ED\u30D1\u30C6\u30A3\u3092\u66F4\u65B0
size.periodic.handler=\u30D5\u30A1\u30A4\u30EB\u30B5\u30A4\u30BA\u304C\u7279\u5B9A\u306E\u6570\u5024\u3092\u8D85\u3048\u3066\u304B\u3089\u30ED\u30B0\u3092\u30ED\u30FC\u30C6\u30FC\u30B7\u30E7\u30F3\u3057\u3001\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u3092\u4E00\u5B9A\u306E\u6570\u3060\u3051\u53D6\u308B\u3088\u3046\u306B\u3001\u30D5\u30A1\u30A4\u30EB\u306B\u66F8\u304D\u8FBC\u307F\u3092\u884C\u3046\u30CF\u30F3\u30C9\u30E9\u30FC\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002
size.periodic.handler.max-backup-index=\u30D0\u30C3\u30AF\u30A2\u30C3\u30D7\u306E\u4FDD\u5B58\u6700\u5927\u6570
size.periodic.handler.rotate-size=\u3069\u306E\u30B5\u30A4\u30BA\u3067\u30ED\u30B0\u30D5\u30A1\u30A4\u30EB\u3092\u30ED\u30FC\u30C6\u30FC\u30B7\u30E7\u30F3\u3059\u308B\u304B
size.periodic.handler.add=\u65B0\u305F\u306B\u30B5\u30A4\u30BA\u30ED\u30FC\u30C6\u30FC\u30B7\u30E7\u30F3\u30D5\u30A1\u30A4\u30EB\u30CF\u30F3\u30C9\u30E9\u30FC\u3092\u8FFD\u52A0
size.periodic.handler.update=\u65E2\u5B58\u306E\u30B5\u30A4\u30BA\u30ED\u30FC\u30C6\u30FC\u30B7\u30E7\u30F3\u30D5\u30A1\u30A4\u30EB\u30CF\u30F3\u30C9\u30E9\u30FC\u306E\u30D7\u30ED\u30D1\u30C6\u30A3\u3092\u66F4\u65B0
custom.handler=\u30AB\u30B9\u30BF\u30E0\u306E\u30ED\u30AE\u30F3\u30B0\u30CF\u30F3\u30C9\u30E9\u30FC\u3092\u5B9A\u7FA9\u3057\u307E\u3059\u3002\u30AB\u30B9\u30BF\u30E0\u306E\u30CF\u30F3\u30C9\u30E9\u30FC\u306F java.util.logging.Handler \u3092\u7D99\u627F\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
custom.handler.class=\u4F7F\u7528\u3059\u308B\u30ED\u30AE\u30F3\u30B0\u30CF\u30F3\u30C9\u30E9\u30FC\u30AF\u30E9\u30B9
custom.handler.module=\u30ED\u30AE\u30F3\u30B0\u30CF\u30F3\u30C9\u30E9\u30FC\u304C\u4F9D\u5B58\u3059\u308B\u30E2\u30B8\u30E5\u30FC\u30EB
custom.handler.update=\u65E2\u5B58\u306E\u30AB\u30B9\u30BF\u30E0\u30ED\u30AE\u30F3\u30B0\u30CF\u30F3\u30C9\u30E9\u30FC\u306E\u30D7\u30ED\u30D1\u30C6\u30A3\u3092\u66F4\u65B0
