# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-logging/org/jboss/as/logging/LocalDescriptions, author ldelima@redhat.com
logging=A configura\u00E7\u00E3o do subsistema de registro em log.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-logging/org/jboss/as/logging/LocalDescriptions, author ldelima@redhat.com
logging.add=Adiciona o subsistema de registro em log.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-logging/org/jboss/as/logging/LocalDescriptions, author ldelima@redhat.com
logging.remove=Remove o subsistema de registro em log.
logging.logging-profile=O perfil que pode ser determinado a uma implanta\u00E7\u00E3o para sua pr\u00F3pria configura\u00E7\u00E3o de registro em log.
logging.logging-profile.add=Adiciona um perfil de registro em log.
logging.logging-profile.remove=Remove o perfil de registro de log e todos os  agentes de log associados e manuseadores.
logging.root-logger=Define o agente de log da raiz para este contexto de log.
logging.root-logger.remove=Remove o agente de log da raiz.
logging.root-logger.remove-root-logger=Remove o agente de log da raiz.
logging.root-logger.remove-root-logger.deprecated=Usa a opera\u00E7\u00E3o remover.
logging.root-logger.add=Adiciona o agente de log da raiz.
logging.root-logger.add-handler=Adiciona um manuseador ao agente de log.
logging.root-logger.add-handler.name=O nome do manuseador a ser adicionado.
logging.root-logger.remove-handler=Remove o manuseador a partir do agente de log.
logging.root-logger.remove-handler.name=O nome do agente de log a ser removido.
logging.root-logger.change-root-log-level=Altera o n\u00EDvel do agente de log da raiz.
logging.root-logger.change-root-log-level.deprecated=Usa a opera\u00E7\u00E3o write-attribute.
logging.root-logger.root-logger-assign-handler.deprecated=Usa a opera\u00E7\u00E3o add-handler.
logging.root-logger.root-logger-assign-handler=Determina um Manuseador ao agente de log da raiz.
logging.root-logger.root-logger-assign-handler.name=O nome do manuseador a ser adicionado.
logging.root-logger.root-logger-unassign-handler=Cancela a determina\u00E7\u00E3o do Manuseador a partir do agente em log da raiz.
logging.root-logger.root-logger-unassign-handler.deprecated=Usa a opera\u00E7\u00E3o remove-handler.
logging.root-logger.root-logger-unassign-handler.name=O nome do manuseador a ser removido.
logging.root-logger.set-root-logger=\u00C9 o mesmo que adicionar a opera\u00E7\u00E3o
logging.root-logger.set-root-logger.deprecated=Usa a opera\u00E7\u00E3o adicionar.
logging.logger=Define uma categoria do agente em log.
logging.logger.add=Adiciona a nova categoria do agente em log.
logging.logger.remove=Remove uma categoria do agente em log existente.
logging.logger.name=Nome do agente em log
logging.logger.use-parent-handlers=Especifica se \u00E9 que este agente em log deve enviar seu resultado ao seu Agente em Log pai.
logging.logger.category=Especifica a categoria para o agente em log.
logging.logger.add-handler=Adiciona um manuseador ao agente em log.
logging.logger.add-handler.name=O nome do manuseador a ser adicionado.
logging.logger.remove-handler=Remove o manuseador a partir do agente em log.
logging.logger.remove-handler.name=O nome do agente de log a ser removido.
logging.logger.change-log-level=Altera o n\u00EDvel do registro de log para a categoria de registrador de log.
logging.logger.change-log-level.deprecated=Usa a opera\u00E7\u00E3o write-attribute.
logging.logger.assign-handler=Determina o Manuseador a um Agente em Log.
logging.logger.assign-handler.deprecated=Usa a opera\u00E7\u00E3o add-handler.
logging.logger.assign-handler.name=O nome do manuseador a ser adicionado.
logging.logger.unassign-handler=Cancela a determina\u00E7\u00E3o de um Manuseador a partir do Registrador do Log.
logging.logger.unassign-handler.deprecated=Usa a opera\u00E7\u00E3o remove-handler.
logging.logger.unassign-handler.name=O nome do manuseador a ser removido.
logging.handler=O manuseador do agente em log.
logging.handler.add=Adiciona o novo manuseador do registrador de log.
logging.handler.remove=Remove um manuseador de registro de log existente.
logging.handler.name=O nome do manuseador.
logging.handler.name.deprecated=O atributo do nome n\u00E3o deve ser usado uma vez que o endere\u00E7o do manuseador cont\u00E9m o nome.
logging.handler.enable=Ativar o manuseador do registro em log
logging.handler.enable.deprecated=Usa o write-atribute para o atributo ativado.
logging.handler.disable=Desativa o manuseador do registro de log.
logging.handler.disable.deprecated=Usa o write-atribute para o atributo ativado.
logging.handler.change-log-level=Altera o n\u00EDvel do registro de log para o manuseador.
logging.handler.change-log-level.deprecated=Usa a opera\u00E7\u00E3o write-attribute.
logging.handler.change-file=Altera o arquivo para um manuseador.
logging.handler.change-file.deprecated=Usa a opera\u00E7\u00E3o write-attribute.
logging.handler.change-file.file=Altera o arquivo para um manuseador.
logging.handler.update-properties=Atualiza as propriedades no manuseador existente.
logging.handler.update-properties.deprecated=Usa a opera\u00E7\u00E3o write-attribute.
logging.handler.add-handler=Adiciona o manuseador ai AsyncHandler.
logging.handler.add-handler.name=O nome do manuseador a ser adicionado.
logging.handler.remove-handler=Remove um manuseador do AsyncHandler.
logging.handler.remove-handler.name=O nome do manuseador a ser removido.
logging.handler.assign-subhandler=Determina um submanuseador ao manuseador.
logging.handler.assign-subhandler.deprecated=Usa a opera\u00E7\u00E3o add-handler.
logging.handler.assign-subhandler.name=O nome do manuseador a ser adicionado.
logging.handler.unassign-subhandler=Cancela a determina\u00E7\u00E3o de um submanuseador a partir do manuseador.
logging.handler.unassign-subhandler.deprecated=Usa a opera\u00E7\u00E3o remove-handler.
logging.handler.unassign-subhandler.name=O nome do manuseador a ser removido.
logging.async-handler=Define um manuseador que escreve os sub-manuseadores numa segmenta\u00E7\u00E3o ass\u00EDncrona. Usado por manuseadores que introduzem uma quantia substancial de atraso.
logging.async-handler.queue-length=O comprimento da fila a ser usada antes da grava\u00E7\u00E3o de esvaziamento
logging.async-handler.overflow-action=Especifica qual a\u00E7\u00E3o a ser tomada quando estiver cheio, As op\u00E7\u00F5es v\u00E1lidas s\u00E3o 'bloquear' e 'descartar'
logging.async-handler.add=Adiciona um novo manuseador ASYNC.
logging.async-handler.subhandlers=Os Manuseadores associados com esse manuseador ass\u00EDncrono.
logging.async-handler.subhandlers.handler=O submanuseador associado com esse manuseador ass\u00EDncrono.
logging.console-handler=Define um manuseador que escreve no console.
logging.console-handler.add=Adiciona um novo manuseador do console.
logging.console-handler.target=Define a destina\u00E7\u00E3o do manuseador do console. O valor pode ser tanto SYSTEM_OUT ou SYSTEM_ERR.
logging.file-handler=Define o manuseador que grava num arquivo.
logging.file-handler.add=Adiciona um novo manuseador de arquivo.
logging.periodic-rotating-file-handler=Define o manuseador que grava a um arquivo, roteando o log ap\u00F3s um determinado per\u00EDodo derivado a partir da sequ\u00EAncia de sufixo gerada, que deve estar num formato entendido pelo java.text.SimpleDateFormat.
logging.periodic-rotating-file-handler.suffix=Determina a sequ\u00EAncia do sufixo. A sequ\u00EAncia est\u00E1 num formato que pode ser entendida pelo java.text.SimpleDateFormat. O per\u00EDodo de rota\u00E7\u00E3o \u00E9 automaticamente calculado baseado no sufixo.
logging.periodic-rotating-file-handler.add=Adiciona um novo manuseador de arquivo de rota\u00E7\u00E3o peri\u00F3dica.
logging.size-rotating-file-handler=Define um manuseador que grava a um arquivo, roteando o log ap\u00F3s o tamanho de um arquivo crescer at\u00E9 um determinado ponto e continuar um n\u00FAmero fixo de back-ups.
logging.size-rotating-file-handler.max-backup-index=O n\u00FAmero m\u00E1ximo de back-ups a ser mantido.
logging.size-rotating-file-handler.rotate-size=O tamanho pelo qual rotear o arquivo de log.
logging.size-rotating-file-handler.rotate-on-boot=Indica que o arquivo deve ser rodado toda a vez que o atributo do arquivo \u00E9 alterado. Isto ocorre no per\u00EDodo de inicializa\u00E7\u00E3o. 
logging.size-rotating-file-handler.add=Adiciona o novo tamanho de manuseador de arquivo de rotea\u00E7\u00E3o.
logging.custom-handler=Define uma manuseador de registro de log. O manuseador de log deve estender o java.util.logging.Handler.
logging.custom-handler.class=A classe do manuseador de registro de log a ser usada. 
logging.custom-handler.module=O m\u00F3dulo que o manuseador de registro de log baseia-se.
logging.custom-handler.properties=Define as propriedades usadas para o manuseador do registro de log. Todas as propriedades devem ser acess\u00EDveis atrav\u00E9s do m\u00E9todo setter.
logging.custom-handler.properties.name=Define o nome da propriedade a ser configurada.
logging.custom-handler.properties.value=Define o valor da propriedade.
logging.syslog-handler=Define um manuseador syslog.
logging.syslog-handler.add=Adiciona um novo manuseador syslog.
logging.syslog-handler.remove=Remove o manuseador syslog.
logging.syslog-handler.app-name=O nome do aplicativo usado quando formatando a mensagem no formato RFC5424. O nome do aplicativo por padr\u00E3o \u00E9 "java".
logging.syslog-handler.facility=Facilidade conforme definida pelo RFC-5424 (http\://tools.ietf.org/html/rfc5424) e RFC-3164 (http\://tools.ietf.org/html/rfc3164).
logging.syslog-handler.hostname=O nome do host das mensagens sendo enviadas. Por exemplo, o nome do host que o aplicativo do servidor est\u00E1 sendo executado.
logging.syslog-handler.port=A porta que servidor syslog est\u00E1 escutando. 
logging.syslog-handler.server-address=O endere\u00E7o do servidor syslog.
logging.syslog-handler.syslog-format=Formata a mensagem do log de acordo com a especifica\u00E7\u00E3o RFC.
logging.common.append=Especifica se \u00E9 que anexar ao arquivo de destino.
logging.common.autoflush=Esvaziamento autom\u00E1tico ap\u00F3s cada grava\u00E7\u00E3o.
logging.common.enabled=Caso configurado para verdadeiro, o manuseador \u00E9 ativado e funciona normalmente. Caso configurado para falso, o manuseador \u00E9 ignorado quando processando as mensagens de log.
logging.common.encoding=A codifica\u00E7\u00E3o de caractere usada por este Manuseador.
logging.common.formatter=Define um padr\u00E3o para o formatador.
logging.common.handlers=Os Manuseadores associados com este Agente em Log.
logging.common.handlers.handler=O manuseador do registro de log.
logging.common.level=O n\u00EDvel de log especificando quais n\u00EDveis de mensagem ser\u00E1 registrados por este agente de log. Os n\u00EDveis de mensagem inferiores a este valor ser\u00E3o descartados.
logging.common.filter-spec=O valor de express\u00E3o do filtro para defini\u00E7\u00E3o do filtro. O exemplo para um filtro que n\u00E3o combina com o padr\u00E3o\: not(match("JBAS.*"))
logging.common.filter=Define um tipo de filtro simples.
logging.common.filter.deprecated=Usa o filter-spec.
logging.common.filter.all=O filtro consistente de diversos filtros numa corrente. Caso qualquer outro filtro encontrar a mensagem de log a ser cancelado o log, a mensagem n\u00E3o ser\u00E1 registrada em log e os filtros subsequentes n\u00E3o ser\u00E3o checados.
logging.common.filter.any=Um filtro consistindo de diversos filtros na corrente. Caso qualquer filtro encontrar a mensagem a ser registrada em log, a mensagem ser\u00E1 registrada em log e os filtros subsequentes n\u00E3o ser\u00E3o checados.
logging.common.filter.accept=Aceita todas as mensagens de log.
logging.common.filter.change-level=O filtro que modifica a grava\u00E7\u00E3o em log com o novo n\u00EDvel, caso o filtro aninhado avalie como verdadeiro para aquela grava\u00E7\u00E3o.
logging.common.filter.deny=Nega todas as mensagens de log.
logging.common.filter.level=O filtro que exclui a mensagem com o n\u00EDvel especificado.
logging.common.filter.level-range=O filtro que efetua o log apenas nas mensagens que encontram-se com um n\u00EDvel de intervalo.
logging.common.filter.level-range.min-level=O n\u00EDvel (menos severo), inclu\u00EDdo.
logging.common.filter.level-range.max-level=O valor m\u00E1ximo (mais severo), inclu\u00EDdo.
logging.common.filter.min-level=O n\u00EDvel (menos severo), inclu\u00EDdo.
logging.common.filter.min-inclusive=Verdadeiro, caso o valor m\u00EDnimo seja inclu\u00EDdo e falso, caso ele seja exclusivo.
logging.common.filter.max-level=O valor m\u00E1ximo (mais severo), inclu\u00EDdo.
logging.common.filter.max-inclusive=Verdadeiro, caso o valor m\u00E1ximo seja inclu\u00EDdo e falso, caso ele seja exclusivo.
logging.common.filter.match=O filtro baseado na express\u00E3o regular. Usado para excluir as grava\u00E7\u00F5es do log que combinam ou n\u00E3o combinam com a express\u00E3o. A express\u00E3o regular \u00E9 checada antes em rela\u00E7\u00E3o \u00E0 mensagem bruta (n\u00E3o formatada).
logging.common.filter.not=O filtro que inverte o filtro que est\u00E1 aninhado.
logging.common.filter.replace=O filtro que aplica a substitui\u00E7\u00E3o de texto na mensagem, caso o filtro aninhado coincidir com o mesmo.
logging.common.filter.replace.pattern=O padr\u00E3o para combina\u00E7\u00E3o
logging.common.filter.replace.replacement=A substitui\u00E7\u00E3o da sequ\u00EAncia
logging.common.filter.replace.replace-all=Verdadeiro, caso todas as ocorr\u00EAncias sejam substitu\u00EDdas. Falso, caso apenas a primeira ocorr\u00EAncia seja substitu\u00EDda.
logging.common.filter.pattern=O padr\u00E3o para combina\u00E7\u00E3o
logging.common.filter.replacement=A substitui\u00E7\u00E3o da sequ\u00EAncia
logging.common.filter.replace-all=Verdadeiro, caso todas as ocorr\u00EAncias sejam substitu\u00EDdas. Falso, caso apenas a primeira ocorr\u00EAncia seja substitu\u00EDda.
logging.handler.file=A descri\u00E7\u00E3o do arquivo consistindo do caminho e relativo opcional ao caminho.
logging.handler.file.path=O caminho do filesystem.
logging.handler.file.relative-to=O nome de outro caminho nomeado anteriormente, ou um dos caminhos padr\u00F5es fornecidos pelo sistema. Caso 'relative-to' seja fornecido, o valor do atributo 'caminho' \u00E9 tratado como relativo ao caminho especificado por esse atributo. Os caminhos padr\u00F5es fornecidos por esse sistema incluem\: <ul><li>jboss.home - the root directory of the JBoss AS distribution</li><li>user.home - user's home directory</li><li>user.dir - user's current working directory</li><li>java.home - java installation directory</li><li>jboss.server.base.dir - root directory for an individual server instance</li><li>jboss.server.data.dir - directory the server will use for persistent data file storage</li><li>jboss.server.log.dir - directory the server will use for log file storage</li><li>jboss.server.tmp.dir - directory the server will use for temporary file storage</li><li>jboss.domain.servers.dir - directory under which a host controller will create the working area for individual server instances</li></ul>
