# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-logging/org/jboss/as/logging/LocalDescriptions, author angela.garcia
logging=La configuraci\u00F3n del sub-sistema de registro.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-logging/org/jboss/as/logging/LocalDescriptions, author angela.garcia
logging.add=Agregar el sub-sistema de registro.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-logging/org/jboss/as/logging/LocalDescriptions, author angela.garcia
logging.remove=Borrar el sub-sistema de registro.
logging.logging-profile=Un perfil que se puede asignar a una implementaci\u00F3n para su configuraci\u00F3n de registro.
logging.logging-profile.add=Agrega un perfil de registro.
logging.logging-profile.remove=Borra el perfil de registro y todos los registros y manejadores asociados.
logging.root-logger=Define el registro ra\u00EDz para este contexto de registros.
logging.root-logger.remove=Borre el registro ra\u00EDz. 
logging.root-logger.remove-root-logger=Borre el registro ra\u00EDz. 
logging.root-logger.remove-root-logger.deprecated=Use la operaci\u00F3n de borrado.
logging.root-logger.add=Agrega el registro ra\u00EDz. 
logging.root-logger.add-handler=Agrega un controlador al registro.
logging.root-logger.add-handler.name=El nombre del controlador a agregar.
logging.root-logger.remove-handler=Borra un controlador del registro.
logging.root-logger.remove-handler.name=El nombre del registro a borrar.
logging.root-logger.change-root-log-level=Cambia el nivel del registro ra\u00EDz. 
logging.root-logger.change-root-log-level.deprecated=Use la operaci\u00F3n write-attribute.
logging.root-logger.root-logger-assign-handler.deprecated=Use la operaci\u00F3n add-handler.
logging.root-logger.root-logger-assign-handler=Asigna un controlador al registro ra\u00EDz. 
logging.root-logger.root-logger-assign-handler.name=El nombre del controlador a agregar.
logging.root-logger.root-logger-unassign-handler=Desasignar un controlador del registro ra\u00EDz.
logging.root-logger.root-logger-unassign-handler.deprecated=Use la operaci\u00F3n remove-handler.
logging.root-logger.root-logger-unassign-handler.name=El nombre del controlador a borrar.
logging.root-logger.set-root-logger=Lo mismo que la operaci\u00F3n de agregado
logging.root-logger.set-root-logger.deprecated=Use la operaci\u00F3n agregar.
logging.logger=Define una categor\u00EDa de registro.
logging.logger.add=Agregar una nueva categor\u00EDa de registro.
logging.logger.remove=Borra una categor\u00EDa existente de registro.
logging.logger.name=El nombre del registro.
logging.logger.use-parent-handlers=Especifica si este registro debe o no enviar su salida al registro padre.
logging.logger.category=Especifica la categor\u00EDa para el registro. 
logging.logger.add-handler=Agrega un controlador al registro.
logging.logger.add-handler.name=El nombre del controlador a agregar.
logging.logger.remove-handler=Borra un controlador del registro.
logging.logger.remove-handler.name=El nombre del registro a borrar.
logging.logger.change-log-level=Cambia el nivel de registro para una categor\u00EDa de registro.
logging.logger.change-log-level.deprecated=Use la operaci\u00F3n write-attribute.
logging.logger.assign-handler=Asigna un controlador a un registro.
logging.logger.assign-handler.deprecated=Use la operaci\u00F3n add-handler.
logging.logger.assign-handler.name=El nombre del controlador a agregar.
logging.logger.unassign-handler=Desasigna un controlador de un registro.
logging.logger.unassign-handler.deprecated=Use la operaci\u00F3n remove-handler.
logging.logger.unassign-handler.name=El nombre del controlador a borrar.
logging.handler=Un controlador de registro.
logging.handler.add=Agregar un nuevo controlador de registro.
logging.handler.remove=Borrar un controlador de registro existente.
logging.handler.name=El nombre del controlador.
logging.handler.name.deprecated=El atributo nombre no se debe utilizar ya que la direcci\u00F3n del controlador contiene el nombre.
logging.handler.enable=Habilitar un controlador de registro.
logging.handler.enable.deprecated=Usar el atributo de escritura para el atributo habilitado.
logging.handler.disable=Inhabilita un controlador de registro.
logging.handler.disable.deprecated=Usar el atributo de escritura para el atributo habilitado.
logging.handler.change-log-level=Cambiar el nivel de registro para un controlador.
logging.handler.change-log-level.deprecated=Use la operaci\u00F3n write-attribute.
logging.handler.change-file=Cambiar el archivo por un controlador.
logging.handler.change-file.deprecated=Use la operaci\u00F3n write-attribute.
logging.handler.change-file.file=Cambiar el archivo por un controlador.
logging.handler.update-properties=Actualizar las propiedades en el controlador existente.
logging.handler.update-properties.deprecated=Use la operaci\u00F3n write-attribute.
logging.handler.add-handler=Agrega un controlador al AsyncHandler.
logging.handler.add-handler.name=El nombre del controlador a agregar.
logging.handler.remove-handler.name=El nombre del controlador a borrar.
logging.handler.assign-subhandler.deprecated=Use la operaci\u00F3n add-handler.
logging.handler.assign-subhandler.name=El nombre del controlador a agregar.
logging.handler.unassign-subhandler.deprecated=Use la operaci\u00F3n remove-handler.
logging.handler.unassign-subhandler.name=El nombre del controlador a borrar.
logging.async-handler=Define un controlador, el cual escribe en los sub-controladores en un hilo asincr\u00F3nico. Utilizado para los controladores, el cual introduce una cantidad importante de retraso.
logging.async-handler.queue-length=La longitud de la cola a utilizar antes de vaciar la escritura
logging.async-handler.overflow-action=Especifica la acci\u00F3n a tomar al desbordarse.  Las opciones v\u00E1lidas son 'block' y 'discard'
logging.async-handler.add=Agregar un nuevo controlador ASYNC.
logging.async-handler.subhandlers=Los controladores asociados con este controlador async.
logging.async-handler.subhandlers.handler=Los sub-controladores asociados con este controlador async.
logging.console-handler=Define un controlador el cual escribe en la consola.
logging.console-handler.add=Agregar un nuevo controlador de consola.
logging.console-handler.target=Define el destino del controlador de la consola. El valor puede ser SYSTEM_OUT o SYSTEM_ERR.
logging.file-handler=Define un controlador el cual escribe en un archivo.
logging.file-handler.add=Agregar un nuevo controlador de archivos.
logging.periodic-rotating-file-handler=Define un controlador, el cual escribe en un archivo rotando el registro despu\u00E9s de un periodo de tiempo derivado de la cadena dada del sufijo, el cual debe estar en un formato comprensible para java.text.SimpleDateFormat.
logging.periodic-rotating-file-handler.suffix=Establezca la cadena del sufijo.  La cadena est\u00E1 en un formato, elcual lo puede entender java.text.SimpleDateFormat. El periodo de la rotaci\u00F3n se calcula autom\u00E1ticamente con base en el sufijo.
logging.periodic-rotating-file-handler.add=Agregar un nuevo controlador de archivos de rotaci\u00F3n peri\u00F3dica.
logging.size-rotating-file-handler=Define un controlador, el cual escribe en un archivo rotando el registro despu\u00E9s de que el tama\u00F1o del archivo crece m\u00E1s all\u00E1 de cierto punto manteniendo un n\u00FAmero fijo de copias de seguridad.
logging.size-rotating-file-handler.max-backup-index=El n\u00FAmero m\u00E1ximo de copias de respaldo a mantener.
logging.size-rotating-file-handler.rotate-size=El tama\u00F1o al cual rotar el archivo de registros.
logging.size-rotating-file-handler.add=Agregar un nuevo tama\u00F1o del controlador de archivos de rotaci\u00F3n.
logging.custom-handler=Defines un controlador de registro personalizado. El controlador personalizado debe extender java.util.logging.Handler.
logging.custom-handler.class=La clase del controlador de registro a utilizar.
logging.custom-handler.module=El m\u00F3dulo del cual depende el controlador de registros.
logging.custom-handler.properties=Define las propiedades utilizadas por el controlador de registros. Todas las propiedades deben ser accesibles por medio del m\u00E9todo setter.
logging.custom-handler.properties.name=Define el nombre de la propiedad a establecer.
logging.custom-handler.properties.value=Define el valor de la propiedad.
logging.common.append=Especifica si debe agregar al archivo destino.
logging.common.autoflush=Vac\u00EDa autom\u00E1ticamente despu\u00E9s de cada escritura.
logging.common.encoding=La codificaci\u00F3n de caracteres que este controlador utiliza.
logging.common.handlers=Los controladores asociados con este registro.
logging.common.handlers.handler=El controlador de registro.
logging.common.level=El nivel de registro que especifica los niveles de mensaje que se registrar\u00E1n en este registro. Los niveles de mensaje menores a este valor se descartar\u00E1n.
logging.common.filter=Define un tipo de filtro simple.
logging.common.filter.deprecated=Use filter-spec.
logging.common.filter.all=Un filtro que consiste de varios filtros en una cadena.  Si alg\u00FAn filtro encuentra que el mensaje de registro no se puede registrar entonces el mensaje no se registrar\u00E1 y los filtros posteriores no se verificar\u00E1n.
logging.common.filter.any=Un filtro que consiste de varios filtros en una cadena.  Si alg\u00FAn filtro encuentra que el mensaje de registro se puede registrar entonces el mensaje se registrar\u00E1 y los filtros posteriores no se verificar\u00E1n.
logging.common.filter.accept=Acepta todos los mensajes de registro.
logging.common.filter.change-level=Un filtro, el cual modifica el registro de registros con un nuevo nivel si el filtro anidado evalua como verdadero para ese registro.
logging.common.filter.deny=Niega todos los mensajes de registro.
logging.common.filter.level=Un filtro, el cual excluye un mensaje con el nivel especificado.
logging.common.filter.level-range=Un filtro, el cual s\u00F3lo registra los mensajes que caen dentro de un rango del nivel.
logging.common.filter.level-range.min-level=El nivel m\u00EDnimo (el menos severo), inclusivo.
logging.common.filter.level-range.max-level=El nivel m\u00E1ximo (el m\u00E1s severo), inclusivo.
logging.common.filter.min-level=El nivel m\u00EDnimo (el menos severo), inclusivo.
logging.common.filter.min-inclusive=Verdadero, si el valor min-level es inclusivo o falso si es exclusivo. 
logging.common.filter.max-level=El nivel m\u00E1ximo (el m\u00E1s severo), inclusivo.
logging.common.filter.max-inclusive=Verdadero, si el valor max-level es inclusivo o falso si es exclusivo. 
logging.common.filter.match=Un filtro basado en expresiones regulares. Utilizado para excluir registros de registros que coinciden o no con la expresi\u00F3n. La expresi\u00F3n regular se verifica frente al mensaje puro (sin formato).
logging.common.filter.not=Un filtro que invierte el filtro que es anidado.
logging.common.filter.replace=Un filtro, el cual aplica una substituci\u00F3n de texto en el mensaje si el filtro anidado coincide.
logging.common.filter.replace.pattern=El patr\u00F3n con el que se debe coincidir
logging.common.filter.replace.replacement=El reemplazo de la cadena
logging.common.filter.replace.replace-all=Verdadero si todas las ocurrencias se deben reemplazar; falso si s\u00F3lo aplica a la primera ocurrencia
logging.common.filter.pattern=El patr\u00F3n con el que se debe coincidir
logging.common.filter.replacement=El reemplazo de la cadena
logging.common.filter.replace-all=Verdadero si todas las ocurrencias se deben reemplazar; falso si s\u00F3lo aplica a la primera  ocurrencia
logging.handler.file=La descripci\u00F3n del archivo que consiste de la ruta y opcionalmente relativo a la ruta.
logging.handler.file.path=La ruta del sistema de archivos.
logging.handler.file.relative-to=El nombre de otra ruta nombrada previamente o de una de las rutas est\u00E1ndar que el  sistema proporciona. Si se brinda 'relative-to' entonces el valor del atributo 'path' se trata como relativo a la ruta especificada por este atributo. Las rutas est\u00E1ndar que el sistema proporciona incluyen\:<ul><li>jboss.home - el directorio ra\u00EDz de la distribuci\u00F3n JBoss AS</li><li>user.home - el directorio de inicio del usuario</li><li>user.dir - el directorio de trabajo actual del usuario</li><li>java.home - directorio de instalaci\u00F3n java</li><li>jboss.server.base.dir - directorio ra\u00EDz para una instancia individual del servidor</li><li>jboss.server.data.dir - directorio que el servidor utilizar\u00E1 para el almacenamiento de archivos de datos persistentes</li><li>jboss.server.log.dir - directorio que el servidor utilizar\u00E1 para el almacenamiento de archivos de registro</li><li>jboss.server.tmp.dir - directorio que el servidor utilizar\u00E1 para almacenamiento de archivos temporales</li><li>jboss.domain.servers.dir - directorio bajo el cual un controlador de hosts crear\u00E1 el \u00E1rea de trabajo para instancias individuales del servidor</li></ul>
