argUsage=Usage\: ./domain.sh [args...]%nwhere args include\:
argBackup=\u30DB\u30B9\u30C8\u304C\u30C9\u30E1\u30A4\u30F3\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u3067\u306A\u3044\u5834\u5408\u3067\u3082\u6C38\u7D9A\u30C9\u30E1\u30A4\u30F3\u8A2D\u5B9A\u306E\u30B3\u30D4\u30FC\u3092\u4FDD\u6301\u3057\u307E\u3059\u3002
argCachedDc=\u3053\u306E\u30DB\u30B9\u30C8\u304C\u30C9\u30E1\u30A4\u30F3\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u3067\u306A\u304F\u8D77\u52D5\u6642\u306B\u30C9\u30E1\u30A4\u30F3\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u306B\u554F\u3044\u5408\u308F\u305B\u3067\u304D\u306A\u3044\u5834\u5408\u3001\u30C9\u30E1\u30A4\u30F3\u8A2D\u5B9A\u3092\u30ED\u30FC\u30AB\u30EB\u3067\u30AD\u30E3\u30C3\u30B7\u30E5\u5316\u3057\u305F\u30B3\u30D4\u30FC\u3092\u4F7F\u3044\u8D77\u52D5\u3057\u307E\u3059(--backup \u53C2\u7167)\u3002
argDomainConfig=\u5229\u7528\u3059\u308B\u30C9\u30E1\u30A4\u30F3\u30D5\u30A1\u30A4\u30EB\u540D (\u30C7\u30D5\u30A9\u30EB\u30C8\u306F "domain.xml")
argHelp=\u3053\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u8868\u793A\u3057\u7D42\u4E86\u3057\u307E\u3059\u3002
argInterProcessHcAddress=\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u304C\u30D7\u30ED\u30BB\u30B9\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u304B\u3089\u901A\u4FE1\u3092\u30EA\u30C3\u30B9\u30F3\u3059\u3079\u304D\u30A2\u30C9\u30EC\u30B9
argInterProcessHcPort=\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u304C\u30D7\u30ED\u30BB\u30B9\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u304B\u3089\u901A\u4FE1\u3092\u30EA\u30C3\u30B9\u30F3\u3059\u3079\u304D\u30DD\u30FC\u30C8
argHostConfig=\u5229\u7528\u3059\u308B\u8A2D\u5B9A\u30D5\u30A1\u30A4\u30EB\u540D (\u30C7\u30D5\u30A9\u30EB\u30C8\u306F "host.xml")
argPcAddress=\u30D7\u30ED\u30BB\u30B9\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u304C\u5236\u5FA1\u3057\u3066\u3044\u308B\u30D7\u30ED\u30BB\u30B9\u304B\u3089\u901A\u4FE1\u3092\u30EA\u30C3\u30B9\u30F3\u3059\u308B\u30A2\u30C9\u30EC\u30B9
argPcPort=\u30D7\u30ED\u30BB\u30B9\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u304C\u5236\u5FA1\u3057\u3066\u3044\u308B\u30D7\u30ED\u30BB\u30B9\u304B\u3089\u901A\u4FE1\u3092\u30EA\u30C3\u30B9\u30F3\u3059\u308B\u30DD\u30FC\u30C8
argProperties=\u6307\u5B9A\u306E url \u304B\u3089\u30B7\u30B9\u30C6\u30E0\u30D7\u30ED\u30D1\u30C6\u30A3\u3092\u30ED\u30FC\u30C9\u3057\u307E\u3059\u3002
argSystem=\u30B7\u30B9\u30C6\u30E0\u30D7\u30ED\u30D1\u30C6\u30A3\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
argVersion=\u30D0\u30FC\u30B8\u30E7\u30F3\u3092\u51FA\u529B\u3057\u7D42\u4E86\u3057\u307E\u3059\u3002
argPublicBindAddress=\u30B7\u30B9\u30C6\u30E0\u30D7\u30ED\u30D1\u30C6\u30A3 jboss.bind.address \u3092\u6307\u5B9A\u306E\u5024\u306B\u8A2D\u5B9A\u3057\u307E\u3059\u3002
argInterfaceBindAddress=\u30B7\u30B9\u30C6\u30E0\u30D7\u30ED\u30D1\u30C6\u30A3 jboss.bind.address.<interface> \u3092\u6307\u5B9A\u306E\u5024\u306B\u8A2D\u5B9A\u3057\u307E\u3059\u3002
argDefaultMulticastAddress=\u30B7\u30B9\u30C6\u30E0\u30D7\u30ED\u30D1\u30C6\u30A3 jboss.default.multicast.address \u3092\u6307\u5B9A\u306E\u5024\u306B\u8A2D\u5B9A\u3057\u307E\u3059\u3002
argAdminOnly=\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u306E\u5B9F\u884C\u30BF\u30A4\u30D7\u3092 ADMIN_ONLY \u306B\u8A2D\u5B9A\u3057\u307E\u3059\u3002ADMIN_ONLY \u3067\u306F\u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u304C\u958B\u304D\u7BA1\u7406\u30EA\u30AF\u30A8\u30B9\u30C8\u3092\u53D7\u3051\u53D6\u308A\u307E\u3059\u304C\u3001\u30B5\u30FC\u30D3\u30B9\u306F\u958B\u59CB\u3055\u308C\u307E\u305B\u3093\u3002\u3053\u306E\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u304C\u30C9\u30E1\u30A4\u30F3\u306E\u30DE\u30B9\u30BF\u30FC\u306E\u5834\u5408\u3001\u30B9\u30EC\u30FC\u30D6\u306E\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u304B\u3089\u53D7\u4FE1\u63A5\u7D9A\u3092\u53D7\u3051\u4ED8\u3051\u307E\u3059\u3002
argMasterAddress=\u30B7\u30B9\u30C6\u30E0\u30D7\u30ED\u30D1\u30C6\u30A3 jboss.domain.master.address \u3092\u6307\u5B9A\u306E\u5024\u306B\u8A2D\u5B9A\u3057\u307E\u3059\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u30B9\u30EC\u30FC\u30D6\u306E\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u8A2D\u5B9A\u3067\u306F\u3001\u3053\u308C\u3092\u4F7F\u3044\u30DE\u30B9\u30BF\u30FC\u306E\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u306E\u30A2\u30C9\u30EC\u30B9\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
argMasterPort=\u30B7\u30B9\u30C6\u30E0\u30D7\u30ED\u30D1\u30C6\u30A3 jboss.domain.master.port \u3092\u6307\u5B9A\u306E\u5024\u306B\u8A2D\u5B9A\u3057\u307E\u3059\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u30B9\u30EC\u30FC\u30D6\u306E\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u8A2D\u5B9A\u3067\u306F\u3001\u30DE\u30B9\u30BF\u30FC\u306E\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u304C\u30CD\u30FC\u30C6\u30A3\u30D6\u7BA1\u7406\u901A\u4FE1\u306B\u5229\u7528\u3059\u308B\u30DD\u30FC\u30C8\u3092\u8A2D\u5B9A\u3059\u308B\u305F\u3081\u306B\u3053\u308C\u3092\u4F7F\u3044\u307E\u3059\u3002
noArgValue=\u5F15\u6570 %s \u306B\u5BFE\u3057\u3066\u5024\u304C\u63D0\u793A\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
cannotFindJavaExe=%s \u306B java \u5B9F\u884C\u30D5\u30A1\u30A4\u30EB\u304C\u3042\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002
invalidAuthKeyLen=\u8A8D\u8A3C\u30AD\u30FC\u306F 16 \u30D0\u30A4\u30C8\u9577\u3067\u306A\u3051\u308C\u3070\u306A\u308A\u307E\u305B\u3093\u3002
invalidCommandLen=cmd \u306B\u306F\u30A8\u30F3\u30C8\u30EA 1 \u3064\u4EE5\u4E0A\u6301\u305F\u305B\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
invalidJavaHome=Java home '%s' \u306F\u5B58\u5728\u3057\u307E\u305B\u3093\u3002
invalidJavaHomeBin=Java home \u306E bin '%1$s' \u306F\u5B58\u5728\u3057\u307E\u305B\u3093\u3002home \u30C7\u30A3\u30EC\u30AF\u30C8\u306F %2$s \u3068\u307F\u306A\u3055\u308C\u307E\u3057\u305F\u3002
invalidLength=%s \u9577\u306F\u7121\u52B9\u3067\u3059\u3002
invalidOption=\u7121\u52B9\u306A\u30AA\u30D7\u30B7\u30E7\u30F3\: %s
nullCommandComponent=\u30B3\u30DE\u30F3\u30C9\u306B\u306F null \u30B3\u30F3\u30DD\u30FC\u30CD\u30F3\u30C8\u304C\u542B\u307E\u308C\u3066\u3044\u307E\u3059\u3002
nullVar=%s \u306F null \u3067\u3059\u3002
