# These files are generated via Zanata (https://translate.jboss.org/project/view/jboss_as).
# Please do not update this file as it will be overwritten.

argUsage=Uso\: ./domain.sh [args...]%n onde argumentos incluem\:
argBackup=Mantenha uma c\u00F3pia da configura\u00E7\u00E3o do dom\u00EDnio de persist\u00EAncia mesmo se esse host n\u00E3o for um Controlador do Dom\u00EDnio
argCachedDc=Caso esse host n\u00E3o seja um Controlador de Dom\u00EDnio e n\u00E3o possa contactar o Controlador de Dom\u00EDnio na inicializa\u00E7\u00E3o, a inicializa\u00E7\u00E3o usando uma c\u00F3pia com cache local da configura\u00E7\u00E3o de dom\u00EDnio (consulte --backup)
argDomainConfig=O nome do arquivo da configura\u00E7\u00E3o do dom\u00EDnio para uso (o padr\u00E3o \u00E9 "domain.xml")
argHelp=Exibe essa mensagem e encerra
argInterProcessHcAddress=Endere\u00E7o pelo qual o controlador do host deve escutar pela comunica\u00E7\u00E3o a partir do controlador do processo
argInterProcessHcPort=A porta pela qual o controlador do processo deve escutar pela comunica\u00E7\u00E3o a partir do controlador do processo
argHostConfig=O nome do arquivo de configura\u00E7\u00E3o do host para uso (o padr\u00E3o \u00E9 "host.xml")
argPcAddress=Endere\u00E7o pelo qual o controlador do processo escura pela comunica\u00E7\u00E3o a partir dos processos em que controla
argPcPort=A porta pela qual o controlador do processo escuta pela comunica\u00E7\u00E3o pela qual processa seus controles
argProperties=Carrega as propriedades do sistema a partir do url gerado
argSystem=Determina a propriedade do sistema
argVersion=Imprime a vers\u00E3o e encerra
argPublicBindAddress=Determina o property jboss.bind.address do sistema ao valor gerado
argInterfaceBindAddress=Determina o jboss.bind.address.<interface> da propriedade de sistema ao valor gerado 
argDefaultMulticastAddress=Determina o  jboss.default.multicast.address da propriedade de sistema ao valor gerado
argAdminOnly=Determina o tipo de rodagem do controlador do sistema para o ADMIN_ONLY, levando isto a abrir interfaces administrativas e aceitar solicita\u00E7\u00F5es de gerenciamento. No entanto, ele n\u00E3o inicia servidores ou, caso o controlador do host seja o mestre para o dom\u00EDnio, aceitar conex\u00F5es de entrada a partir dos controladores host subsidi\u00E1rio. 
argMasterAddress=Determina o jboss.domain.master.address da propriedade do sistema a um valor gerado. Numa configura\u00E7\u00E3o do Controlador do Host subsidi\u00E1ria padr\u00E3o, isto \u00E9 usado para configurar o endere\u00E7o do Controlador do Host mestre.
argMasterPort=Determina o jboss.domain.master.port da propriedade de sistema ao valor gerado. Numa configura\u00E7\u00E3o do Controlador do Host subsidi\u00E1ria padr\u00E3o, isto \u00E9 usado para configurar a porta usada para a comunica\u00E7\u00E3o de gerenciamento nativa pelo Controlador do Host mestre.
noArgValue=Nenum valor fornecido para o argumento %s
cannotFindJavaExe=N\u00E3o foi poss\u00EDvel encontrar o java execut\u00E1vel sob %s.
invalidAuthKeyLen=A chave de autentica\u00E7\u00E3o deve ter 16 bites de comprimento
invalidCommandLen=o cmd deve possuir pelo menos uma entrada
invalidJavaHome=A p\u00E1gina principal do Java '%s' n\u00E3o existe.
invalidJavaHomeBin=O bin '%s' da p\u00E1gina principal do Java n\u00E3o existe. O diret\u00F3rio principal foi determinado a ser %s.
invalidLength=%s de comprimento \u00E9 inv\u00E1lido
invalidOption=Op\u00E7\u00E3o inv\u00E1lida\: %s
nullCommandComponent=O comando cont\u00E9m um componente nulo
nullVar=%s \u00E9 nulo
