# These files are generated via Zanata (https://translate.jboss.org/project/view/jboss_as).
# Please do not update this file as it will be overwritten.

nullEndpointName=O nome do ponto de extremidade nulo
nullEndpointClass=A classe do ponto de extremidade nulo
classLoaderResolutionFailed=N\u00E3o foi poss\u00EDvel resolver o m\u00F3dulo ou o classloader para a implanta\u00E7\u00E3o %s
cannotLoadDeploymentAspectsDefinitionFile=N\u00E3o foi poss\u00EDvel carregar os aspectos da implanta\u00E7\u00E3o WS a partir do %s
missingHandlerChainConfigFile=O arquivo de config da corrente do manuseador %s n\u00E3o foi encontrado no %s
unexpectedElement=Elemento inesperado\: %s
unexpectedEndTag=Marca final inesperada\: %s
unexpectedEndOfDocument=Alcan\u00E7ou o final do documento xml inesperadamente
missingDeploymentAspectClassAttribute=N\u00E3o foi poss\u00EDvel encontrar o atributo de classe para o aspecto de implanta\u00E7\u00E3o
cannotInstantiateDeploymentAspect=N\u00E3o foi poss\u00EDvel criar um aspecto de implanta\u00E7\u00E3o da classe\: %s
missingPropertyNameAttribute=N\u00E3o foi poss\u00EDvel encontrar o atributo do nome da propriedade para o aspecto da implanta\u00E7\u00E3o\: %s
missingPropertyClassAttribute=N\u00E3o foi poss\u00EDvel encontrar o atributo da classe da propriedade para o aspecto da implanta\u00E7\u00E3o\: %s
unsupportedPropertyClass=A classe da propriedade n\u00E3o \u00E9 suportada\: %s
cannotInstantiateList=N\u00E3o foi poss\u00EDvel criar a lista do tipo\: %s
cannotInstantiateMap=N\u00E3o foi poss\u00EDvel criar o mapa do tipo\: %s
noMetricsAvailable=Nenhuma m\u00E9trica dispon\u00EDvel
missingEjbComponentViewName=O nome da visualiza\u00E7\u00E3o do componente n\u00E3o pode ser nulo
cannotFindEjbView=N\u00E3o foi poss\u00EDvel encontrar a visualiza\u00E7\u00E3o ejb\: %s
nullRootUrl=Url de raiz nulo
nullPath=Caminho nulo
cannotGetVirtualFile=N\u00E3o foi poss\u00EDvel obter o VirtualFile a partir do URL\: %s
missingVirtualFile=O VirtualFile %s n\u00E3o existe
unmountedVirtualFile=O VirtualFile %s n\u00E3o est\u00E1 montado
missingChild=O parente '%s' n\u00E3o foi encontrado para o VirtualFile\: %s
createContextPhaseFailed=Falha ao criar o contexto
startContextPhaseFailed=Falha ao iniciar o contexto
stopContextPhaseFailed=Falha ao encerrar o contexto
destroyContextPhaseFailed=Falha ao destruir o contexto
cannotInstantiateServletDelegate=N\u00E3o foi poss\u00EDvel criar o servlet delegado\: %s
missingDeploymentProperty=N\u00E3o foi poss\u00EDvel obter a propriedade da implanta\u00E7\u00E3o\: %s
multipleSecurityDomainsDetected=Os dom\u00EDnios de seguran\u00E7a m\u00FAltiplos n\u00E3o suportados. O primeiro dom\u00EDnio\: %s' o segundo dom\u00EDnio\: '%s'\n\n
sameUrlPatternRequested=O ponto de extremidade do Servi\u00E7o da Web %s como o URL padr\u00E3o %s j\u00E1 foi registrado. O ponto de extremidade do Servi\u00E7o da Web %s est\u00E1 solicitando o mesmo URL padr\u00E3o. 
invalidServiceRefSetterMethodName=O destino de inje\u00E7\u00E3o do @WebServiceRef est\u00E1 inv\u00E1lido. Apenas os m\u00E9todos setter s\u00E3o permitidos\: %s
requiredServiceRefName=O 'nome' do atributo @WebServiceRef \u00E9 solicitado para as anota\u00E7\u00F5es do n\u00EDvel da classe.
requiredServiceRefType=O 'tipo' do atributo @WebServiceRef \u00E9 solicitado para as anota\u00E7\u00F5es do n\u00EDvel da classe.
missingEndpointConfig=O %s da config do ponto de extremidade n\u00E3o existe
mutuallyExclusiveHandlerChainAttributes=Os atributos %s, %s e %s s\u00E3o mutualmente exclusivos
wrongHandlerChainType=O tiplo de corrente do manuseador n\u00E3o suportado\: %s. Os tipos suportado s\u00E3o tanto %s ou %s
multipleHandlerChainsWithSameId=N\u00E3o foi poss\u00EDvel adicionar uma nova corrente de manuseador do tipo %s com a id %s. Essa id j\u00E1 est\u00E1 sendo usada na config %s para outra corrente.
missingHandlerChain=Config do ponto de extremidade %s\: %s a corrente do manuseador com a id %s n\u00E3o existe 
missingHandler=Config do ponto de extremidade %s, %s a corrente do manuseador %s\: n\u00E3o cont\u00E9m o manuseador com o nome %s
