cannotAddIntegration=N'a pas pu ajouter le module d'int\u00E9gration %s au d\u00E9ploiement
cannotChangeInputStream=Ne peut pas changer la r\u00E9f\u00E9rence du flux d'entr\u00E9e.
cannotCloseContainerManagedEntityManager=Le gestionnaire d'entit\u00E9s g\u00E9r\u00E9 par le conteneur ne peut \u00EAtre ferm\u00E9 que par le conteneur (aura lieu si la m\u00E9thode @remove est invoqu\u00E9e sur le SFSB contenant)
cannotCloseNonExtendedEntityManager=Ne peut fermer que les gestionnaires d'entit\u00E9s qui sont des instances de ExtendedEntityManager %s
cannotCloseTransactionContainerEntityManger=Le gestionnaire d'entit\u00E9s g\u00E9r\u00E9 par le conteneur peut uniquement \u00EAtre ferm\u00E9 par le conteneur (auto-nettoy\u00E9 \u00E0 tx/invocation et ferm\u00E9 lorsque le composant propri\u00E9taire est ferm\u00E9).
cannotCreateAdapter=N'a pas pu cr\u00E9er d'instance de classe d'adaptateur '%s'
cannotDeployApp=N'a pas pu d\u00E9ployer le fournisseur de persistance du paquetage de l'application '%s'
cannotGetSessionFactory=N'a pas pu obtenir de fabrique de session de la part du gestionnaire d'entit\u00E9s
cannotInjectResourceLocalEntityManager.0=Impossible d'injecter RESOURCE_LOCAL Container Managed EntityManagers par @PersistenceContext
cannotInjectResourceLocalEntityManager.1=Ne peut pas injecter RESOURCE_LOCAL entity manager %s par <persistence-context-ref>
cannotLoadAdapterModule=Erreur de chargement (class %s) du module de l'adaptateur du fournisseur de persistance (%s)
cannotLoadEntityClass=N'a pas pu charger la classe d'entit\u00E9 '%s' avec PersistenceUnitInfo.getClassLoader()
cannotLoadFromJpa=N'a pas pu charger %s \u00E0 partir du chargeur de classe des modules JPA
cannotLoadModule=N'a pas pu charger le module %s pour ajouter l'adaptateur %s au d\u00E9ploiement
cannotLoadPersistenceProviderModule=Erreur de chargement du module du fournisseur de persistances %s  (classe %s)
cannotReplaceStack=Erreur interne \: impossible de remplacer le haut de la pile car la pile est null (c-a-d vide).
cannotSpecifyBoth=Impossible de sp\u00E9cifier %s (%s) et %s (%s) dans %s pour %s
cannotUseExtendedPersistenceTransaction=Contexte de persistance \u00E9tendu trouv\u00E9 dans la pile d'appels d'invocations SFSB, mais ne peut pas \u00EAtre utilis\u00E9 car la traduction a d\u00E9j\u00E0 un contexte transactionnel qui lui est associ\u00E9. Cela peut \u00EAtre \u00E9vit\u00E9 si on change le code d'application, soit en \u00E9liminant le contexte de persistance \u00E9tendu, soit le contexte transactionnel. Voir JPA spec 2.0 section 7.6.3.1. Le nom d'unit\u00E9 de persistance scoped\=%s, contexte de persistance d\u00E9j\u00E0 en transaction\=%s, contexte de persistance \u00E9tendue \= %s.
childNotFound=N'a pas pu trouver l'enfant '%s' sur '%s'
classLevelAnnotationParameterRequired=Les annotations de niveau de classe %s doivent fournir un %s
persistenceUnitNotFound.2=Impossible de trouver une unit\u00E9 de persistance nomm\u00E9e %s dans %s
persistenceUnitNotFound.3=Impossible de trouver une unit\u00E9 de persistance nomm\u00E9e %s\#%s \u00E0 %s\n\n
emptyParameter=Le param\u00E8tre %s est vide
errorGettingTransaction=Une erreur a eu lieu lors de l'obtention de la transaction associ\u00E9e au thread en cours \: %s
failedToGetAdapter=N'a pas pu obtenir l'adaptateur pour le fournisseur de persistance '%s'
failedToAddPersistenceUnit=N'a pas pu ajouter le service d'unit\u00E9 de persistance pour %s
failedToGetModuleAttachment=N'a pas pu obtenir l'attachement du module pour %s
failedToParse=N'a pas pu lire %s
hibernateOnlyEntityManagerFactory=Ne peut injecter uniquement qu'\u00E0 partir d'une Hibernate EntityManagerFactoryImpl
invalidPersistenceUnitName=Le nom de l'unit\u00E9 de persistance (%s) contient un caract\u00E8re '%s' ill\u00E9gal
invalidScopeName=Le nom de la peristance scoped doit \u00EAtre "%s" mais \u00E9tait %s
invalidUrlConnection=N'a pas pu ajouter le module d'int\u00E9gration %s au module de d\u00E9ploiement, n'a pas eu la JarUrlConnection attendue, %s obtenue
missingPersistenceUnitMetadata=PersistenceUnitMetadata manquante (thread local non d\u00E9fini)
multipleAdapters=Le module de l'adaptateur du fournisseur de persistance (%s) a plus d'un adaptateur
multipleThreadsInvokingSfsb=Il y a plus d'un thread \u00E0 la fois entrain d'invoquer le stateful session bean '%s' en m\u00EAme temps
multipleThreadsUsingEntityManager=Il y a plus d'un thread qui utilise l'instance EntityManger '%s' en m\u00EAme temps
notSetInInterceptorContext=%s non d\u00E9fini dans InterceptorContext \: %s
notYetImplemented=Non encore impl\u00E9ment\u00E9
nullParameter=Erreur %s interne, %s null pass\u00E9
nullVar=Le param\u00E8tre %s est null
objectAlreadyDefined=L'objet pr\u00E9c\u00E9dent de la classe %s est %s et non Null
parameterMustBeExtendedEntityManager=Erreur interne, le param\u00E8tre attendu \u00E9tait de type ExtendedEntityManager, mais on a obtenu %s \u00E0 la place
persistenceProviderNotFound=PersistenceProvider '%s' non trouv\u00E9
relativePathNotFound=Chemin relatif non trouv\u00E9 \: %s
setterMethodOnlyAnnotation=La cible d'injection %s n'est pas valide. Les m\u00E9thodes setter uniquement sont autoris\u00E9es\: %s
transactionRequired=La transaction doit effectuer cette op\u00E9ration (soit en utilisant une transaction, soit un contexte de persistance \u00E9tendu)
noPUnitNameSpecifiedAndMultiplePersistenceUnits=Le nom d'unit\u00E9 (unitName) n'a pas \u00E9t\u00E9 sp\u00E9cifi\u00E9 et il y a %d d\u00E9finitions d'unit\u00E9 de persistance dans l'application %s. Il vous suffira soit de modifier l'application pour obtenir une d\u00E9finition d'unit\u00E9 de persistance, ou bien de sp\u00E9cifier le nom d'unit\u00E9 (unitName) pour chaque r\u00E9f\u00E9rence en unit\u00E9 de persistance.
couldNotCreateInstanceProvider=N'a pas pu cr\u00E9er une instance de classe de fournisseur de persistance %s
referenceCountedEntityManagerNegativeCount=erreur interne, le nombre de stateful session beans (%d) associ\u00E9 au contexte de persistance \u00E9tendu (%s) ne peut pas correspondre \u00E0 un nombre n\u00E9gatif.
