cannotAddIntegration=N\u00E3o foi poss\u00EDvel adicionar %s no m\u00F3dulo de integra\u00E7\u00E3o para implanta\u00E7\u00E3o
cannotChangeInputStream=N\u00E3o foi poss\u00EDvel alterar a refer\u00EAncia do fluxo de entrada.
cannotCloseContainerManagedEntityManager=O gerenciador da entidade de gerenciamento do recipiente n\u00E3o pode apenas ser encerrado pelo recipiente (acontecer\u00E1 quando o m\u00E9todo @remove for invocado contendo SFSB)
cannotCloseNonExtendedEntityManager=N\u00E3o foi poss\u00EDvel encerrar o gerenciador de entidade SFSB XPC que s\u00E3o inst\u00E2ncias do ExtendedEntityManager %s
cannotCloseTransactionContainerEntityManger=O gerenciador de entidade gerenciado do recipiente pode apenas ser encerrado pelo recipiente (auto limpeza no tx/invoca\u00E7\u00E3o e encerrar quando o componente pertencido for encerrado.)
cannotCreateAdapter=N\u00E3o foi poss\u00EDvel criar uma inst\u00E2ncia da classe do adpatador '%s'
cannotDeployApp=N\u00E3o foi poss\u00EDvel implantar o provedor de persist\u00EAncia com pacote do aplicativo '%s'
cannotGetSessionFactory=N\u00E3o foi poss\u00EDvel obter a cria\u00E7\u00E3o da sess\u00E3o Hibernate do gerenciador de entidade
cannotInjectResourceLocalEntityManager.0=N\u00E3o foi poss\u00EDvel injetar o recipiente RESOURCE_LOCAL gerenciado EntityManagers usando o @PersistenceContext
cannotInjectResourceLocalEntityManager.1=N\u00E3o foi poss\u00EDvel injetar o gerenciador de entidade RESOURCE_LOCAL  %s usando <persistence-context-ref> 
cannotLoadAdapterModule=O m\u00F3dulo do adaptador do provedor persistente (%s) erro no carregamento (classe %s)
cannotLoadEntityClass=N\u00E3o foi poss\u00EDvel carregar a classe de entidade '%s' com o PersistenceUnitInfo.getClassLoader()
cannotLoadFromJpa=N\u00E3o foi poss\u00EDvel carregar %s a partir do classloader de m\u00F3dulos JPA
cannotLoadModule=N\u00E3o foi poss\u00EDvel carregar %s para adicionar %s adaptador para implanta\u00E7\u00E3o
cannotLoadPersistenceProviderModule=Erro ao carregar o m\u00F3dulo do provedor de persist\u00EAncia %s (classe %s)
cannotReplaceStack=Erro interno\: n\u00E3o foi poss\u00EDvel substituir a parte superior uma vez que a pilha \u00E9 nula (o mesmo de estar vazia).
cannotSpecifyBoth=N\u00E3o foi poss\u00EDvel especificar ambos %s (%s) e %s (%s) no %s para %s
cannotUseExtendedPersistenceTransaction=O contexto de persist\u00EAncia estendido encontrado na invoca\u00E7\u00E3o SFSB, mas n\u00E3o foi poss\u00EDvel ser usado uma vez que a transa\u00E7\u00E3o j\u00E1 possui um contexto transacional associado com isto. Isto pode ser evitado pela altera\u00E7\u00E3o do c\u00F3digo de aplica\u00E7\u00E3o, para eliminar o contexto de persist\u00EAncia estendido ou o contexto transacional. Consulte a se\u00E7\u00E3o 7.6.3.1 do JPA spec 2.0. O name\=%s da unidade de persist\u00EAncia com escopo, contexto de persist\u00EAncia j\u00E1 na transa\u00E7\u00E3o \=%s, contexto de persist\u00EAncia estendido \=%s.
childNotFound=N\u00E3o foi poss\u00EDvel encontrar o filho '%s' no '%s'
classLevelAnnotationParameterRequired=As anota\u00E7\u00F5es %s do n\u00EDvel da classe devem fornecer um %s
persistenceUnitNotFound.2=N\u00E3o foi poss\u00EDvel encontrar uma unidade de persist\u00EAncia nomeada %s no %s
persistenceUnitNotFound.3=N\u00E3o foi poss\u00EDvel encontrar uma unidade de persist\u00EAncia %s\#%s no %s
emptyParameter=O par\u00E2metro %s est\u00E1 vazio
errorGettingTransaction=Ocorreu um erro enquanto obtendo a transa\u00E7\u00E3o associada com o thread atual\: %s
failedToGetAdapter=Falha ao obter o adaptador para o provedor de persist\u00EAncia '%s'
failedToAddPersistenceUnit=Falha ao adicionar o servi\u00E7o da unidade de persist\u00EAncia para %s
failedToGetModuleAttachment=Falha ao obter o anexo do m\u00F3dulo para %s
failedToParse=Falha ao pesquisar %s
hibernateOnlyEntityManagerFactory=N\u00E3o foi poss\u00EDvel injetar do Hibernate EntityManagerFactoryImpl
invalidPersistenceUnitName=Nome da unidade de persist\u00EAncia (%s) cont\u00E9m caracteres '%s' ilegais
invalidScopeName=O nome de persist\u00EAncia com escopo deve ser "%s" mas era %s
invalidUrlConnection=N\u00E3o foi poss\u00EDvel adicionar o m\u00F3dulo de integra\u00E7\u00E3o %s para implanta\u00E7\u00E3o, n\u00E3o foi obtido o JarUrlConnection esperado, foi obtido %s
missingPersistenceUnitMetadata=Falta o PersistenceUnitMetadata (o thead local n\u00E3o foi configurado)
multipleAdapters=O m\u00F3dulo do adaptador do provedor de persist\u00EAncia (%s) n\u00E3o possui mais de um adaptador
multipleThreadsInvokingSfsb=Mais de um thread est\u00E1 invocando o bean de sess\u00E3o com estado '%s' no mesmo per\u00EDodo
multipleThreadsUsingEntityManager=Mais de um thread est\u00E1 usando a inst\u00E2ncia EntityManager '%s' ao mesmo tempo 
notSetInInterceptorContext=%s n\u00E3o configurado no InterceptorContext\: %s
notYetImplemented=N\u00E3o foi implantado ainda
nullParameter=Erro %s interno, nulo %s passado
nullVar=O par\u00E2metro %s \u00E9 nulo
objectAlreadyDefined=O objeto anterior para a classe %s \u00E9 %s ao inv\u00E9s de nulo
parameterMustBeExtendedEntityManager=Erro interno, par\u00E2metro esperado do tipo ExtendedEntityManage, mas, ao inv\u00E9s disso, obteve %s 
persistenceProviderNotFound=PersistenceProvider '%s' n\u00E3o encontrado
relativePathNotFound=N\u00E3o foi poss\u00EDvel encontrar um caminho relativo\: %s
setterMethodOnlyAnnotation=%s destino de inje\u00E7\u00E3o inv\u00E1lido. Apenas m\u00E9todos setter s\u00E3o permitidos\: %s
transactionRequired=A transa\u00E7\u00E3o \u00E9 requerida para executar essa opera\u00E7\u00E3o (tanto use a transa\u00E7\u00E3o ou o contexto de persist\u00EAncia estendido)
noPUnitNameSpecifiedAndMultiplePersistenceUnits=O unitName de persist\u00EAncia n\u00E3o foi especificado e existem defini\u00E7\u00F5es de unidade %d no aplicativo %s. Voc\u00EA pode alterar o aplicativo para obter apenas uma defini\u00E7\u00E3o de unidade de persist\u00EAncia ou especificar o unitName para cada refer\u00EAncia \u00E0 unidade de persist\u00EAncia.
couldNotCreateInstanceProvider=N\u00E3o foi poss\u00EDvel criar a inst\u00E2ncia da classe do provedor de persist\u00EAncia %s
referenceCountedEntityManagerNegativeCount=erro interno, o n\u00FAmero de beans de sess\u00E3o com estado (%d) associado com o contexto de persist\u00EAncia estendido (%s) n\u00E3o pode ser um n\u00FAmero negativo.
