jgroups=La configuration du sous-syst\u00E8me JGroups.
jgroups.add=Ajouter le sous-syst\u00E8me JGroups.
jgroups.remove=Supprimer le sous-syst\u00E8me JGroups
jgroups.describe=D\u00E9crire le sous-syst\u00E8me JGoups.
jgroups.default-stack=La pile par d\u00E9faut de protocoles JGroups.
jgroups.stack=La configuration d'une pile de protocoles JGroups.
jgroups.stack.add=Ajouter une pile de protocoles au sous-syst\u00E8me JGroups.
jgroups.stack.remove=Supprimer une pile de protocoles du sous-syst\u00E8me JGroups.
jgroups.stack.export-native-configuration=Exporter cette configuration de pile sous un format JGroups natif.
jgroups.stack.name=Le nom d'une pile de protocole.
jgroups.stack.transport=La configuration d'une transport de pile de protocole.
jgroups.stack.transport.add=Ajouter la configuration d'un transport de pile de protocole.
jgroups.stack.transport.remove=Supprimer la configuration d'un transport pour une pile de protocoles.
jgroups.stack.transport.type=La classe d'impl\u00E9mentation d'un protocole, qui d\u00E9termine la fonctionnalit\u00E9 du protocole.
jgroups.stack.transport.socket-binding=La sp\u00E9cification de liaison de socket pour cette couche de protocole, utilis\u00E9e pour indiquer les interfaces IP et les ports de communication.
jgroups.stack.transport.properties=Une liste de propri\u00E9t\u00E9s d'une couche de protocole. Utilis\u00E9e pour personnaliser le comportement de protocole.
jgroups.stack.transport.shared=Si true, le transport sous-jacent sera partag\u00E9 par tous les r\u00E9seaux qui utilisent cette pile.
jgroups.stack.transport.diagnostics-socket-binding=La sp\u00E9cification de la liaison de socket des diagnostiques pour cette couche de protocole, utilis\u00E9e pour indiquer les interfaces IP, et les ports de communication.
jgroups.stack.transport.default-executor=L'ex\u00E9cuteur de pool de threads qui g\u00E8re les messages entrants.
jgroups.stack.transport.oob-executor=L'ex\u00E9cuteur de pool de threads qui g\u00E8re les messages entrants hors-bande.
jgroups.stack.transport.timer-executor=L'ex\u00E9cuteur de pool de threads qui g\u00E8re les t\u00E2ches de synchronisation li\u00E9es au protocole.
jgroups.stack.transport.thread-factory=L'usine de threads \u00E0 utiliser pour les t\u00E2ches asynchr\u00F4nes sp\u00E9cifiques au transport.
jgroups.stack.transport.site=L'identifiant du site (c-a-d centre de donn\u00E9es) pour ce n\u0153ud. Utilis\u00E9 par le hachage consistant de sensible \u00E0 la typologie d'Infinispan.
jgroups.stack.transport.rack=Identifiant du rack (c-a-d le rack du serveur) pour ce noeud. Utilis\u00E9 par le hachage consistant de sensible \u00E0 la typologie d'Infinispan.
jgroups.stack.transport.machine=Identifiant de la machine (c-a-d l'h\u00F4te) pour ce noeud. Utilis\u00E9 par le hachage consistant de sensible \u00E0 la typologie d'Infinispan.
jgroups.stack.transport.property=Une propri\u00E9t\u00E9 de protocole avec un nom et une valeur.
jgroups.stack.transport.property.add=Ajoute une propri\u00E9t\u00E9 de protocole.
jgroups.stack.transport.property.remove=Supprime une propri\u00E9t\u00E9 de protocole.
jgroups.stack.transport.property.value=La valeur de la propri\u00E9t\u00E9 de protocole.
jgroups.stack.protocols=La liste des protocoles configur\u00E9s pour une pile de protocoles.
jgroups.stack.protocol=La configuration d'un protocole dans une pile de protocoles.
jgroups.stack.protocol.add-protocol=Ajouter la configuration d'un protocole dans une pile de protocoles.
jgroups.stack.protocol.remove-protocol=Supprime la configuration d'un protocole dans une pile de protocoles.
jgroups.stack.protocol.type=La classe d'impl\u00E9mentation pour un protocole, qui d\u00E9termine la fonctionnalit\u00E9 du protocole.
jgroups.stack.protocol.socket-binding=La sp\u00E9cification de liaison de socket pour cette couche de protocole, utilis\u00E9e pour indiquer les interfaces d'IP et les ports de communication.
jgroups.stack.protocol.properties=Une liste de propri\u00E9t\u00E9s pour une couche de protocoles. Utilis\u00E9 pour personnaliser un comportement de protocole.
jgroups.stack.protocol.property=Une propri\u00E9t\u00E9 de protocole avec un nom et une valeur.
jgroups.stack.protocol.property.add=Ajoute une propri\u00E9t\u00E9 de protocole.
jgroups.stack.protocol.property.remove=Supprime une propri\u00E9t\u00E9 de protocole.
jgroups.stack.protocol.property.value=La valeur de la propri\u00E9t\u00E9 de protocole.
