jgroups=A configura\u00E7\u00E3o do sub-sistema do jgroups.
jgroups.add=Adiciona o sub-sistema do jgroups.
jgroups.remove=Remove o sub-sistema do jgroups.
jgroups.describe=Descreve o sub-sistema do jgroups.
jgroups.default-stack=A pilha do protocolo jgroups.
jgroups.stack=A configura\u00E7\u00E3o da pilha do protocolo do jgroups.
jgroups.stack.add=Adiciona a pilha do protocolo para o subsistema do jgroups.
jgroups.stack.remove=Remove a pilha do protocolo a partir do sub-sistema jgroups.
jgroups.stack.export-native-configuration=Exporta a configura\u00E7\u00E3o da pilha como um formato JGroups nativo.
jgroups.stack.name=O nome da pilha do protocolo.
jgroups.stack.transport=A configura\u00E7\u00E3o do transporte para a pilha do protocolo.
jgroups.stack.transport.add=Adiciona a configura\u00E7\u00E3o do transporte para a pilha do protocolo.
jgroups.stack.transport.remove=Remove a configura\u00E7\u00E3o do transporte para a pilha do protocolo.
jgroups.stack.transport.type=A classe de implementa\u00E7\u00E3o para o protocolo, que determina a funcionalidade do protocolo.
jgroups.stack.transport.socket-binding=A especifica\u00E7\u00E3o binding para a camada do protocolo, usada para especificar as interfaces IP e portas de comunica\u00E7\u00E3o.
jgroups.stack.transport.properties=Uma lista de propriedades para a camada do protocolo. Usado para personalizar o comportamento do protocolo.
jgroups.stack.transport.shared=Caso verdadeiro, o transporte subjacente \u00E9 compartilhado por todos os canais usando esta pilha.
jgroups.stack.transport.diagnostics-socket-binding=O diagn\u00F3stico da especifica\u00E7\u00E3o binding do soquete para esta camada do protocolo, usado para as interfaces e portas para comunica\u00E7\u00E3o.
jgroups.stack.transport.default-executor=O executor do pool thread para manusear as mensagens de entrada.
jgroups.stack.transport.oob-executor=O executor pool thread para manusear as mensagens fora de banda.
jgroups.stack.transport.timer-executor=O executor do pool thread para manusear tarefas de tempo relacionado com o protocolo.
jgroups.stack.transport.thread-factory=A f\u00E1brica thread de uso para manusear as tarefas espec\u00EDficas de transporte ass\u00EDncrono.
jgroups.stack.transport.site=O identificador (ex.\: centro de dados) para esse n\u00F3. Usado pelo hash consistente de topologia Infinispan.
jgroups.stack.transport.rack=O identificador rack (ex.\: rack do servidor) para esse n\u00F3. Usado pelo hash consistente da topologia Infinispan.
jgroups.stack.transport.machine=O identificador (ex.\: host) da m\u00E1quina para esse n\u00F3. Usado pelo hash consistente da topologia Infinispan.
jgroups.stack.transport.property=A propriedade do protocolo com o nome e valor.
jgroups.stack.transport.property.add=Adiciona a propriedade do protocolo.
jgroups.stack.transport.property.remove=Remove a propriedade do protocolo.
jgroups.stack.transport.property.value=O valor da propriedade do protocolo.
jgroups.stack.protocols=A lista dos protocolos configurados para a pilha do protocolo.
jgroups.stack.protocol=A configura\u00E7\u00E3o de um protocolo com a pilha do protocolo.
jgroups.stack.protocol.add-protocol=Adiciona a configura\u00E7\u00E3o do protocolo com a pilha do protocolo.
jgroups.stack.protocol.remove-protocol=Remove a configura\u00E7\u00E3o de um protocolo com a pilha do protocolo.
jgroups.stack.protocol.type=A classe de implanta\u00E7\u00E3o para um protocolo, que determina a funcionalidade do protocolo.
jgroups.stack.protocol.socket-binding=A especifica\u00E7\u00E3o binding do soquete para a camada do protocolo, usada para especificar as interfaces IP e portas para comunica\u00E7\u00E3o.
jgroups.stack.protocol.properties=Uma lista de propriedades para a camada do protocolo. Usada para personalizar o comportamento do protocolo.
jgroups.stack.protocol.property=Uma propriedade do protocolo com nome e valor.
jgroups.stack.protocol.property.add=Adiciona a propriedade do protocolo.
jgroups.stack.protocol.property.remove=Remove a propriedade do protocolo.
jgroups.stack.protocol.property.value=O valor da propriedade do protocolo.
