jgroups=La configuraci\u00F3n del sub-sistema jgroups.
jgroups.add=Agregar el sub-sistema jgroups.
jgroups.remove=Borrar el sub-sistema jgroups.
jgroups.describe=Describir el sub-sistema jgroups.
jgroups.default-stack=La pila predeterminada del protocolo jgroups.
jgroups.stack=La configuraci\u00F3n de una pila del protocolo jgroups.
jgroups.stack.add=Agregar una pila del protocolo al sub-sistema jgroups.
jgroups.stack.remove=Borrar una pila del protocolo del sub-sistema jgroups.
jgroups.stack.export-native-configuration=Exportar esta configuraci\u00F3n de la pila como un formato nativo de JGroups.
jgroups.stack.name=El nombre para una pila de protocolo. 
jgroups.stack.transport=La configuraci\u00F3n de un transporte para una pila de protocolo.
jgroups.stack.transport.add=Agregar la configuraci\u00F3n de un transporte para una pila de protocolo.
jgroups.stack.transport.remove=Borrar la configuraci\u00F3n de un transporte para una pila de protocolo.
jgroups.stack.transport.type=La clase de implementaci\u00F3n para un protocolo, el cual determina la funcionalidad del protocolo.
jgroups.stack.transport.socket-binding=La especificaci\u00F3n del enlace de sockets para esta capa del protocolo, utilizada para especificar interfaces IP y puertos para comunicaci\u00F3n.
jgroups.stack.transport.properties=Una lista de propiedades para una capa del protocolo. Utilizada para personalizar el comportamiento del protocolo.
jgroups.stack.transport.shared=Si es verdadera entonces el transporte subyacente es compartido por todos los canales que utilizan esta pila.
jgroups.stack.transport.diagnostics-socket-binding=La especificaci\u00F3n del enlace del socket de diagn\u00F3stico para esta capa del protocolo, utilizada para especificar interfaces IP y puertos para comunicaci\u00F3n.
jgroups.stack.transport.default-executor=El ejecutador del pool de hilos para manejar mensajes entrantes.
jgroups.stack.transport.oob-executor=El ejecutador del pool de hilos para manejar mensajes entrantes fuera de banda.
jgroups.stack.transport.timer-executor=El ejecutador del pool de hilos para manejar tareas del temporizador relacionadas con el protocolo. 
jgroups.stack.transport.thread-factory=La f\u00E1brica de hilos a utilizar para manejar tareas asincr\u00F3nicas espec\u00EDficas del transporte.
jgroups.stack.transport.site=El sitio (es decir el centro de datos) identificador para este nodo. Utilizado por el control consistente conciente de la topolog\u00EDa Infinispan.
jgroups.stack.transport.rack=El rack (es decir el rack del servidor) identificador para este nodo. Utilizado por el control consistente conciente de la topolog\u00EDa Infinispan.
jgroups.stack.transport.machine=La m\u00E1quina (es decir el host) identificador para este nodo. Utilizado por el control consistente conciente de la topolog\u00EDa Infinispan.
jgroups.stack.transport.property=Una propiedad del protocolo con nombre y valor.
jgroups.stack.transport.property.add=Agrega una propiedad del protocolo.
jgroups.stack.transport.property.remove=Borra una propiedad del protocolo. 
jgroups.stack.transport.property.value=El valor de una propiedad del protocolo. 
jgroups.stack.protocols=La lista de protocolos configurados para una pila de protocolos.
jgroups.stack.protocol=La configuraci\u00F3n de un protocolo dentro de una pila de protocolos.
jgroups.stack.protocol.add-protocol=Agregar la configuraci\u00F3n de un protocolo dentro de una pila de protocolos.
jgroups.stack.protocol.remove-protocol=Borrar la configuraci\u00F3n de un protocolo dentro de una pila de protocolos.
jgroups.stack.protocol.type=La clase de implementaci\u00F3n para un protocolo, el cual determina la funcionalidad del protocolo.
jgroups.stack.protocol.socket-binding=La especificaci\u00F3n de enlace de sockets para esta capa de protocolos, utilizada para especificar interfaces IP y puertos para comunicaci\u00F3n.
jgroups.stack.protocol.properties=Una lista de propiedades para una capa del protocolo. Utilizada para personalizar el comportamiento del protocolo.
jgroups.stack.protocol.property=Una propiedad del protocolo con nombre y valor.
jgroups.stack.protocol.property.add=Agrega una propiedad del protocolo.
jgroups.stack.protocol.property.remove=Borra una propiedad del protocolo. 
jgroups.stack.protocol.property.value=El valor de una propiedad del protocolo. 
