transactions=La configuraci\u00F3n del sub-sistema de transacciones.
transactions.add=A\u00F1ade el sub-sistema de transacciones
transactions.remove=Borra el sub-sistema de transacciones
transactions.configuration=Configuraci\u00F3n de entornos varios. Puede referirse al n\u00FAcleo, recuperaci\u00F3n, entorno de coordinador y a configuraciones del almac\u00E9n de objetos.
transactions.node-identifier=Utilizado para establecer el identificador de nodos en el entorno del n\u00FAcleo.
transactions.process-id-uuid=Indica si el administrador de  transacciones debe usar el ID de proceso basado en UUID.
transactions.process-id-socket-binding=El nombre de la configuraci\u00F3n de enlace de sockets a utilizar si el administrador de transacciones debe usar el ID de proceso basado en sockets. Ser\u00E1 'indefinido' si 'process-id-uuid' es 'verdadero'; de lo contrario deber\u00E1   establecerse.
transactions.process-id-socket-max-ports=El n\u00FAmero m\u00E1ximo de puertos para buscar un puerto abierto, si el administrador de transacciones debe utilizar un ID de proceso basado en sockets. Si el puerto especificado por el enlace de socket denominado en 'process-id-socket-binding' est\u00E1 ocupado, el puerto inmediatamente superior se intentar\u00E1 hasta que se encuentre un puerto abierto o un n\u00FAmero de puertos especificados por este atributo se han intentado. Ser\u00E1 "indefinido" si 'process-id-uuid' es 'Verdadero'.
transactions.path=Denota una ruta de sistema de archivos relativa o absoluta en la que el n\u00FAcleo del administrador de transacciones  debe almacenar datos. El valor predeterminado se trata como relativo a la ruta indicada por el atributo "relative-to". 
transactions.relative-to=Hace referencia a una configuraci\u00F3n de ruta global en el modelo de dominio, se predetermina al directorio de datos del servidor de aplicaciones de JBoss  (jboss.server.data.dir). El valor del atributo de la "ruta" se tratar\u00E1 como relativo a esa ruta. Utilice una cadena vac\u00EDa para inhabilitar el comportamiento predeterminado y forzar el valor del atributo de la "ruta" para que sea tratado como una ruta absoluta.
transactions.jts=Si es verdadero, esto habilitar\u00E1 el Servicio de transacciones de Java.
transactions.socket-binding=Utilizado para hacer referencia al enlace del socket correcto a utilizar para el entorno de recuperaci\u00F3n.
transactions.status-socket-binding=Utilizado para hacer referencia al enlace del socket correcto para el administrador de estatus de transacciones.
transactions.recovery-listener=Utilizado para especificar si el sistema de recuperaci\u00F3n escucha en un socket de red o no. 
transactions.enable-statistics=Si las estad\u00EDsticas se deben habilitar o no.
transactions.enable-tsm-status=Si el administrador del servicio de estatus de transacciones (TSM), necesarias para la recuperaci\u00F3n del proceso, deben proporcionarse o no. 
transactions.default-timeout=Tiempo de expiraci\u00F3n predeterminado.
transactions.object-store-path=Denota una ruta de sistema de archivos relativa o absoluta en la que el almac\u00E9n de objetos del  administrador de transacciones debe almacenar datos. El valor predeterminado se trata como relativo a la ruta indicada por el atributo "relative-to". 
transactions.object-store-relative-to=Hace referencia a una configuraci\u00F3n de ruta global en el modelo de dominio, se predetermina al directorio de datos del servidor de aplicaciones de JBoss  (jboss.server.data.dir). El valor del atributo de la "ruta" se tratar\u00E1 como relativo a esa ruta. Utilice una cadena vac\u00EDa para inhabilitar el comportamiento predeterminado y forzar el valor del atributo de la "ruta" para que sea tratado como una ruta absoluta.
transactions.number-of-transactions=El n\u00FAmero de transacciones creadas en total (a nivel superior y anidadas)
transactions.number-of-nested-transactions=El n\u00FAmero total de (sub) transacciones anidadas creadas.
transactions.number-of-heuristics=El n\u00FAmero de transacciones que han terminado con resultados heur\u00EDsticos.
transactions.number-of-committed-transactions=El n\u00FAmero de transacciones guardadas.
transactions.number-of-aborted-transactions=El n\u00FAmero de transacciones abortadas. (por ejemplo, deshechas) 
transactions.number-of-inflight-transactions=El n\u00FAmero de transacciones que han comenzado pero que a\u00FAn no han terminado. 
transactions.number-of-timed-out-transactions=El n\u00FAmero de transacciones que se deshacen debido al tiempo de expiraci\u00F3n. 
transactions.number-of-application-rollbacks=El n\u00FAmero de transacciones que se han deshecho por petici\u00F3n de aplicaciones. Esto incluye aquellas que han expirado, ya que la conducta de expiraci\u00F3n se considera un atributo de la configuraci\u00F3n de aplicaciones.
transactions.number-of-resource-rollbacks=El n\u00FAmero de transacciones que se deshacen debido a falla de recursos. (participante) 
