transactions=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u306E\u8A2D\u5B9A
transactions.add=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u306E\u8FFD\u52A0
transactions.remove=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u306E\u524A\u9664
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author Yamamoto Mie
transactions.configuration=\u69D8\u3005\u306A\u74B0\u5883\u8A2D\u5B9A\u3002\u30B3\u30A2\u3001\u30EA\u30AB\u30D0\u30EA\u3001\u30B3\u30FC\u30C7\u30A3\u30CD\u30FC\u30BF\u30FC\u306E\u74B0\u5883\u3001\u304A\u3088\u3073\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u30B9\u30C8\u30A2\u306E\u8A2D\u5B9A\u3092\u53C2\u7167\u3059\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u3059\u3002
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author Yamamoto Mie
transactions.node-identifier=\u30B3\u30A2\u74B0\u5883\u306E\u30CE\u30FC\u30C9\u8B58\u5225\u5B50\u3092\u8A2D\u5B9A\u3059\u308B\u306E\u306B\u4F7F\u3044\u307E\u3059\u3002
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author Yamamoto Mie
transactions.process-id-uuid=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u304C UUID \u30D9\u30FC\u30B9\u306E\u30D7\u30ED\u30BB\u30B9 id \u3092\u4F7F\u3046\u3079\u304D\u304B\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author Yamamoto Mie
transactions.process-id-socket-binding=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u304C socket \u30D9\u30FC\u30B9\u306E\u30D7\u30ED\u30BB\u30B9 id \u3092\u4F7F\u3046\u5FC5\u8981\u304C\u3042\u308B\u5834\u5408\u306B\u5229\u7528\u3059\u308B\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u8A2D\u5B9A\u540D\u3002'process-id-uuid' \u304C 'true' \u306E\u5834\u5408\u306F 'undefined' \u3067\u3001true \u3067\u306A\u3044\u5834\u5408\u306F\u3053\u306E\u5024\u3092\u8A2D\u5B9A\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author Yamamoto Mie
transactions.process-id-socket-max-ports=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u304C\u30BD\u30B1\u30C3\u30C8\u30D9\u30FC\u30B9\u306E\u30D7\u30ED\u30BB\u30B9 id \u3092\u4F7F\u3046\u5FC5\u8981\u304C\u3042\u308B\u5834\u5408\u306B\u3001\u958B\u3044\u3066\u3044\u308B\u30DD\u30FC\u30C8\u3092\u691C\u7D22\u3059\u308B\u305F\u3081\u306E\u30DD\u30FC\u30C8\u6700\u5927\u6570\u3002'process-id-socket-binding' \u3067\u53C2\u7167\u3055\u308C\u3066\u3044\u308B\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u304C\u6307\u5B9A\u3059\u308B\u30DD\u30FC\u30C8\u304C\u4F7F\u308F\u308C\u3066\u3044\u308B\u5834\u5408\u3001\u958B\u3044\u3066\u3044\u308B\u30DD\u30FC\u30C8\u304C\u898B\u3064\u304B\u308B\u304B\u3001\u3053\u306E\u5C5E\u6027\u304C\u3057\u3066\u3044\u308B\u30DD\u30FC\u30C8\u6570\u5206\u3092\u8A66\u884C\u3059\u308B\u307E\u3067\u3001\u6B21\u306B\u6570\u5024\u306E\u9AD8\u3044\u30DD\u30FC\u30C8\u3092\u8A66\u884C\u3057\u3066\u3044\u304D\u307E\u3059\u3002'process-id-uuid' \u304C 'true' \u306E\u5834\u5408 'undefined' \u306B\u306A\u308A\u307E\u3059\u3002
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author Yamamoto Mie
transactions.path=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u306E\u30B3\u30A2\u304C\u30C7\u30FC\u30BF\u3092\u683C\u7D0D\u3059\u308B\u5834\u6240\u3092\u793A\u3059\u76F8\u5BFE\uFF0F\u7D76\u5BFE\u30D1\u30B9\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u3067\u306F\u3001\u5024\u306F "relative-to" \u5C5E\u6027\u3067\u6307\u5B9A\u3055\u308C\u305F\u30D1\u30B9\u3092\u8D77\u70B9\u3068\u3057\u305F\u76F8\u5BFE\u30D1\u30B9\u3068\u3057\u3066\u51E6\u7406\u3055\u308C\u307E\u3059\u3002
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author Yamamoto Mie
transactions.relative-to=\u30C9\u30E1\u30A4\u30F3\u30E2\u30C7\u30EB\u306E\u30B0\u30ED\u30FC\u30D0\u30EB\u30D1\u30B9\u8A2D\u5B9A\u3092\u53C2\u7167\u3057\u307E\u3059\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u306F JBoss Application Server \u306E data \u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u3067\u3059 (jboss.server.data.dir)\u3002"path" \u5C5E\u6027\u306E\u5024\u306F\u3053\u306E\u30D1\u30B9\u3092\u8D77\u70B9\u3068\u3057\u305F\u76F8\u5BFE\u30D1\u30B9\u3068\u3057\u3066\u51E6\u7406\u3055\u308C\u307E\u3059\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u52D5\u4F5C\u3092\u7121\u52B9\u306B\u3057\u3001"path" \u5C5E\u6027\u306E\u5024\u3092\u5F37\u5236\u7684\u306B\u5229\u7528\u3057\u7D76\u5BFE\u30D1\u30B9\u3068\u3057\u3066\u51E6\u7406\u3059\u308B\u306B\u306F\u3001\u7A7A\u306E\u6587\u5B57\u5217\u3092\u4F7F\u3044\u307E\u3059\u3002
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author Yamamoto Mie
transactions.jts=True \u306E\u5834\u5408\u306F Java \u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30B5\u30FC\u30D3\u30B9\u3092\u6709\u52B9\u306B\u3057\u307E\u3059\u3002
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author Yamamoto Mie
transactions.socket-binding=\u30EA\u30AB\u30D0\u30EA\u74B0\u5883\u3092\u4F7F\u3046\u305F\u3081\u306B\u6B63\u3057\u3044\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u3092\u53C2\u7167\u3059\u308B\u969B\u306B\u5229\u7528\u3057\u307E\u3059\u3002
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author Yamamoto Mie
transactions.status-socket-binding=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30B9\u30C6\u30FC\u30BF\u30B9\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u306B\u5229\u7528\u3059\u308B\u305F\u3081\u306B\u6B63\u78BA\u306A\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u3092\u53C2\u7167\u3059\u308B\u306E\u306B\u5229\u7528
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author Yamamoto Mie
transactions.recovery-listener=\u30EA\u30AB\u30D0\u30EA\u30B7\u30B9\u30C6\u30E0\u304C\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u30BD\u30B1\u30C3\u30C8\u3092\u30EA\u30C3\u30B9\u30F3\u3059\u3079\u304D\u304B\u3069\u3046\u304B\u3092\u6307\u5B9A\u3059\u308B\u969B\u306B\u5229\u7528
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author Yamamoto Mie
transactions.enable-statistics=\u7D71\u8A08\u3092\u6709\u52B9\u306B\u3059\u3079\u304D\u304B\u3069\u3046\u304B
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author Yamamoto Mie
transactions.enable-tsm-status=out-of-process \u30EA\u30AB\u30D0\u30EA\u306B\u5FC5\u8981\u3068\u3055\u308C\u308B\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30B9\u30C6\u30FC\u30BF\u30B9\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC (TSM) \u30B5\u30FC\u30D3\u30B9\u3092\u63D0\u4F9B\u3059\u3079\u304D\u304B\u3069\u3046\u304B
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author Yamamoto Mie
transactions.default-timeout=\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author Yamamoto Mie
transactions.object-store-path=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u306E\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u30B9\u30C8\u30A2\u304C\u30C7\u30FC\u30BF\u3092\u683C\u7D0D\u3059\u308B\u5834\u6240\u3092\u793A\u3059\u76F8\u5BFE\uFF0F\u7D76\u5BFE\u30D1\u30B9\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u3067\u306F\u3001\u5024\u306F "relative-to" \u5C5E\u6027\u3067\u6307\u5B9A\u3055\u3048\u305F\u30D1\u30B9\u3092\u8D77\u70B9\u3068\u3057\u305F\u76F8\u5BFE\u30D1\u30B9\u3068\u3057\u3066\u51E6\u7406\u3055\u308C\u307E\u3059\u3002
transactions.object-store-relative-to=\u30C9\u30E1\u30A4\u30F3\u30E2\u30C7\u30EB\u306E\u30B0\u30ED\u30FC\u30D0\u30EB\u30D1\u30B9\u8A2D\u5B9A\u3092\u53C2\u7167\u3057\u307E\u3059\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u306F JBoss Application Server \u306E data \u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u3067\u3059 (jboss.server.data.dir)\u3002"path" \u5C5E\u6027\u306E\u5024\u306F\u3053\u306E\u30D1\u30B9\u3092\u8D77\u70B9\u3068\u3057\u305F\u76F8\u5BFE\u30D1\u30B9\u3068\u3057\u3066\u51E6\u7406\u3055\u308C\u307E\u3059\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u52D5\u4F5C\u3092\u7121\u52B9\u306B\u3057\u3001"path" \u5C5E\u6027\u306E\u5024\u3092\u5F37\u5236\u7684\u306B\u5229\u7528\u3057\u7D76\u5BFE\u30D1\u30B9\u3068\u3057\u3066\u51E6\u7406\u3059\u308B\u306B\u306F\u3001\u7A7A\u306E\u6587\u5B57\u5217\u3092\u4F7F\u3044\u307E\u3059\u3002
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author Yamamoto Mie
transactions.number-of-transactions=\u4F5C\u6210\u6E08\u307F\u306E\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3 (\u30C8\u30C3\u30D7\u30EC\u30D9\u30EB\u304A\u3088\u3073\u30CD\u30B9\u30C8\u5316) \u7DCF\u6570
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author Yamamoto Mie
transactions.number-of-nested-transactions=\u4F5C\u6210\u6E08\u307F\u306E\u30CD\u30B9\u30C8\u5316 (\u30B5\u30D6) \u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u7DCF\u6570
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author Yamamoto Mie
transactions.number-of-heuristics=\u30D2\u30E5\u30FC\u30EA\u30B9\u30C6\u30A3\u30C3\u30AF\u306A\u7D50\u679C\u3067\u7D42\u4E86\u3055\u308C\u305F\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u6570
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author Yamamoto Mie
transactions.number-of-committed-transactions=\u30B3\u30DF\u30C3\u30C8\u3055\u308C\u305F\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u6570
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author Yamamoto Mie
transactions.number-of-aborted-transactions=\u4E2D\u65AD\u3055\u308C\u305F (\u30ED\u30FC\u30EB\u30D0\u30C3\u30AF\u3055\u308C\u305F) \u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u6570
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author Yamamoto Mie
transactions.number-of-inflight-transactions=\u958B\u59CB\u6E08\u307F\u3067\u3042\u308B\u304C\u7D42\u4E86\u3055\u308C\u3066\u3044\u306A\u3044\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u6570
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author Yamamoto Mie
transactions.number-of-timed-out-transactions=\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u304C\u539F\u56E0\u3067\u30ED\u30FC\u30EB\u30D0\u30C3\u30AF\u3057\u305F\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u6570
transactions.number-of-application-rollbacks=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u30EA\u30AF\u30A8\u30B9\u30C8\u306B\u3088\u308A\u30ED\u30FC\u30EB\u30D0\u30C3\u30AF\u3055\u308C\u305F\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u6570\u3002\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u306E\u52D5\u4F5C\u306F\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u8A2D\u5B9A\u306E\u5C5E\u6027\u3068\u307F\u306A\u3055\u308C\u308B\u305F\u3081\u3001\u3053\u306E\u6570\u306B\u306F\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u3057\u305F\u3082\u306E\u3082\u542B\u307F\u307E\u3059\u3002
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author Yamamoto Mie
transactions.number-of-resource-rollbacks=\u30EA\u30BD\u30FC\u30B9 (\u30D1\u30FC\u30C6\u30A3\u30B7\u30D1\u30F3\u30C8) \u306E\u554F\u984C\u304C\u539F\u56E0\u3067\u30ED\u30FC\u30EB\u30D0\u30C3\u30AF\u3055\u308C\u305F\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u6570
transactions.log-store.transaction.delete=\u3053\u306E\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30ED\u30B0\u3092\u524A\u9664\u3057\u307E\u3059\u3002\u8B66\u544A\uFF1A\u3053\u306E\u64CD\u4F5C\u5F8C\u3001\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u306F\u672C\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u306B\u95A2\u3059\u308B\u60C5\u5831\u306F\u6301\u305F\u306A\u3044\u305F\u3081\u3001\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u306E\u56DE\u5FA9\u306F\u3067\u304D\u307E\u305B\u3093\u3002\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u304C\u78BA\u5B9F\u306B\u5B8C\u4E86\u3057\u3066\u3044\u308B\u5834\u5408\u306F\u3001\u3053\u306E\u64CD\u4F5C\u306F\u5B89\u5168\u3067\u3059\u3002\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30ED\u30B0\u306E\u8868\u73FE\u3082\u3053\u306E\u30E2\u30C7\u30EB\u304B\u3089\u524A\u9664\u3055\u308C\u307E\u3059\u3002
transactions.log-store.transaction.participant.refresh=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30ED\u30B0\u3092\u30AF\u30A8\u30EA\u3059\u308B\u3053\u3068\u3067\u3001\u3053\u306E\u30D1\u30FC\u30C6\u30A3\u30B7\u30D1\u30F3\u30C8\u8A18\u9332\u306E\u5C5E\u6027\u306B\u95A2\u3059\u308B\u7BA1\u7406\u30D3\u30E5\u30FC\u3092\u66F4\u65B0\u3057\u307E\u3059 (read-resource \u306E\u64CD\u4F5C\u306F\u30E2\u30C7\u30EB\u306E\u8AAD\u307F\u8FBC\u307F\u306E\u307F\u3067\u3042\u308B\u305F\u3081\u3001\u3053\u306E\u66F4\u65B0\u306E\u64CD\u4F5C\u304C\u5FC5\u8981\u3068\u306A\u308A\u307E\u3059)\u3002
transactions.log-store.transaction.participant.recover=\u3053\u306E\u8A18\u9332\u304C\u30D2\u30E5\u30FC\u30EA\u30B9\u30C6\u30A3\u30C3\u30AF\u306A\u72B6\u614B\u3067\u3042\u308C\u3070\u30012PC \u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u306E\u30B3\u30DF\u30C3\u30C8\u30D5\u30A7\u30FC\u30BA\u3092\u518D\u5EA6\u5B9F\u884C\u3059\u308B\u3088\u3046\u8A66\u884C\u3057\u307E\u3059\u3002
transactions.log-store=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30ED\u30AE\u30F3\u30B0\u30B9\u30C8\u30EC\u30FC\u30B8\u30E1\u30AB\u30CB\u30BA\u30E0\u306E\u8868\u73FE
transactions.log-store.add=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30ED\u30AE\u30F3\u30B0\u30B9\u30C8\u30EC\u30FC\u30B8\u30E1\u30AB\u30CB\u30BA\u30E0\u306E\u8868\u73FE\u3092\u8FFD\u52A0
transactions.log-store.probe=\u65B0\u898F\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30ED\u30B0\u306E\u30B9\u30AD\u30E3\u30F3\u3002\u3053\u306E\u64CD\u4F5C\u3067\u306F\u3001\u4FDD\u7559\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u6BCE\u306B\u5B50\u304C\u4F5C\u6210\u3055\u308C\u307E\u3059\u3002
transactions.log-store.remove=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30ED\u30AE\u30F3\u30B0\u30B9\u30C8\u30EC\u30FC\u30B8\u30E1\u30AB\u30CB\u30BA\u30E0\u306E\u8868\u73FE\u3092\u524A\u9664
transactions.log-store.type=\u30ED\u30AE\u30F3\u30B0\u30B9\u30C8\u30A2\u306E\u5B9F\u88C5\u30BF\u30A4\u30D7\u3092\u6307\u5B9A
transactions.log-store.transactions=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u304C\u554F\u984C\u767A\u751F\u6642\u306B\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u3092\u30EA\u30AB\u5F35\u308A\u3059\u308B\u305F\u3081\u306B\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u304C\u4FDD\u5B58\u3059\u308B\u6C38\u7D9A\u60C5\u5831\u3002\u8A72\u5F53\u306E\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u304C\u6E96\u5099\uFF0F\u30B3\u30DF\u30C3\u30C8\u30D5\u30A7\u30FC\u30BA\u3092\u958B\u59CB\uFF0F\u5B8C\u4E86\u3059\u308B\u305F\u3081\u3001\u3053\u306E\u30D7\u30ED\u30FC\u30D3\u30F3\u30B0\u306E\u64CD\u4F5C\u306F\u30E2\u30C7\u30EB\u304B\u3089\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u3092\u8FFD\u52A0\uFF0F\u524A\u9664\u3057\u307E\u3059\u3002\u30B9\u30BF\u30C3\u30AF\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u306F\u3001\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u304C\u5B8C\u4E86\u3059\u308B\u304B\u3001\u524A\u9664\u306E\u64CD\u4F5C\u3067\u660E\u793A\u7684\u306B\u524A\u9664\u3055\u308C\u308B\u307E\u3067\u30E2\u30C7\u30EB\u5185\u306B\u7559\u307E\u308A\u307E\u3059\u3002
transactions.log-store.transaction=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u304C\u554F\u984C\u767A\u751F\u6642\u306B\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u3092\u30EA\u30AB\u5F35\u308A\u3059\u308B\u305F\u3081\u306B\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u304C\u4FDD\u5B58\u3059\u308B\u6C38\u7D9A\u60C5\u5831\u3002\u8A72\u5F53\u306E\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u304C\u6E96\u5099\uFF0F\u30B3\u30DF\u30C3\u30C8\u30D5\u30A7\u30FC\u30BA\u3092\u958B\u59CB\uFF0F\u5B8C\u4E86\u3059\u308B\u305F\u3081\u3001\u3053\u306E\u30D7\u30ED\u30FC\u30D3\u30F3\u30B0\u306E\u64CD\u4F5C\u306F\u30E2\u30C7\u30EB\u304B\u3089\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u3092\u8FFD\u52A0\uFF0F\u524A\u9664\u3057\u307E\u3059\u3002\u30B9\u30BF\u30C3\u30AF\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u306F\u3001\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u304C\u5B8C\u4E86\u3059\u308B\u304B\u3001\u524A\u9664\u306E\u64CD\u4F5C\u3067\u660E\u793A\u7684\u306B\u524A\u9664\u3055\u308C\u308B\u307E\u3067\u30E2\u30C7\u30EB\u5185\u306B\u7559\u307E\u308A\u307E\u3059\u3002
transactions.log-store.transaction.add=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u3092\u30ED\u30B0\u30B9\u30C8\u30A2\u306B\u8FFD\u52A0
transactions.log-store.transaction.jmx-name=\u3053\u306E\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u306E JMX \u540D
transactions.log-store.transaction.id=\u3053\u306E\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u306E id
transactions.log-store.transaction.age-in-seconds=\u3053\u306E\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u304C\u6E96\u5099\u6E08\u307F\u3042\u308B\u3044\u306F\u30EA\u30AB\u30D0\u30EA\u30B7\u30B9\u30C6\u30E0\u304C\u6700\u5F8C\u306B\u30EA\u30AB\u30D0\u30EA\u3092\u8A66\u884C\u3057\u305F\u6642\u9593
transactions.log-store.transaction.type=\u3053\u306E\u8A18\u9332\u3092\u4FDD\u5B58\u3057\u305F\u578B\u540D
transactions.log-store.transaction.participants=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u3067\u6A5F\u80FD\u3057\u305F\u30EA\u30BD\u30FC\u30B9
transactions.log-store.transaction.participant=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u3067\u6A5F\u80FD\u3057\u305F\u30EA\u30BD\u30FC\u30B9
transactions.log-store.transaction.participant.jmx-name=\u3053\u306E\u30D1\u30FC\u30C6\u30A3\u30B7\u30D1\u30F3\u30C8\u306E JMX \u540D
transactions.log-store.transaction.participant.add=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u306E\u30D1\u30FC\u30C6\u30A3\u30B7\u30D1\u30F3\u30C8\u3092\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30ED\u30B0\u306B\u8FFD\u52A0
transactions.log-store.transaction.participant.status=\u3053\u306E\u30D1\u30FC\u30C6\u30A3\u30B7\u30D1\u30F3\u30C8\u306E\u30B3\u30DF\u30C3\u30C8\u30E1\u30F3\u30C8\u30B9\u30C6\u30FC\u30BF\u30B9\u3092\u30EC\u30DD\u30FC\u30C8 (\u4FDD\u7559\u3001\u6E96\u5099\u6E08\u3001\u5931\u6557\u3001\u30D2\u30E5\u30FC\u30EA\u30B9\u30C6\u30A3\u30C3\u30AF\u3001\u8AAD\u307F\u53D6\u308A\u5C02\u7528\u306E\u3044\u305A\u308C\u304B)
transactions.log-store.transaction.participant.jndi-name=\u3053\u306E\u30D1\u30FC\u30C6\u30A3\u30B7\u30D1\u30F3\u30C8\u306E JNDI \u540D
transactions.log-store.transaction.participant.type=\u3053\u306E\u8A18\u9332\u3092\u4FDD\u5B58\u3057\u305F\u578B\u540D
transactions.log-store.transaction.participant.eis-product-name=JCA \u30A8\u30F3\u30BF\u30FC\u30D7\u30E9\u30A4\u30BA\u60C5\u5831\u30B7\u30B9\u30C6\u30E0\u306E\u88FD\u54C1\u540D
transactions.log-store.transaction.participant.eis-product-version=JCA \u30A8\u30F3\u30BF\u30FC\u30D7\u30E9\u30A4\u30BA\u60C5\u5831\u30B7\u30B9\u30C6\u30E0\u306E\u88FD\u54C1\u30D0\u30FC\u30B8\u30E7\u30F3
