transactions=La configuration du sous-syst\u00E8me de transactions.
transactions.add=Ajoute le sous-syst\u00E8me transactions
transactions.remove=Supprime le sous-syst\u00E8me transactions
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author samfreemanz
transactions.configuration=configuration de divers environnements. Peut faire r\u00E9f\u00E9rence aux configurations core (c\u0153ur), recovery (restauration), coordinator environment (environnement du coordinateur) et object store (stockage d'objets).
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author samfreemanz
transactions.node-identifier=Utilis\u00E9 pour d\u00E9finir l'identifiant noeud dans l'environnement core.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author samfreemanz
transactions.process-id-uuid=Indique si le gestionnaire des transactions devrait utiliser un ID de processus bas\u00E9 sur UUID ou non.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author samfreemanz
transactions.process-id-socket-binding=Nom de la configuration de liaison de socket \u00E0 utiliser si le gestionnaire de transactions utilise un ID de processus bas\u00E9 sur socket. Sera 'undefined' (non d\u00E9fini) si 'process-id-uuid' est 'true'\u00A0; sinon, il doit \u00EAtre d\u00E9fini.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author samfreemanz
transactions.process-id-socket-max-ports=Nombre maximum de ports \u00E0 rechercher un port ouvert si le gestionnaire de transactions devait utiliser un ID de processus bas\u00E9 sur socket. Si le port sp\u00E9cifi\u00E9 par la liaison de socket r\u00E9f\u00E9renc\u00E9e dans 'process-id-socket-binding' est occup\u00E9, le port plus haut suivant sera essay\u00E9 jusqu'\u00E0 ce qu'un port ouvert soit trouv\u00E9 ou que le nombre de ports sp\u00E9cifi\u00E9 par cet attribut soit \u00E9puis\u00E9. Sera 'undefined' (non d\u00E9fini) si 'process-id-uuid' est 'true'.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author samfreemanz
transactions.path=D\u00E9note un chemin absolu ou relatif de syst\u00E8me de fichiers montrant o\u00F9 le c\u0153ur du gestionnaire de transactions devrait stocker les donn\u00E9es. Par d\u00E9faut, la valeur est trait\u00E9e comme \u00E9tant relative au chemin d\u00E9not\u00E9 par l'attribut "relative-to" (relatif \u00E0).
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author samfreemanz
transactions.relative-to=R\u00E9f\u00E9rence une configuration de chemin global dans le mod\u00E8le de domaine, par d\u00E9faut le r\u00E9pertoire des donn\u00E9es JBoss Application Server (jboss.server.data.dir). La valeur de l'attribut "path" (chemin) sera trait\u00E9e comme \u00E9tant relative \u00E0 ce chemin. Veuillez utiliser une cha\u00EEne vide pour d\u00E9sactiver le comportement par d\u00E9faut et pour forcer la valeur de l'attribut "path" (chemin) \u00E0 \u00EAtre trait\u00E9e comme un chemin absolu.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author samfreemanz
transactions.jts=Si true, ceci active Java Transaction Service
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author samfreemanz
transactions.socket-binding=Utilis\u00E9 pour r\u00E9f\u00E9rencer la liaison de socket correcte \u00E0 utiliser pour l'environnement de r\u00E9cup\u00E9ration.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author samfreemanz
transactions.status-socket-binding=Utilis\u00E9 pour r\u00E9f\u00E9rencer la liaison de socket correcte \u00E0 utiliser pour le gestionnaire de statut des transactions.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author samfreemanz
transactions.recovery-listener=Utilis\u00E9 pour sp\u00E9cifier si le syst\u00E8me de r\u00E9cup\u00E9ration doit \u00E9couter un socket r\u00E9seau ou pas.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author samfreemanz
transactions.enable-statistics=Si les statistiques doivent \u00EAtre activ\u00E9es.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author samfreemanz
transactions.enable-tsm-status=Si le service TSM (Transaction Status Manager), n\u00E9cessit\u00E9 pour les r\u00E9cup\u00E9rations hors-processus, doit \u00EAtre fourni ou non.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author samfreemanz
transactions.default-timeout=D\u00E9lai d'expiration par d\u00E9faut.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author samfreemanz
transactions.object-store-path=D\u00E9note un chemin de syst\u00E8me de fichiers absolu ou relatif montrant l'endroit o\u00F9 le store d'objets du gestionnaire de transactions doit stocker les donn\u00E9es. Par d\u00E9faut, la valeur est trait\u00E9e comme relative au chemin d\u00E9not\u00E9 par l'attribut \u00AB\u00A0relatif \u00E0\u00A0\u00BB.
transactions.object-store-relative-to=Fait r\u00E9f\u00E9rence \u00E0 une configuration de chemin global dans le mod\u00E8le de domaine, par d\u00E9faut le r\u00E9pertoire de donn\u00E9es JBoss Application Server (jboss.server.data.dir). La valeur de l'attribut "path" (chemin) sera trait\u00E9e comme \u00E9tant relative \u00E0 ce chemin. Veuillez utiliser une cha\u00EEne vide pour d\u00E9sactiver le comportement par d\u00E9faut et forcer la valeur de l'attribut "path" \u00E0 \u00EAtre trait\u00E9e comme un chemin absolu.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author samfreemanz
transactions.number-of-transactions=Nombre total de transactions (niveau sup\u00E9rieur et imbriqu\u00E9es) cr\u00E9\u00E9es
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author samfreemanz
transactions.number-of-nested-transactions=Nombre total de transactions imbriqu\u00E9es (sub) cr\u00E9\u00E9es.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author samfreemanz
transactions.number-of-heuristics=Nombre de transactions qui se sont termin\u00E9es avec des r\u00E9sultats heuristiques.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author samfreemanz
transactions.number-of-committed-transactions=Nombre de transactions commit\u00E9es.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author samfreemanz
transactions.number-of-aborted-transactions=Nombre de transactions abandonn\u00E9es (c.-\u00E0-d. restaur\u00E9es).
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author samfreemanz
transactions.number-of-inflight-transactions=Nombre de transaction ayant commenc\u00E9 mais qui ne sont pas termin\u00E9es.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author samfreemanz
transactions.number-of-timed-out-transactions=Nombre de transactions restaur\u00E9es \u00E0 cause de l'expiration du d\u00E9lai.
transactions.number-of-application-rollbacks=Nombre de transactions qui ont \u00E9t\u00E9 restaur\u00E9es sur la requ\u00EAte d'une application. Ceci inclut celles qui ont d\u00E9pass\u00E9 le d\u00E9lai d'expiration, puisque le comportement du d\u00E9lai d'expiration est consid\u00E9r\u00E9 comme un attribut de la configuration de l'application.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author samfreemanz
transactions.number-of-resource-rollbacks=Nombre de transaction qui ont \u00E9t\u00E9 restaur\u00E9es suite \u00E0 un \u00E9chec de ressources (participant).
transactions.log-store.transaction.delete=Supprimer ce journal de transactions. AVERTISSEMENT apr\u00E8s cette op\u00E9ration, le gestionnaire de transactions n'aura aucune connaissance de l'op\u00E9ration et ne sera donc pas en mesure de la r\u00E9cup\u00E9rer. Si vous \u00EAtes s\u00FBr que la transaction est termin\u00E9e, l'op\u00E9ration est sans danger. La repr\u00E9sentation du journal des transactions est \u00E9galement supprim\u00E9e du mod\u00E8le.
transactions.log-store.transaction.participant.refresh=Actualiser l'affichage de la gestion des attributs de ce dossier participant en interrogeant le journal de transactions. (\u00C0 noter que l'op\u00E9ration 'read-resource' ne lit uniquement que le mod\u00E8le, d'o\u00F9 la n\u00E9cessit\u00E9 de cette op\u00E9ration d'actualisation).
transactions.log-store.transaction.participant.recover=Si cet enregistrement est dans un \u00E9tat heuristique, alors essayez \u00E0 nouveau la p\u0125ase validation de la transaction 2PC.
transactions.log-store=Repr\u00E9sentation du m\u00E9canisme de stockage de la journalisation des transactions.
transactions.log-store.add=Ajouter une repr\u00E9sentation du m\u00E9canisme de stockage de la journalisation des transactions.
transactions.log-store.probe=Scanner les nouveaux journaux de transactions. Cette op\u00E9ration va cr\u00E9er un enfant pour chaque transaction en attente.
transactions.log-store.remove=Supprimer une repr\u00E9sentation du m\u00E9canisme de stockage de la journalisation des transactions.
transactions.log-store.type=Indique le type d'impl\u00E9mentation du store de journalisation.
transactions.log-store.transactions=L'information persistante stock\u00E9e par le gestionnaire de transaction dans le but de r\u00E9cup\u00E9rer une transaction en cas d'\u00E9chec. L'op\u00E9ration de la sonde sera d'ajouter et de supprimer des op\u00E9rations du mod\u00E8le quand les transactions r\u00E9elles correspondantes commenceront et finiront les phases de pr\u00E9paration et de validation. Une transaction coinc\u00E9e restera dans le mod\u00E8le jusqu'\u00E0 ce qu'elle soit termin\u00E9e ou explicitement supprim\u00E9e par l'op\u00E9ration de suppression.
transactions.log-store.transaction=L'information persistante stock\u00E9e par le gestionnaire de transaction dans le but de r\u00E9cup\u00E9rer une transaction en cas d'\u00E9chec. L'op\u00E9ration de la sonde sera d'ajouter et de supprimer des op\u00E9rations du mod\u00E8le quand les transactions r\u00E9elles correspondantes commenceront et finiront les phases de pr\u00E9paration et de validation. Une transaction coinc\u00E9e restera dans le mod\u00E8le jusqu'\u00E0 ce qu'elle soit termin\u00E9e ou explicitement supprim\u00E9e par l'op\u00E9ration de suppression.
transactions.log-store.transaction.add=Ajouter une transaction au log-store.
transactions.log-store.transaction.jmx-name=Le nom JMX de cette transaction.
transactions.log-store.transaction.id=L'id de cette transaction.
transactions.log-store.transaction.age-in-seconds=L'heure de pr\u00E9paration de cette transaction ou l'heure \u00E0 laquelle le syst\u00E8me de recouvrement a tent\u00E9 de la recouvrir.
transactions.log-store.transaction.type=Le nom de stockage de cet enregistrement.
transactions.log-store.transaction.participants=Les ressources qui ont fonctionn\u00E9 dans une transaction.
transactions.log-store.transaction.participant=Les ressources qui n'ont pas fonctionn\u00E9 dans une transaction.
transactions.log-store.transaction.participant.jmx-name=Le nom JMX de ce participant.
transactions.log-store.transaction.participant.add=Ajouter un participant de transaction \u00E0 un journal de transaction.
transactions.log-store.transaction.participant.status=Reporte le statut de validation de ce participant (ne peut pas correspondre \u00E0 Pending (en attente), Prepared (pr\u00E9par\u00E9), Failed (\u00E9chou\u00E9), Heuristic ou Readonly (lecture seule)).
transactions.log-store.transaction.participant.jndi-name=Nom JNDI de ce participant.
transactions.log-store.transaction.participant.type=Le nom de stockage de cet enregistrement.
transactions.log-store.transaction.participant.eis-product-name=Le nom de produit du syst\u00E8me d'information enterprise JCA.
transactions.log-store.transaction.participant.eis-product-version=La version du produit du syst\u00E8me d'information enterprise JCA.
