transactions=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u306E\u8A2D\u5B9A
transactions.add=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u306E\u8FFD\u52A0
transactions.remove=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u306E\u524A\u9664
transactions.configuration=\u69D8\u3005\u306A\u74B0\u5883\u8A2D\u5B9A\u3002\u30B3\u30A2\u3001\u30EA\u30AB\u30D0\u30EA\u3001\u30B3\u30FC\u30C7\u30A3\u30CD\u30FC\u30BF\u30FC\u306E\u74B0\u5883\u3001\u304A\u3088\u3073\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u30B9\u30C8\u30A2\u306E\u8A2D\u5B9A\u3092\u53C2\u7167\u3059\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u3059\u3002
transactions.node-identifier=\u30B3\u30A2\u74B0\u5883\u306E\u30CE\u30FC\u30C9\u8B58\u5225\u5B50\u3092\u8A2D\u5B9A\u3059\u308B\u306E\u306B\u4F7F\u3044\u307E\u3059\u3002
transactions.process-id-uuid=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u304C UUID \u30D9\u30FC\u30B9\u306E\u30D7\u30ED\u30BB\u30B9 id \u3092\u4F7F\u3046\u3079\u304D\u304B\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
transactions.process-id-socket-binding=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u304C socket \u30D9\u30FC\u30B9\u306E\u30D7\u30ED\u30BB\u30B9 id \u3092\u4F7F\u3046\u5FC5\u8981\u304C\u3042\u308B\u5834\u5408\u306B\u5229\u7528\u3059\u308B\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u8A2D\u5B9A\u540D\u3002'process-id-uuid' \u304C 'true' \u306E\u5834\u5408\u306F 'undefined' \u3067\u3001true \u3067\u306A\u3044\u5834\u5408\u306F\u3053\u306E\u5024\u3092\u8A2D\u5B9A\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
transactions.process-id-socket-max-ports=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u304C\u30BD\u30B1\u30C3\u30C8\u30D9\u30FC\u30B9\u306E\u30D7\u30ED\u30BB\u30B9 id \u3092\u4F7F\u3046\u5FC5\u8981\u304C\u3042\u308B\u5834\u5408\u306B\u3001\u958B\u3044\u3066\u3044\u308B\u30DD\u30FC\u30C8\u3092\u691C\u7D22\u3059\u308B\u305F\u3081\u306E\u30DD\u30FC\u30C8\u6700\u5927\u6570\u3002'process-id-socket-binding' \u3067\u53C2\u7167\u3055\u308C\u3066\u3044\u308B\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u304C\u6307\u5B9A\u3059\u308B\u30DD\u30FC\u30C8\u304C\u4F7F\u308F\u308C\u3066\u3044\u308B\u5834\u5408\u3001\u958B\u3044\u3066\u3044\u308B\u30DD\u30FC\u30C8\u304C\u898B\u3064\u304B\u308B\u304B\u3001\u3053\u306E\u5C5E\u6027\u304C\u3057\u3066\u3044\u308B\u30DD\u30FC\u30C8\u6570\u5206\u3092\u8A66\u884C\u3059\u308B\u307E\u3067\u3001\u6B21\u306B\u6570\u5024\u306E\u9AD8\u3044\u30DD\u30FC\u30C8\u3092\u8A66\u884C\u3057\u3066\u3044\u304D\u307E\u3059\u3002'process-id-uuid' \u304C 'true' \u306E\u5834\u5408 'undefined' \u306B\u306A\u308A\u307E\u3059\u3002
transactions.path=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u306E\u30B3\u30A2\u304C\u30C7\u30FC\u30BF\u3092\u683C\u7D0D\u3059\u308B\u5834\u6240\u3092\u793A\u3059\u76F8\u5BFE\uFF0F\u7D76\u5BFE\u30D1\u30B9\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u3067\u306F\u3001\u5024\u306F "relative-to" \u5C5E\u6027\u3067\u6307\u5B9A\u3055\u308C\u305F\u30D1\u30B9\u3092\u8D77\u70B9\u3068\u3057\u305F\u76F8\u5BFE\u30D1\u30B9\u3068\u3057\u3066\u51E6\u7406\u3055\u308C\u307E\u3059\u3002
transactions.relative-to=\u30C9\u30E1\u30A4\u30F3\u30E2\u30C7\u30EB\u306E\u30B0\u30ED\u30FC\u30D0\u30EB\u30D1\u30B9\u8A2D\u5B9A\u3092\u53C2\u7167\u3057\u307E\u3059\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u306F JBoss Application Server \u306E data \u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u3067\u3059 (jboss.server.data.dir)\u3002"path" \u5C5E\u6027\u306E\u5024\u306F\u3053\u306E\u30D1\u30B9\u3092\u8D77\u70B9\u3068\u3057\u305F\u76F8\u5BFE\u30D1\u30B9\u3068\u3057\u3066\u51E6\u7406\u3055\u308C\u307E\u3059\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u52D5\u4F5C\u3092\u7121\u52B9\u306B\u3057\u3001"path" \u5C5E\u6027\u306E\u5024\u3092\u5F37\u5236\u7684\u306B\u5229\u7528\u3057\u7D76\u5BFE\u30D1\u30B9\u3068\u3057\u3066\u51E6\u7406\u3059\u308B\u306B\u306F\u3001\u7A7A\u306E\u6587\u5B57\u5217\u3092\u4F7F\u3044\u307E\u3059\u3002
transactions.jts=True \u306E\u5834\u5408\u306F Java \u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30B5\u30FC\u30D3\u30B9\u3092\u6709\u52B9\u306B\u3057\u307E\u3059\u3002
transactions.socket-binding=\u30EA\u30AB\u30D0\u30EA\u74B0\u5883\u3092\u4F7F\u3046\u305F\u3081\u306B\u6B63\u3057\u3044\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u3092\u53C2\u7167\u3059\u308B\u969B\u306B\u5229\u7528\u3057\u307E\u3059\u3002
transactions.status-socket-binding=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30B9\u30C6\u30FC\u30BF\u30B9\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u306B\u5229\u7528\u3059\u308B\u305F\u3081\u306B\u6B63\u78BA\u306A\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u3092\u53C2\u7167\u3059\u308B\u306E\u306B\u5229\u7528
transactions.recovery-listener=\u30EA\u30AB\u30D0\u30EA\u30B7\u30B9\u30C6\u30E0\u304C\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u30BD\u30B1\u30C3\u30C8\u3092\u30EA\u30C3\u30B9\u30F3\u3059\u3079\u304D\u304B\u3069\u3046\u304B\u3092\u6307\u5B9A\u3059\u308B\u969B\u306B\u5229\u7528
transactions.enable-statistics=\u7D71\u8A08\u3092\u6709\u52B9\u306B\u3059\u3079\u304D\u304B\u3069\u3046\u304B
transactions.enable-tsm-status=out-of-process \u30EA\u30AB\u30D0\u30EA\u306B\u5FC5\u8981\u3068\u3055\u308C\u308B\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30B9\u30C6\u30FC\u30BF\u30B9\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC (TSM) \u30B5\u30FC\u30D3\u30B9\u3092\u63D0\u4F9B\u3059\u3079\u304D\u304B\u3069\u3046\u304B
transactions.default-timeout=\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8
transactions.object-store-path=\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u306E\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u30B9\u30C8\u30A2\u304C\u30C7\u30FC\u30BF\u3092\u683C\u7D0D\u3059\u308B\u5834\u6240\u3092\u793A\u3059\u76F8\u5BFE\uFF0F\u7D76\u5BFE\u30D1\u30B9\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u3067\u306F\u3001\u5024\u306F "relative-to" \u5C5E\u6027\u3067\u6307\u5B9A\u3055\u3048\u305F\u30D1\u30B9\u3092\u8D77\u70B9\u3068\u3057\u305F\u76F8\u5BFE\u30D1\u30B9\u3068\u3057\u3066\u51E6\u7406\u3055\u308C\u307E\u3059\u3002
transactions.object-store-relative-to=\u30C9\u30E1\u30A4\u30F3\u30E2\u30C7\u30EB\u306E\u30B0\u30ED\u30FC\u30D0\u30EB\u30D1\u30B9\u8A2D\u5B9A\u3092\u53C2\u7167\u3057\u307E\u3059\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u306F JBoss Application Server \u306E data \u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u3067\u3059 (jboss.server.data.dir)\u3002"path" \u5C5E\u6027\u306E\u5024\u306F\u3053\u306E\u30D1\u30B9\u3092\u8D77\u70B9\u3068\u3057\u305F\u76F8\u5BFE\u30D1\u30B9\u3068\u3057\u3066\u51E6\u7406\u3055\u308C\u307E\u3059\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u52D5\u4F5C\u3092\u7121\u52B9\u306B\u3057\u3001"path" \u5C5E\u6027\u306E\u5024\u3092\u5F37\u5236\u7684\u306B\u5229\u7528\u3057\u7D76\u5BFE\u30D1\u30B9\u3068\u3057\u3066\u51E6\u7406\u3059\u308B\u306B\u306F\u3001\u7A7A\u306E\u6587\u5B57\u5217\u3092\u4F7F\u3044\u307E\u3059\u3002
transactions.number-of-transactions=\u4F5C\u6210\u6E08\u307F\u306E\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3 (\u30C8\u30C3\u30D7\u30EC\u30D9\u30EB\u304A\u3088\u3073\u30CD\u30B9\u30C8\u5316) \u7DCF\u6570
transactions.number-of-nested-transactions=\u4F5C\u6210\u6E08\u307F\u306E\u30CD\u30B9\u30C8\u5316 (\u30B5\u30D6) \u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u7DCF\u6570
transactions.number-of-heuristics=\u30D2\u30E5\u30FC\u30EA\u30B9\u30C6\u30A3\u30C3\u30AF\u306A\u7D50\u679C\u3067\u7D42\u4E86\u3055\u308C\u305F\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u6570
transactions.number-of-committed-transactions=\u30B3\u30DF\u30C3\u30C8\u3055\u308C\u305F\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u6570
transactions.number-of-aborted-transactions=\u4E2D\u65AD\u3055\u308C\u305F (\u30ED\u30FC\u30EB\u30D0\u30C3\u30AF\u3055\u308C\u305F) \u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u6570
transactions.number-of-inflight-transactions=\u958B\u59CB\u6E08\u307F\u3067\u3042\u308B\u304C\u7D42\u4E86\u3055\u308C\u3066\u3044\u306A\u3044\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u6570
transactions.number-of-timed-out-transactions=\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u304C\u539F\u56E0\u3067\u30ED\u30FC\u30EB\u30D0\u30C3\u30AF\u3057\u305F\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u6570
transactions.number-of-application-rollbacks=\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u30EA\u30AF\u30A8\u30B9\u30C8\u306B\u3088\u308A\u30ED\u30FC\u30EB\u30D0\u30C3\u30AF\u3055\u308C\u305F\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u6570\u3002\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u306E\u52D5\u4F5C\u306F\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u8A2D\u5B9A\u306E\u5C5E\u6027\u3068\u307F\u306A\u3055\u308C\u308B\u305F\u3081\u3001\u3053\u306E\u6570\u306B\u306F\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u3057\u305F\u3082\u306E\u3082\u542B\u307F\u307E\u3059\u3002
transactions.number-of-resource-rollbacks=\u30EA\u30BD\u30FC\u30B9 (\u30D1\u30FC\u30C6\u30A3\u30B7\u30D1\u30F3\u30C8) \u306E\u554F\u984C\u304C\u539F\u56E0\u3067\u30ED\u30FC\u30EB\u30D0\u30C3\u30AF\u3055\u308C\u305F\u30C8\u30E9\u30F3\u30B6\u30AF\u30B7\u30E7\u30F3\u6570
