transactions=La configuration du sous-syst\u00E8me de transactions.
transactions.add=Ajoute le sous-syst\u00E8me transactions
transactions.remove=Supprime le sous-syst\u00E8me transactions
transactions.configuration=configuration de divers environnements. Peut faire r\u00E9f\u00E9rence aux configurations core (c\u0153ur), recovery (restauration), coordinator environment (environnement du coordinateur) et object store (stockage d'objets).
transactions.node-identifier=Utilis\u00E9 pour d\u00E9finir l'identifiant noeud dans l'environnement core.
transactions.process-id-uuid=Indique si le gestionnaire des transactions devrait utiliser un ID de processus bas\u00E9 sur UUID ou non.
transactions.process-id-socket-binding=Nom de la configuration de liaison de socket \u00E0 utiliser si le gestionnaire de transactions utilise un ID de processus bas\u00E9 sur socket. Sera 'undefined' (non d\u00E9fini) si 'process-id-uuid' est 'true'\u00A0; sinon, il doit \u00EAtre d\u00E9fini.
transactions.process-id-socket-max-ports=Nombre maximum de ports \u00E0 rechercher un port ouvert si le gestionnaire de transactions devait utiliser un ID de processus bas\u00E9 sur socket. Si le port sp\u00E9cifi\u00E9 par la liaison de socket r\u00E9f\u00E9renc\u00E9e dans 'process-id-socket-binding' est occup\u00E9, le port plus haut suivant sera essay\u00E9 jusqu'\u00E0 ce qu'un port ouvert soit trouv\u00E9 ou que le nombre de ports sp\u00E9cifi\u00E9 par cet attribut soit \u00E9puis\u00E9. Sera 'undefined' (non d\u00E9fini) si 'process-id-uuid' est 'true'.
transactions.path=D\u00E9note un chemin absolu ou relatif de syst\u00E8me de fichiers montrant o\u00F9 le c\u0153ur du gestionnaire de transactions devrait stocker les donn\u00E9es. Par d\u00E9faut, la valeur est trait\u00E9e comme \u00E9tant relative au chemin d\u00E9not\u00E9 par l'attribut "relative-to" (relatif \u00E0).
transactions.relative-to=R\u00E9f\u00E9rence une configuration de chemin global dans le mod\u00E8le de domaine, par d\u00E9faut le r\u00E9pertoire des donn\u00E9es JBoss Application Server (jboss.server.data.dir). La valeur de l'attribut "path" (chemin) sera trait\u00E9e comme \u00E9tant relative \u00E0 ce chemin. Veuillez utiliser une cha\u00EEne vide pour d\u00E9sactiver le comportement par d\u00E9faut et pour forcer la valeur de l'attribut "path" (chemin) \u00E0 \u00EAtre trait\u00E9e comme un chemin absolu.
transactions.jts=Si true, ceci active Java Transaction Service
transactions.socket-binding=Utilis\u00E9 pour r\u00E9f\u00E9rencer la liaison de socket correcte \u00E0 utiliser pour l'environnement de r\u00E9cup\u00E9ration.
transactions.status-socket-binding=Utilis\u00E9 pour r\u00E9f\u00E9rencer la liaison de socket correcte \u00E0 utiliser pour le gestionnaire de statut des transactions.
transactions.recovery-listener=Utilis\u00E9 pour sp\u00E9cifier si le syst\u00E8me de r\u00E9cup\u00E9ration doit \u00E9couter un socket r\u00E9seau ou pas.
transactions.enable-statistics=Si les statistiques doivent \u00EAtre activ\u00E9es.
transactions.enable-tsm-status=Si le service TSM (Transaction Status Manager), n\u00E9cessit\u00E9 pour les r\u00E9cup\u00E9rations hors-processus, doit \u00EAtre fourni ou non.
transactions.default-timeout=D\u00E9lai d'expiration par d\u00E9faut.
transactions.object-store-path=D\u00E9note un chemin de syst\u00E8me de fichiers absolu ou relatif montrant l'endroit o\u00F9 le store d'objets du gestionnaire de transactions doit stocker les donn\u00E9es. Par d\u00E9faut, la valeur est trait\u00E9e comme relative au chemin d\u00E9not\u00E9 par l'attribut \u00AB\u00A0relatif \u00E0\u00A0\u00BB.
transactions.object-store-relative-to=Fait r\u00E9f\u00E9rence \u00E0 une configuration de chemin global dans le mod\u00E8le de domaine, par d\u00E9faut le r\u00E9pertoire de donn\u00E9es JBoss Application Server (jboss.server.data.dir). La valeur de l'attribut "path" (chemin) sera trait\u00E9e comme \u00E9tant relative \u00E0 ce chemin. Veuillez utiliser une cha\u00EEne vide pour d\u00E9sactiver le comportement par d\u00E9faut et forcer la valeur de l'attribut "path" \u00E0 \u00EAtre trait\u00E9e comme un chemin absolu.
transactions.number-of-transactions=Nombre total de transactions (niveau sup\u00E9rieur et imbriqu\u00E9es) cr\u00E9\u00E9es
transactions.number-of-nested-transactions=Nombre total de transactions imbriqu\u00E9es (sub) cr\u00E9\u00E9es.
transactions.number-of-heuristics=Nombre de transactions qui se sont termin\u00E9es avec des r\u00E9sultats heuristiques.
transactions.number-of-committed-transactions=Nombre de transactions commit\u00E9es.
transactions.number-of-aborted-transactions=Nombre de transactions abandonn\u00E9es (c.-\u00E0-d. restaur\u00E9es).
transactions.number-of-inflight-transactions=Nombre de transaction ayant commenc\u00E9 mais qui ne sont pas termin\u00E9es.
transactions.number-of-timed-out-transactions=Nombre de transactions restaur\u00E9es \u00E0 cause de l'expiration du d\u00E9lai.
transactions.number-of-application-rollbacks=Nombre de transactions qui ont \u00E9t\u00E9 restaur\u00E9es sur la requ\u00EAte d'une application. Ceci inclut celles qui ont d\u00E9pass\u00E9 le d\u00E9lai d'expiration, puisque le comportement du d\u00E9lai d'expiration est consid\u00E9r\u00E9 comme un attribut de la configuration de l'application.
transactions.number-of-resource-rollbacks=Nombre de transaction qui ont \u00E9t\u00E9 restaur\u00E9es suite \u00E0 un \u00E9chec de ressources (participant).
