transactions=A configura\u00E7\u00E3o do sub-sistema de transa\u00E7\u00F5es.
transactions.add=Adiciona o sub-sistema das transa\u00E7\u00F5es
transactions.remove=Remove o sub-sistema das transa\u00E7\u00F5es
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author ldelima@redhat.com
transactions.configuration=configura\u00E7\u00E3o de diversos ambientes. Isto pode ser referido ao core, recupera\u00E7\u00E3o, ambiente de coordena\u00E7\u00E3o e configura\u00E7\u00F5es do armazenamento do objeto.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author ldelima@redhat.com
transactions.node-identifier=Usado para determinar o identificador do n\u00F3 no ambiente core.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author ldelima@redhat.com
transactions.process-id-uuid=Indica se \u00E9 que o gerenciador da transa\u00E7\u00E3o deve usa a id baseada no processo.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author ldelima@redhat.com
transactions.process-id-socket-binding=O nome da configura\u00E7\u00E3o binding do soquete para uso, caso o gerenciador da transa\u00E7\u00E3o use a id do processo baseado no soquete. Isto ser\u00E1 'indefinido', caso o 'process-id-uuid' for verdadeiro, do contr\u00E1rio isto dever\u00E1 ser configurado.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author ldelima@redhat.com
transactions.process-id-socket-max-ports=O n\u00FAmero m\u00E1ximo de portas de busca para uma porta aberta, caso o gerenciador de transa\u00E7\u00E3o use a id do processo baseado no soquete. Caso a porta especificada pelo binding do soquete referenciado no 'process-id-socket-binding' estiver ocupada, haver\u00E1 uma tentativa na pr\u00F3xima porta superior at\u00E9 que uma porta aberta seja encontrada ou o n\u00FAmero de portas especificadas por esse atributo tenham sido tentados. Isto ser\u00E1 'indefinido' caso o 'process-id-uuid' seja 'verdadeiro'.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author ldelima@redhat.com
transactions.path=Indica um caminho de fliesystem relativo ou absoluto apontando onde o core do gerenciador da transa\u00E7\u00E3o deve ser armazenar os dados. Por padr\u00E3o, o valor \u00E9 tratado como relativo ao caminho descrito pelo atributo "relativo \u00E0".
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author ldelima@redhat.com
transactions.relative-to=As refer\u00EAncias da configura\u00E7\u00E3o do caminho global no modelo do dom\u00EDnio, padronizadas ao diret\u00F3rio de dados do Servidor do Aplicativo JBoss (jboss.server.data.dir). O valor do atributo "caminho" ser\u00E1 tratado como relativo neste caminho. Use uma sequ\u00EAncia vazia para desativar o comportamento padr\u00E3o e for\u00E7ar o valor do atributo "caminho" a ser tratado como um caminho absoluto.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author ldelima@redhat.com
transactions.jts=Caso verdadeiro, isto ativa o Servi\u00E7o da Transa\u00E7\u00E3o do Java
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author ldelima@redhat.com
transactions.socket-binding=Usado para referenciar o binding do soquete correto para uso do ambiente de recupera\u00E7\u00E3o.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author ldelima@redhat.com
transactions.status-socket-binding=Usado para referenciar o binding de soquete correto para uso do gerenciador de status da transa\u00E7\u00E3o.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author ldelima@redhat.com
transactions.recovery-listener=Usado para especificar, caso o sistema de recupera\u00E7\u00E3o ouvir ou n\u00E3o no soquete da rede.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author ldelima@redhat.com
transactions.enable-statistics=Se \u00E9 que as estat\u00EDsticas devem ser ativadas.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author ldelima@redhat.com
transactions.enable-tsm-status=Se \u00E9 que o servi\u00E7o do gerenciador de status da transa\u00E7\u00E3o (TSM), necess\u00E1rio para desligar a recupera\u00E7\u00E3o do processo, deve ser fornecido ou n\u00E3o.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author ldelima@redhat.com
transactions.default-timeout=O intervalo padr\u00E3o.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author ldelima@redhat.com
transactions.object-store-path=Descreve o caminho do filesystem absoluto ou relativo onde o armazenamento do objeto do gerenciador de transa\u00E7\u00E3o deve armazenar dados. Por padr\u00E3o, o valor \u00E9 tratado como relativo ao caminho indicado pelo atributo "relativo \u00E0".
transactions.object-store-relative-to=Referencia a configura\u00E7\u00E3o do caminho global no modelo do dom\u00EDnio, padronizado ao diret\u00F3rio de dados do Servidor do Aplicativo JBoss (jboss.server.data.dir). O valor do atributo "caminho" ser\u00E1 tratado como relativo nesse caminho. Use uma sequ\u00EAncia vazia para desativar o comportamento padr\u00E3o e for\u00E7ar o valor do atributo do "caminho" a ser tratado como um caminho absoluto.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author ldelima@redhat.com
transactions.number-of-transactions=O n\u00FAmero total de transa\u00E7\u00F5es criadas (n\u00EDvel superior e aninhadas).
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author ldelima@redhat.com
transactions.number-of-nested-transactions=O n\u00FAmero total de transa\u00E7\u00F5es criadas (sub) aninhadas.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author ldelima@redhat.com
transactions.number-of-heuristics=O n\u00FAmero total de transa\u00E7\u00F5es que encerram com as sa\u00EDdas heur\u00EDsticas.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author ldelima@redhat.com
transactions.number-of-committed-transactions=O n\u00FAmero de transa\u00E7\u00F5es confirmadas.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author ldelima@redhat.com
transactions.number-of-aborted-transactions=O n\u00FAmero de transa\u00E7\u00F5es abortadas (ex.\: revertidas).
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author ldelima@redhat.com
transactions.number-of-inflight-transactions=O n\u00FAmero de transa\u00E7\u00F5es que foram iniciadas, mas n\u00E3o foram encerradas.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author ldelima@redhat.com
transactions.number-of-timed-out-transactions=O n\u00FAmero de transa\u00E7\u00F5es que foram revertidas devido ao intervalo.
transactions.number-of-application-rollbacks=O n\u00FAmero de transa\u00E7\u00F5es que foram revertidas pela solicita\u00E7\u00E3o do aplicativo. Isto inclui as transa\u00E7\u00F5es em intervalo, uma vez que o comportamento de intervalo \u00E9 considerado um atributo da configura\u00E7\u00E3o do aplicativo.
# translation auto-copied from project JBoss AS, version eap6, document org.jboss.as/jboss-as-transactions/org/jboss/as/txn/subsystem/LocalDescriptions, author ldelima@redhat.com
transactions.number-of-resource-rollbacks=O n\u00FAmero de transa\u00E7\u00F5es que foram revertidas devido \u00E0 falha do recurso (participante).
transactions.log-store.transaction.delete=Remove this transaction log. WARNING after this operation the transaction manager will have no knowledge of the transaction and will therefore never be able to recover it. If you are sure that the transaction is complete then the operation is safe. The representation of the transaction log is removed from the model too.
transactions.log-store.transaction.participant.refresh=Refresh the management view of the attributes of this participant record by querying the transaction log. (Note that the read-resource operaton only reads the model, hence the need for this refresh operation).
transactions.log-store.transaction.participant.recover=If this record is in a heuristic state then attempt to replay the commit phase of the 2PC transaction.
transactions.log-store=Representation of the transaction logging storage mechanism.
transactions.log-store.add=Add a representation of the transaction logging storage mechanism.
transactions.log-store.probe=Scan for new transaction logs. This operation will creates a child for each pending transaction.
transactions.log-store.remove=Remove a representation of the transaction logging storage mechanism.
transactions.log-store.type=Specifies the implementation type of the logging store.
transactions.log-store.transactions=The persistent information that the transaction manager stores for the purpose of recovering a transaction in the event of failure. The probe operation will add and remove transactions from the model as the corresponding real transactions start and finish the prepare and commit phases. A stuck transaction will remain in the model until either it is completed or explicitly removed by the delete operation.
transactions.log-store.transaction=The persistent information that the transaction manager stores for the purpose of recovering a transaction in the event of failure. The probe operation will add and remove transactions from the model as the corresponding real transactions start and finish the prepare and commit phases. A stuck transaction will remain in the model until either it is completed or explicitly removed by the delete operation.
transactions.log-store.transaction.add=Add a transaction to log-store.
transactions.log-store.transaction.jmx-name=The JMX name of this transaction.
transactions.log-store.transaction.id=The id of this transaction.
transactions.log-store.transaction.age-in-seconds=The time since this transaction was prepared or when the recovery system last tried to recover it.
transactions.log-store.transaction.type=The type name under which this record is stored.
transactions.log-store.transaction.participants=The resources that did work in a transaction.
transactions.log-store.transaction.participant=The resources that did work in a transaction.
transactions.log-store.transaction.participant.jmx-name=The JMX name of this participant.
transactions.log-store.transaction.participant.add=Add a transaction participant to a transaction log.
transactions.log-store.transaction.participant.status=Reports the commitment status of this participant (can be one of Pending, Prepared, Failed, Heuristic or Readonly).
transactions.log-store.transaction.participant.jndi-name=JNDI name of this participant.
transactions.log-store.transaction.participant.type=The type name under which this record is stored.
transactions.log-store.transaction.participant.eis-product-name=The JCA enterprise information system's product name.
transactions.log-store.transaction.participant.eis-product-version=The JCA enterprise information system's product version
