picketlink-identity-management=La configuraci\u00F3n del sub-sistema PicketLink.
picketlink-identity-management.add=Agrega la configuraci\u00F3n del sub-sistema PicketLink.
picketlink-identity-management.remove=Borra la configuraci\u00F3n del sub-sistema PicketLink.
picketlink-identity-management.deprecated=El subsistema PicketLink ya no se utiliza y es posible que se borre, que se modifique de manera importante o que se limite al uso del servidor de legado de dominios administrados en versiones futuras.
partition-manager=La configuraci\u00F3n de un administrador de particiones.
partition-manager.add=Agrega una configuraci\u00F3n del administrador de particiones.
partition-manager.remove=Borra una configuraci\u00F3n del administrador de particiones.
partition-manager.name=Nombre para el administrador de particiones.
partition-manager.jndi-name=Nombre JNDI para el administrador de particiones.
identity-configuration=La configuraci\u00F3n de un administrador de particiones.
identity-configuration.add=Agrega una configuraci\u00F3n para un administrador de particiones.
identity-configuration.remove=Borra una configuraci\u00F3n para un administrador de particiones.
identity-configuration.name=Nombre de la configuraci\u00F3n.
jpa-store=La configuraci\u00F3n de un almac\u00E9n JPA.
jpa-store.add=Agregar un almac\u00E9n JPA.
jpa-store.remove=Borra un almac\u00E9n JPA.
jpa-store.data-source=URL JNDI para la fuente de datos.
jpa-store.entity-module=Nombre del m\u00F3dulo desde donde se deben cargar las entidades JPA y la unidad de persistencia.
jpa-store.entity-module-unit-name=El nombre de la unidad de persistencia al utilizar el m\u00F3dulo entidad.
jpa-store.entity-manager-factory=URL JNDI para la EntityManagerFactory.
jpa-store.module=Un m\u00F3dulo opcional desde donde se deben cargar las clases.
jpa-store.support-attribute=Indica si los atributos ad-hoc est\u00E1n soportados por el almac\u00E9n de identidad.
jpa-store.support-credential=Indica si las credenciales est\u00E1n soportadas por el almac\u00E9n de identidades.
file-store=La configuraci\u00F3n de un almac\u00E9n de archivos.
file-store.add=Agrega un almac\u00E9n de archivos.
file-store.remove=Borra un almac\u00E9n de archivos.
file-store.working-dir=Directorio en donde se deben almacenar los archivos IDM.
file-store.relative-to=Ruta relativa cuando se especifica el directorio de trabajo.
file-store.always-create-files=Indica si los archivos IDM siempre se deben crear.
file-store.async-write=Indica si se soportan las escrituras asincr\u00F3nicas.
file-store.async-write-thread-pool=Define el tama\u00F1o del grupo de hilos para las escrituras asincr\u00F3nicas.
file-store.module=Un m\u00F3dulo opcional desde donde se deben cargar las clases.
file-store.support-attribute=Indica si los atributos ad-hoc est\u00E1n soportados por el almac\u00E9n de identidad.
file-store.support-credential=Indica si las credenciales est\u00E1n soportadas por el almac\u00E9n de identidades.
ldap-store=La configuraci\u00F3n de un almac\u00E9n LDAP.
ldap-store.add=Agrega un almac\u00E9n LDAP.
ldap-store.remove=Borra un almac\u00E9n LDAP.
ldap-store.url=Define la url para conectarse al servidor LDAP.
ldap-store.bind-dn=Define el DN de enlace utilizado para autenticar con el servidor.
ldap-store.bind-credential=Define la credencial de enlace utilizada para autenticar con el servidor.
ldap-store.base-dn-suffix=Define el sufijo DN base en donde se almacenan los tipos de identidad.
ldap-store.module=Un m\u00F3dulo opcional desde donde se deben cargar las clases.
ldap-store.support-attribute=Indica si los atributos ad-hoc est\u00E1n soportados por el almac\u00E9n de identidad.
ldap-store.support-credential=Indica si las credenciales est\u00E1n soportadas por el almac\u00E9n de identidades.
ldap-store.unique-id-attribute-name=El nombre de un atributo LDAP que identifica de manera \u00FAnica las entradas.
ldap-store.active-directory=Indica si el servidor LDAP es un MSAD.
mapping=La configuraci\u00F3n de mapeo LDAP para un tipo IDM.
mapping.add=Agrega una configuraci\u00F3n de mapeo.
mapping.remove=Borra una configuraci\u00F3n de mapeo.
mapping.class-name=El nombre completamente calificado del tipo IDM.
mapping.code=El alias para uno de los tipos inclu\u00EDdos.
mapping.module=Un m\u00F3dulo opcional desde donde se deben cargar las clases.
mapping.base-dn-suffix=El DN base para este tipo.
mapping.object-classes=Una lista de objectClasses.
mapping.parent-membership-attribute-name=El nombre del atributo utilizado para crear relaciones de padre-hijo.
mapping.relates-to=Relaciona un tipo con otro tipo mapeado. Usualmente se utiliza cuando se mapean relaciones.
attribute=Un mapeo de atributo LDAP para un tipo mapeado espec\u00EDfico.
attribute.add=Agrega una configuraci\u00F3n de atributos.
attribute.remove=Borra una configuraci\u00F3n de atributos.
attribute.name=El nombre de la propiedad a mapear a un atributo LDAP espec\u00EDfico.
attribute.ldap-name=El nombre del atributo LDAP para mapear a una propiedad espec\u00EDfica.
attribute.is-identifier=Indica si este atributo es un identificador.
attribute.read-only=Indica si este atributo es de solo lectura.
supported-types=El grupo de tipo soportado para una configuraci\u00F3n del almac\u00E9n de identidades.
supported-types.add=Agrega un grupo de tipo soportado.
supported-types.remove=Borra un grupo de tipo soportado.
supported-types.supports-all=Indica si se soportan todos los tipos.
supported-type=El tipo soportado por una configuraci\u00F3n de almac\u00E9n de identidades.
supported-type.add=Agrega un tipo.
supported-type.remove=Borra un tipo.
supported-type.class-name=El nombre del tipo. Usualmente el nombre completamente calificado.
supported-type.code=El alias para uno de los tipos incluidos.
supported-type.module=Un m\u00F3dulo opcional desde donde se deben cargar las clases.
credential-handler=Un tipo CredentialHandler soportado por un almac\u00E9n de identidades espec\u00EDfico.
credential-handler.add=Agrega un tipo.
credential-handler.remove=Borra un tipo.
credential-handler.class-name=El nombre del tipo. Usualmente el nombre completamente calificado.
credential-handler.code=El alias para uno de los tipos incluidos.
credential-handler.module=Un m\u00F3dulo opcional desde donde se deben cargar las clases.
