picketlink-identity-management=A configura\u00E7\u00E3o da Subsistema PicketLink.
picketlink-identity-management.add=Adiciona a configura\u00E7\u00E3o do Subsistema PincketLink.
picketlink-identity-management.remove=Remove a configura\u00E7\u00E3o do Subsistema PincketLink.
picketlink-identity-management.deprecated=O Subsistema Picketlink est\u00E1 preterido  e pode ser removido, significantemente revisado, ou limitado ao uso do servidor de legacia do managed domain em vers\u00F5es futuras.
partition-manager=A configura\u00E7\u00E3o de um keystore para uso da cria\u00E7\u00E3o de um gerenciador trust para verifica\u00E7\u00E3o de clientes.
partition-manager.add=Adiciona a configura\u00E7\u00E3o do Gerenciador de Parti\u00E7\u00E3o.
partition-manager.remove=Remove a configura\u00E7\u00E3o do Gerenciador de Parti\u00E7\u00E3o.
partition-manager.name=Nome para o Gerenciador de Parti\u00E7\u00E3o.
partition-manager.jndi-name=O nome JNDI para o Gerenciador de Parti\u00E7\u00E3o.
identity-configuration=A configura\u00E7\u00E3o para o Gerenciador de Parti\u00E7\u00E3o.
identity-configuration.add=Adiciona uma configura\u00E7\u00E3o para o Gerenciador de Parti\u00E7\u00E3o.
identity-configuration.remove=Remove a configura\u00E7\u00E3o para o Gerenciador de Parti\u00E7\u00E3o.
identity-configuration.name=Nome da Configura\u00E7\u00E3o.
jpa-store=A configura\u00E7\u00E3o do JPA Store.
jpa-store.add=Adiciona o JPA Store.
jpa-store.remove=Remove o JPA Store.
jpa-store.data-source=O JNDI URL para a Fonte de Dados.
jpa-store.entity-module=O nome do m\u00F3dulo onde as entidades JPA e unidades persistidas devem ser carregadas. 
jpa-store.entity-module-unit-name=O nome da unidade persistida quando usando entity-module.
jpa-store.entity-manager-factory=O JNDI URL para o EntityManagerFactory.
jpa-store.module=Um m\u00F3dulo alternativo onde as classes devem ser carregadas.
jpa-store.support-attribute=Indica se os atributos ad-hoc s\u00E3o suportados pelo store de identidade.
jpa-store.support-credential=Indica se os credenciais s\u00E3o suportados pelo store de identidade.
file-store=A configura\u00E7\u00E3o do Store do Arquivo.
file-store.add=Adiciona o Store do Arquivo.
file-store.remove=Remove o Store do Arquivo.
file-store.working-dir=O diret\u00F3rio onde os arquivos IDM devem ser stored.
file-store.relative-to=Caminho relativo quando o working-dir \u00E9 especificado.
file-store.always-create-files=Indica se os arquivos IDM devem sempre ser criados.
file-store.async-write=Indicat se as grava\u00E7\u00F5es async s\u00E3o suportadas.
file-store.async-write-thread-pool=Define o tamanho do thread pool para as grava\u00E7\u00F5es async.
file-store.module=Um m\u00F3dulo de alternativa a partir de onde a classe deve ser carregada.
file-store.support-attribute=Indica se os atributos ad-hoc s\u00E3o suportados pelo store de identidade.
file-store.support-credential=Indica se os credenciais s\u00E3o suportados pelo store de identidade.
ldap-store=A configura\u00E7\u00E3o do LDAP Store.
ldap-store.add=Adiciona um LDAP Store.
ldap-store.remove=Remove um LDAP Store.
ldap-store.url=Defines o url de conex\u00E3o do servidor LDAP.
ldap-store.bind-dn=Defines o bind DN usado para autenticar com o servidor.
ldap-store.bind-credential=Define o credencial do bind usado para autenticar com o servidor.
ldap-store.base-dn-suffix=Define o sufixo base DN onde os tipos de identidade s\u00E3o stored.
ldap-store.module=Um m\u00F3dulo de alternativa a partir de onde a classe deve ser carregada.
ldap-store.support-attribute=Indica se os atributos ad-hoc s\u00E3o suportados pelo store de identidade.
ldap-store.support-credential=Indica se os credenciais s\u00E3o suportados pelo store de identidade.
ldap-store.unique-id-attribute-name=O nome de um atributo LDAP que identifica entradas unicamente.
ldap-store.active-directory=Indica ser \u00E9 que o servidor LDAP \u00E9 uma MSAD.
mapping=A configura\u00E7\u00E3o do mapeamento LDAP para um tipo IDM.
mapping.add=Adiciona uma configura\u00E7\u00E3o de mapeamento.
mapping.remove=Remove uma configura\u00E7\u00E3o de mapeamento.
mapping.class-name=O nome inteiramente qualificado do tipo IDM.
mapping.code=O alias para os tipos internos.
mapping.module=Um m\u00F3dulo de alternativa a partir de onde a classe deve ser carregada.
mapping.base-dn-suffix=O DN base para este tipo.
mapping.object-classes=Uma lista de v\u00EDrgula separada do objectClasses.
mapping.parent-membership-attribute-name=O nome do atributo usado para criar as rela\u00E7\u00F5es parent-child
mapping.relates-to=Relata um tipo com outro tipo mapeado. Normalmente usado quando mapeamento as rela\u00E7\u00F5es.
attribute=O mapeamento do atributo LDAP para o tipo mapeado espec\u00EDfico.
attribute.add=Adiciona a configura\u00E7\u00E3o do atributo.
attribute.remove=Remove a configura\u00E7\u00E3o do atributo.
attribute.name=O nome da propriedade para mapear um atributo LDAP espec\u00EDfico.
attribute.ldap-name=O nome do atributo LDAP para mapear uma propriedade espec\u00EDfica.
attribute.is-identifier=Indica se o atributo \u00E9 um identificador.
attribute.read-only=Indica se o atributo \u00E9 apenas de leitura.
supported-types=O conjunto de tipo suportado para uma configura\u00E7\u00E3o store de identidade.
supported-types.add=Adiciona um conjunto de tipo suportado.
supported-types.remove=Remove um conjunto de tipo suportado.
supported-types.supports-all=Indica se todos os tipos s\u00E3o suportados.
supported-type=O tipo suportado pela configura\u00E7\u00E3o do store de identidade.
supported-type.add=Adiciona o tipo.
supported-type.remove=Remove o tipo.
supported-type.class-name=O nome do tipo. Normalmente o nome inteiramente qualificado.
supported-type.code=O alias de um dos tipos internos.
supported-type.module=Um m\u00F3dulo de alternativa a partir de onde a classe deve ser carregada.
credential-handler=O tipo CredentialHandler suportado pelo store de identidade espec\u00EDfica.
credential-handler.add=Adiciona o tipo.
credential-handler.remove=Remove o tipo.
credential-handler.class-name=O nome do tipo. Normalmente o nome inteiramente qualificado.
credential-handler.code=O alias de um dos tipos internos.
credential-handler.module=Um m\u00F3dulo de alternativa onde as classes devem ser carregadas.
