# These files are generated via Zanata (https://translate.jboss.org/project/view/jboss_as).
# Please do not update this file as it will be overwritten.

couldNotGetBeansXmlAsURL=N\u00E3o foi poss\u00EDvel obter o arquivo getbeans.xml como URL no processamento do arquivo\: %s
couldNotLoadInterceptorClass=N\u00E3o foi poss\u00EDvel carregar a classe do interruptor\: %s
extensionDoesNotImplementExtension=A classe do servi\u00E7o %s n\u00E3o implanta a interface javax.enterprise.inject.spi.Extension
viewNotFoundOnEJB=A visualiza\u00E7\u00E3o do tipo %s n\u00E3o foi encontrada no EJB %s
ejbHashBeenRemoved=O EJB foi removido
couldNotInjectField=Falha ao executar a inje\u00E7\u00E3o CDI do campo\: %s no %s
couldNotInjectMethod=Falha ao executar a inje\u00E7\u00E3o CDI no m\u00E9todo\: %s no %s
moreThanOneBeanConstructor=A classe %s possui mais do que um construtor anotado com o @Inject
attemptingToInjectInjectionPointIntoField=O componente %s est\u00E1 tentando injetar o InjectPoint num campo\: %s
couldNotResolveInjectionPoint=N\u00E3o foi poss\u00EDvel resolver o bean CDI para o ponto de inje\u00E7\u00E3o %s com os qualificadores %s
attemptingToInjectInjectionPointIntoNonBean=O componente %s est\u00E1 tentando injetar a InjectionPoint ao m\u00E9todo de um componente que n\u00E3o \u00E9 um bean CDI %s
unknownInterceptorClassForCDIInjection=Classe de interceptor desconhecido para a inje\u00E7\u00E3o CDI %s
parameterCannotBeNull=O %s n\u00E3o pode ser nulo
injectionPointNotAJavabean=O ponto de inje\u00E7\u00E3o representa um m\u00E9todo que n\u00E3o segue as conven\u00E7\u00F5es do JavaBean (deve possuir exatamente um par\u00E2metro) %s
annotationNotFound=O %s da anota\u00E7\u00E3o n\u00E3o foi encontrado no %s 
ejbNotResolved=N\u00E3o foi poss\u00EDvel resolver a inje\u00E7\u00E3o @EJB para o %s no %s
moreThanOneEjbResolved=Foi resolvido mais de um EJB para a inje\u00E7\u00E3o @EJB do %s no %s. Foi encontrado %s
couldNotDetermineUnderlyingType=N\u00E3o foi poss\u00EDvel determinar a classe de bean do tipo do ponto de inje\u00E7\u00E3o de %s
couldNotFindPersistenceUnit=Erro ao injetar a unidade de persist\u00EAncia no bean gerenciado CDI. N\u00E3o foi poss\u00EDvel encontrar a unidade de persist\u00EAncia nomeada %s na implanta\u00E7\u00E3o %s
securityNotEnabled=N\u00E3o foi poss\u00EDvel injetar o SecurityManager, a seguran\u00E7a n\u00E3o est\u00E1 ativada
singletonNotSet=O singleton n\u00E3o foi configurado para %s. Isto significa que voc\u00EA est\u00E1 tentando acessar a implanta\u00E7\u00E3o weld com o ClassLoader do Contexto do Thread que n\u00E3o est\u00E1 associado com a implanta\u00E7\u00E3o.
alreadyRunning=O %s j\u00E1 est\u00E1 rodando
notStarted=O %s n\u00E3o foi iniciado
cannotAddServicesAfterStart=Os servi\u00E7os n\u00E3o podem ser adicionados ap\u00F3s o weld ter iniciado
beanDeploymentNotFound=N\u00E3o foi encontrado o BeanDeploymentArchive com a id %s na implanta\u00E7\u00E3o
