couldNotGetBeansXmlAsURL=Pourrait r\u00E9cup\u00E9rer le fichier beans.xml en tant qu'URL lors du traitement du fichier\u00A0\: %s
couldNotLoadInterceptorClass=Impossible de charger l'intercepteur de classe\u00A0\: %s
extensionDoesNotImplementExtension=La classe du service %s n'a pas impl\u00E9ment\u00E9 l'interface javax.enterprise.inject.spi.Extension
viewNotFoundOnEJB=Affichage du type %s introuvable sur EJB %s
ejbHashBeenRemoved=EJB a \u00E9t\u00E9 supprim\u00E9
couldNotInjectField=Impossible d'effectuer une injection CDI du champ\u00A0\: %s sur %s
couldNotInjectMethod=Impossible d'effectuer une injection CDI de la m\u00E9thode\u00A0\: %s sur %s
moreThanOneBeanConstructor=La classe %s poss\u00E8de plus d'un constructeur annot\u00E9 avec @Inject
attemptingToInjectInjectionPointIntoField=Le composant %s tente d'injecter InjectionPoint dans un champ\u00A0\: %s
couldNotResolveInjectionPoint=Impossible de r\u00E9soudre le bean CDI pour le point d'injection %s avec les qualificateurs %s
attemptingToInjectInjectionPointIntoNonBean=Le composant %s tente d'injecter InjectionPoint dans une m\u00E9thode sur un composant qui n'est pas un bean CDI %s
unknownInterceptorClassForCDIInjection=Classe de l'intercepteur inconnue pour l'injection CDI %s
parameterCannotBeNull=% ne peut pas \u00EAtre null
injectionPointNotAJavabean=Le point d'injection repr\u00E9sente une m\u00E9thode qui ne suit pas les conventions JavaBean (doit poss\u00E9der exactement un param\u00E8tre) %s
annotationNotFound=Annotation %s introuvable sur %s
ejbNotResolved=Impossible de r\u00E9soudre l'injection @EJB pour %s sur %s
moreThanOneEjbResolved=R\u00E9solution de plus d'un EJB pour l'injection @EJB de %s sur %s. %s trouv\u00E9
couldNotDetermineUnderlyingType=Impossible de d\u00E9terminer la classe bean \u00E0 partir du type de point d'injection de %s
couldNotFindPersistenceUnit=Erreur lors de l'injection de l'unit\u00E9 de persistance dans le bean g\u00E9r\u00E9 CDI. Impossible de trouver une unit\u00E9 de persistance nomm\u00E9e %s dans le d\u00E9ploiement %s
securityNotEnabled=Impossible d'injecter SecurityManager, la s\u00E9curit\u00E9 n'est pas activ\u00E9e
singletonNotSet=Singleton non d\u00E9fini pour %s. Cela signifie que vous tentez d'acc\u00E9der \u00E0 un d\u00E9ploiement Weld avec ClassLoader Contexte Thread qui n'est pas associ\u00E9 au d\u00E9ploiement.
alreadyRunning=%s est d\u00E9j\u00E0 en cours d'ex\u00E9cution
notStarted=%s n'est pas d\u00E9marr\u00E9
cannotAddServicesAfterStart=les services ne peuvent pas \u00EAtre ajout\u00E9s une fois que Weld a commenc\u00E9
beanDeploymentNotFound=le BeanDeploymentArchive avec l'id %s est introuvable dans le d\u00E9ploiement
