# These files are generated via Zanata (https://translate.jboss.org/project/view/jboss_as).
# Please do not update this file as it will be overwritten.

couldNotGetBeansXmlAsURL=No se pudo obtener el archivo beans.xml como URL al procesar el archivo\: %s
couldNotLoadInterceptorClass=No se pudo cargar clase de interceptor\: %s
extensionDoesNotImplementExtension=Clase de servicio %s no se implement\u00F3 en la interfaz de Extensi\u00F3n javax.enterprise.inject.spi.
viewNotFoundOnEJB=Vista de tipo %s no se encontr\u00F3 en EJB %s
ejbHashBeenRemoved=EJB ha sido borrado
couldNotInjectField=Fall\u00F3 realizar la inyecci\u00F3n CDI del campo %s en %s
couldNotInjectMethod=Fall\u00F3 realizar inyecci\u00F3n CDI del m\u00E9todo\: %s on %s
moreThanOneBeanConstructor=Clase %s tiene m\u00E1s de un constructor anotado con @Inject
attemptingToInjectInjectionPointIntoField=Componente %s est\u00E1 tratando de inyectar el  InjectionPoint en un campo\: %s
couldNotResolveInjectionPoint=No se pudo resolver bean CDI para punto de inyecci\u00F3n %s con calificadores %s 
attemptingToInjectInjectionPointIntoNonBean=Componente %s est\u00E1 tratando de inyectar el  InjectionPoint en un m\u00E9todo en un componente que no es un bean CDI %s
unknownInterceptorClassForCDIInjection=Clase de interceptor desconocido para inyecci\u00F3n CDI %s
parameterCannotBeNull=%s no puede ser nulo
injectionPointNotAJavabean=El punto de inyecci\u00F3n representa un m\u00E9todo que no sigue las convenciones de JavaBean (debe tener exactamente un par\u00E1metro) %s
annotationNotFound=anotaci\u00F3n %s no se encontr\u00F3 en %s
ejbNotResolved=No se pudo resolver inyecci\u00F3n @EJB parar %s en %s
moreThanOneEjbResolved=Resuelto m\u00E1s de un EJB para @EJB injection de %s en %s. Se encontraron %s
couldNotDetermineUnderlyingType=No se pudo determinar la clase de bean del tipo de punto de inyecci\u00F3n de %s
couldNotFindPersistenceUnit=Error al inyectar unidad de persistencia en bean CDI administrado. No se puede encontrar una unidad de persistencia denominada %s en implementaci\u00F3n %s
securityNotEnabled=No se pudo inyectar SecurityManager, la seguridad no est\u00E1 habilitada
singletonNotSet=Singleton no establecido para %s. Esto significa que usted est\u00E1 intentando acceder a una implementaci\u00F3n de soldadura con  Thread Context ClassLoader que no est\u00E1 asociado con la implementaci\u00F3n.
alreadyRunning=%s ya se est\u00E1 ejecutando
notStarted=%s no ha iniciado
cannotAddServicesAfterStart=no se pueden a\u00F1adir servicios despu\u00E9s de que la soldadura haya empezado
beanDeploymentNotFound=No se encontr\u00F3 BeanDeploymentArchive con ID %s  en implementaci\u00F3n
