cannotDeleteDeploymentProgressMarker=Kann Deployment-Fortschritts-Statusdatei nicht l\u00F6schen %s
cannotRemoveDeploymentMarker=Kann \u00FCberz\u00E4hlige Deployment-Statusdatei nicht entfernen %s
deploymentNotFound=Deployment von '%s' angefragt, aber das Deployment ist nicht vorhanden 
deploymentTriggered=%1$s in Deployment-Verzeichnis gefunden. Um Deployment zustarten, erstellen Sie eine Datei namens %1$s%2$s
errorWritingDeploymentMarker=Es trat eine Exception auf beim Schreiben der Deployment Status Datei %s
explodedAutoDeploymentContentWarning=Zuverl\u00E4ssiges Deployment-Verhalten ist nicht m\u00F6glich, wenn automatisches Deployment von entpackten Inhalten aktiviert ist (d.h. Deployment ohne Verwendung von "%s"' Statusdateien). Konfiguration von automatischem Deployment von entpackten Inhalten wird nicht empfohlen f\u00FCr Situationen, in denen Zuverl\u00E4ssigkeit erforderlich ist. Die Konfiguring der Einstellung %s des Deployment-Scanners auf "false" wird empfohlen.
explodedDeploymentContentDeleted=Der Deployment-Scanner stellte fest, dass der Inhalt f\u00FCr das entpackte Deployment %1$s gel\u00F6scht wurde, dass automatisches Deploy/Undeploy f\u00FCr entpackte Deployments jedoch nicht aktiviert ist und dass die %1$s%2$s Statusdatei f\u00FCr dieses Deployment nicht entfernt wurde. Dadurch wurde das Deployment nicht undeployt, allerdings wurden vom Deployment ben\u00F6tigte Ressourcen m\u00F6glicherweise gel\u00F6scht und Applikationsfehler k\u00F6nnen auftreten. Es wird empfohlen, die %1$s%2$s Statusdatei zu l\u00F6schen, um den Undeploy-Vorgang auszul\u00F6sen.
failedCheckingZipFile=\u00DCberpr\u00FCfung, ob %s eine komplette ZIP ist, fehlgeschlagen
fileSystemDeploymentFailed=Dateisystem-Deploymentdienst fehlgeschlagen 
incompleteContent=Scan hat unvollst\u00E4ndig kopierte Dateinhalte f\u00FCr Deployment %s gefunden. Deployment-\u00C4nderungen werden nicht verarbeitet, bis alle Inhalte vollst\u00E4ndig sind.
invalidExplodedDeploymentDirectory=Der Deployment-Scanner hat ein Verzeichnis namens %1$s gefunden, dass sich nicht innerhalb eines Verzeichnisses befand, dessen Name auf .ear, .jar, .rar, .sar oder .war endet. Dies ist wahrscheinlich darauf zur\u00FCckzuf\u00FChren, dass ein Archivverzeichnis direkt innerhalb des %2$s Verzeichnisses entpackt wurde, was einen Benutzerfehler darstellt. Das %1$s Verzeichnis wird nicht auf Deployments untersucht, doch es ist m\u00F6glich, dass der Scanner andere Dateien vom nicht entpackten Archiv findet und versucht, diese zu deployen, was zu Fehlern f\u00FChren kann.
scanException=Scan von %s meldet Ausnahme
started=Start von %s f\u00FCr Verzeichnis %s
reattemptingFailedDeployment=Erneuter Versuch des fehlgeschlagenen Deployments %s
failedCheckingXMLFile=\u00DCberpr\u00FCfung, ob %s eine komplette XML ist, fehlgeschlagen
