cannotDeleteDeploymentProgressMarker=N\u00E3o foi poss\u00EDvel deletar o arquivo do marcador de progresso de implanta\u00E7\u00E3o %s
cannotRemoveDeploymentMarker=N\u00E3o foi poss\u00EDvel remover o arquivo do marcador de implanta\u00E7\u00E3o estranha
deploymentNotFound=A implanta\u00E7\u00E3o do solicitada, mas a implanta\u00E7\u00E3o n\u00E3o est\u00E1 presente
deploymentTriggered=Encontrado t\u00F3rio da implanta\u00E7\u00E3o. Crie um arquivo chamado %1$s%2$s para aplicar o trigger na implanta\u00E7\u00E3o
errorWritingDeploymentMarker=Foi visto o arquivo do marcador da implanta\u00E7\u00E3o de grava\u00E7\u00E3o %s
explodedAutoDeploymentContentWarning=Reliable deployment behaviour is not possible when auto-deployment of exploded content is enabled (i.e. deployment without use of "%s"' marker files). Configuration of auto-deployment of exploded content is not recommended in any situation where reliability is desired. Configuring the deployment scanner's %s setting to "false" is recommended.
explodedDeploymentContentDeleted=The deployment scanner found that the content for exploded deployment %1$s has been deleted, but auto-deploy/undeploy for exploded deployments is not enabled and the %1$s%2$s marker file for this deployment has not been removed. As a result, the deployment is not being undeployed, but resources needed by the deployment may have been deleted and application errors may occur. Deleting the %1$s%2$s marker file to trigger undeploy is recommended.
failedCheckingZipFile=Failed checking whether %s was a complete zip
fileSystemDeploymentFailed=File system deployment service failed
incompleteContent=Scan found incompletely copied file content for deployment %s. Deployment changes will not be processed until all content is complete.
invalidExplodedDeploymentDirectory=The deployment scanner found a directory named %1$s that was not inside a directory whose name ends with .ear, .jar, .rar, .sar or .war. This is likely the result of unzipping an archive directly inside the %2$s directory, which is a user error. The %1$s directory will not be scanned for deployments, but it is possible that the scanner mayfind other files from the unzipped archive and attempt to deploy them, leading to errors.
scanException=Scan of %s threw Exception
started=Started %s for directory %s
unsafeAutoDeploy=Scan found content configured for auto-deploy that could not be safely auto-deployed. See details above. Deployment changes will not be processed until all problematic content is either removed or whether to deploy the content or not is indicated via a %s or %s marker file. Problematic deployments are %s
reattemptingFailedDeployment=Re-attempting failed deployment %s
failedCheckingXMLFile=Failed checking whether %s was a complete XML
