# These files are generated via Zanata (https://translate.jboss.org/project/view/jboss_as).
# Please do not update this file as it will be overwritten.

cannotDeleteDeploymentProgressMarker=Impossible de supprimer le fichier marqueur de progr\u00E8s de d\u00E9ploiement %s
cannotRemoveDeploymentMarker=Impossible de supprimer le fichier marqueur de d\u00E9ploiement superflu 
deploymentNotFound=D\u00E9ploiement de '%s' requis, mais le d\u00E9ploiement n'est pas pr\u00E9sent
deploymentTriggered=%1$s trouv\u00E9 dans le r\u00E9pertoire du d\u00E9ploiement. Pour d\u00E9clencher le d\u00E9ploiement, cr\u00E9er un fichier nomm\u00E9 %1$s%2$s
errorWritingDeploymentMarker=Exception intercept\u00E9e lors de l'\u00E9criture dans le fichier marqueur de d\u00E9ploiement %s
explodedAutoDeploymentContentWarning=Le comportement de d\u00E9ploiement fiable n'est pas possible lorsque l'auto-d\u00E9ploiement de contenu explos\u00E9 est activ\u00E9 (c'est-\u00E0-dire le d\u00E9ploiement sans utilisation des fichiers marqueurs "% s"). La configuration d'auto-d\u00E9ploiement de contenu explos\u00E9 n'est pas recommand\u00E9e dans toutes les situations quand on esp\u00E8re une certaine fiabilit\u00E9. Configurer le param\u00E8tre %s de l'analyseur d\u00E9ploiement \u00E0 false est conseill\u00E9.
explodedDeploymentContentDeleted=Le scanner de d\u00E9ploiement a d\u00E9tect\u00E9 que le contenu du d\u00E9ploiement explos\u00E9 %1$s a \u00E9t\u00E9 supprim\u00E9, mais l'auto-d\u00E9ploiement/retrait de d\u00E9ploiement pour les d\u00E9ploiements explos\u00E9s n'est pas activ\u00E9 et le marqueur de fichier %1$s%2$s pour ce d\u00E9ploiement n'a pas \u00E9t\u00E9 supprim\u00E9. En cons\u00E9quence, le d\u00E9ploiement n'est pas \u00EAtre retir\u00E9, mais les ressources n\u00E9cessaires pour le d\u00E9ploiement ont sans doute \u00E9t\u00E9 supprim\u00E9s et des erreurs d'application ont pu se produire. Il est conseill\u00E9 de supprimer le marqueur de fichier %1$s%2$s pour d\u00E9clencher le d\u00E9ploiement.
failedCheckingZipFile=Impossible de v\u00E9rifier si %s \u00E9tait un fichier compress\u00E9 complet
fileSystemDeploymentFailed=Le service de d\u00E9ploiement du syst\u00E8me de fichiers a \u00E9chou\u00E9
incompleteContent=Le scanneur a d\u00E9tect\u00E9 un contenu de fichier partiellement copi\u00E9 pour le d\u00E9ploiement %s. Les changements de d\u00E9ploiement ne seront pas trait\u00E9s avant la fin du contenu.
invalidExplodedDeploymentDirectory=Le scanner de d\u00E9ploiement a trouv\u00E9 un r\u00E9pertoire nomm\u00E9 %1$s qui n'\u00E9tait pas \u00E0 l'int\u00E9rieur d'un r\u00E9pertoire dont le nom se termine par .ear, .jar, .rar, .sar ou .war. C'est probablement le r\u00E9sultat de la d\u00E9compression d'une archive dans le r\u00E9pertoire %2$s, qui est une erreur de l'utilisateur. Les d\u00E9ploiement ne pourront pas \u00EAtre d\u00E9tect\u00E9s dans le r\u00E9pertoire %1$s, mais il est possible que le scanner trouve d'autres fichiers de l'archive d\u00E9compress\u00E9e et la tente de les d\u00E9ployer, conduisant \u00E0 des erreurs.
scanException=Exceptions suite au balayage de %s
started=%s d\u00E9marr\u00E9 pour le r\u00E9pertoire %s
unsafeAutoDeploy=Du contenu configur\u00E9 pour l'auto d\u00E9ploiement a \u00E9t\u00E9 d\u00E9tect\u00E9 lors du balayage. Voir d\u00E9tails ci-dessus. Les changements apport\u00E9s au d\u00E9ploiement ne seront pas trait\u00E9es tant que tout le contenu probl\u00E9matique n'a pas \u00E9t\u00E9 supprim\u00E9 ou si la possibilit\u00E9 de d\u00E9ployer le contenu n'est pas indiqu\u00E9 par un marqueur %s ou %s. Les d\u00E9ploiements probl\u00E9matiques sont %s
reattemptingFailedDeployment=La nouvelle tentative de d\u00E9ploiement %s n'a pas abouti
failedCheckingXMLFile=N'a pas pu v\u00E9rifier si %s \u00E9tait tout \u00E0 fait XML 
