# These files are generated via Zanata (https://translate.jboss.org/project/view/jboss_as).
# Please do not update this file as it will be overwritten.

cannotDeleteDeploymentProgressMarker=No se puede borrar el archivo marcador de progreso de la implementaci\u00F3n %s
cannotRemoveDeploymentMarker=No se puede borrar el archivo marcador de la implementaci\u00F3n externa %s
deploymentNotFound=Implementaci\u00F3n de '%s' solicitada pero la implementaci\u00F3n no est\u00E1 presente
deploymentTriggered=Se encontr\u00F3 %1$s en el directorio de implementaci\u00F3n. Para disparar la implementaci\u00F3n cree un archivo llamado %1$s%2$s
errorWritingDeploymentMarker=Se atrap\u00F3 una excepci\u00F3n al escribir en el archivo marcador de implementaci\u00F3n %s
explodedAutoDeploymentContentWarning=No es posible tener un comportamiento confiable de implementaci\u00F3n cuando la auto-implementaci\u00F3n del contenido expandido est\u00E1 habilitado (es decir la implementaci\u00F3n sin usar los archivos marcadores "%s"'). No se recomienda la configuraci\u00F3n de la auto-implementaci\u00F3n de contenido expandido en ninguna situaci\u00F3n donde se requiere confiabilidad. Se recomienda el configurar la opci\u00F3n %s del escaner de implementaci\u00F3n como "falso".
explodedDeploymentContentDeleted=El escaner de implementaci\u00F3n encontr\u00F3 que el contenido para la implementaci\u00F3n expandida %1$s se ha borrado, pero la auto-implementaci\u00F3n/borrado de la implementaci\u00F3n para implementaciones expandidas no est\u00E1 habilitado y el archivo marcador %1$s%2$s para esta implementaci\u00F3n no se ha borrado. Como consecuencia la implementaci\u00F3n no se est\u00E1 borrando, pero es posible que los recursos necesarios por parte de la implementaci\u00F3n ya se hayan borrado y es posible que tengan lugar errores de la aplicaci\u00F3n. Se recomienda el borrar el archivo marcador  %1$s%2$s para disparar el borrado de la implementaci\u00F3n.
failedCheckingZipFile=No logr\u00F3 chequear si %s era un zip completo
fileSystemDeploymentFailed=Servicio de implementaci\u00F3n del sistema de archivos fallido
incompleteContent=El escaner encontr\u00F3 el contenido de un archivo copiado de manera incompleta para la implementaci\u00F3n %s. Los cambios en la implementaci\u00F3n no se procesar\u00E1n hasta que todo el contenido est\u00E9 completo.
invalidExplodedDeploymentDirectory=El escaner de implementaci\u00F3n encontr\u00F3 un directorio llamado %1$s que no estaba dentro de un directorio cuyo nombre termina con .ear, .jar, .rar, .sar o .war. Esto es posiblemente el resultado de descomprimir un fichero directamente dentro del directorio %2$s, el cual es un error del usuario. El directorio %1$s no se escanear\u00E1 en busca de implementaciones pero es posible que el escaner encuentre otros archivos del fichero descomprimido y trate de implementarlos, lo cual conlleva a errores.
scanException=el escaner de %s present\u00F3 una excepci\u00F3n
started=Inici\u00F3 %s para el directorio %s
unsafeAutoDeploy=El escaner encontr\u00F3 contenido configurado para la auto-implementaci\u00F3n que no se pod\u00EDa auto-implementar de manera segura. Consulte los detalles anteriores. Los cambios en la implementaci\u00F3n no se procesar\u00E1n hasta que todo el contenido problem\u00E1tico se borre o si se implementa el contenido o no se indica por medio de un archivo marcador %s o un %s. Las implementaciones problem\u00E1ticas son %s
reattemptingFailedDeployment=Re-intentando la implementaci\u00F3n fallida %s
failedCheckingXMLFile=No se logr\u00F3 verificar si %s era un XML completo
