cannotDeleteDeploymentProgressMarker=\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u306E\u9032\u6357\u30DE\u30FC\u30AB\u30FC\u30D5\u30A1\u30A4\u30EB %s \u3092\u524A\u9664\u3067\u304D\u307E\u305B\u3093\u3002
cannotRemoveDeploymentMarker=\u5916\u90E8\u306E\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30DE\u30FC\u30AB\u30FC\u30D5\u30A1\u30A4\u30EB %s \u3092\u524A\u9664\u3067\u304D\u307E\u305B\u3093\u3002
deploymentNotFound='%s' \u306E\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u304C\u30EA\u30AF\u30A8\u30B9\u30C8\u3055\u308C\u307E\u3057\u305F\u304C\u3001\u3053\u306E\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u306F\u5B58\u5728\u3057\u307E\u305B\u3093\u3002
deploymentTriggered=deployment \u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u306B %1$s \u304C\u3042\u308A\u307E\u3057\u305F\u3002\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u3092\u30C8\u30EA\u30AC\u30FC\u3059\u308B\u306B\u306F\u3001%1$s%2$s \u3068\u547C\u3070\u308C\u308B\u30D5\u30A1\u30A4\u30EB\u3092\u4F5C\u6210\u3057\u3066\u304F\u3060\u3055\u3044\u3002
errorWritingDeploymentMarker=\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30DE\u30FC\u30AB\u30FC\u30D5\u30A1\u30A4\u30EB %s \u306E\u66F8\u304D\u8FBC\u307F\u9014\u4E2D\u3067\u4F8B\u5916\u3092\u691C\u51FA\u3057\u307E\u3057\u305F\u3002
explodedAutoDeploymentContentWarning=\u5C55\u958B\u30B3\u30F3\u30C6\u30F3\u30C4\u306E\u81EA\u52D5\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u304C\u6709\u52B9\u306A\u5834\u5408(\u3059\u306A\u308F\u3061\u3001'"%1$s"' \u30DE\u30FC\u30AB\u30FC\u30D5\u30A1\u30A4\u30EB\u3092\u5229\u7528\u3057\u306A\u3044\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8)\u306F\u3001\u4FE1\u983C\u6027\u306E\u3042\u308B\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u52D5\u4F5C\u306F\u96E3\u3057\u3044\u3067\u3059\u3002\u4FE1\u983C\u6027\u3092\u78BA\u4FDD\u3057\u305F\u3044\u5834\u5408\u306F\u3001\u5C55\u958B\u30B3\u30F3\u30C6\u30F3\u30C4\u306E\u81EA\u52D5\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u8A2D\u5B9A\u306F\u63A8\u5968\u3055\u308C\u307E\u305B\u3093\u3002\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30B9\u30AD\u30E3\u30CA\u30FC\u306E %2$s \u3092 false \u306B\u8A2D\u5B9A\u3059\u308B\u3053\u3068\u304C\u63A8\u5968\u3055\u308C\u307E\u3059\u3002
explodedDeploymentContentDeleted=\u5C55\u958B\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8 %1$s \u306E\u30B3\u30F3\u30C6\u30F3\u30C4\u304C\u524A\u9664\u3055\u308C\u3066\u3044\u308B\u304C\u3001\u5C55\u958B\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u306E\u81EA\u52D5\u30C7\u30D7\u30ED\u30A4\uFF0F\u30A2\u30F3\u30C7\u30D7\u30ED\u30A4\u304C\u6709\u52B9\u306B\u306A\u3063\u3066\u304A\u3089\u305A\u3001\u3053\u306E\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u306E%1$s%2$s \u30DE\u30FC\u30AB\u30FC\u30D5\u30A1\u30A4\u30EB\u304C\u524A\u9664\u3055\u308C\u3066\u3044\u306A\u3044\u3068\u3001\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30B9\u30AD\u30E3\u30CA\u30FC\u304C\u691C\u51FA\u3057\u307E\u3057\u305F\u3002\u7D50\u679C\u3001\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u306F\u30A2\u30F3\u30C7\u30D7\u30ED\u30A4\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u304C\u3001\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u306B\u5FC5\u8981\u306A\u30EA\u30BD\u30FC\u30B9\u306F\u524A\u9664\u3055\u308C\u3066\u3044\u308B\u305F\u3081\u3001\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u30A8\u30E9\u30FC\u304C\u767A\u751F\u3059\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002%1$s%2$s\u30DE\u30FC\u30AB\u30FC\u30D5\u30A1\u30A4\u30EB\u3092\u524A\u9664\u3057\u30A2\u30F3\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u3092\u30C8\u30EA\u30AC\u30FC\u3059\u308B\u3088\u3046\u63A8\u5968\u3055\u308C\u307E\u3059\u3002
failedCheckingZipFile=%s \u306F\u5B8C\u5168\u306A zip \u3067\u3042\u308B\u304B\u78BA\u8A8D\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
fileSystemDeploymentFailed=\u30D5\u30A1\u30A4\u30EB\u30B7\u30B9\u30C6\u30E0\u306E\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30B5\u30FC\u30D3\u30B9\u306B\u554F\u984C\u304C\u3042\u308A\u307E\u3057\u305F\u3002
incompleteContent=\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8 %s \u306E\u30D5\u30A1\u30A4\u30EB\u30B3\u30F3\u30C6\u30F3\u30C4\u304C\u5B8C\u5168\u306B\u30B3\u30D4\u30FC\u3055\u308C\u3066\u3044\u306A\u3044\u3068\u3001\u30B9\u30AD\u30E3\u30F3\u3067\u691C\u51FA\u3055\u308C\u307E\u3057\u305F\u3002\u3059\u3079\u3066\u5B8C\u5168\u306A\u30B3\u30F3\u30C6\u30F3\u30C4\u306B\u306A\u308B\u307E\u3067\u3001\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u306E\u5909\u66F4\u306F\u51E6\u7406\u3055\u308C\u307E\u305B\u3093\u3002
invalidExplodedDeploymentDirectory=\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30B9\u30AD\u30E3\u30CA\u30FC\u304C %1$s \u3068\u3044\u3046\u540D\u524D\u306E\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u3092\u691C\u51FA\u3057\u307E\u3057\u305F\u304C\u3001.ear\u3001.jar\u3001.rar\u3001.sar\u3001.war \u3068\u3044\u3046\u540D\u79F0\u3067\u7D42\u4E86\u3059\u308B\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u5185\u306B\u5B58\u5728\u3057\u307E\u305B\u3093\u3002\u3053\u308C\u306F\u30E6\u30FC\u30B6\u30FC\u30A8\u30E9\u30FC\u3067\u3001%2$s \u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u5185\u306B\u76F4\u63A5\u30A2\u30FC\u30AB\u30A4\u30D6\u3092\u5C55\u958B\u3057\u305F\u305F\u3081\u3067\u3057\u3087\u3046\u3002%1$s \u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u306F\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u7528\u306B\u30B9\u30AD\u30E3\u30F3\u3055\u308C\u307E\u305B\u3093\u304C\u3001\u30B9\u30AD\u30E3\u30CA\u30FC\u306F\u3053\u306E\u5C55\u958B\u30A2\u30FC\u30AB\u30A4\u30D6\u304B\u3089\u5225\u306E\u30D5\u30A1\u30A4\u30EB\u3092\u691C\u51FA\u3057\u3001\u305D\u306E\u30D5\u30A1\u30A4\u30EB\u3092\u30C7\u30D7\u30ED\u30A4\u3057\u3088\u3046\u3057\u3001\u30A8\u30E9\u30FC\u304C\u767A\u751F\u3059\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002
scanException=%s \u306E\u30B9\u30AD\u30E3\u30F3\u3067\u4F8B\u5916\u304C\u30B9\u30ED\u30FC\u3055\u308C\u307E\u3057\u305F\u3002
started=\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA %2$s \u306E %1$s \u304C\u8D77\u52D5\u3057\u307E\u3057\u305F\u3002
unsafeAutoDeploy=\u81EA\u52D5\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u8A2D\u5B9A\u3092\u3057\u305F\u30B3\u30F3\u30C6\u30F3\u30C4\u3067\u3001\u6B63\u5E38\u306B\u81EA\u52D5\u30C7\u30D7\u30ED\u30A4\u3067\u304D\u306A\u3044\u3082\u306E\u304C\u30B9\u30AD\u30E3\u30F3\u3067\u898B\u3064\u304B\u308A\u307E\u3057\u305F\u3002\u4E0A\u8A18\u306E\u8A73\u7D30\u3092\u78BA\u8A8D\u3057\u3066\u304F\u3060\u3055\u3044\u3002\u554F\u984C\u306E\u3042\u308B\u30B3\u30F3\u30C6\u30F3\u30C4\u3092\u524A\u9664\u3059\u308B\u304B\u3001\u3042\u308B\u3044\u306F\u30B3\u30F3\u30C6\u30F3\u30C4\u3092\u30C7\u30D7\u30ED\u30A4\u3059\u308B\u304B\u5426\u304B\u3092 %1$s \u3042\u308B\u3044\u306F %2$s \u30DE\u30FC\u30AB\u30FC\u30D5\u30A1\u30A4\u30EB\u3067\u6307\u5B9A\u3059\u308B\u307E\u3067\u3001\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u306E\u5909\u66F4\u306F\u51E6\u7406\u3055\u308C\u307E\u305B\u3093\u3002\u554F\u984C\u306E\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u306F %3$s \u3067\u3059\u3002
reattemptingFailedDeployment=\u554F\u984C\u306E\u3042\u3063\u305F\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8 %s \u3092\u518D\u8A66\u884C\u4E2D
failedCheckingXMLFile=%s \u304C\u5B8C\u5168\u306A XML \u304B\u3069\u3046\u304B\u306E\u30C1\u30A7\u30C3\u30AF\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
