cannotDeleteDeploymentProgressMarker=N\u00E3o foi poss\u00EDvel deletar o arquivo do marcador de progresso de implanta\u00E7\u00E3o %s
cannotRemoveDeploymentMarker=N\u00E3o foi poss\u00EDvel remover o arquivo do marcador de implanta\u00E7\u00E3o estranha
deploymentNotFound=A implanta\u00E7\u00E3o do solicitada, mas a implanta\u00E7\u00E3o n\u00E3o est\u00E1 presente
deploymentTriggered=Encontrado t\u00F3rio da implanta\u00E7\u00E3o. Crie um arquivo chamado %1$s%2$s para aplicar o trigger na implanta\u00E7\u00E3o
errorWritingDeploymentMarker=Foi visto o arquivo do marcador da implanta\u00E7\u00E3o de grava\u00E7\u00E3o %s
explodedAutoDeploymentContentWarning=O comportamento da implanta\u00E7\u00E3o confi\u00E1vel n\u00E3o foi poss\u00EDvel quando a implanta\u00E7\u00E3o autom\u00E1tica do conte\u00FAdo destacado estiver ativado. (ex.\: a implanta\u00E7\u00E3o sem uso dos arquivos do marcador "%s"'. A configura\u00E7\u00E3o de implanta\u00E7\u00E3o autom\u00E1tica do conte\u00FAdo destacado n\u00E3o \u00E9 recomendada em qualquer situa\u00E7\u00E3o onde a confiabilidade \u00E9 desejada. Recomenda-se a configura\u00E7\u00E3o do %s do scanner da implanta\u00E7\u00E3o para "falso".
explodedDeploymentContentDeleted=O scanner de implanta\u00E7\u00E3o descobriu que o conte\u00FAdo para a implanta\u00E7\u00E3o destacada %1$s foi deletada, por\u00E9m a implanta\u00E7\u00E3o/desimplanta\u00E7\u00E3o autom\u00E1tica para implanta\u00E7\u00F5es destacadas n\u00E3o est\u00E1 ativada. Al\u00E9m disso, o arquivo do marcador %1$s%2$s para essa implanta\u00E7\u00E3o n\u00E3o foi removido. Como resultado, a implanta\u00E7\u00E3o n\u00E3o foi desimplantada, mas os recursos necess\u00E1rios pela implanta\u00E7\u00E3o podem ter sido deletados e podem ocorrer erros de aplica\u00E7\u00E3o. Recomenda-se a exclus\u00E3o do arquivo doo marcador %1$s%2$s para aplicar o trigger na desimplanta\u00E7\u00E3o. 
failedCheckingZipFile=Falha ao checar se \u00E9 que o %s era um zip completo
fileSystemDeploymentFailed=Falha no servi\u00E7o da implanta\u00E7\u00E3o do sistema do arquivo
incompleteContent=Foi encontrada a digita\u00E7\u00E3o incompleta do conte\u00FAdo do arquivo copiado para o %s da implanta\u00E7\u00E3o. As altera\u00E7\u00F5es da implanta\u00E7\u00E3o n\u00E3o ser\u00E3o processadas at\u00E9 que todos os conte\u00FAdos estejam completos.
invalidExplodedDeploymentDirectory=O scanner da implanta\u00E7\u00E3o encontrou um diret\u00F3rio nomeado %1$s que n\u00E3o estava dentro de um diret\u00F3rio cujo nome encerra com .ear, .jar, .rar, .sar or .war. Esse resultado parece-se com o cancelamento do zip de um arquivo diretamente dentro do diret\u00F3rio %2$s, que \u00E9 um erro do usu\u00E1rio. O diret\u00F3rio %1$s n\u00E3o ser\u00E1 escaneado para implanta\u00E7\u00F5es, mas \u00E9 poss\u00EDvel que o scanner encontre outros arquivos a partir do arquivo sem zip e tente implant\u00E1-los, levando a erros.
scanException=O scan do %s lan\u00E7ou Exce\u00E7\u00E3o
started=Foi iniciado o %s para o diret\u00F3rio %s
unsafeAutoDeploy=O conte\u00FAdo encontrado do scan configurado para a implanta\u00E7\u00E3o autom\u00E1tica que n\u00E3o p\u00F4de ser implantado automaticamente. Consulte os detalhes abaixo. As altera\u00E7\u00F5es da implanta\u00E7\u00E3o n\u00E3o ser\u00E3o processados at\u00E9 que todo o conte\u00FAdo problem\u00E1tico seja removido ou caso a implanta\u00E7\u00E3o ou n\u00E3o do conte\u00FAdo esteja indicada atrav\u00E9s de um %s ou arquivo de marcador %s. As implanta\u00E7\u00F5es problem\u00E1ticas s\u00E3o %s.
reattemptingFailedDeployment=A nova tentativa falhou a implanta\u00E7\u00E3o %s
failedCheckingXMLFile=Falha ao checar se o %s era um XML completo
