deployment.scanner=La configuraci\u00F3n del sub-sistema del escaner de implementaci\u00F3n
deployment.scanner.subsystem.add=Agregar el sub-sistema del escaner de implementaci\u00F3n.
deployment.scanner.subsystem.remove=Borrar el sub-sistema del escaner de implementaci\u00F3n.
deployment.scanner.subsystem.scanner=Los escaners mantenidos por el sub-sistema.
deployment.scanner.subsystem=Un escaner de implementaci\u00F3n individual que escanea una ubicaci\u00F3n en particular
deployment.scanner.relative-to=Referencia a una ruta del sistema de archivos definida en la secci\u00F3n de "rutas" de la configuraci\u00F3n del servidor.
deployment.scanner.path=La ruta real del sistema de archivos que se va a escanear. Se trata como una ruta absoluta a menos de que se especifique el atributo 'relativo-a', en cuyo caso el valor se trata como relativo a esa ruta.
deployment.scanner.auto-deploy-exploded=Controla si el contenido de la implementaci\u00F3n comprimida se debe implementar de manera autom\u00E1tica por medio del escaner sin requerir que el usuario agregue un archivo marcador .dodeploy. El configurar esto como 'verdadero' s\u00F3lo se  recomienda para los escenarios de desarrollo b\u00E1sico ya que no hay manera de asegurarse de que la implementaci\u00F3n no ocurrir\u00E1 en la mitad de los cambios del contenido.
deployment.scanner.auto-deploy-zipped=Controla si el contenido de implementaci\u00F3n comprimida se debe implementar autom\u00E1ticamente por medio del escaner sin requerir que el usuario agregue un archivo marcador .dodeploy.
deployment.scanner.auto-deploy-xml=Controla si el contenido de implementaci\u00F3n XML se debe implementar autom\u00E1ticamente por medio del escaner sin requerir que el usuario agregue un archivo marcador .dodeploy.
deployment.scanner.scan-enabled=Etiqueta que indica que todos los escaneos (incluyendo el escaneo inicial en el arranque) se deben inhabilitar.
deployment.scanner.scan-interval=Intervalo peri\u00F3dico en milisegundos durante el cual el repositorio se debe escanear en busca de cambios. Un valor menor que 1 indica que el repositorio s\u00F3lo se debe escanear durante el arranque inicial.
deployment.scanner.deployment-timeout=Tiempo de expiraci\u00F3n en segundos que se le permite a una implementaci\u00F3m el ejecutar antes de cancelar. Por defecto es 60 segundos.
deployment.scanner.add=Agregar un nuevo escaner de implementaci\u00F3n
deployment.scanner.remove=Borrar un escaner de implementaci\u00F3n
deployment.scanner.name=El nombre del escaner
