deployment.scanner=La configuration du sous-syst\u00E8me du scanneur de d\u00E9ploiement
deployment.scanner.subsystem.add=Ajouter le sous-syst\u00E8me du scanner de d\u00E9ploiement.
deployment.scanner.subsystem.remove=Supprimer le sous-syst\u00E8me du scanneur de d\u00E9ploiement.
deployment.scanner.subsystem.scanner=Les scanneurs maintenus par le sous-syst\u00E8me.
deployment.scanner.subsystem=Un scanneur de d\u00E9ploiement individuel qui scanne un emplacement particulier
deployment.scanner.relative-to=R\u00E9f\u00E9rence \u00E0 un chemin de syst\u00E8me de fichier d\u00E9fini dans la section "paths" (chemins) de la configuration du serveur.
deployment.scanner.path=Le chemin d'acc\u00E8s au syst\u00E8me de fichier qu'il faut scanner. Trait\u00E9 en tant que chemin complet, \u00E0 moins que l'attribut 'relative-to' soit sp\u00E9cifi\u00E9, dans lequel cas, la valeur sera trait\u00E9e comme relative \u00E0 ce chemin.
deployment.scanner.auto-deploy-exploded=Contr\u00F4le si le contenu de d\u00E9ploiement compress\u00E9 doit \u00EAtre d\u00E9ploy\u00E9 automatiquement par le scanneur sans que l'utilisateur n'ait besoin d'ajouter un fichier marqueur .dodeploy. D\u00E9finir ceci \u00E0 'true' n'est pas conseill\u00E9 sauf pour les sc\u00E9narios de d\u00E9ploiement de base, car il n'y a aucun moyen de veiller \u00E0 ce que le d\u00E9ploiement ait lieu en plein milieu d'un changement niveau contenu.
deployment.scanner.auto-deploy-zipped=Contr\u00F4le si le contenu de d\u00E9ploiement compress\u00E9 doit \u00EAtre automatiquement d\u00E9ploy\u00E9 par le scanneur sans que l'utilisateur n'ait besoin d'ajouter un fichier marqueur .dodeploy.
deployment.scanner.auto-deploy-xml=Contr\u00F4le si le contenu de d\u00E9ploiement XML doit \u00EAtre d\u00E9ploy automatiquement par le scanneur sans que l'utilisateur n'ait besoin d'ajouter un fichier marqueur .dodepoy.
deployment.scanner.scan-enabled=Drapeau indiquant que tous les balayages (y compris le balayage au d\u00E9marrage) doivent \u00EAtre d\u00E9sactiv\u00E9s.
deployment.scanner.scan-interval=Intervalle p\u00E9riodique, en millisecondes, au cours duquel le r\u00E9f\u00E9rentiel doit \u00EAtre scann\u00E9 pour v\u00E9rifier les changements. Une valeur inf\u00E9rieure \u00E0 1 indique que le r\u00E9f\u00E9rentiel ne doit \u00EAtre scann\u00E9 qu'au d\u00E9marrage uniquement.
deployment.scanner.deployment-timeout=Timeout, en secondes, d'ex\u00E9cution de d\u00E9ploiement avant qu'il soit annul\u00E9. La valeur par d\u00E9faut est 60 secondes.
deployment.scanner.add=Ajouter un nouveau scanner de d\u00E9ploiement
deployment.scanner.remove=Supprimer un scanner de d\u00E9ploiement
deployment.scanner.name=Le nom du scanner
