deployment.scanner=\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30B9\u30AD\u30E3\u30CA\u30FC\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u8A2D\u5B9A
deployment.scanner.subsystem.add=\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30B9\u30AD\u30E3\u30CA\u30FC\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u306E\u8FFD\u52A0
deployment.scanner.subsystem.remove=\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30B9\u30AD\u30E3\u30CA\u30FC\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u306E\u524A\u9664
deployment.scanner.subsystem.scanner=\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u7BA1\u7406\u306E\u30B9\u30AD\u30E3\u30CA\u30FC
deployment.scanner.subsystem=\u7279\u5B9A\u306E\u5834\u6240\u3092\u30B9\u30AD\u30E3\u30F3\u3059\u308B\u500B\u5225\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30B9\u30AD\u30E3\u30CA\u30FC
deployment.scanner.relative-to=\u30B5\u30FC\u30D0\u30FC\u8A2D\u5B9A\u306E\u300Cpaths\u300D\u306E\u9805\u76EE\u3067\u8A2D\u5B9A\u3057\u305F\u30D5\u30A1\u30A4\u30EB\u30B7\u30B9\u30C6\u30E0\u30D1\u30B9\u3078\u306E\u53C2\u7167
deployment.scanner.path=\u5B9F\u969B\u306B\u30B9\u30AD\u30E3\u30F3\u4E88\u5B9A\u306E\u30D5\u30A1\u30A4\u30EB\u30B7\u30B9\u30C6\u30E0\u30D1\u30B9\u3002'relative-to' \u5C5E\u6027\u304C\u6307\u5B9A\u3055\u308C\u3066\u3044\u306A\u3044\u9650\u308A\u7D76\u5BFE\u30D1\u30B9\u3068\u3057\u3066\u51E6\u7406\u3057\u307E\u3059\u3002'relative-to' \u5C5E\u6027\u304C\u6307\u5B9A\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u306F\u3001\u5024\u306F\u305D\u306E\u30D1\u30B9\u3092\u8D77\u70B9\u3068\u3057\u305F\u76F8\u5BFE\u30D1\u30B9\u3068\u3057\u3066\u51E6\u7406\u3055\u308C\u307E\u3059\u3002
deployment.scanner.auto-deploy-exploded=\u30E6\u30FC\u30B6\u30FC\u304C.dodeploy \u30DE\u30FC\u30AB\u30FC\u30D5\u30A1\u30A4\u30EB\u3092\u8FFD\u52A0\u3057\u306A\u3044\u3067\u3082\u5727\u7E2E\u3055\u308C\u305F\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30B3\u30F3\u30C6\u30F3\u30C4\u3092\u81EA\u52D5\u7684\u306B\u30B9\u30AD\u30E3\u30CA\u30FC\u304C\u30C7\u30D7\u30ED\u30A4\u3059\u308B\u304B\u3069\u3046\u304B\u3092\u5236\u5FA1\u3057\u307E\u3059\u3002\u30B3\u30F3\u30C6\u30F3\u30C4\u5909\u66F4\u4E2D\u306B\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u304C\u767A\u751F\u3057\u306A\u3044\u3088\u3046\u5FB9\u5E95\u3059\u308B\u65B9\u6CD5\u304C\u306A\u3044\u305F\u3081\u3001\u57FA\u672C\u7684\u306A\u958B\u767A\u30B7\u30CA\u30EA\u30AA\u4EE5\u5916\u306B\u304A\u3044\u3066\u3001\u3053\u308C\u3092 'true' \u306B\u8A2D\u5B9A\u3059\u308B\u306E\u306F\u63A8\u5968\u3055\u308C\u307E\u305B\u3093\u3002
deployment.scanner.auto-deploy-zipped=\u30E6\u30FC\u30B6\u30FC\u304C.dodeploy \u30DE\u30FC\u30AB\u30FC\u30D5\u30A1\u30A4\u30EB\u3092\u8FFD\u52A0\u3057\u306A\u3044\u3067\u3082\u5727\u7E2E\u3055\u308C\u305F\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30B3\u30F3\u30C6\u30F3\u30C4\u3092\u81EA\u52D5\u7684\u306B\u30B9\u30AD\u30E3\u30CA\u30FC\u304C\u30C7\u30D7\u30ED\u30A4\u3059\u308B\u304B\u3069\u3046\u304B\u3092\u5236\u5FA1\u3057\u307E\u3059\u3002
deployment.scanner.auto-deploy-xml=\u30E6\u30FC\u30B6\u30FC\u304C.dodeploy \u30DE\u30FC\u30AB\u30FC\u30D5\u30A1\u30A4\u30EB\u3092\u8FFD\u52A0\u3057\u306A\u3044\u3067\u3082 XML \u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30B3\u30F3\u30C6\u30F3\u30C4\u3092\u81EA\u52D5\u7684\u306B\u30B9\u30AD\u30E3\u30CA\u30FC\u304C\u30C7\u30D7\u30ED\u30A4\u3059\u308B\u304B\u3069\u3046\u304B\u3092\u5236\u5FA1\u3057\u307E\u3059\u3002
deployment.scanner.scan-enabled=(\u8D77\u52D5\u6642\u306E\u521D\u56DE\u30B9\u30AD\u30E3\u30F3\u3092\u542B\u3080) \u3059\u3079\u3066\u306E\u30B9\u30AD\u30E3\u30F3\u3092\u7121\u52B9\u306B\u3059\u3079\u304D\u304B\u6307\u5B9A\u3059\u308B\u30D5\u30E9\u30B0
deployment.scanner.scan-interval=\u30EC\u30DD\u30B8\u30C8\u30EA\u306E\u5909\u66F4\u3092\u30B9\u30AD\u30E3\u30F3\u3059\u308B\u9593\u9694 (\u30DF\u30EA\u79D2\u5358\u4F4D)\u30021 \u672A\u6E80\u306E\u5024\u306E\u5834\u5408\u3001\u30EC\u30DD\u30B8\u30C8\u30EA\u306F\u521D\u56DE\u8D77\u52D5\u6642\u306E\u307F\u30B9\u30AD\u30E3\u30F3\u3055\u308C\u307E\u3059\u3002
deployment.scanner.deployment-timeout=\u30AD\u30E3\u30F3\u30BB\u30EB\u3059\u308B\u307E\u3067\u306E\u9593\u306B\u3069\u306E\u7A0B\u5EA6\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u3092\u5B9F\u884C\u3067\u304D\u308B\u304B\u3001\u305D\u306E\u30BF\u30A4\u30E0\u30A2\u30A6\u30C8\u6642\u9593 (\u79D2\u5358\u4F4D)\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u306F 60 \u79D2\u3067\u3059\u3002
deployment.scanner.add=\u65B0\u898F\u306E\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30B9\u30AD\u30E3\u30CA\u3092\u8FFD\u52A0
deployment.scanner.remove=\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30B9\u30AD\u30E3\u30CA\u30FC\u306E\u524A\u9664
deployment.scanner.name=\u30B9\u30AD\u30E3\u30CA\u30FC\u540D
