deployment.scanner=A configura\u00E7\u00E3o do sub-sistema do scanner da implanta\u00E7\u00E3o
deployment.scanner.subsystem.add=Adiciona o sub-sistema do scanner da implanta\u00E7\u00E3o.
deployment.scanner.subsystem.remove=Remove o sub-sistema do scanner da implanta\u00E7\u00E3o.
deployment.scanner.subsystem.scanner=Os scanners mantidos pelo sub-sistema.
deployment.scanner.subsystem=Um scanner de implanta\u00E7\u00E3o individual que escaneia uma localiza\u00E7\u00E3o particular
deployment.scanner.relative-to=A refer\u00EAncia ao caminho do filesystem definido na se\u00E7\u00E3o "caminhos" da configura\u00E7\u00E3o do servidor.
deployment.scanner.path=O caminho do filesystem atual a ser escaneado. Ele \u00E9 tratado como um caminho absoluto, a n\u00E3o ser que o atributo 'relative-to' seja especificado. Neste caso, o valor \u00E9 tratado como relativo ao daquele caminho.
deployment.scanner.auto-deploy-exploded=Controla se \u00E9 que o conte\u00FAdo de implanta\u00E7\u00E3o com zip deve ser automaticamente implantado pelo scanner sem solicita\u00E7\u00E3o do usu\u00E1rio para a adi\u00E7\u00E3o de um arquivo marcador .dodeploy. N\u00E3o \u00E9 aconselh\u00E1vel a configura\u00E7\u00E3o disto para 'verdadeiro', com exce\u00E7\u00E3o dos casos de desenvolvimento, uma vez que n\u00E3o existe maneira de garantir que a implanta\u00E7\u00E3o n\u00E3o ocorrer\u00E1 no meio das altera\u00E7\u00F5es do conte\u00FAdo. 
deployment.scanner.auto-deploy-zipped=Controla se \u00E9 que o conte\u00FAdo de implanta\u00E7\u00E3o com zip deve ser automaticamente implantado pelo scanner sem solicita\u00E7\u00E3o ao usu\u00E1rio de adi\u00E7\u00E3o ao arquivo do marcador .dodeploy.
deployment.scanner.auto-deploy-xml=Controla se \u00E9 que o conte\u00FAdo de implanta\u00E7\u00E3oXML deve ser automaticamente implantado pelo scanner sem solicita\u00E7\u00E3o ao usu\u00E1rio de adi\u00E7\u00E3o ao arquivo do marcador .dodeploy.
deployment.scanner.scan-enabled=Aviso indicando que todas as verifica\u00E7\u00F5es (incluindo a verifica\u00E7\u00E3o inicial) devem ser desativadas.
deployment.scanner.scan-interval=Intervalo peri\u00F3dico, em mil\u00E9simos de segundos, pelo qual o reposit\u00F3rio deve ser verificado para altera\u00E7\u00F5es. Um valor inferior a 1 indica se o reposit\u00F3rio deve ser verificado no come\u00E7o da inicializa\u00E7\u00E3o.
deployment.scanner.deployment-timeout=Intervalo, em segundos, que uma implanta\u00E7\u00E3o \u00E9 permitida a executar antes de ser cancelada. O padr\u00E3o \u00E9 de 60 segundos.
deployment.scanner.add=Adiciona um novo scanner de implanta\u00E7\u00E3o
deployment.scanner.remove=Remove um novo scanner de implanta\u00E7\u00E3o
deployment.scanner.name=O nome do scanner
