cacheRemoveFailed=No se logr\u00F3 borrar %s del cach\u00E9
cacheEntryNotFound=No logr\u00F3 encontrar la instancia SFSB con el id de sesi\u00F3n %s en el cach\u00E9
asyncInvocationFailed=Invocaci\u00F3n asincr\u00F3nica fallida
getTxManagerStatusFailed=no se logr\u00F3 obtener el estatus del administrador tx; ignorando
setRollbackOnlyFailed=no logr\u00F3 establecer el retroceso s\u00F3lamente; ignorando
activationConfigPropertyIgnored=ActivationConfigProperty %s se ignorar\u00E1 ya que no es permitido por el adaptador de recursos\: %s
discardingStatefulComponent=Descartando la instancia del componente con estado\: %s debido a la excepci\u00F3n
failedToRemoveBean=No logr\u00F3 borrar el bean\: %s con el id de sesi\u00F3n %s
failToFindSfsbWithId=No pudo encontrar la instancia del bean de sesi\u00F3n con estado con id\: %s para el bean\: %s durante la destrucci\u00F3n. Probablemente ya se borr\u00F3
defaultInterceptorClassNotListed=La clase predeterminada del interceptor %s no est\u00E1 listada en la secci\u00F3n de <interceptors> de ejb-jar.xml y no se aplicar\u00E1
noMethodFoundOnEjbExcludeList=No se encontr\u00F3 un m\u00E9todo llamado\: %s en EJB\: %s al procesar el elemento  exclude-list en ejb-jar.xml
noMethodFoundOnEjbWithParamExcludeList=No se encontr\u00F3 un m\u00E9todo llamado\: %s con tipos de par\u00E1metros\: %s en EJB\: %s al procesar el elemento exclude-list en ejb-jar.xml
noMethodFoundOnEjbPermission=No se encontr\u00F3 un m\u00E9todo llamado\: %s en EJB\: %s al procesar el elemento method-permission en ejb-jar.xml
noMethodFoundWithParamOnEjbMethodPermission=No se encontr\u00F3 un m\u00E9todo llamado\: %s con tipos de par\u00E1metros\: %s en EJB\: %s al procesar el elemento method-permission en ejb-jar.xml
unknownTimezoneId=Se encontr\u00F3 un id de zona horaria desconocida\: %s en la expresi\u00F3n del programa. Ignorando y usando la zona horaria del servidor\: %s
timerPersistenceNotEnable=La persistencia del temporizador no est\u00E1 habilitada, los temporizadores persistentes no sobrevivir\u00E1n los reinicios de la MVJ
nextExpirationIsNull=Siguiente expiraci\u00F3n es nula. No se programar\u00E1n tareas para el temporizador %S
ignoringException=Ignorando la excepci\u00F3n durante setRollbackOnly
UnregisteredRegisteredTimerService=Se borr\u00F3 el registro del Timerservice que ya estaba registrado con el id %s y se registrar\u00E1 una nueva instancia
errorInvokeTimeout=Error invocando el tiempo de expiraci\u00F3n para el temporizador\: %s
timerRetried=Se volver\u00E1 a intentar el temporizador\: %s
errorDuringRetryTimeout=Error durante el tiempo de expiraci\u00F3n del re-intento para el temporizador\: %s
retryingTimeout=Tiempo de expiraci\u00F3n del re-intento para el temporizador\: %s
timerNotActive=El temporizador no est\u00E1 activo, salt\u00E1ndose el reintento del temporizador\: %s
failToReadTimerInformation=No pudo leer la informaci\u00F3n del temporizador para el componente EJB %s
failedToRemovePersistentTimer=No se pudo borrar el termporizador persistente %s
failToRestoreTimers=%s no es un directorioy, no pudo restablecer los temporizadores
failToRestoreTimersFromFile=No pudo restablecer el temporizador de %s
failToCloseFile=error al cerrar el archivo
failToRestoreTimersForObjectId=No pudo restablecer los temporizadores para %s
failToCreateDirectoryForPersistTimers=No pudo crear el directorio %s para persistir los temporizadores EJB.
discardingEntityComponent=Descartando la instancia del componente de entidades\: %s debido a una excepci\u00F3n
invocationFailed=Invocaci\u00F3n EJB fall\u00F3 en el componente %s para el m\u00E9todo %s
couldNotFindEjbForLocatorIIOP=No pudo encontrar EJB para el localizador %s, el proxy cliente EJB no ser\u00E1 reemplazado
ejbNotExposedOverIIOP=EJB %s no se est\u00E1 reemplazando con un Stub ya que no est\u00E1 expuesto sobre IIOP
dynamicStubCreationFailed=Creaci\u00F3n din\u00E1mica del stub fall\u00F3 para la clase %s
exceptionReleasingEntity=Excepci\u00F3n liberando la entidad
unsupportedClientMarshallingStrategy=Estrategia de organizaci\u00F3n de clientes no soportada %s recibida en el canal %s , no habr\u00E1 m\u00E1s comunicaciones
closingChannel=Cerrando el canal %s debido a un error
closingChannelOnChannelEnd=Notificaci\u00F3n del final del canal recibida, cerrando el canal %s
logMDBStart=Inici\u00F3 el bean dirigido por mensajes '%s' con el adaptador de recursos '%s'
skipOverlappingInvokeTimeout=Temporizador %s todav\u00EDa activo, salt\u00E1ndose la ejecuci\u00F3n programada de superposici\u00F3n en\: %s
