# These files are generated via Zanata (https://translate.jboss.org/project/view/jboss_as).
# Please do not update this file as it will be overwritten.

cacheRemoveFailed=N'a pas pu retirer %s du cache
cacheEntryNotFound=N'a pas pu trouver d'instance SFSB avec ID %s dans le cache
asyncInvocationFailed=L'invocation asynchrone a \u00E9chou\u00E9
getTxManagerStatusFailed=n'a pas pu obtenir le statut manager tx; ignore
setRollbackOnlyFailed=impossible de d\u00E9finir le rollback uniquement, ignore
activationConfigPropertyIgnored=ActivationConfigProperty %s sera ignor\u00E9 car non autoris\u00E9 par l'adaptateur de ressources \: %s
discardingStatefulComponent=Ignorer l'instance du composant dynamique \: %s en raison de l'exception
failedToRemoveBean=N'a pas pu supprimer le bean \: %s avec l'id de session %s
failToFindSfsbWithId=Impossible de trouver une instance de bean de session stateful ayant comme id \: %s pour le bean \: %s en cours de destruction. Probablement d\u00E9j\u00E0 supprim\u00E9
defaultInterceptorClassNotListed=Classe d'intercepteur par d\u00E9faut %s non list\u00E9e dans <interceptors> section of ejb-jar.xml et ne sera pas appliqu\u00E9e
noMethodFoundOnEjbExcludeList=Aucune m\u00E9thode nomm\u00E9e \: %s trouv\u00E9 sur EJB\: %s lors du traitement de l'\u00E9l\u00E9ment exclude-list dans ejb-jar.xml
noMethodFoundOnEjbWithParamExcludeList=Aucune m\u00E9thode nomm\u00E9e \: %s avec types de param \: %s trouv\u00E9 dans EJB \: %s quand on traite l'\u00E9l\u00E9ment exclude-list dans ejb-jar.xml
noMethodFoundOnEjbPermission=Aucune m\u00E9thode nomm\u00E9e \: %s trouv\u00E9 sur EJB\: %s lors du traitement de l'\u00E9l\u00E9ment method-permissiont dans ejb-jar.xml
noMethodFoundWithParamOnEjbMethodPermission=Aucune m\u00E9thode nomm\u00E9e \: %s avec types de param \: %s trouv\u00E9 dans EJB \: %s quand on traite l'\u00E9l\u00E9ment method-permission dans ejb-jar.xml
unknownTimezoneId=Id de fuseau horaire inconnue \: %s trouv\u00E9 dans l'expression de l'emploi du temps. L'ignorer et utiliser le fuseau horaire du serveur \: %S
timerPersistenceNotEnable=La persistance du minuteur n'est pas activ\u00E9e, les minuteurs persistants ne survivront pas au nouveaux d\u00E9marrages.
nextExpirationIsNull=L'expiration suivante est null. Aucune t\u00E2che ne sera pr\u00E9vue pour le minuteur %S
ignoringException=Ignorer l'exception pendant le setRollbackOnly
UnregisteredRegisteredTimerService=D\u00E9senregistrer un Timerservice d\u00E9j\u00E0 enregistr\u00E9 ayant comme id %s et une nouvelle instance sera alors enregistr\u00E9e
errorInvokeTimeout=Erreur d'invocation de timeout pour le minuteur \: %s
timerRetried=Minuteur \: %s sera tent\u00E9 \u00E0 nouveau
errorDuringRetryTimeout=Erreur lors des tentatives \u00E0 nouveau du minuteur \: %s
retryingTimeout=Essai \u00E0 nouveau du timeout minuteur \: %s
timerNotActive=Minuteur non actif, \u00E9viter toute tentative \u00E0 nouveau du minuteur \: %s
failToReadTimerInformation=Impossible de lire les informations du minuteur pour le composant EJB %s
failedToRemovePersistentTimer=Impossible de supprimer le minuteur persistant %s
failToRestoreTimers=%s n'est pas un r\u00E9pertoire, impossible de restaurer les minuteurs
failToRestoreTimersFromFile=Impossible de restaurer le minuteur de %s
failToCloseFile=erreur lors de la fermeture du fichier
failToRestoreTimersForObjectId=Impossible de restaurer les minuteurs pour %s
failToCreateDirectoryForPersistTimers=Impossible de cr\u00E9er un r\u00E9pertoire %s pour persister les minuteurs EJB.
discardingEntityComponent=Ignorer l'instance du composant entit\u00E9 \: %s en raison de l'exception
invocationFailed=L'invocation EJB a \u00E9chou\u00E9 sur le composant %s pour la m\u00E9thode %s
couldNotFindEjbForLocatorIIOP=Impossible de trouver EJB pour le locateur %s, le proxy du client EJB ne pourra pas \u00EAtre remplac\u00E9
ejbNotExposedOverIIOP=%s EJB n'est pas remplac\u00E9 par un Stub car non expos\u00E9 par IIOP
dynamicStubCreationFailed=La cr\u00E9ation de stub dynamique a \u00E9chou\u00E9 pour la classe %s
exceptionReleasingEntity=Entit\u00E9 qui produit des exceptions
unsupportedClientMarshallingStrategy=Strat\u00E9gie de marshaling de client non prise en charge %s a re\u00E7u sur le canal %s, aucune autre communication n'aura lieu
closingChannel=Fermeture du r\u00E9seau %s \u00E0 cause d'une erreur
closingChannelOnChannelEnd=Notification de fin de r\u00E9seau re\u00E7ue, fermeture du r\u00E9seau %s
logMDBStart=D\u00E9marrage du bean bas\u00E9 message '%s' avec '%s' adaptateur de ressources
skipOverlappingInvokeTimeout=La minuterie %s est toujours active, \u00E9vitement du chevauchement d'ex\u00E9cution pr\u00E9vu \u00E0 \: %s
