cacheRemoveFailed=Falha ao remover o %s do cache
cacheEntryNotFound=Falha ao encontrar a inst\u00E2ncia SFSB com o %s da ID de sess\u00E3o no cache
asyncInvocationFailed=A invoca\u00E7\u00E3o ass\u00EDncrona falhou
getTxManagerStatusFailed=falha ao obter o status do gerenciador tx; ignorando
setRollbackOnlyFailed=falha ao determinar apenas a revers\u00E3o; ignorando
activationConfigPropertyIgnored=O %s da ActivationConfigProperty %s ser\u00E1 ignorado uma vez que ele n\u00E3o est\u00E1 permitido pelo adaptador de recurso\: %s
discardingStatefulComponent=Descartando a inst\u00E2ncia do componente com estado\: %s devido \u00E0 exce\u00E7\u00E3o
failedToRemoveBean=Falha ao remover o bean\: o %s com o %s da id de sess\u00E3o
failToFindSfsbWithId=N\u00E3o foi poss\u00EDvel encontrar a inst\u00E2ncia do bean de sess\u00E3o com estado com a id\: o %s para o bean\: %s durante destrui\u00E7\u00E3o. Isto j\u00E1 foi provavelmente removido
defaultInterceptorClassNotListed=O %s da classe do interceptor padr\u00E3o n\u00E3o est\u00E1 listado na se\u00E7\u00E3o dos <interceptors> do ejb-jar.xml e n\u00E3o ser\u00E1 aplicado
noMethodFoundOnEjbExcludeList=Nenhum m\u00E9todo nomeado\: o %s encontrado no EJB\: %s enquanto processando o elemento exclude-list no ejb-jar.xml
noMethodFoundOnEjbWithParamExcludeList=Nenhum m\u00E9todo nomeado\: %s com os tipos de par\u00E2metros\: %s encontrado no EJB\: %s enquanto processandoo elemento exclude-list no ejb-jar.xml
noMethodFoundOnEjbPermission=Nenhum m\u00E9todo nomeado\: %s encontrado no EJB\: %s enquanto processando o elemento do m\u00E9todo de permiss\u00E3o no ejb-jar.xml
noMethodFoundWithParamOnEjbMethodPermission=Nenhum m\u00E9todo nomeado\: %s com os tipos de par\u00E2metros\: %s encontrado no EJB\: %s enquanto processando o elemento do m\u00E9todo de permiss\u00E3o no ejb-jar.xml
unknownTimezoneId=A id do fuso hor\u00E1rio desconhecido\: %s encontrado na express\u00E3o esquematizada. Ignorando-a e usando o fuso hor\u00E1rio do servidor\: %s
timerPersistenceNotEnable=A persist\u00EAncia do timer, os timers de persist\u00EAncia n\u00E3o sobreviver\u00E3o as reinicializa\u00E7\u00F5es do JVM
nextExpirationIsNull=A pr\u00F3xima expira\u00E7\u00E3o \u00E9 nula. Nenhuma tarefa ser\u00E1 esquematizada para o %S do timer
ignoringException=Ignorando a exce\u00E7\u00E3o durante o setRollbackOnly
UnregisteredRegisteredTimerService=O cancelamento de um Timerservice j\u00E1 registrado com o %s de id leva a uma nova inst\u00E2ncia a ser registrada 
errorInvokeTimeout=Erro ao invocar o intervalo para o timer\: %s
timerRetried=Timer\: %s ser\u00E1 tentado novamente
errorDuringRetryTimeout=Error na nova tentativa se intervalo para o timer\: %s
retryingTimeout=O intervalo de nova tentativo para o timer\: %s
timerNotActive=O timer n\u00E3o est\u00E1 ativado, ignorando a nova tentativa do timer\: %s
failToReadTimerInformation=N\u00E3o foi poss\u00EDvel ler a informa\u00E7\u00E3o do timer para o %s do componente
failedToRemovePersistentTimer=N\u00E3o foi poss\u00EDvel remover o %s do timer de persist\u00EAncia
failToRestoreTimers=O %s n\u00E3o \u00E9 um diret\u00F3rio. N\u00E3o foi poss\u00EDvel restaurar os timers
failToRestoreTimersFromFile=N\u00E3o foi poss\u00EDvel restaurar o timer a partir do %s
failToCloseFile=erro ao encerrar o arquivo
failToRestoreTimersForObjectId=N\u00E3o foi poss\u00EDvel restaurar os timers para o %s
failToCreateDirectoryForPersistTimers=N\u00E3o foi poss\u00EDvel criar o %s do diret\u00F3rio para persistir os timers EJB.
discardingEntityComponent=Descartando a inst\u00E2ncia do componente de entidade\: %s devido \u00E0 exce\u00E7\u00E3o
invocationFailed=A Invoca\u00E7\u00E3o EJB falhou no %s do componente para o %s do m\u00E9todo
couldNotFindEjbForLocatorIIOP=N\u00E3o foi poss\u00EDvel encontrar o EJB para o %s do localizador. O proxy do cliente EJB n\u00E3o ser\u00E1 substitu\u00EDdo
ejbNotExposedOverIIOP=O %s do EJB n\u00E3o foi substitu\u00EDdo por um Stub uma vez que ele n\u00E3o foi exposto no IIOP
dynamicStubCreationFailed=A cria\u00E7\u00E3o do stub din\u00E2mico falhou para o %s da classe 
exceptionReleasingEntity=Exce\u00E7\u00E3o liberando a entidade
unsupportedClientMarshallingStrategy=O cliente n\u00E3o suportado aplicando o marshall no %s da estrat\u00E9gia no %s do canal. N\u00E3o haver\u00E1 nenhuma comunica\u00E7\u00E3o futura.
closingChannel=Encerramento do %s do canal devido a um erro
closingChannelOnChannelEnd=A notifica\u00E7\u00E3o do encerramento do canal foi recebida, encerrando o %s do canal
logMDBStart=O '%s' do bean dirigido de mensagem foi iniciado como o adaptador do recurso '%s'
skipOverlappingInvokeTimeout=O %s do timer continua ativo, ignorando a execu\u00E7\u00E3o esquematizada de sobreposi\u00E7\u00E3o\: %s
