# These files are generated via Zanata (https://translate.jboss.org/project/view/jboss_as).
# Please do not update this file as it will be overwritten.

argUsage=Uso\: ./standalone.sh [args...]%nonde argumentos incluem\:
argServerConfig=O nome do arquivo de configura\u00E7\u00E3o para uso (o padr\u00E3o \u00E9 "standalone.xml")
argHelp=Exibe essa mensagem e encerra
argProperties=Carrega as propriedades de sistema a partir do url gerado
argSecurityProperty=Determina a propriedade de seguran\u00E7a
argSystem=Determina a propriedade de sistema
argVersion=Imprime uma vers\u00E3o e encerra
argPublicBindAddress=Determina o jboss.bind.address da propriedade de sistema ao valor gerado
argInterfaceBindAddress=Determina o  jboss.bind.address.<interface> da propriedade de sistema ao valor gerado
argDefaultMulticastAddress=Determina o jboss.default.multicast.address da propriedade de sistema ao valor gerado
argAdminOnly=Determina o tipo de rodagem do servidor ao ADMIN_ONLY levando-o a abrir as interfaces administrativas e aceitar as solicita\u00E7\u00F5es de gerenciamento. No entanto, ele n\u00E3o inicia os servi\u00E7os do per\u00EDodo de rodagem ou aceita as solicita\u00E7\u00F5es do usu\u00E1rio.
valueExpectedForCommandLineOption=Valor esperado para a op\u00E7\u00E3o %s
invalidCommandLineOption=Op\u00E7\u00E3o inv\u00E1lida '%s'
malformedCommandLineURL=URL malformado '%s' fornecido para a op\u00E7\u00E3o '%s'
unableToLoadProperties=N\u00E3o foi poss\u00EDvel carregar as propriedades do UR\u00C7 '%s'
cannotCreateVault=Erro ao inicializar o cofre --  %s
failedToConnectToHC=Falha ao conectar o host-controller
cancelledHCConnect=A solicita\u00E7\u00E3o da conex\u00E3o do host-controller foi cancelada
hostControllerNameNonNullInStandalone=O hostControllerName deve ser nulo caso o servi\u00E7o n\u00E3o esteja num dom\u00EDnio gerenciado
hostControllerNameNullInDomain=O hostControllerName pode n\u00E3o ser nulo caso o servidor esteja num dom\u00EDnio gerenciado
cannotResolveInterface=O endere\u00E7o IP n\u00E3o pode ser resolvido usando o crit\u00E9rio de sele\u00E7\u00E3o da interface. A falha era -- %s
failedToResolveInterface=falha ao resolver a interface %s
failedToStartHttpManagementService=Falha ao iniciar o servi\u00E7o http-interface
noSuchDeploymentContent=Nenhum conte\u00FAdo da implanta\u00E7\u00E3o com hash %s dispon\u00EDvel no reposit\u00F3rio do conte\u00FAdo da implanta\u00E7\u00E3o.
noSuchDeployment=N\u00E3o foi encontrada nenhuma implanta\u00E7\u00E3o com o nome %s
cannotReplaceDeployment=N\u00E3o foi poss\u00EDvel usar o mesmo valor de par\u00E2metros %s e %s. Use %s para reimplantar o mesmo conte\u00FAdo ou %s para substituir o conte\u00FAdo com uma nova vers\u00E3o de mesmo nome.
deploymentAlreadyStarted=Implanta\u00E7\u00E3o %s j\u00E1 inicializada
missingHomeDirConfiguration=Falta o valor da configura\u00E7\u00E3o para\: %s 
%s=falta\: %s
attributeIsRequired=O %s \u00E9 solicitado
attributeNotAllowedWhenAlternativeIsPresent=O %s n\u00E3o \u00E9 permitido quando o %s estiver presente
attributeIsInvalid=O %s \u00E9 inv\u00E1lido
caughtIOExceptionUploadingContent=Foi vista uma IOException de leitura atualizando o conte\u00FAdo da implanta\u00E7\u00E3o
nullStreamAttachment=Fluxo nulo no \u00EDndice [%d]
invalidDeploymentURL='%s' n\u00E3o \u00E9 um URL v\u00E1lido
problemOpeningStreamFromDeploymentURL=Erro ao obter o fluxo de entrada a partir do URL '%s'
serviceModuleLoaderAlreadyStarted=O ServiceModuleLoader j\u00E1 foi instalado
serviceModuleLoaderAlreadyStopped=O ServiceModuleLoader j\u00E3 foi encerrado
missingModulePrefix=O '%s' n\u00E3o pode ser carregado a partir de um  uma vez que o nome n\u00E3o inicia com '%s'
failedToReadVirtualFile=Falha na leitura do '%s'
deploymentRootRequired=A raiz da implanta\u00E7\u00E3o n\u00E3o \u00E9 requerida
subdeploymentsRequireParent=As sub-implanta\u00E7\u00E3o requerem uma unidade de implanta\u00E7\u00E3o pai
noModuleIdentifier=Nenhum Identificador de M\u00F3dulo anexado \u00E0 implanta\u00E7\u00E3o '%s'
failedToCreateVFSResourceLoader=Falha ao criar o VFSResourceLoader para a raiz [%s]
failedToGetFileFromRemoteRepository=Falha ao obter o reposit\u00F3rio remoto
cannotCreateLocalDirectory=N\u00E3o foi poss\u00EDvel criar o diret\u00F3rio local\: %s
didNotReadEntireFile=N\u00E3o foi ler o arquivo por completo. Falta\: %d
noArgValue=Nenhum valor foi fornecido para o argumento %s%n
couldNotFindHcFileRepositoryConnection=N\u00E3o foi poss\u00EDvel encontrar a conex\u00E3o do reposit\u00F3rio para o controlador do host.
onlyHashAllowedForDeploymentAddInDomainServer=Apenas o 'hash' est\u00E1 permitido para a adi\u00E7\u00E3o da implanta\u00E7\u00E3o no servidor do modo de dom\u00EDnio\: %s
onlyHashAllowedForDeploymentFullReplaceInDomainServer=Apenas o 'hash' est\u00E1 permitido para substitui\u00E7\u00E3o completa ao servidor do modo de dom\u00EDnio\: %s
unknownMountType=Tipo de montagem desconhecida %s
failedCreatingTempProvider=Falha ao criar o provedor do arquivo tempor\u00E1rio
illegalCombinationOfHttpManagementInterfaceConfigurations=O %s n\u00E3o p\u00F4de ser definido quando o %s ou %s \nforem definidos tamb\u00E9m
systemPropertyNotManageable=O %s da propriedade de sistema n\u00E3o pode ser determinado atrav\u00E9s do arquivo de configura\u00E7\u00E3o xml ou a partir do cliente de gerenciamento. O seu valor deve ser conhecido no processo inicial, de forma que ele pode ser apenas configurado na linha de comando
systemPropertyCannotOverrideServerName=O %s da propriedade de sistema n\u00E3o pode ser determinada ap\u00F3s o nome do servidor ter sido configurado atrav\u00E9s do arquivo de configura\u00E7\u00E3o xml ou a partir do cliente de gerenciamento
unableToInitialiseSSLContext=N\u00E3o foi poss\u00EDvel inicializar o '%s' SSLContext b\u00E1sico
modulesDirectoryDoesNotExist=O diret\u00F3rio dos m\u00F3dulos determinados n\u00E3o existem\: %s
homeDirectoryDoesNotExist=O diret\u00F3rio principal n\u00E3o existe\: %s
bundlesDirectoryDoesNotExist=O diret\u00F3rio de pacotes n\u00E3o existe\: %s
configDirectoryDoesNotExist=O diret\u00F3rio de configura\u00E7\u00E3o n\u00E3o existe\: %s
serverBaseDirectoryDoesNotExist=O diret\u00F3rio base do servidor n\u00E3o existe\: %s
serverDataDirectoryIsNotDirectory=O diret\u00F3rio de dados do servidor n\u00E3o \u00E9 um diret\u00F3rio\: %s
couldNotCreateServerDataDirectory=N\u00E3o foi poss\u00EDvel criar um diret\u00F3rio de dados do servidor\: %s
serverContentDirectoryIsNotDirectory=O diret\u00F3rio do conte\u00FAdo do servidor n\u00E3o \u00E9 um diret\u00F3rio\: %s
couldNotCreateServerContentDirectory=N\u00E3o foi poss\u00EDvel criar o diret\u00F3rio do conte\u00FAdo do servidor\: %s
logDirectoryIsNotADirectory=O diret\u00F3rio de log n\u00E3o \u00E9 um diret\u00F3rio\: %s
couldNotCreateLogDirectory=N\u00E3o foi poss\u00EDvel criar um diret\u00F3rio de log\: %s
serverTempDirectoryIsNotADirectory=O diret\u00F3rio tempor\u00E1rio do servidor n\u00E3o existe\: %s
couldNotCreateServerTempDirectory=N\u00E3o foi poss\u00EDvel criar o diret\u00F3rio tempor\u00E1rio do servidor\: %s
controllerTempDirectoryIsNotADirectory=O diret\u00F3rio tempor\u00E1rio do controlador n\u00E3o existe\: %s
couldNotCreateControllerTempDirectory=N\u00E3o foi poss\u00EDvel criar o diret\u00F3rio tempor\u00E1rio do servidor\: %s
domainBaseDirDoesNotExist=O diret\u00F3rio base do dom\u00EDnio n\u00E3o existe\: %s
domainConfigDirDoesNotExist=O diret\u00F3rio de configura\u00E7\u00E3o do dom\u00EDnio n\u00E3o existe\: %s
serverBaseDirectoryIsNotADirectory=O diret\u00F3rio base do servidor n\u00E3o \u00E9 um diret\u00F3rio\: %s
couldNotCreateServerBaseDirectory=N\u00E3o foi poss\u00EDvel criar um diret\u00F3rio base do servidor\: %s
noSuchDeploymentContentAtBoot=Nenhum conte\u00FAdo de implanta\u00E7\u00E3o com hash %s dispon\u00EDvel no reposit\u00F3rio do conte\u00FAdo de implanta\u00E7\u00E3o para a implanta\u00E7\u00E3o '%s'. Este \u00E9 um erro de inicializa\u00E7\u00E3o fatal. Para corrigir este problema, tanto reinicie com a op\u00E7\u00E3o --admin-only  configurada e uso o CLI para instalar o a falta do conte\u00FAdo e remov\u00EA-lo da configura\u00E7\u00E3o, ou remova a implanta\u00E7\u00E3o do arquivo de configura\u00E7\u00E3o xml e reinicie sua m\u00E1quina.
