# These files are generated via Zanata (https://translate.jboss.org/project/view/jboss_as).
# Please do not update this file as it will be overwritten.

argUsage=Usage\u00A0\: ./standalone.sh [args...]%n o\u00F9 les args incluent\u00A0\:
argServerConfig=Nom du fichier de configuration du serveur \u00E0 utiliser (par d\u00E9faut "standalone.xml")
argHelp=Afficher ce message et quitter
argProperties=Charger les propri\u00E9t\u00E9s du syst\u00E8me \u00E0 partir de l'url donn\u00E9
argSecurityProperty=D\u00E9finir une propri\u00E9t\u00E9 de s\u00E9curit\u00E9
argSystem=D\u00E9finir une propri\u00E9t\u00E9 syst\u00E8me
argVersion=Imprimer la version et quitter
argPublicBindAddress=D\u00E9finir la propri\u00E9t\u00E9 syst\u00E8me jboss.bind.address sur la valeur donn\u00E9e
argInterfaceBindAddress=D\u00E9finir la propri\u00E9t\u00E9 syst\u00E8me jboss.bind.address.<interface> sur la valeur donn\u00E9e
argDefaultMulticastAddress=D\u00E9finir la propri\u00E9t\u00E9 syst\u00E8me jboss.default.multicast.address sur la valeur donn\u00E9e
argAdminOnly=D\u00E9finir le type de fonctionnement du serveur sur ADMIN_ONLY entra\u00EEne l'ouverture des interfaces administratives et il accepte les requ\u00EAtes de gestion mais ne d\u00E9marrera pas d'autres services de runtime et n'acceptera pas de requ\u00EAtes de la part des utilisateurs finaux.
valueExpectedForCommandLineOption=Valeur attendue pour l'option %s
invalidCommandLineOption=Option '%s' invalide
malformedCommandLineURL=Malformation de l'URL '%s' fourni pour l'option '%s'
unableToLoadProperties=Impossible de charger les propri\u00E9t\u00E9s de l'URL '%s'
cannotCreateVault=Erreur lors de l'initialisation de vault --  %s
failedToConnectToHC=\u00C9chec de la connexion au contr\u00F4leur-h\u00F4te (host-controller)
cancelledHCConnect=La demande de connexion au contr\u00F4leur-h\u00F4te a \u00E9t\u00E9 annul\u00E9e
hostControllerNameNonNullInStandalone=hostControllerName doit \u00EAtre null si le serveur n'est pas dans un domaine g\u00E9r\u00E9
hostControllerNameNullInDomain=hostControllerName ne peut pas \u00EAtre null si le serveur est dans un domaine g\u00E9r\u00E9
cannotResolveInterface=Une adresse IP ne peut pas \u00EAtre r\u00E9solue \u00E0 l'aide du crit\u00E8re de s\u00E9lection de l'interface donn\u00E9e. L'\u00E9chec est -- %s
failedToResolveInterface=\u00E9chec de r\u00E9solution de l'interface %s
failedToStartHttpManagementService=\u00C9chec du d\u00E9marrage du service http-interface
noSuchDeploymentContent=Aucun contenu de d\u00E9ploiement avec hash %s n'est disponible dans le r\u00E9f\u00E9rentiel de contenu de d\u00E9ploiement.
noSuchDeployment=Aucun d\u00E9ploiement avec le nom %s trouv\u00E9
cannotReplaceDeployment=Impossible d'utiliser %s avec la m\u00EAme valeur pour les param\u00E8tres %s et %s. Utilisez %s pour red\u00E9ployer le m\u00EAme contenu ou %s pour remplacer le contenu avec une nouvelle version poss\u00E9dant le m\u00EAme nom.
deploymentAlreadyStarted=Le d\u00E9ploiement %s a d\u00E9j\u00E0 \u00E9t\u00E9 lanc\u00E9
missingHomeDirConfiguration=Valeur de configuration manquante pour\u00A0\: %s
%s=est manquant\u00A0\: %s
attributeIsRequired=%s est requis
attributeNotAllowedWhenAlternativeIsPresent=%s n'est pas permis lorsque %s sont pr\u00E9sents
attributeIsInvalid=%s est invalide
caughtIOExceptionUploadingContent=IOException intercept\u00E9e lors de la lecture du contenu du d\u00E9ploiement t\u00E9l\u00E9charg\u00E9
nullStreamAttachment=Flux null sur l'index [%d]
invalidDeploymentURL='%s' n'est pas un URL valide
problemOpeningStreamFromDeploymentURL=Erreur lors de l'obtention du flux d'entr\u00E9e de l'URL '%s'
serviceModuleLoaderAlreadyStarted=ServiceModuleLoader est d\u00E9j\u00E0 d\u00E9marr\u00E9
serviceModuleLoaderAlreadyStopped=ServiceModuleLoader est d\u00E9j\u00E0 arr\u00EAt\u00E9
missingModulePrefix='%s' ne peut pas \u00EAtre charg\u00E9 depuis un ServiceModuleLoader car son nom ne commence pas par '%s'
failedToReadVirtualFile=\u00C9chec de la lecture de '%s'
deploymentRootRequired=La racine (root) du d\u00E9ploiement est requise
subdeploymentsRequireParent=Les sous-d\u00E9ploiements requi\u00E8rent une unit\u00E9 de d\u00E9ploiement parent
noModuleIdentifier=Aucun Module Identifier attach\u00E9 au d\u00E9ploiement '%s'
failedToCreateVFSResourceLoader=\u00C9chec de la cr\u00E9ation de 
failedToGetFileFromRemoteRepository=Impossible d'obtenir le fichier depuis le r\u00E9f\u00E9rentiel distant
cannotCreateLocalDirectory=Impossible de cr\u00E9er le r\u00E9pertoire local\u00A0\: %s
didNotReadEntireFile=N'a pas lu le fichier entier. Il manque\u00A0\: %d
noArgValue=Aucune valeur n'a \u00E9t\u00E9 fournie pour l'argument %s%n
couldNotFindHcFileRepositoryConnection=Connexion du r\u00E9f\u00E9rentiel de fichier au contr\u00F4leur h\u00F4te introuvable.
onlyHashAllowedForDeploymentAddInDomainServer=Seul 'hash' est autoris\u00E9 pour une addition au d\u00E9ploiement sur un serveur en mode domaine\u00A0\: %s
onlyHashAllowedForDeploymentFullReplaceInDomainServer=Seul 'hash' est autoris\u00E9 pour un remplacement complet de d\u00E9ploiement sur un serveur en mode domaine\u00A0\: %s
unknownMountType=Type de montage inconnu %s
failedCreatingTempProvider=\u00C9chec de la cr\u00E9ation de fournisseur de fichiers temp
illegalCombinationOfHttpManagementInterfaceConfigurations=%s ne peut pas \u00EAtre d\u00E9fini si %s ou %s est aussi d\u00E9fini
systemPropertyNotManageable=La propri\u00E9t\u00E9 syst\u00E8me %s ne peut pas \u00EAtre d\u00E9finie via le fichier de configuration XML ou depuis un client de gestion\u00A0; sa valeur doit \u00EAtre connue lors du d\u00E9marrage du processus initial, de mani\u00E8re \u00E0 \u00EAtre d\u00E9finie \u00E0 partir de la ligne de commande uniquement.
systemPropertyCannotOverrideServerName=La propri\u00E9t\u00E9 syst\u00E8me %s ne peut pas \u00EAtre d\u00E9finie apr\u00E8s que le nom du serveur a \u00E9t\u00E9 d\u00E9fini via le fichier de configuration XML ou depuis un client de gestion
unableToInitialiseSSLContext=Impossible d'initialiser un SSLContext de base '%s'
modulesDirectoryDoesNotExist=Le r\u00E9pertoire des modules d\u00E9termin\u00E9s n'existe pas\u00A0\: %s
homeDirectoryDoesNotExist=Le r\u00E9pertoire d'accueil n'existe pas\u00A0\: %s
bundlesDirectoryDoesNotExist=Le r\u00E9pertoire des lots (bundles) n'existe pas\u00A0\: %s
configDirectoryDoesNotExist=Le r\u00E9pertoire de configuration n'existe pas \: %s
serverBaseDirectoryDoesNotExist=Le r\u00E9pertoire du serveur de base n'existe pas \: %s
serverDataDirectoryIsNotDirectory=Le r\u00E9pertoire du serveur de donn\u00E9es n'est pas un r\u00E9pertoire \: %s
couldNotCreateServerDataDirectory=Impossible de cr\u00E9er un r\u00E9pertoire de serveur de donn\u00E9es\u00A0\: %s
serverContentDirectoryIsNotDirectory=Le r\u00E9pertoire du serveur de contenu n'est pas un r\u00E9pertoire \: %s
couldNotCreateServerContentDirectory=Impossible de cr\u00E9er un r\u00E9pertoire de serveur de contenu\u00A0\: %s
logDirectoryIsNotADirectory=Le r\u00E9pertoire log n'est pas un r\u00E9pertoire \: %s
couldNotCreateLogDirectory=Impossible de cr\u00E9er un r\u00E9pertoire de log \: %s
serverTempDirectoryIsNotADirectory=Le r\u00E9pertoire temp du serveur n'existe pas\u00A0\: %s
couldNotCreateServerTempDirectory=Impossible de cr\u00E9er le r\u00E9pertoire temp du serveur\u00A0\: %s
controllerTempDirectoryIsNotADirectory=Le r\u00E9pertoire temp du contr\u00F4leur n'existe pas\u00A0\: %s
couldNotCreateControllerTempDirectory=Impossible de cr\u00E9er le r\u00E9pertoire temp du serveur\u00A0\: %s
domainBaseDirDoesNotExist=Le r\u00E9pertoire de base du domaine n'existe pas\u00A0\: %s
domainConfigDirDoesNotExist=Le r\u00E9pertoire de configuration du domaine n'existe pas\u00A0\: %s
serverBaseDirectoryIsNotADirectory=Le r\u00E9pertoire de base du serveur n'est pas un r\u00E9pertoire\u00A0\: %s
couldNotCreateServerBaseDirectory=Impossible de cr\u00E9er un r\u00E9pertoire de base du serveur\u00A0\: %s
noSuchDeploymentContentAtBoot=Aucun d\u00E9ploiement de contenu avec hash %s n'est disponible dans le r\u00E9f\u00E9rentiel de contenu du d\u00E9ploiement pour le d\u00E9ploiement '%s'. Ceci est une erreur fatale. Pour corriger le probl\u00E8me, effectuez un red\u00E9marrage avec l'ensemble d'interrupteurs --admin-only et utilisez le CLI pour installer le contenu manquant ou supprimez-le de la configuration, sinon vous pouvez supprimer le d\u00E9ploiement du fichier de configuration XML et red\u00E9marrer.
