argUsage=Usage\: ./standalone.sh [args...]%nwhere args include\:
argServerConfig=\u5229\u7528\u3057\u305F\u3044\u30B5\u30FC\u30D0\u30FC\u8A2D\u5B9A\u30D5\u30A1\u30A4\u30EB\u540D (\u30C7\u30D5\u30A9\u30EB\u30C8\u306F "standalone.xml")
argHelp=\u3053\u306E\u30E1\u30C3\u30BB\u30FC\u30B8\u3092\u8868\u793A\u3057\u7D42\u4E86\u3057\u307E\u3059\u3002
argProperties=\u6307\u5B9A\u306E url \u304B\u3089\u30B7\u30B9\u30C6\u30E0\u30D7\u30ED\u30D1\u30C6\u30A3\u3092\u30ED\u30FC\u30C9\u3057\u307E\u3059\u3002
argSecurityProperty=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30D7\u30ED\u30D1\u30C6\u30A3\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
argSystem=\u30B7\u30B9\u30C6\u30E0\u30D7\u30ED\u30D1\u30C6\u30A3\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
argVersion=\u30D0\u30FC\u30B8\u30E7\u30F3\u3092\u51FA\u529B\u3057\u7D42\u4E86\u3057\u307E\u3059\u3002
argPublicBindAddress=\u30B7\u30B9\u30C6\u30E0\u30D7\u30ED\u30D1\u30C6\u30A3 jboss.bind.address \u3092\u6307\u5B9A\u306E\u5024\u306B\u8A2D\u5B9A\u3057\u307E\u3059\u3002
argInterfaceBindAddress=\u30B7\u30B9\u30C6\u30E0\u30D7\u30ED\u30D1\u30C6\u30A3 jboss.bind.address.<interface> \u3092\u6307\u5B9A\u306E\u5024\u306B\u8A2D\u5B9A\u3057\u307E\u3059\u3002
argDefaultMulticastAddress=\u30B7\u30B9\u30C6\u30E0\u30D7\u30ED\u30D1\u30C6\u30A3 jboss.default.multicast.address \u3092\u6307\u5B9A\u306E\u5024\u306B\u8A2D\u5B9A\u3057\u307E\u3059\u3002
argAdminOnly=\u30B5\u30FC\u30D0\u30FC\u306E\u5B9F\u884C\u30BF\u30A4\u30D7\u3092 ADMIN_ONLY \u306B\u8A2D\u5B9A\u3057\u307E\u3059\u3002ADMIN_ONLY \u3067\u306F\u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u304C\u958B\u304D\u7BA1\u7406\u30EA\u30AF\u30A8\u30B9\u30C8\u3092\u53D7\u3051\u53D6\u308A\u307E\u3059\u304C\u3001\u4ED6\u306E\u30E9\u30F3\u30BF\u30A4\u30E0\u30B5\u30FC\u30D3\u30B9\u3092\u958B\u59CB\u3057\u306A\u3044\u3001\u3042\u308B\u3044\u306F\u30A8\u30F3\u30C9\u30E6\u30FC\u30B6\u30FC\u306E\u30EA\u30AF\u30A8\u30B9\u30C8\u3092\u53D7\u3051\u53D6\u308A\u307E\u305B\u3093\u3002
valueExpectedForCommandLineOption=\u30AA\u30D7\u30B7\u30E7\u30F3 %s \u306B\u306F\u5024\u304C\u5FC5\u8981\u3067\u3059\u3002
invalidCommandLineOption=\u7121\u52B9\u306A\u30AA\u30D7\u30B7\u30E7\u30F3 '%s'
malformedCommandLineURL=\u30AA\u30D7\u30B7\u30E7\u30F3 '%$2s' \u306B\u63D0\u793A\u3055\u308C\u305F\u5F62\u5F0F\u306E URL '%$1s' \u306F\u4E0D\u6B63\u3067\u3059\u3002
unableToLoadProperties=URL '%s' \u304B\u3089\u30D7\u30ED\u30D1\u30C6\u30A3\u3092\u30ED\u30FC\u30C9\u3067\u304D\u307E\u305B\u3093\u3002
cannotCreateVault=\u30DC\u30FC\u30EB\u30C8\u306E\u521D\u671F\u5316\u30A8\u30E9\u30FC -- %s
failedToConnectToHC=\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u3078\u306E\u63A5\u7D9A\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
cancelledHCConnect=\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u3078\u306E\u63A5\u7D9A\u30EA\u30AF\u30A8\u30B9\u30C8\u304C\u30AD\u30E3\u30F3\u30BB\u30EB\u3055\u308C\u307E\u3057\u305F\u3002
hostControllerNameNonNullInStandalone=\u30B5\u30FC\u30D0\u30FC\u304C\u7BA1\u7406\u30C9\u30E1\u30A4\u30F3\u306B\u306A\u3044\u5834\u5408\u306F\u3001hostControllerName \u306F null \u3067\u306A\u3051\u308C\u3070\u306A\u308A\u307E\u305B\u3093\u3002
hostControllerNameNullInDomain=\u30B5\u30FC\u30D0\u30FC\u304C\u7BA1\u7406\u30C9\u30E1\u30A4\u30F3\u306B\u3042\u308B\u5834\u5408\u306F\u3001hostControllerName \u306F null \u3068\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
cannotResolveInterface=\u6307\u5B9A\u306E\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u9078\u629E\u57FA\u6E96\u3092\u4F7F\u3063\u3066 IP \u30A2\u30C9\u30EC\u30B9\u3092\u89E3\u6C7A\u3067\u304D\u307E\u305B\u3093\u3002%s \u3067\u5931\u6557\u3057\u307E\u3057\u305F\u3002
failedToResolveInterface=\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9 %s \u306E\u89E3\u6C7A\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
failedToStartHttpManagementService=http-interface \u30B5\u30FC\u30D3\u30B9\u306E\u958B\u59CB\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
noSuchDeploymentContent=\u30CF\u30C3\u30B7\u30E5 %s \u3092\u6301\u3064\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30B3\u30F3\u30C6\u30F3\u30C4\u306E\u3046\u3061\u3001\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30B3\u30F3\u30C6\u30F3\u30C4\u30EC\u30DD\u30B8\u30C8\u30EA\u3067\u5229\u7528\u3067\u304D\u308B\u3082\u306E\u306F\u3042\u308A\u307E\u305B\u3093\u3002
noSuchDeployment=%s \u3068\u3044\u3046\u540D\u524D\u306E\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002
cannotReplaceDeployment=\u30D1\u30E9\u30E1\u30FC\u30BF\u30FC %$2s \u3068 %$3s \u306B\u5BFE\u3057\u3066\u540C\u3058\u5024\u3092\u6301\u3064 %$1s \u3092\u5229\u7528\u3067\u304D\u307E\u305B\u3093\u3002%$4s \u3092\u4F7F\u3044\u540C\u3058\u30B3\u30F3\u30C6\u30F3\u30C4\u3092\u518D\u5EA6\u30C7\u30D7\u30ED\u30A4\u3059\u308B\u304B\u3001\u540C\u3058\u540D\u524D\u3067\u65B0\u3057\u3044\u30D0\u30FC\u30B8\u30E7\u30F3\u306E\u30B3\u30F3\u30C6\u30F3\u30C4\u3068\u7F6E\u304D\u63DB\u3048\u3066\u304F\u3060\u3055\u3044\u3002
deploymentAlreadyStarted=\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8 %s \u306F\u3059\u3067\u306B\u958B\u59CB\u3055\u308C\u3066\u3044\u307E\u3059\u3002
missingHomeDirConfiguration=\u8A2D\u5B9A\u5024\u304C\u629C\u3051\u3066\u3044\u307E\u3059\: %s
%s=(This is invalid entry)
missingDependencies=%n        %1$s \u306F\u4EE5\u4E0B\u304C\u4E0D\u8DB3\u3057\u3066\u3044\u307E\u3059\: %2$s
attributeIsRequired=%s \u304C\u5FC5\u8981\u3067\u3059\u3002
attributeNotAllowedWhenAlternativeIsPresent=%2$s \u304C\u5B58\u5728\u3059\u308B\u5834\u5408\u306F %1$s \u306F\u5229\u7528\u3067\u304D\u307E\u305B\u3093\u3002
attributeIsInvalid=%s \u306F\u7121\u52B9\u3067\u3059\u3002
caughtIOExceptionUploadingContent=\u30A2\u30C3\u30D7\u30ED\u30FC\u30C9\u3057\u305F\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30B3\u30F3\u30C6\u30F3\u30C4\u3092\u8AAD\u307F\u53D6\u308A\u4E2D\u306B IOException \u3092\u691C\u51FA\u3057\u307E\u3057\u305F\u3002
nullStreamAttachment=\u30A4\u30F3\u30C7\u30C3\u30AF\u30B9 [%d] \u306E\u30B9\u30C8\u30EA\u30FC\u30E0\u306F null \u3067\u3059\u3002
invalidDeploymentURL='%s' \u306F\u6709\u52B9\u306A URL \u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3002
problemOpeningStreamFromDeploymentURL=URL '%s' \u304B\u3089\u306E\u5165\u529B\u30B9\u30C8\u30EA\u30FC\u30E0\u306E\u53D6\u5F97\u30A8\u30E9\u30FC
serviceModuleLoaderAlreadyStarted=ServiceModuleLoader \u306F\u3059\u3067\u306B\u958B\u59CB\u3055\u308C\u3066\u3044\u307E\u3059\u3002
serviceModuleLoaderAlreadyStopped=ServiceModuleLoader \u306F\u3059\u3067\u306B\u505C\u6B62\u3055\u308C\u3066\u3044\u307E\u3059\u3002
missingModulePrefix=\u540D\u524D\u304C '%2$s' \u3067\u958B\u59CB\u3057\u3066\u3044\u306A\u3044\u305F\u3081\u3001'%1$s' \u306F ServiceModuleLoader \u304B\u3089\u30ED\u30FC\u30C9\u3067\u304D\u307E\u305B\u3093\u3002
failedToReadVirtualFile='%s' \u306E\u8AAD\u307F\u8FBC\u307F\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
deploymentRootRequired=\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30EB\u30FC\u30C8\u304C\u5FC5\u8981\u3067\u3059\u3002
subdeploymentsRequireParent=\u30B5\u30D6\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u306B\u306F\u89AA\u3068\u306A\u308B\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30E6\u30CB\u30C3\u30C8\u304C\u5FC5\u8981\u3067\u3059\u3002
noModuleIdentifier=\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8 '%s' \u306B\u30E2\u30B8\u30E5\u30FC\u30EB\u8B58\u5225\u5B50\u304C\u95A2\u9023\u4ED8\u3051\u3089\u308C\u3066\u3044\u307E\u305B\u3093\u3002
failedToCreateVFSResourceLoader=root \u306B VFSResourceLoader \u3092\u4F5C\u6210\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F [%s]
failedToGetFileFromRemoteRepository=\u30EA\u30E2\u30FC\u30C8\u30EC\u30DD\u30B8\u30C8\u30EA\u304B\u3089\u30D5\u30A1\u30A4\u30EB\u3092\u53D6\u5F97\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
cannotCreateLocalDirectory=\u30ED\u30FC\u30AB\u30EB\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u3092\u4F5C\u6210\u3067\u304D\u307E\u305B\u3093\: %s 
didNotReadEntireFile=\u30D5\u30A1\u30A4\u30EB\u5168\u4F53\u3092\u8AAD\u307F\u8FBC\u307F\u307E\u305B\u3093\u3067\u3057\u305F\u3002%d \u304C\u3042\u308A\u307E\u305B\u3093\u3002
noArgValue=\u5F15\u6570 %2$s \u306B\u5BFE\u3057\u3066\u5024\u304C\u63D0\u793A\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002%n
couldNotFindHcFileRepositoryConnection=\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u306B\u5BFE\u3059\u308B\u30D5\u30A1\u30A4\u30EB\u30EC\u30DD\u30B8\u30C8\u30EA\u63A5\u7D9A\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3067\u3057\u305F\u3002
onlyHashAllowedForDeploymentAddInDomainServer=\u30C9\u30E1\u30A4\u30F3\u30E2\u30FC\u30C9\u306E\u30B5\u30FC\u30D0\u30FC\u306B\u30C7\u30D7\u30ED\u30A4\u30F3\u30C8\u3092\u8FFD\u52A0\u3059\u308B\u5834\u5408\u3001'hash' \u306E\u307F\u304C\u5229\u7528\u3067\u304D\u307E\u3059\: %s
onlyHashAllowedForDeploymentFullReplaceInDomainServer=\u30C9\u30E1\u30A4\u30F3\u30E2\u30FC\u30C9\u306E\u30B5\u30FC\u30D0\u30FC\u306B\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u3092\u5B8C\u5168\u7F6E\u304D\u63DB\u3048\u3059\u308B\u5834\u5408\u3001'hash' \u306E\u307F\u304C\u5229\u7528\u3067\u304D\u307E\u3059\: %s
unknownMountType=\u4E0D\u660E\u306A\u30DE\u30A6\u30F3\u30C8\u30BF\u30A4\u30D7 %s
failedCreatingTempProvider=\u4E00\u6642\u30D5\u30A1\u30A4\u30EB\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306E\u4F5C\u6210\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
illegalCombinationOfHttpManagementInterfaceConfigurations=%s \u3042\u308B\u3044\u306F %s \u306E\u3044\u305A\u308C\u304B\u304C\u5B9A\u7FA9\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u3001%s \u3092\u5B9A\u7FA9\u3067\u304D\u307E\u305B\u3093\u3002
systemPropertyNotManageable=\u30B7\u30B9\u30C6\u30E0\u30D7\u30ED\u30D1\u30C6\u30A3 %s \u306F xml \u8A2D\u5B9A\u30D5\u30A1\u30A4\u30EB\u3042\u308B\u3044\u306F\u7BA1\u7406\u6697\u3044\u306A\u3068\u304B\u3089\u8A2D\u5B9A\u3067\u304D\u307E\u305B\u3093\u3002\u521D\u671F\u30D7\u30ED\u30BB\u30B9\u306E\u958B\u59CB\u6642\u306B\u3053\u306E\u5024\u304C\u306A\u3051\u308C\u3070\u306A\u308A\u307E\u305B\u3093\u3002\u305D\u306E\u305F\u3081\u3001\u30B3\u30DE\u30F3\u30C9\u30E9\u30A4\u30F3\u304B\u3089\u306E\u307F\u8A2D\u5B9A\u53EF\u80FD\u3067\u3059\u3002
systemPropertyCannotOverrideServerName=xml \u8A2D\u5B9A\u30D5\u30A1\u30A4\u30EB\u3042\u308B\u3044\u306F\u7BA1\u7406\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u304B\u3089\u30B5\u30FC\u30D0\u30FC\u540D\u3092\u8A2D\u5B9A\u3057\u305F\u5F8C\u3067\u30B7\u30B9\u30C6\u30E0\u30D7\u30ED\u30D1\u30C6\u30A3 %s \u3092\u8A2D\u5B9A\u3067\u304D\u307E\u305B\u3093\u3002
unableToInitialiseSSLContext=\u57FA\u672C\u7684\u306A SSLContext '%s' \u3092\u521D\u671F\u5316\u3067\u304D\u307E\u305B\u3093\u3002
modulesDirectoryDoesNotExist=\u5B9A\u7FA9\u6E08\u307F\u306E\u30E2\u30B8\u30E5\u30FC\u30EB\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u306F\u5B58\u5728\u3057\u307E\u305B\u3093\: %s
homeDirectoryDoesNotExist=\u30DB\u30FC\u30E0\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u306F\u5B58\u5728\u3057\u307E\u305B\u3093\: %s
bundlesDirectoryDoesNotExist=\u30D0\u30F3\u30C9\u30EB\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u306F\u5B58\u5728\u3057\u307E\u305B\u3093\: %s
configDirectoryDoesNotExist=\u8A2D\u5B9A\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u306F\u5B58\u5728\u3057\u307E\u305B\u3093\: %s
serverBaseDirectoryDoesNotExist=\u30B5\u30FC\u30D0\u30FC\u306E\u30D9\u30FC\u30B9\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u306F\u5B58\u5728\u3057\u307E\u305B\u3093\: %s
serverDataDirectoryIsNotDirectory=\u30B5\u30FC\u30D0\u30FC\u306E\u30C7\u30FC\u30BF\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u306F\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u3067\u306F\u3042\u308A\u307E\u305B\u3093\: %s
couldNotCreateServerDataDirectory=\u30B5\u30FC\u30D0\u30FC\u306E\u30C7\u30FC\u30BF\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u3092\u4F5C\u6210\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\: %s
serverContentDirectoryIsNotDirectory=\u30B5\u30FC\u30D0\u30FC\u306E\u30B3\u30F3\u30C6\u30F3\u30C4\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u306F\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u3067\u306F\u3042\u308A\u307E\u305B\u3093\: %s
couldNotCreateServerContentDirectory=\u30B5\u30FC\u30D0\u30FC\u306E\u30B3\u30F3\u30C6\u30F3\u30C4\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u3092\u4F5C\u6210\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\: %s
logDirectoryIsNotADirectory=\u30ED\u30B0\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u306F\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u3067\u306F\u3042\u308A\u307E\u305B\u3093\: %s
couldNotCreateLogDirectory=\u30ED\u30B0\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u3092\u4F5C\u6210\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\: %s 
serverTempDirectoryIsNotADirectory=\u30B5\u30FC\u30D0\u30FC\u306E\u4E00\u6642\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u306F\u5B58\u5728\u3057\u307E\u305B\u3093\: %s
couldNotCreateServerTempDirectory=\u30B5\u30FC\u30D0\u30FC\u306E\u4E00\u6642\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u3092\u4F5C\u6210\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\: %s
controllerTempDirectoryIsNotADirectory=\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u306E\u4E00\u6642\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u306F\u5B58\u5728\u3057\u307E\u305B\u3093\: %s
couldNotCreateControllerTempDirectory=\u30B5\u30FC\u30D0\u30FC\u306E\u4E00\u6642\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u3092\u4F5C\u6210\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\: %s
domainBaseDirDoesNotExist=\u30C9\u30E1\u30A4\u30F3\u306E\u30D9\u30FC\u30B9\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u306F\u5B58\u5728\u3057\u307E\u305B\u3093\: %s
domainConfigDirDoesNotExist=\u30C9\u30E1\u30A4\u30F3\u306E\u8A2D\u5B9A\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u306F\u5B58\u5728\u3057\u307E\u305B\u3093\: %s
serverBaseDirectoryIsNotADirectory=\u30B5\u30FC\u30D0\u30FC\u306E\u30D9\u30FC\u30B9\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u306F\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u3067\u306F\u3042\u308A\u307E\u305B\u3093\: %s
couldNotCreateServerBaseDirectory=\u30B5\u30FC\u30D0\u30FC\u306E\u30D9\u30FC\u30B9\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u3092\u4F5C\u6210\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\: %s
noSuchDeploymentContentAtBoot=\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8 %2$s \u306E\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30B3\u30F3\u30C6\u30F3\u30C4\u30EA\u30DD\u30B8\u30C8\u30EA\u306B\u30CF\u30C3\u30B7\u30E5 %1$s \u3092\u6301\u3064\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30B3\u30F3\u30C6\u30F3\u30C4\u304C\u898B\u3064\u304B\u308A\u307E\u305B\u3093\u3002\u3053\u308C\u306F\u81F4\u547D\u7684\u306A\u8D77\u52D5\u30A8\u30E9\u30FC\u3067\u3059\u3002\u3053\u306E\u554F\u984C\u3092\u89E3\u6C7A\u3059\u308B\u306B\u306F\u3001--admin-only \u30B9\u30A4\u30C3\u30C1\u30BB\u30C3\u30C8\u3067\u518D\u8D77\u52D5\u3059\u308B\u304B\u3001CLI \u3092\u4F7F\u3044\u8DB3\u308A\u306A\u3044\u30B3\u30F3\u30C6\u30F3\u30C4\u3092\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u3059\u308B\u304B\u3001\u3042\u308B\u3044\u306F\u8A2D\u5B9A\u304B\u3089\u524A\u9664\u3059\u308B\u304B\u3001\u3042\u308B\u3044\u306F xml \u8A2D\u5B9A\u30D5\u30A1\u30A4\u30EB\u304B\u3089\u305D\u306E\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u3092\u524A\u9664\u3057\u518D\u8D77\u52D5\u3057\u3066\u304F\u3060\u3055\u3044\u3002
