argUsage=Uso\: ./standalone.sh [args...]%nwhere args include\:
argServerConfig=Nombre del archivo de configuraci\u00F3n del servidor a utilizar (por defecto es  "standalone.xml")
argHelp=Presente este mensaje y salga
argProperties=Cargue las propiedades del sistema desde la url dada
argSecurityProperty=Establecer una propiedad de seguridad
argSystem=Establezca una propiedad del sistema
argVersion=Imprimir la versi\u00F3n y salir
argPublicBindAddress=Establecer la propiedad del sistema jboss.bind.address con el valor dado
argInterfaceBindAddress=Establecer la propiedad del sistema jboss.bind.address.<interface> con el valor dado
argDefaultMulticastAddress=Establecer la propiedad del sistema jboss.default.multicast.address con el valor dado
argAdminOnly=Establece el tipo de ejecuci\u00F3n del servidor como ADMIN_ONLY de manera que abre las interfaces administrativas y acepta peticiones de administraci\u00F3n pero no inicia otros servicios del tiempo de ejecuci\u00F3n o acepta peticiones de los usuarios.
valueExpectedForCommandLineOption=Valor esperado para la opci\u00F3n %s
invalidCommandLineOption=Opci\u00F3n inv\u00E1lida '%s'
malformedCommandLineURL=URL malformada '%s' dada para la opci\u00F3n '%s'
unableToLoadProperties=No se puede cargar las propiedades de la URL '%s'
cannotCreateVault=Error inicializando el dep\u00F3sito --  %s
failedToConnectToHC=No se logr\u00F3 conectar al controlador host
cancelledHCConnect=La petici\u00F3n de conexi\u00F3n al controlador host se cancel\u00F3
hostControllerNameNonNullInStandalone=hostControllerName debe ser nulo si el servidor no est\u00E1 en un dominio administrado
hostControllerNameNullInDomain=hostControllerName no debe ser nulo si el servidor est\u00E1 en un dominio administrado
cannotResolveInterface=Una direcci\u00F3n IP no se puede resolver usando el criterio de selecci\u00F3n de la interfaz dada. La falla fue -- %s
failedToResolveInterface=No logr\u00F3 resolver la interfaz %s
failedToStartHttpManagementService=No logr\u00F3 iniciar el servicio http-interface
noSuchDeploymentContent=No se encuentra disponible el contenido de implementaci\u00F3n con hash %s en el repositorio de contenido de la implementaci\u00F3n.
noSuchDeployment=No se encontr\u00F3 una implementaci\u00F3n con el nombre %s
cannotReplaceDeployment=No se puede utilizar %s con el mismo valor para los par\u00E1metros %s y %s. Use %s para volver a implementar el mismo contenido o %s para reemplazar contenido con una nueva versi\u00F3n con el mismo nombre.
deploymentAlreadyStarted=La implementaci\u00F3n %s ya inici\u00F3
missingHomeDirConfiguration=Falta el valor de configuraci\u00F3n para\: %s
%s=falta\: %s
attributeIsRequired=Se requiere %s 
attributeNotAllowedWhenAlternativeIsPresent=%s no se permite cuando %s est\u00E1 presente
attributeIsInvalid=%s es inv\u00E1lido
caughtIOExceptionUploadingContent=Se atrap\u00F3 IOException leyendo el contenido de implementaci\u00F3n cargado
nullStreamAttachment=Flujo nulo en el \u00EDndice [%d]
invalidDeploymentURL='%s' no es una URL v\u00E1lida.
problemOpeningStreamFromDeploymentURL=Error al obtener el flujo de entrada de la URL '%s'
serviceModuleLoaderAlreadyStarted=ServiceModuleLoader ya iniciado
serviceModuleLoaderAlreadyStopped=ServiceModuleLoader ya se detuvo
missingModulePrefix='%s' no se puede cargar desde un ServiceModuleLoader ya que su nombre no inicia por '%s'
failedToReadVirtualFile=No logr\u00F3 leer '%s'
deploymentRootRequired=Se requiere la ra\u00EDz de la implementaci\u00F3n
subdeploymentsRequireParent=Las sub-implementaciones requieren una unidad de implementaci\u00F3n padre
noModuleIdentifier=No hay adjunto un idetificador de m\u00F3dulo a la implementaci\u00F3n '%s'
failedToCreateVFSResourceLoader=No logr\u00F3 crear VFSResourceLoader para la ra\u00EDz [%s]
failedToGetFileFromRemoteRepository=No logr\u00F3 obtener el archivo del repositorio remoto
cannotCreateLocalDirectory=No se logr\u00F3 crear el directorio local\: %s
didNotReadEntireFile=No se ley\u00F3 el archivo completo. Falta\: %d
noArgValue=No se proporcion\u00F3 un valor para el argumento %s%n
couldNotFindHcFileRepositoryConnection=No pudo encontrar la conexi\u00F3n del repositorio de archivos al controlador host.
onlyHashAllowedForDeploymentAddInDomainServer=Solo se permite 'hash' para adici\u00F3n en la implementaci\u00F3n para un servidor de modo de dominio\: %s
onlyHashAllowedForDeploymentFullReplaceInDomainServer=Solo se permite 'hash' para reemplazo completo en la implementaci\u00F3n para un servidor del modo de dominio\: %s
unknownMountType=Tipo desconocido de montaje %s
failedCreatingTempProvider=No logr\u00F3 crear el proveedor del archivo temporal
illegalCombinationOfHttpManagementInterfaceConfigurations=%s no se puede definir cuando %s o %s tambi\u00E9n se definen
systemPropertyNotManageable=La propiedad del sistema %s no se puede establecer por medio del archivo de configuraci\u00F3n xml o desde un cliente de administraci\u00F3n; su valor se debe conocer al comienzo del proceso  inicial de manera que se pueda establecer desde la l\u00EDnea de comandos
systemPropertyCannotOverrideServerName=La propiedad del sistema %s no se puede establecer despu\u00E9s de que se ha configurado el nombre del servidor por medio del archivo de configuraci\u00F3n xml o desde un cliente de administraci\u00F3n
unableToInitialiseSSLContext=No se puede inicializar un SSLContext b\u00E1sico '%s'
modulesDirectoryDoesNotExist=El directorio de m\u00F3dulos determinado no existe\: %s
homeDirectoryDoesNotExist=El directorio de inicio no existe\: %s
bundlesDirectoryDoesNotExist=El directorio de grupos no existe\: %s
configDirectoryDoesNotExist=Directorio de configuraci\u00F3n no existe\: %s
serverBaseDirectoryDoesNotExist=Directorio base del servidor no existe\: %s
serverDataDirectoryIsNotDirectory=El directorio de datos del servidor no es un directorio\: %s
couldNotCreateServerDataDirectory=No se pudo crear un directorio de datos del servidor\: %s
serverContentDirectoryIsNotDirectory=El directorio de contenido del servidor no es un directorio\: %s
couldNotCreateServerContentDirectory=No se pudo crear un directorio de contenido del servidor\: %s
logDirectoryIsNotADirectory=Directorio de registro no es un directorio\: %s
couldNotCreateLogDirectory=No se pudo crear un directorio de registro\: %s
serverTempDirectoryIsNotADirectory=Directorio temporal del servidor no existe\: %s
couldNotCreateServerTempDirectory=No se pudo crear un directorio temporal del servidor\: %s
controllerTempDirectoryIsNotADirectory=Directorio temporal del controlador no existe\: %s
couldNotCreateControllerTempDirectory=No se pudo crear un directorio temporal del servidor\: %s
domainBaseDirDoesNotExist=Directorio base de dominio no existe\: %s
domainConfigDirDoesNotExist=Directorio de configuraci\u00F3n de dominio no existe\: %s
serverBaseDirectoryIsNotADirectory=El directorio base del servidor no es un directorio\: %s
couldNotCreateServerBaseDirectory=No se pudo crear un directorio base del servidor\: %s
noSuchDeploymentContentAtBoot=No hay disponible ning\u00FAn contenido de implementaci\u00F3n con hash %s en el repositorio de contenido de la implementaci\u00F3n para desplegarlo '%s'. Este es un error fatal de arranque. Para corregir el problema puede re-iniciar con la opci\u00F3n --admin-only y usar el CLI para instalar el contenido que falta o b\u00F3rrelo de la configuraci\u00F3n o borre la implementaci\u00F3n del archivo de configuraci\u00F3n xml y re-inicie.
