namespaces=Mappe les espace-noms utilis\u00E9s dans la configuration de document XML, quand les cl\u00E9s correspondent \u00E0 des pr\u00E9fixes d'espace-noms et les valeurs \u00E0 des sch\u00E9ma URI.
namespaces.add=Ajouter un mappage de pr\u00E9fixe d'espace-nom au mappage de l'attribut des espace-noms.
namespaces.add.prefix=Le pr\u00E9fixe de l'espace-nom \u00E0 ajouter
namespaces.add.uri=Le sch\u00E9ma uri de l'espace-nom \u00E0 ajouter
namespaces.remove=Supprimer un mappage de pr\u00E9fixe d'espace-nom au mappage de l'attribut des espace-noms.
namespaces.remove.namespace=Le pr\u00E9fixe de l'espace-nom \u00E0 supprimer.
schema-locations=Mappage des locations de schema XML utilis\u00E9s dans la configuration du document XML, quand les cl\u00E9s correspondent \u00E0 des sch\u00E9ma URI et les valeurs \u00E0 des locations dans lesquelles le sch\u00E9ma se trouve.
schema-locations.add=Ajouter un mappage de location de sch\u00E9ma au mappage de l'attribut schema-locations
schema-locations.add.uri=Uri de la location de sch\u00E9ma \u00E0 ajouter
schema-locations.add.schema-location=Location du sch\u00E9ma ajout\u00E9.
schema-locations.remove=Supprime un mappage de location de sch\u00E9ma d'un mappage d,attribut schema-locations.
schema-locations.remove.schema-uri=URI de la location de sch\u00E9ma \u00E0 supprimer.
core.management=Services de gestion pour contr\u00F4ler un serveur autonome ou un contr\u00F4leur h\u00F4te d'h\u00F4te dans un domaine de gestion.
core.management.security-realms=Les espaces de s\u00E9curit\u00E9 disponibles pour contr\u00F4ler l'acc\u00E8s aux services de gestion.
core.management.security-realm=Un espace de s\u00E9curit\u00E9 qui peut \u00EAtre associ\u00E9 \u00E0 une interface de gestion et qui peut \u00EAtre utilis\u00E9 pour contr\u00F4ler l'acc\u00E8s aux services de gestion.
core.management.security-realm.add=Ajoute un espace de s\u00E9curit\u00E9 qui puisse \u00EAtre associ\u00E9 \u00E0 l'interface de gestion et utilis\u00E9 pour contr\u00F4ler l'acc\u00E8s aux services de gestion. 
core.management.security-realm.remove=Supprime un espace de s\u00E9curit\u00E9 qui puisse \u00EAtre associ\u00E9 \u00E0 l'interface de gestion et utilis\u00E9 pour contr\u00F4ler l'acc\u00E8s aux services de gestion.
core.management.security-realm.server-identity=Configuration des identit\u00E9s qui repr\u00E9sentent le serveur.
core.management.security-realm.server-identity.secret=Configuration de l'identit\u00E9 bas\u00E9e mot de passe/secret d'un serveur ou d'un contr\u00F4leur d'h\u00F4te.
core.management.security-realm.server-identity.secret.add=Ajoute une identit\u00E9 bas\u00E9e mot de passe/secret pour un serveur ou un contr\u00F4leur d'h\u00F4te.
core.management.security-realm.server-identity.secret.remove=Supprime une identit\u00E9 bas\u00E9e mot de passe/secret pour un serveur ou un contr\u00F4leur d'h\u00F4te.
core.management.security-realm.server-identity.secret.value=Le secret / mot de passe codifi\u00E9 - Base64 Encoded.
core.management.security-realm.server-identity.ssl=Configuration de l'identit\u00E9 SSL d'un serveur ou d'un contr\u00F4leur d'h\u00F4te.
core.management.security-realm.server-identity.ssl.add=Ajoute une identit\u00E9 SSL d'un serveur ou d'un contr\u00F4leur d'h\u00F4te.
core.management.security-realm.server-identity.ssl.remove=Supprime l'identit\u00E9 SSL d'un serveur ou d'un contr\u00F4leur d'h\u00F4te.
core.management.security-realm.server-identity.ssl.protocol=Protocole \u00E0 utiliser quand on cr\u00E9e un SSLContext.
core.management.security-realm.server-identity.ssl.keystore-password=Mot de passe pour utiliser le keystore.
core.management.security-realm.server-identity.ssl.keystore-path=Chemin du keystore.
core.management.security-realm.server-identity.ssl.keystore-relative-to=Nom d'un autre chemin nomm\u00E9 auparavant, ou un des chemins standards fournis par le syst\u00E8me. Si 'relative-to' est fourni, la valeur de l'attribut 'path' (chemin) sera trait\u00E9 comme \u00E9tant relative \u00E0 celle du chemin indiqu\u00E9 par cet attribut.
core.management.security-realm.authentication=Configuration des m\u00E9canismes d'authentification c\u00F4t\u00E9 serveur. En option, on peut d\u00E9finir un truststore et un store bas\u00E9 mot de passe/nom d'utilisateur. L'authentification essaiera tout d'abord d'utiliser le truststore et s'il n'est disponible, il retournera \u00E0 l'authentification mot de passe/nom d'utilisateur. Si rien n'est sp\u00E9cifi\u00E9, le seul m\u00E9canisme disponible sera le m\u00E9canisme local de l'interface Native et l'interface HTTP ne sera pas accessible.
core.management.security-realm.authentication.truststore=Configuration d'un keystore \u00E0 utiliser pour cr\u00E9er un trust manager pour v\u00E9rifier les clients.
core.management.security-realm.authentication.truststore.add=Ajoute un keystore \u00E0 utiliser pour cr\u00E9er un trust manager pour v\u00E9rifier les clients.
core.management.security-realm.authentication.truststore.remove=Supprime un keystore \u00E0 utiliser pour cr\u00E9er un trust manager pour v\u00E9rifier les clients.
core.management.security-realm.authentication.truststore.keystore-password=Mot de passe pour ouvrir le keystore.
core.management.security-realm.authentication.truststore.keystore-path=Chemin du keystore.
core.management.security-realm.authentication.truststore.keystore-relative-to=Nom d'un autre chemin nomm\u00E9 auparavant, ou un des chemins standards fournis par le syst\u00E8me. Si 'relative-to' est fourni, la valeur de l'attribut 'path' (chemin) sera trait\u00E9 comme \u00E9tant relative \u00E0 celle du chemin indiqu\u00E9 par cet attribut.
core.management.security-realm.authentication.jaas=Configuration d'un JAAS LoginContext pour authentifier les utilisateurs.
core.management.security-realm.authentication.jaas.add=Ajoute une configuration pour utiliser JAAS pour l'authentification.
core.management.security-realm.authentication.jaas.remove=Supprime une configuration pour utiliser JAAS pour l'authentification.
core.management.security-realm.authentication.jaas.name=Le nom de la configuration JAAS \u00E0 utiliser.
core.management.security-realm.authentication.ldap=Configuration pour utiliser LDAP comme r\u00E9f\u00E9rentiel d'utilisateur.
core.management.security-realm.authentication.ldap.add=Ajoute une configuration pour utiliser LDAP comme r\u00E9f\u00E9rentiel d'utilisateur.
core.management.security-realm.authentication.ldap.remove=Supprime une configuration pour utiliser LDAP comme r\u00E9f\u00E9rentiel d'utilisateur.
core.management.security-realm.authentication.ldap.connection=Le nom de la connexion \u00E0 utiliser pour se connecter \u00E0 LDAP.
core.management.security-realm.authentication.ldap.base-dn=Le nom particulier de base pour commencer la recherche pour l'utilisateur.
core.management.security-realm.authentication.ldap.recursive=La recherche est-elle r\u00E9cursive ?
core.management.security-realm.authentication.ldap.user-dn=Le nom de l'attribut qui correspond au nom particulier de l'utilisateur.
core.management.security-realm.authentication.ldap.username-attribute=Le nom de l'attribut \u00E0 rechercher par l'utilisateur. Le filtre devra alors op\u00E9rer un recherche simple pour laquelle le nom d'utilisateur saisi par l'utilisateur devra correspondre \u00E0 l'attribut indiqu\u00E9 ici.
core.management.security-realm.authentication.ldap.advanced-filter=Filtre d\u00E9fini pr\u00E9cis\u00E9ment qu'il faut utiliser pour rechercher l'utilisateur sur la base de leur ID d'utilisateur saisie. Le filtre doit contenir une variable sous forme {0} - qui sera remplac\u00E9e par un nom d'utilisateur fourni par l'utilisateur.
core.management.security-realm.authentication.properties=Configuration pour pouvoir utiliser une liste que les utilisateurs ont stock\u00E9e dans le fichier de propri\u00E9t\u00E9s, comme r\u00E9f\u00E9rentiel d'utilisateur. Les saisies du fichier de propri\u00E9t\u00E9s sont username\={credentials}et chaque utilisateur est indiqu\u00E9 sur sa propre ligne.
core.management.security-realm.authentication.properties.add=Ajoute une configuration pour pouvoir utiliser une liste stock\u00E9e dans le fichier de propri\u00E9t\u00E9s comme r\u00E9f\u00E9rentiel de l'utilisateur.
core.management.security-realm.authentication.properties.remove=Supprime une configuration pour pouvoir utiliser une liste d'utilisateurs stock\u00E9e dans le fichier de propri\u00E9t\u00E9s comme r\u00E9f\u00E9rentiel de l'utilisateur.
core.management.security-realm.authentication.properties.path=le chemin du fichier de propri\u00E9t\u00E9s qui contient les utilisateurs.
core.management.security-realm.authentication.properties.relative-to=Nom d'un autre chemin nomm\u00E9 auparavant, ou un des chemins standards fournis par le syst\u00E8me. Si 'relative-to' est fourni, la valeur de l'attribut 'path' (chemin) sera trait\u00E9 comme \u00E9tant relative \u00E0 celle du chemin indiqu\u00E9 par cet attribut.
core.management.security-realm.authentication.properties.plain-text=Est-ce que les informations d'identification du fichier de propri\u00E9t\u00E9s sont stock\u00E9es en texte brut. Si ce n'est pas le cas, les informations d'identification devront correspondre normalement au hachage Digest codifi\u00E9 hex de 'username \: realm \: password'.
core.management.security-realm.authentication.xml=Configuration pour utiliser une liste d'utilisateurs stock\u00E9s directement dans le fichier de configuration host.xml ou standalone.xml comme r\u00E9f\u00E9rentiel d'utilisateur.
core.management.security-realm.authentication.xml.add=Ajoute une configuration pour utiliser une liste d'utilisateurs directement dans le fichier de configuration host.xml ou standalone.xml comme r\u00E9f\u00E9rentiel d'utilisateur.
core.management.security-realm.authentication.xml.remove=Configuration pour supprimer une liste d'utilisateurs stock\u00E9s directement dans le fichier de configuration host.xml ou standalone.xml comme r\u00E9f\u00E9rentiel d'utilisateur.
core.management.security-realm.authentication.xml.user=Un utilisateur autoris\u00E9.
core.management.security-realm.authentication.xml.user.add=Ajoute un utilisateur autoris\u00E9.
core.management.security-realm.authentication.xml.user.remove=Supprime un utilisateur autoris\u00E9.
core.management.security-realm.authentication.xml.user.password=Le mot de passe de l'utilisateur.
core.management.security-realm.authorization=Configuration c\u00F4t\u00E9 serveur pour charger des informations utilisateur suppl\u00E9mentaires comme les r\u00F4les \u00E0 utiliser pour les v\u00E9rifications d'autorisation qui suivent.
core.management.security-realm.authorization.properties=Configuration pour utiliser le fichier de propri\u00E9t\u00E9s pour charger les r\u00F4les d'utilisateur. Les entr\u00E9es du fichier de propri\u00E9t\u00E9s sont les username\={roles}avec les r\u00F4les sous forme d'une liste de r\u00F4les d'utilisateurs s\u00E9par\u00E9s par des virgules.
core.management.security-realm.authorization.properties.add=Ajoute une configuration pour pouvoir utiliser un fichier de propri\u00E9t\u00E9s pour charger des r\u00F4les d'utilisateurs.
core.management.security-realm.authorization.properties.remove=Supprime une configuration pour pouvoir utiliser un fichier de propri\u00E9t\u00E9s pour charger des r\u00F4les d'utilisateur.
core.management.security-realm.authorization.properties.path=Chemin des fichiers de propri\u00E9t\u00E9s qui contiennent les r\u00F4les d'utilisateur.
core.management.security-realm.authorization.properties.relative-to=Le nom d'un autre chemin nomm\u00E9 auparavant, ou un des chemins standards fournis par le syst\u00E8me. Si 'relative-to' est fourni, la valeur de l'attribut 'path' (chemin) sera trait\u00E9e comme relative au chemin sp\u00E9cifi\u00E9 par cet attribut.
core.management.ldap-connections=Configurations des fabriques de connexions qui peuvent \u00EAtre utilis\u00E9es par un domaine de s\u00E9curit\u00E9 pour les serveurs d'acc\u00E8s LDAP comme source d'information d'authentification et d'autorisation.
core.management.ldap-connection=Une fabrique de connexion qui peut \u00EAtre utilis\u00E9e par un domaine de s\u00E9curit\u00E9 pour acc\u00E9der \u00E0 un serveur LDAP comme source d'informations d'authentification et d'autorisation.
core.management.ldap-connection.add=Ajoute une fabrique de connexion qui peut \u00EAtre utilis\u00E9e par un domaine de s\u00E9curit\u00E9 pour acc\u00E9der \u00E0 un serveur LDAP comme source d'informations d'authentification et d'autorisation.
core.management.ldap-connection.remove=Supprime une fabrique de connexion qui peut \u00EAtre utilis\u00E9e par un domaine de s\u00E9curit\u00E9 pour acc\u00E9der \u00E0 un serveur LDAP comme source d'informations d'authentification et d'autorisation.
core.management.ldap-connection.url=URL \u00E0 utiliser pour se connecter au serveur LDAP.
core.management.ldap-connection.search-dn=Le nom particulier \u00E0 utiliser pour se connecter au serveur LDAP pour proc\u00E9der aux recherches.
core.management.ldap-connection.search-credential=Les informations d'identification \u00E0 utiliser pour se connecter et faire des recherches.
core.management.ldap-connection.initial-context-factory=La fabrique de contexte initial pour \u00E9tablie le LdapContext.
core.management.management-interfaces=Interfaces expos\u00E9es par les services de gestion pour permettre aux appelants ext\u00E9rieurs d'effectuer les t\u00E2ches de gestion.
core.management.native-interface=Configuration de l'interface de gestion native du serveur.
core.management.native-interface.add=Ajoute la configuration de l'interface de gestion native du serveur.
core.management.native-interface.interface=Interface de r\u00E9seau sur laquelle le socket de communication native de gestion du serveur devra \u00EAtre ouvert. Doit \u00EAtre 'd\u00E9fini' si l'attribut \u00ABsocket-binding\u00BB est d\u00E9fini.
core.management.native-interface.port=Port o\u00F9 le socket de communication native de gestion du serveur devra \u00EAtre ouvert. Doit \u00EAtre 'non d\u00E9fini' si l'attribut \u00ABsochet-binding\u00BB est d\u00E9fini.
core.management.native-interface.security-realm=Le domaine de s\u00E9curit\u00E9 \u00E0 utiliser pour l'interface de gestion native.
core.management.native-interface.socket-binding=Le nom de la configuration du \u00ABsocket binding\u00BB \u00E0 utiliser pour le socket d'interface de gestion native.
core.management.native-remoting-interface=Configuration de l'interface de gestion native du serveur qui utilise un connecteur d'un sous-syst\u00E8me distant.
core.management.native-remoting-interface.add=Ajoute la configuration de l'interface de gestion native du serveur qui utilise un connecteur d'un sous-syst\u00E8me distant.
core.management.http-interface=Configuration de l'interface de gestion HTTP du serveur.
core.management.http-interface.add=Ajoute la configuration de l'interface de gestion HTTP du serveur.
core.management.http-interface.interface=Interface de r\u00E9seau sur laquelle le socket de communication de gestion HTTP du serveur devra \u00EAtre ouvert.
core.management.http-interface.port=Port o\u00F9 le socket de communication de gestion HTTP du serveur devra \u00EAtre ouvert. 
core.service-container=Le conteneur central qui g\u00E8re tous les services sur un serveur autonome ou sur un contr\u00F4leur d'h\u00F4te dans un domaine de gestion.
extension=Un module qui \u00E9tend les capacit\u00E9s standards d'un domaine ou d'un serveur autonome.
extension.module=Le nom du module.
extension.add=Ajoute une extension.
extension.remove=Supprime une extension.
extension.subsystem=Un sous-syst\u00E8me fourni par l'extension. Ce qui est fourni ici correspond \u00E0 des informations sur l'interface du sch\u00E9ma xml et de gestion fourni par le sous-syst\u00E8me, pas la configuration du sous-syst\u00E8me lui-m\u00EAme.
extension.subsystem.xml-namespaces=Une liste des URL pour les espace-noms support\u00E9s par l'analyseur XML du sous-syst\u00E8me. Elle sera certainement vide si l'extension n'associait pas clairement un espace-nom XML avec un sous-syst\u00E8me particulier.
extension.subsystem.management-major-version=Version majeure de l'interface de gestion du sous-syst\u00E8me. Sans doute non d\u00E9finie si le sous-syst\u00E8me ne fournit pas actuellement une interface de gestion versionn\u00E9e.
extension.subsystem.management-minor-version=Version mineure de l'interface de gestion du sous-syst\u00E8me. Sans doute non d\u00E9finie si le sous-syst\u00E8me ne fournit pas actuellement une interface de gestion versionn\u00E9e.
named_path=Un chemin d'acc\u00E8s de syst\u00E8me de fichiers nomm\u00E9, mais sans obligation de sp\u00E9cifier le chemin d'acc\u00E8s r\u00E9el. Si aucun chemin d'acc\u00E8s r\u00E9el n'est sp\u00E9cifi\u00E9, il agit comme un espace r\u00E9serv\u00E9 dans le mod\u00E8le (par exemple au niveau du domaine) jusqu'\u00E0 une d\u00E9finition du chemin d'acc\u00E8s enti\u00E8rement sp\u00E9cifi\u00E9 soit appliqu\u00E9e \u00E0 un niveau inf\u00E9rieur (par exemple niveau h\u00F4te, o\u00F9 l'on sait que des adresses sont disponibles.)
specified_path=Un chemin d'acc\u00E8s de syst\u00E8me de fichier nomm\u00E9.
path.name=Le nom du chemin d'acc\u00E8s. Ne peut pas correspondre \u00E0 l'un des chemins standards fix\u00E9s et fournis par le syst\u00E8me \: <ul><li>jboss.home - the root directory of the JBoss AS distribution</li><li>user.home - user's home directory</li><li>user.dir - user's current working directory</li><li>java.home - java installation directory</li><li>jboss.server.base.dir - root directory for an individual server instance</li></ul> Notez que le syst\u00E8me fournit d'autres chemins standards qui pourront \u00EAtre remplac\u00E9s si on les d\u00E9clare dans le fichier de configuration. Voir la documentation de l'attribut \u00ABrelative-to\u00BB pour obtenir une liste compl\u00E8te des chemins standards.
path.path=Le chemin d'acc\u00E8s de syst\u00E8me de fichiers r\u00E9els. Consid\u00E9r\u00E9 comme un chemin d'acc\u00E8s absolu, \u00E0 moins que l'attribut \u00ABrelative-to\u00BB ne soit sp\u00E9cifi\u00E9, auquel cas la valeur sera trait\u00E9e comme \u00E9tant relative \u00E0 ce chemin. <p>Si trait\u00E9 comme un chemin d'acc\u00E8s complet, le v\u00E9ritable chemin d'acc\u00E8s de runtime sp\u00E9cifi\u00E9 par la valeur de cet attribut sera d\u00E9termin\u00E9 comme suit \: </p>si cette valeur est d\u00E9j\u00E0 absolue, alors la valeur sera directement utilis\u00E9e. Sinon le chemin d'acc\u00E8s runtime sera r\u00E9solu d'une mani\u00E8re d\u00E9pendante du syst\u00E8me. Sur les syst\u00E8mes UNIX, un chemin d'acc\u00E8s relatif est irr\u00E9vocable si on le r\u00E9sout sur le r\u00E9pertoire utilisateur actuel. Sur les syst\u00E8mes Microsoft Windows, un chemin d'acc\u00E8s relatif sera rendu irr\u00E9vocable si on le r\u00E9sout sur le r\u00E9pertoire courant du lecteur nomm\u00E9 par le chemin d'acc\u00E8s, le cas \u00E9ch\u00E9ant ; si ce n'est pas le cas, sur le r\u00E9pertoire utilisateur actuel.
path.relative-to=Le nom d'un autre nom de chemin d'acc\u00E8s, ou de l'un des chemins d'acc\u00E8s standards fournis par le syst\u00E8me. Si \u00ABrelative-to\u00BB est fourni, la valeur de l'attribut \u00AB path \u00BB (chemin) est consid\u00E9r\u00E9e comme relative au chemin sp\u00E9cifi\u00E9 par cet attribut. Les chemins d'acc\u00E8s standards fournis par le syst\u00E8me comprennent \: <ul><li>jboss.home - le r\u00E9pertoire racine de la distribution de JBoss AS</li><li>user.home - r\u00E9pertoire d'acceuil de l'utilisateur</li><li> user.dir - r\u00E9pertoire de travail actuel de l'utilisateur</li><li>java.home - r\u00E9pertoire d'installation de java</li><li>jboss.server.base.dir - exemple de r\u00E9pertoire racine d'un serveur individuel</li><li>jboss.server.data.dir - r\u00E9pertoire utilis\u00E9 par le serveur pour le stockage de fichiers de donn\u00E9es persistantes</li><li>jboss.server.log.dir - le r\u00E9pertoire utilis\u00E9 par le serveur pour le stockage de fichiers log</li><li>jboss.server.tmp.dir - le r\u00E9pertoire utilis\u00E9 par le serveur pour le stockage de fichiers temporaires</li><li>jboss.domain.servers.dir - r\u00E9pertoire sous lequel un contr\u00F4leur h\u00F4te va cr\u00E9er la zone de travail pour chaque instance de serveur</li></ul>
path.add=Ajouter un nouveau chemin.
path.add.path=La valeur de l'attribut \u00ABchemin\u00BB du chemin
path.add.relative-to=La valeur de l'attribut \u00ABrelative-to\u00BB du chemin d'acc\u00E8s.
path.remove=Supprimer un chemin
profile=Un ensemble nomm\u00E9 de configurations de sous-syst\u00E8mes.
profile.name=Le nom du profil.
profile.add=Ajouter un nouveau \u00ABprofile\u00BB (profil)
profile.add.includes=La valeur du nouvel attribut \u00ABincludes\u00BB du profil.
profile.describe=Produit les sous-syst\u00E8mes du profil sous forme de liste des op\u00E9rations qui pourront \u00EAtre ex\u00E9cut\u00E9es pour cr\u00E9er le m\u00EAme mod\u00E8le.
profile.remove=Supprimer un \u00ABprofile\u00BB (profil)
profile.remove.name=La valeur de l'attribut \u00ABname\u00BB (nom) du profil.
profile.includes=Une liste des autres profils \u00E0 inclure dans ce profil.
profile.include=Indique que le contenu d'un profil d\u00E9sign\u00E9 doit \u00EAtre inclus dans le profil dont la d\u00E9finition inclut cet item.
profile.include.profile=Le nom du profil inclus
profile.includes.add=Ajouter un profil \u00E0 la liste des profils inclus
profile.includes.add.include=Le nom du profil inclus
profile.includes.remove=Supprimer un profil de la liste des profils inclus
profile.includes.remove.include=Le nom du profil inclus
profile.subsystem=Les sous-syst\u00E8mes qui constituent le profil.
named_interface=Une interface r\u00E9seau nomm\u00E9e, mais sans aucun crit\u00E8re pour d\u00E9terminer l'adresse IP \u00E0 associer \u00E0 cette interface. Si aucun crit\u00E8re de s\u00E9lection des adresses IP n'est d\u00E9fini, agit comme un espace r\u00E9serv\u00E9 dans le mod\u00E8le (par exemple au niveau du domaine) jusqu'\u00E0 une d\u00E9finition d'interface enti\u00E8rement sp\u00E9cifi\u00E9e soit appliqu\u00E9e \u00E0 un niveau inf\u00E9rieur (par exemple niveau h\u00F4te, o\u00F9 l'on sait que des adresses sont disponibles.)
specified_interface=Une interface de r\u00E9seau nomm\u00E9e, avec les crit\u00E8res requis pour d\u00E9terminer l'adresse IP \u00E0 associer \u00E0 cette interface.
interface.name=Le nom de l'interface.
interface.criteria=Obsol\u00E8te. Un ensemble de crit\u00E8res \u00E0 utiliser en runtime pour d\u00E9terminer l'adresse IP \u00E0 utiliser pour une interface.
interface.add=Ajouter une nouvelle sp\u00E9cification d'interface.
interface.add.criteria=Obsol\u00E8te.
interface.remove=Supprime une sp\u00E9cification d'interface.
interface.any-address=Attribut qui indique que les sockets utilisant cette interface doivent \u00EAtre li\u00E9s \u00E0 une adresse g\u00E9n\u00E9rique. L'adresse g\u00E9n\u00E9rique IPv6 (\:\:) sera utilis\u00E9e \u00E0 moins que la propri\u00E9t\u00E9 du syst\u00E8me java.net.preferIpV4Stack soit d\u00E9finie sur true, dans lequel cas l'adresse g\u00E9n\u00E9rique IPv4 (0.0.0.0) sera utilis\u00E9e. Si un socket est li\u00E9 \u00E0 une adresse anylocal (locale) IPv6 sur une machine dual-stack, elle peut accepter le trafic IPv6 et IPv4; si elle est li\u00E9e \u00E0 une adresse IPv4 anylocal (locale) (mapp\u00E9e IPv4), il peut accepter uniquement le trafic IPv4.
interface.any-ipv4-address=Attribut qui indique que les sockets qui utilisent cette interface doivent \u00EAtre li\u00E9s \u00E0 l'adresse g\u00E9n\u00E9rique IPv4 (0.0.0.0).
interface.any-ipv6-address=Attribut qui indique que les sockets qui utilisent cette interface doivent \u00EAtre li\u00E9s \u00E0 l'adresse g\u00E9n\u00E9rique IPv6 (\:\:).
interface.inet-address=Attribut qui indique qu'un des crit\u00E8res de s\u00E9lection pour choisir une adresse IP pour cette interface doit \u00EAtre si l'adresse correspond ou non \u00E0 la valeur donn\u00E9e. La valeur est soit une adresse IP IPv6 ou IPv4 parsem\u00E9e de notation d\u00E9cimale, ou un nom d'h\u00F4te qui peut \u00EAtre r\u00E9solu en adresse IP. \u00AB undefined \u00BB signifie que cet attribut n'est pas pertinent \u00E0 la s\u00E9lection d'adresse IP.
interface.link-local-address=Attribut qui indique qu'un des crit\u00E8res de s\u00E9lection pour choisir une adresse IP pour cette interface doit \u00EAtre si l'adresse est link-local ou non. \u00ABundefined\u00BB ou \u00ABfalse\u00BB indique que cet attribut n'est pas pertinent \u00E0 la s\u00E9lection de l'adresse IP.
interface.loopback=Attribut qui indique qu'un des crit\u00E8res de s\u00E9lection pour choisir une adresse IP pour cette interface doit \u00EAtre si l'adresse de bouclage ou non. \u00ABundefined\u00BB ou \u00ABfalse\u00BB indique que cet attribut n'est pas pertinent \u00E0 la s\u00E9lection de l'adresse IP.
interface.loopback-address=Attribut qui indique que l'adresse IP de cette interface doit correspondre \u00E0 la valeur donn\u00E9e, si l'interface de bouclage existe sur la machine. Une \u00ABadresse de bouclage\u00BB n'est peut-\u00EAtre pas configur\u00E9e sur l'interface du loopback de la machine. Diff\u00E9rent de l'adresse inet-address car la valeur donn\u00E9e sera utilis\u00E9e m\u00EAme si aucun NIC ayant une adresse IP indiqu\u00E9e associ\u00E9e ne peut \u00EAtre trouv\u00E9. \u00ABundefined\u00BB ou \u00ABfalse\u00BB signifie que cet attribut n'est pas pertinent \u00E0 la s\u00E9lection de l'adresse IP.
interface.multicast=Attribut qui indique qu'un des crit\u00E8res de s\u00E9lection pour choisir une adresse IP pour cette interface doit \u00EAtre si l'interface de r\u00E9seau supporte la multidiffusion ou non. \u00ABundefined\u00BB ou \u00ABfalse\u00BB indique que cet attribut n'est pas pertinent \u00E0 la s\u00E9lection de l'adresse IP.
interface.nic=Attribut qui indique qu'un des crit\u00E8res de s\u00E9lection pour choisir une adresse IP pour cette interface doit \u00EAtre si l'interface de r\u00E9seau poss\u00E8de un nom ou non. \u00ABundefined\u00BB ou \u00ABfalse\u00BB indique que cet attribut n'est pas pertinent \u00E0 la s\u00E9lection de l'adresse IP.
interface.nic-match=Attribut qui indique qu'un des crit\u00E8res de s\u00E9lection pour choisir une adresse IP pour cette interface doit \u00EAtre si l'interface de r\u00E9seau a un nom qui correspond \u00E0 l'expression standard donn\u00E9e. La valeur est une expression standard qui correspond aux noms des interfaces de r\u00E9seau disponibles sur la machine pour pouvoir trouver un interface qui convient. La valeur \u00ABundefined\u00BB signifie que cet attribut n'est pas pertinent \u00E0 la s\u00E9lection de l'adresse IP.
interface.point-to-point=Attribut qui indique qu'un des crit\u00E8res de s\u00E9lection pour choisir une adresse IP pour cette interface doit \u00EAtre si son interface de r\u00E9seau correspond \u00E0 une interface point-to-point. \u00ABundefined\u00BB ou \u00ABfalse\u00BB indique que cet attribut n'est pas pertinent \u00E0 la s\u00E9lection de l'adresse IP.
interface.public-address=Attribut qui indique qu'un des crit\u00E8res de s\u00E9lection pour choisir une adresse IP pour cette interface doit \u00EAtre si l'adresse est publiquement repositionable ou non. \u00ABundefined\u00BB ou \u00ABfalse\u00BB indique que cet attribut n'est pas pertinent \u00E0 la s\u00E9lection de l'adresse IP.
interface.site-local-address=Attribut qui indique qu'un des crit\u00E8res de s\u00E9lection pour choisir une adresse IP pour cette interface doit \u00EAtre si l'adresse est site-local ou non. \u00ABundefined\u00BB ou \u00ABfalse\u00BB indique que cet attribut n'est pas pertinent \u00E0 la s\u00E9lection de l'adresse IP.
interface.subnet-match=Attribut qui indique qu'un des crit\u00E8res de s\u00E9lection pour choisir une adresse IP pour cette interface doit \u00EAtre si l'adresse correspond \u00E0 la d\u00E9finition de sous-r\u00E9seau donn\u00E9e. La valeur est soit une adresse IP et le nombre d'octets du pr\u00E9fixe du r\u00E9seau de l'adresse, en "slash notation" (convention avec barre oblique), comme par exemple \: "192.168.0.0/16". \u00ABundefined \u00BB signifie que cet attribut n'est pas pertinent \u00E0 la s\u00E9lection d'adresse IP.
interface.up=Attribut qui indique qu'un des crit\u00E8res de s\u00E9lection pour choisir une adresse IP pour cette interface doit \u00EAtre si l'interface de r\u00E9seau est active ou non. \u00ABundefined\u00BB ou \u00ABfalse\u00BB indique que cet attribut n'est pas pertinent \u00E0 la s\u00E9lection de l'adresse IP.
interface.virtual=Attribut qui indique qu'un des crit\u00E8res de s\u00E9lection pour choisir une adresse IP pour cette interface doit \u00EAtre si l'interface de r\u00E9seau est virtuelle ou non. \u00ABundefined\u00BB ou \u00ABfalse\u00BB indique que cet attribut n'est pas pertinent \u00E0 la s\u00E9lection de l'adresse IP.
interface.not=Attribut qui indique qu'un des crit\u00E8res de s\u00E9lection pour choisir une adresse IP pour cette interface doit \u00EAtre que l'adresse IP ne *doive pas* remplir aucun des crit\u00E8res imbriqu\u00E9s. La valeur de cet attribut correspond \u00E0 un ensemble de crit\u00E8res (par ex. \u00ABloopback\u00BB) dont la signification normale aura \u00E9t\u00E9 invers\u00E9e. \u00ABundefined\u00BB indique que cet attribut n'est pas pertinent \u00E0 la s\u00E9lection de l'adresse IP.
interface.any=Attribut qui indique qu'un des crit\u00E8res de s\u00E9lection pour choisir une adresse IP pour cette interface doit \u00EAtre que l'adresse IP ne *doive* remplir un crit\u00E8re imbriqu\u00E9 au moins. La valeur de cet attribut correspond \u00E0 un ensemble de crit\u00E8res. \u00ABundefined\u00BB indique que cet attribut n'est pas pertinent \u00E0 la s\u00E9lection de l'adresse IP.
socket-binding-group=Contient une liste des configurations de socket.
socket-binding-group.name=Le nom du groupe de liaison de socket.
socket-binding-group.default-interface=Nom d'une interface qui doit \u00EAtre utilis\u00E9e comme interface pour toute socket qui n'en d\u00E9clare pas une explicitement.
socket-binding-group.socket-binding=Les configurations de chaque socket.
socket-binding-group.port-offset=Incr\u00E9ment \u00E0 appliquer aux valeurs de base de ports d\u00E9finis dans les liaisons socket pour d\u00E9river les valeurs de runtime \u00E0 utiliser sur ce serveur.
socket-binding-group.includes=Une liste de noms de groupe de liaison socket dont les liaisons doivent \u00EAtre incluses dans ce groupe socket-liaison. L'interface par d\u00E9faut de ce groupe de liaison s'appliquera \u00E0 toute liaison incluse qui ne sp\u00E9cifie pas une interface.
socket-binding-group.add=Ajoute un groupe de liaison de socket.
socket-binding-group.remove=Supprime un groupe de liaison de socket.
socket-binding-group.include.add=Ajoute un groupe de liaison de socket \u00E0 l'attribut \u00ABincludes\u00BB du groupe de liaison de socket.
socket-binding-group.include.add.include=Le nom du groupe de socket de liaison \u00E0 inclure.
socket-binding-group.include.remove=Supprime un groupe de liaison de socket \u00E0 l'attribut \u00ABincludes\u00BB du groupe de liaison de socket.
socket-binding-group.include.remove.include=Le nom du groupe de socket de liaison \u00E0 ne plus inclure.
socket-binding=Information de configuration de socket.
socket-binding.name=Le nom du socket. Les services qui doivent acc\u00E9der les informations de configuration du socket verront qu'il utilise ce nom.
socket-binding.interface=Nom de l'interface \u00E0 laquelle le socket doit \u00EAtre reli\u00E9, ou bien, pour les socket multi-diffusion, l'interface sur laquelle il devra \u00E9couter. Doit correspondre \u00E0 une des interfaces d\u00E9clar\u00E9es.
socket-binding.port=Nombre de ports sur lesquels le socket doit \u00EAtre reli\u00E9.
socket-binding.fixed-port=Si la valeur du port doit demeurer fix\u00E9e, m\u00EAme si les compensions num\u00E9riques sont appliqu\u00E9es \u00E0 d'autres sockets du groupe de sockets.
socket-binding.multicast-address=Adresse multi-diffusion sur laquelle le socket devrait recevoir le trafic multi-diffusion. Si non sp\u00E9cifi\u00E9, le socket ne sera pas configur\u00E9 pour recevoir la multi-diffusion.
socket-binding.multicast-port=Port sur lequel le socket doit recevoir le trafic multi-diffusion. Doit \u00EAtre configur\u00E9 si \u00ABmulticast-address\u00BB est configur\u00E9.
socket-binding.add=Ajoute une configuration de liaison de socket au groupe.
socket-binding.remove=Supprime la configuration de liaison de socket du groupe.
socket-binding.bound=Si un socket qui utilise cette configuration de liaison de socket a \u00E9t\u00E9 trouv\u00E9.
socket-binding.bound-address=L'adresse \u00E0 laquelle le socket qui utilise cette configuration de liaison de socket a \u00E9t\u00E9 reli\u00E9, ou non d\u00E9finie si aucun socket n'a pu \u00EAtre trouv\u00E9.
socket-binding.bound-port=Le port auquel le socket qui utilise la configuration de liaison de socket a \u00E9t\u00E9 reli\u00E9, ou non d\u00E9fini si aucun socket n'a \u00E9t\u00E9 trouv\u00E9.
socket-binding.client-mappings=Sp\u00E9cifie des mappages clients z\u00E9ro ou plus pour cette liaison du socket. Un client se connectant \u00E0 ce socket doit utiliser l'adresse de destination sp\u00E9cifi\u00E9e dans le mappage d'interface sortante d\u00E9sir\u00E9e. Cela permet des topologies de r\u00E9seau avanc\u00E9es qui utilisent soit la traduction d'adresses r\u00E9seau, ou ont des liaisons sur plusieurs interfaces r\u00E9seau pour fonctionner. Chaque mappage devrait \u00EAtre \u00E9valu\u00E9e dans l'ordre d\u00E9clar\u00E9, avec la premi\u00E8re adresse utilis\u00E9e pour d\u00E9terminer la destination.
socket-binding.client-mappings.source-network=R\u00E9seau source auquel la connexion client se relie. Cette valeur est sous la forme ip/masque de r\u00E9seau. Un client doit faire correspondre cette valeur \u00E0 l'interface de r\u00E9seau h\u00F4te client d\u00E9sir\u00E9 et si elle correspond, le client doit se connecter \u00E0 des valeurs de destination correspondante. Si omis, ce mappage doit correspondre \u00E0 n'importe quelle interface.
socket-binding.client-mappings.destination-address=L'adresse de destination \u00E0 laquelle un client devra se connecter si le r\u00E9seau source correspond. Cette valeur peut soit correspondre \u00E0 un nom d'h\u00F4te, soit une adresse ip.
socket-binding.client-mappings.destination-port=Le port de destination auquel un client doit se connecter si le r\u00E9seau source correspond. En cas d'oubli, ce mappage ira utiliser le port de liaison de socket qui convient.
remote-destination-outbound-socket-binding=Information de configuration pour une liaison de socket sortant, destination distante.
remote-destination-outbound-socket-binding.name=Le nom de la liaison de socket sortant. Les services qui doivent acc\u00E9der les informations de configuration du socket verront qu'il utilise ce nom.
remote-destination-outbound-socket-binding.source-interface=Le nom de l'interface qui sera utilis\u00E9e pour l'adresse source du socket sortant.
remote-destination-outbound-socket-binding.source-port=Le num\u00E9ro de port qui sera utilis\u00E9 comme port source du socket sortant.
remote-destination-outbound-socket-binding.host=Le nom d'h\u00F4te ou l'adresse IP de la destination duiistante \u00E0 laquelle ce socket sortant devra se connecter.
remote-destination-outbound-socket-binding.port=Le num\u00E9ro de port de la destination distante \u00E0 laquelle le socket sortant devra se connecter.
remote-destination-outbound-socket-binding.add=Ajoute une liaison de socket sortant de destination distante, \u00E0 un groupe de liaison de sockets.
remote-destination-outbound-socket-binding.remove=Supprime une liaison de socket sortant de destination distante, \u00E0 un groupe de liaison de sockets.
remote-destination-outbound-socket-binding.fixed-source-port=Si la valeur du port doit demeurer fix\u00E9e, m\u00EAme si les compensions num\u00E9riques sont appliqu\u00E9es \u00E0 d'autres sockets sortants du groupe de sockets.
local-destination-outbound-socket-binding=Information de configuration pour une liaison de socket sortant, destination locale.
local-destination-outbound-socket-binding.name=Le nom de la liaison de socket sortant. Les services qui doivent acc\u00E9der les informations de configuration du socket verront qu'il utilise ce nom.
local-destination-outbound-socket-binding.source-interface=Le nom de l'interface qui sera utilis\u00E9e pour l'adresse source du socket sortant.
local-destination-outbound-socket-binding.source-port=Le num\u00E9ro de port qui sera utilis\u00E9 comme port source du socket sortant.
local-destination-outbound-socket-binding.socket-binding-ref=Le nom du socket-binding local qui sera utilis\u00E9 pour d\u00E9terminer le port auquel ce socket sortant se connecte.
local-destination-outbound-socket-binding.add=Ajoute une liaison de socket sortant de destination locale, \u00E0 un groupe de liaison de sockets.
local-destination-outbound-socket-binding.remove=Supprime une liaison de socket sortant de destination locale, \u00E0 un groupe de liaison de sockets.
local-destination-outbound-socket-binding.fixed-source-port=Si la valeur du port doit demeurer fix\u00E9e, m\u00EAme si les compensions num\u00E9riques sont appliqu\u00E9es \u00E0 d'autres sockets sortants du groupe de sockets.
subsystem.describe=Produit le sous-syst\u00E8me sous forme d'une liste d'op\u00E9rations qui pourront \u00EAtre ex\u00E9cut\u00E9es pour cr\u00E9er le mod\u00E8le d'origine.
system-property.add=Ajoute une propri\u00E9t\u00E9 syst\u00E8me ou en met \u00E0 jour un d\u00E9j\u00E0 existant.
system-property.remove=Supprime une propri\u00E9t\u00E9 syst\u00E8me.
system-property.value=La valeur de la propri\u00E9t\u00E9 syst\u00E8me.
system-property.boottime=Si true, la propri\u00E9t\u00E9 syst\u00E8me sera pass\u00E9e de la ligne de commande au serveur jmv d\u00E9marr\u00E9. Si false, elle sera envoy\u00E9e dans le serveur dans le cadre d'une \u00E9tape de d\u00E9marrage.
deployment=Un d\u00E9ploiement repr\u00E9sente tout ce qui peut \u00EAtre d\u00E9ploy\u00E9 (par ex. une application comme EJB-JAR, WAR, EAR, toute sorte d'archive standard comme RAR ou un d\u00E9ploiement sp\u00E9cifique-JBoss) dans un serveur.
deployment.name=Identifiant unique du d\u00E9ploiement. Doit \u00EAtre unique \u00E0 travers tous les d\u00E9ploiements.
deployment.runtime-name=Nom par lequel le d\u00E9ploiement devra \u00EAtre connu au moment de l'ex\u00E9cution du serveur. Cela \u00E9quivaudrait au nom de fichier d'un fichier de d\u00E9ploiement et formerait la base pour une application de Java Enterprise Edition par d\u00E9faut et des noms de module. Cela serait g\u00E9n\u00E9ralement correspondre \u00E0 \u00ABname\u00BB, mais dans certains cas, les utilisateurs souhaiteraient avoir deux d\u00E9ploiements avec le m\u00EAme \u00ABruntime-name\u00BB (p. ex. deux versions de \u00AB foo.war \u00BB) tous deux disponibles dans le r\u00E9f\u00E9rentiel de contenu de d\u00E9ploiement, auquel cas, les d\u00E9ploiements doivent avoir des valeurs de \u00ABname\u00BB distinctes, mais auraient le m\u00EAme \u00ABruntime-name\u00BB.
deployment.content=Liste des pi\u00E8ces de contenu qui font partie du d\u00E9ploiement.
deployment.hash=Le hachage du contenu de d\u00E9ploiement g\u00E9r\u00E9 qui a \u00E9t\u00E9 charg\u00E9 dans le r\u00E9f\u00E9rentiel du contenu de d\u00E9ploiement du serveur autonome ou du domaine.
deployment.inputstream=L'index des flux d'entr\u00E9e  attach\u00E9s \u00E0 l'op\u00E9ration qui contient le contenu de d\u00E9ploiement devant \u00EAtre t\u00E9l\u00E9charg\u00E9 dans le r\u00E9f\u00E9rentiel de contenu de d\u00E9ploiement du serveur autonome ou du domaine.
deployment.enabled=Bool\u00E9en qui indique si le contenu du d\u00E9ploiement est actuellement d\u00E9ploy\u00E9 en runtime (ou bien s'il devra \u00EAtre d\u00E9ploy\u00E9 en cours d'ex\u00E9cution au prochain d\u00E9marrage du serveur).
deployment.persistent=Bool\u00E9en qui indique si l'existence du d\u00E9ploiement devra \u00EAtre enregistr\u00E9 dans la configuration de serveur persistante. Ne s'applique qu'\u00E0 un serveur en mode autonome. La valeur par d\u00E9faut est true. Un d\u00E9ploiement g\u00E9r\u00E9 par un scanner de d\u00E9ploiement aurait cette valeur fix\u00E9e \u00E0 false pour que le d\u00E9ploiement ne puisse uniquement \u00EAtre d\u00E9ploy\u00E9 que si le scanner d\u00E9tecte le d\u00E9ploiement.
deployment.upload-bytes=Indique que le contenu du d\u00E9ploiement du tableau d'octets inclus devra \u00EAtre ajout\u00E9 au r\u00E9f\u00E9rentiel du contenu de d\u00E9ploiement. Notez que cette op\u00E9ration n'indique pas que le contenu doit \u00EAtre d\u00E9ploy\u00E9 dans le runtime.
deployment.bytes=Tableau d'octets qui contient le contenu du d\u00E9ploiement qui devrait \u00EAtre charg\u00E9 dans le r\u00E9f\u00E9rentiel du contenu de d\u00E9ploiement du serveur autonome ou du domaine.
deployment.upload-url=Indique si le contenu de d\u00E9ploiement disponible LURL inclus devra \u00EAtre ajout\u00E9 au r\u00E9f\u00E9rentiel de contenu de d\u00E9ploiement. Notez que cette op\u00E9ration n'indique pas que le contenu doit \u00EAtre d\u00E9ploy\u00E9 dans le runtime.
deployment.url=URL o\u00F9 le contenu du d\u00E9ploiement sera rendu disponible pour t\u00E9l\u00E9charger le r\u00E9f\u00E9rentiel du contenu de d\u00E9ploiement du serveur autonome ou du domaine. Notez que l'URL devra \u00EAtre accessible \u00E0 partir de la cible de l'op\u00E9ration (c-a-d Contr\u00F4leur de domaines ou Serveur autonome).
deployment.upload-stream=Indique que le contenu de d\u00E9ploiement disponible dans l'index de flux entrant devra \u00EAtre ajout\u00E9 au r\u00E9f\u00E9rentiel de contenu de d\u00E9ploiement. Notez que cette op\u00E9ration n'indique pas que le contenu doit \u00EAtre d\u00E9ploy\u00E9 dans le runtime.
deployment.path=Chemin (relatif ou absolu) de contenu non g\u00E9r\u00E9 qui fait partie du d\u00E9ploiement.
deployment.relative-to=Nom d'un chemin syst\u00E8me relatif \u00E0 la valeur du chemin \u00ABpath\u00BB relatif. Si non d\u00E9fini, \u00ABpath\u00BB sera consid\u00E9r\u00E9 comme absolu.
deployment.archive=Indicateur d'archive compress\u00E9e (true) ou explos\u00E9e (false) de contenu non g\u00E9r\u00E9.
deployment.add=\ Ajoute le contenu pr\u00E9c\u00E9demment t\u00E9l\u00E9charg\u00E9 \u00E0 la liste de contenu disponible pour utilisation. Ne d\u00E9ploie pas r\u00E9ellement le contenu \u00E0 moins que le param\u00E8tre \u00ABenabled\u00BB (activ\u00E9) soit sur true.
deployment.deploy=D\u00E9ploie le contenu de d\u00E9ploiement sp\u00E9cifi\u00E9 dans le runtime, rempla\u00E7ant le contenu existant optionnellement.
deployment.deploy.name=Le nom du nouveau contenu.
deployment.deploy.to-replace=Le nom du contenu qui a \u00E9t\u00E9 remplac\u00E9.
deployment.replace=Remplace le contenu existant par le nouveau contenu dans le runtime. Le nouveau contenu aura d\u00E9j\u00E0 d\u00FB \u00EAtre t\u00E9l\u00E9charg\u00E9 dans le r\u00E9f\u00E9rentiel de contenu de d\u00E9ploiement.
deployment.replace.name=Le nom du nouveau contenu.
deployment.replace.to-replace=Le nom du contenu qui a \u00E9t\u00E9 remplac\u00E9.
deployment.full-replace=Ajouter le contenu du d\u00E9ploiement pr\u00E9c\u00E9demment t\u00E9l\u00E9charg\u00E9 \u00E0 la liste de contenu disponible pour une utilisation, remplacer le contenu existant du m\u00EAme nom dans le runtime et supprimer le contenu remplac\u00E9 par de la liste de contenu disponible pour utilisation. C'est \u00E9quivalent \u00E0 une s\u00E9quence 'add', 'undeploy', 'deploy', 'remove' o\u00F9 le nouveau contenu a le m\u00EAme nom que le contenu en train d'\u00EAtre remplac\u00E9. L'un des 'runtime-name', 'hash', 'input-stream-index', 'bytes' or 'url' doit \u00EAtre sp\u00E9cifi\u00E9 pr\u00E9cis\u00E9ment.
deployment.undeploy=Retirer le contenu du d\u00E9ploiement du runtime. Le contenu restera dans la liste du contenu disponible pour utilisation.
deployment.redeploy=Retirer le contenu existant du runtime et d\u00E9ployez-le \u00E0 nouveau.
deployment.status=Le statut de runtime actuel d'un d\u00E9ploiement. Les modes de statut possibles sont OK, FAILED et STOPPED. FAILED indique qu'une d\u00E9pendance manque ou qu'un service ne peut pas d\u00E9marrer. STOPPED indique que le d\u00E9ploiement n'a pas pu \u00EAtre activ\u00E9 ou qu'il a \u00E9t\u00E9 stopp\u00E9 manuellement.
deployment.subsystem=Les ressources de runtime cr\u00E9\u00E9es quand le d\u00E9ploiement \u00E9tait d\u00E9ploy\u00E9, organis\u00E9es par le sous-syst\u00E8me responsable de la ressource de runtime.
deployment.subdeployment=Les ressources de runtime associ\u00E9es \u00E0 un d\u00E9ploiement enfant empaquet\u00E9 \u00E0 l'int\u00E9rieur d'un autre d\u00E9ploiement; comme par exemple, un war \u00E0 l'int\u00E9rieur d'un ear.
global.read-attribute=Obtient la valeur d'un attribut pour une ressource s\u00E9lectionn\u00E9e.
global.read-attribute.name=Le nom de l'attribut pour obtenir la valeur sous la ressource s\u00E9lectionn\u00E9e.
global.read-attribute.include-defaults=Bool\u00E9en pour activer/d\u00E9sactiver la lecture par d\u00E9faut. Si d\u00E9fini \u00E0 false, seuls les attributs d\u00E9finis par l'utilisateur seront renvoy\u00E9s en ignorant \u00ABundefined\u00BB.
global.read-attribute.reply=La valeur de l'attribut. Le type correspondra \u00E0 celle de l'attribut trouv\u00E9.
global.read-children-names=Obtient le nom de tous les enfants sous la ressource s\u00E9lectionn\u00E9e ayant le type donn\u00E9.
global.read-children-names.child-type=Le nom du n\u0153ud sous lequel se trouve les noms des enfants. 
global.read-children-names.reply=Les noms des enfants
global.read-children-types=Obtient les noms de tous les enfants qui se trouvent sous la ressource s\u00E9lectionn\u00E9e.
global.read-children-types.reply=Les types d'enfant
global.read-children-resources=Lit les informations sur tous les enfants d'une ressource d'un type donn\u00E9
global.read-children-resources.child-type=Le nom de la ressource  sous laquelle obtenir les ressources d'en enfant
global.read-children-resources.recursive=Si l'on doit obtenir les enfants r\u00E9cursivement. Si non pr\u00E9sent, false par d\u00E9faut.
global.read-children-resources.recursive-depth=La pr\u00E9cision avec laquelle les informations sur les enfants devront \u00EAtre incluses.
global.read-children-resources.proxies=Si l'on doit inclure des ressources distantes dans une recherche r\u00E9cursive (c-a-d ressources niveau h\u00F4te dans une recherche de root de domaine; ex\u00E9cuter des ressources de serveur dans une recherche d'h\u00F4te). Si non pr\u00E9sent, false par d\u00E9faut.
global.read-children-resources.include-runtime=Si l'on doit inclure des attributs de runtime (c-a-d dont les valeurs ne proviennent pas de la configuration persistante) dans la r\u00E9ponse. Si non pr\u00E9sent, false sera la valeur par d\u00E9faut. Ignor\u00E9 si le param\u00E8tre 'r\u00E9cursif' est d\u00E9fini \u00E0 true; c-a-d si les attributs peuvent \u00EAtre lus en recherches non r\u00E9cursives.
global.read-children-resources.include-defaults=Bool\u00E9en pour activer/d\u00E9sactiver la lecture par d\u00E9faut. Si d\u00E9fini \u00E0 false, seuls les attributs d\u00E9finis par l'utilisateur seront renvoy\u00E9s en ignorant \u00ABundefined\u00BB.
global.read-children-resources.reply=Les ressources enfant
global.read-operation=Obtient les informations d'une ressource donn\u00E9e d'une op\u00E9ration.
global.read-operation.locale=Locale pour obtenir la description d'une op\u00E9ration. Si null, la locale par d\u00E9faut sera utilis\u00E9e.
global.read-operation.reply=Le nom de l'op\u00E9ration pour laquelle obtenir les d\u00E9tails.
global.read-operation.type=La description de l'op\u00E9ration. Non d\u00E9fini si non trouv\u00E9.
global.read-operation-names=Obtention des noms de toutes les op\u00E9rations pour une ressource donn\u00E9e.
global.read-operation-names.reply=Les nom de l'op\u00E9ration
global.read-resource=Lit les valeurs d'attribut de la ressource du mod\u00E8le, ainsi que l'information de base ou compl\u00E8te des ressources enfant.
global.read-resource.recursive=Si l'on doit inclure toutes les informations sur les ressources enfants r\u00E9cursivement. Si non pr\u00E9sent, false par d\u00E9faut.
global.read-resource.recursive-depth=La pr\u00E9cision avec laquelle les informations sur les enfants devront \u00EAtre incluses.
global.read-resource.proxies=Si l'on doit inclure des ressources distantes dans une recherche r\u00E9cursive (c-a-d ressources niveau h\u00F4te dans une recherche de root de domaine; ex\u00E9cuter des ressources de serveur dans une recherche d'h\u00F4te). Si absent, false par d\u00E9faut.
global.read-resource.include-runtime=Si l'on doit inclure des attributs de runtime (c-a-d dont les valeurs ne proviennent pas de la configuration persistante) dans la r\u00E9ponse, Si absent, false sera la valeur par d\u00E9faut.
global.read-resource.include-defaults=Bool\u00E9en pour activer/d\u00E9sactiver la lecture par d\u00E9faut. Si d\u00E9fini \u00E0 false, seuls les attributs d\u00E9finis par l'utilisateur seront renvoy\u00E9s en ignorant \u00ABundefined\u00BB.
global.read-resource.reply=Les valeurs d'attribut de la ressource, ainsi que l'information sur les ressources enfant.
global.read-resource-description=Obtient la description des attributs d'une ressource, des types d'enfant, et optionnellement des op\u00E9rations.
global.read-resource-description.locale=La locale pour obtenir la description de la ressource. Si null, la locale par d\u00E9faut sera utilis\u00E9e.
global.read-resource-description.operations=Si l'on doit inclure des descriptions des op\u00E9rations de la ressource. La valeur par d\u00E9faut est false.
global.read-resource-description.inherited=Si \u00ABoperation\u00BB est true, si l'on doit inclure des descriptions des op\u00E9rations h\u00E9rit\u00E9es de la ressource. La valeur par d\u00E9faut est true.
global.read-resource-description.recursive=Si l'on doit inclure r\u00E9cursivement des descriptions pour les ressources enfant. La valeur par d\u00E9faut est false.
global.read-resource-description.proxies=Si l'on doit inclure des ressources distantes dans une recherche r\u00E9cursive (c-a-d ressources niveau h\u00F4te dans une recherche de root de domaine; ex\u00E9cuter des ressources de serveur dans une recherche d'h\u00F4te). Si non pr\u00E9sent, false par d\u00E9faut.
global.read-resource-description.recursive-depth=La pr\u00E9cision avec laquelle les informations sur les enfants devront \u00EAtre incluses.
global.read-resource-description.reply=La description de la ressource
global.undefine-attribute=D\u00E9finit la valeur d'un attribut d'une ressource s\u00E9lectionn\u00E9e \u00E0 \u00ABundefined\u00BB
global.undefine-attribute.name=Le nom de l'attribut qui doit \u00EAtre d\u00E9fini \u00E0 \u00ABundefined\u00BB
global.write-attribute=Indique la valeur d'un attribut d'une ressource s\u00E9lectionn\u00E9e
global.write-attribute.name=Le nom de l'attribut dont on doit d\u00E9finir la valeur sous la ressource s\u00E9lectionn\u00E9e
global.write-attribute.value=La valeur de l'attribut dont on doit d\u00E9finir la valeur sous la ressource s\u00E9lectionn\u00E9e. Peut correspondre \u00E0 null si le mod\u00E8le sous-jacent prend en charge les valeurs null.
global.validate-address=V\u00E9rifie si une ressource ayant une adresse donn\u00E9e comme argument existe bien.
global.validate-address.value=L'adresse \u00E0 v\u00E9rifier.
global.validate-address.reply=R\u00E9sultat de la v\u00E9rification d'adresse.
global.validate-address.reply.valid=Indique si une ressource ayant une adresse donn\u00E9e comme argument existe bien.
global.validate-address.reply.problem=Inclus uniquement si l'adresse n'est pas valide et d\u00E9crit ce qui ne va pas dans l'adresse.
global.validate-operation=Confirme qu'une op\u00E9ration est valide suivant sa description. Toute erreur pr\u00E9sente appara\u00EEtra dans failure-description de l'op\u00E9ration.
global.validate-operation.value=L'op\u00E9ration \u00E0 valider.
root.composite=Une op\u00E9ration qui regroupe plusieurs demandes d'op\u00E9rations en une seule demande.
root.composite.steps=Une liste de demandes d'op\u00E9rations constituant une demande composite.
root.composite.reply=Une r\u00E9ponse d'op\u00E9rations composites qui r\u00E9unit tous les r\u00E9sultats d'\u00E9tape.
read-config-as-xml=Lit la configuration en cours et la renvoie dans un format XML.
read-config-as-xml.response=La forme XML de la configuration persistante.
jvm=La configuration JVM pour les serveurs / processus g\u00E9r\u00E9s.
jvm.add=Ajouter une configuration JVM.
jvm.remove=Supprimer une configuration JVM existante.
jvm.name=Le nom de la configuration JVM.
jvm.heap=La taille du tas ou segment de m\u00E9moire allou\u00E9 par la JVM.
jvm.heap.max=La taille maximum du tas ou segment de m\u00E9moire allou\u00E9 par la JVM.
jvm.permgen=La taille de g\u00E9n\u00E9ration permanente initiale.
jvm.permgen.max=La taille maximum de la g\u00E9n\u00E9ration permanente.
jvm.stack=Les configurations de la taille de la pile JVM.
jvm.agent.lib=JVM Agent Lib
jvm.agent.path=Le chemin d'acc\u00E8s de l'agent JVM.
jvm.javaagent=L'agent Java
jvm.option=Une option JVM
jvm.options=Les options JVM
jvm.option.add=Ajouter une option JVM
jvm.option.remove=Supprimer une option JVM
jvm.env.variables=Les variables de l'environnement JVM.
jvm.system.properties=Les propri\u00E9t\u00E9s du syst\u00E8me JVM
jvm.java.home=Java Home
jvm.type=Le type JVM peut soit \u00EAtre SUN ou IBM
jvm.debug.enabled=Valeur bool\u00E9enne qui indique si le d\u00E9bogage est activ\u00E9.
jvm.debug.options=Les options de d\u00E9bogage.
jvm.env.classpath.ignored=Ignore le chemin de classe de l'environnement.
snapshot.delete.description=Supprime un instantan\u00E9 d'un r\u00E9pertoire d'instantan\u00E9s
snapshot.delete.name=Le nom de l'instantan\u00E9 \u00E0 supprimer. Le nom complet n'est pas n\u00E9cessaire, dans la mesure o\u00F9 ce qui est fourni identifie uniquement un instantan\u00E9 du r\u00E9pertoire d'instantan\u00E9s. Si 'all' est utilis\u00E9, alors tous les instantan\u00E9s du r\u00E9pertoire d'instantan\u00E9s seront supprim\u00E9s. 
snapshot.list.description=Liste les instantan\u00E9s
snapshot.list.reply.dir=Le r\u00E9pertoire o\u00F9 se trouvent les instantan\u00E9s
snapshot.list.reply.names=Les noms des instantan\u00E9s du r\u00E9pertoire d'instantan\u00E9s
snapshot.take.description=Rel\u00E8ve un instantan\u00E9 de la configuration en cours
snapshot.take.reply.name=Lieu \u00E0 l'int\u00E9rieur du fichier sur la machine o\u00F9 se trouve la configuration
vault=Security Vault pour les attributs.
vault.code=Nom complet pour l'impl\u00E9mentation du Security Vault
vault.option=Option de Security Vault
vault.options=Options de Security Vault
vault.add=Ajouter le Security Vault
vault.remove=Supprimer le Security Vault
core.resolve-expression=Op\u00E9ration qui accepte une expression comme entr\u00E9e (ou un string qui peut \u00EAtre analys\u00E9 en expression) et qui la r\u00E9sout \u00E0 l'aide des propri\u00E9t\u00E9s du syst\u00E8me local et des variables d'environnement.
core.resolve-expression.expression=Expression \u00E0 r\u00E9soudre.
core.resolve-expression.reply=Expression r\u00E9solue, ou la forme du string de la valeur d'entr\u00E9e d'origine si elle ne repr\u00E9sente pas une expression.
