namespaces=Mapa de espacios de nombres utilizados en el documento XML de configuraci\u00F3n, en donde las llaves son prefijos de espacios de nombre  y los valores son URIs de esquemas.
namespaces.add=Agrega un mapeo de un prefijo de espacio de nombre al mapa de los atributos de los espacios de nombre.
namespaces.add.prefix=El prefijo de espacio de nombre a agregar
namespaces.add.uri=El esquema uri del espacio de nombre a agregar.
namespaces.remove=Borra un mapeo del prefijo del espacio de nombre del mapa de los atributos de los espacios de nombre.
namespaces.remove.namespace=El prefijo del espacio de nombre a borrar.
schema-locations=Mapa de la ubicaci\u00F3n de los esquemas XML utilizados en el documento XML de configuraci\u00F3n, en donde las llaves son URIs de esquema y los valores son lugares en donde se pueda encontrar el esquema.
schema-locations.add=Agrega un mapeo de ubicaci\u00F3n del esquema al mapa del atributo de ubicaci\u00F3n del esquema.
schema-locations.add.uri=El uri de la ubicaci\u00F3n del esquema a agregar
schema-locations.add.schema-location=La ubicaci\u00F3n en donde se puede encontrar el esquema agregado.
schema-locations.remove=Borra un mapeo de ubicaci\u00F3n del esquema al mapa del atributo de ubicaci\u00F3n del esquema.
schema-locations.remove.schema-uri=El URI de la ubicaci\u00F3n del esquema a borrar.
core.management=Los servicios de administraci\u00F3n utilizados para controlar un servidor aut\u00F3nomo o un controlador de hosts del host en un dominio de administraci\u00F3n.
core.management.security-realms=Los l\u00EDmites de seguridad disponibles para controlar el acceso a los servicios de administraci\u00F3n.
core.management.security-realm=Un l\u00EDmite de seguridad se puede asociar con una interfaz de administraci\u00F3n y se puede utilizar para controlar el acceso a los servicios de administraci\u00F3n.
core.management.security-realm.add=Agrega un l\u00EDmite de seguridad se puede asociar con una interfaz de administraci\u00F3n y se puede utilizar para controlar el acceso a los servicios de administraci\u00F3n.
core.management.security-realm.remove=Borra un l\u00EDmite de seguridad se puede asociar con una interfaz de administraci\u00F3n y se puede utilizar para controlar el acceso a los servicios de administraci\u00F3n.
core.management.security-realm.server-identity=Configuraci\u00F3n de las identidades que representan el servidor.
core.management.security-realm.server-identity.secret=Configuraci\u00F3n de la identidad basada en secreto/contrase\u00F1a de un servidor o controlador de host.
core.management.security-realm.server-identity.secret.add=Agregar una identidad basada en secreto/contrase\u00F1a para un servidor o controlador de host.
core.management.security-realm.server-identity.secret.remove=Borra una identidad basada en secreto/contrase\u00F1a para un servidor o controlador de host.
core.management.security-realm.server-identity.secret.value=El secreto / contrase\u00F1a - Codificado Base64.
core.management.security-realm.server-identity.ssl=Configuraci\u00F3n de la identidad SSL de un servidor o controlador de host.
core.management.security-realm.server-identity.ssl.add=Agrega la identidad SSL de un servidor o controlador de host.
core.management.security-realm.server-identity.ssl.remove=Borra la identidad SSL de un servidor o controlador de host.
core.management.security-realm.server-identity.ssl.protocol=El protocolo a usar al crear el SSLContext.
core.management.security-realm.server-identity.ssl.keystore-password=La contrase\u00F1a para abrir el almac\u00E9n de llaves.
core.management.security-realm.server-identity.ssl.keystore-path=La ruta del almac\u00E9n de llaves.
core.management.security-realm.server-identity.ssl.keystore-relative-to=El nombre de otra ruta nombrada previamente o de una de las rutas est\u00E1ndar que el sistema proporciona. Si se proporciona un 'relativo-a' entonces el valor del atributo 'ruta' se trata como relativo a la ruta especificada por este atributo.
core.management.security-realm.authentication=Configuraci\u00F3n de los mecanismos de autenticaci\u00F3n del lado del servidor. Opcionalmente se puede definir un almac\u00E9n de confianza y se puede definir un almac\u00E9n basado en el nombre de usuario/contrase\u00F1a. La autenticaci\u00F3n primero tratar\u00E1 de usar el almac\u00E9n de confianza y si no est\u00E1 disponoible regresar\u00E1 a la autenticaci\u00F3n del nombre de usuario/contrase\u00F1a. Si no se especifica ninguna de estas entonces el \u00FAnico mecanismo disponible ser\u00E1 el mecanismo local para la interfaz Native y la interfaz HTTP no ser\u00E1 accesible.
core.management.security-realm.authentication.truststore=Configuraci\u00F3n de un almac\u00E9n de llaves a utilizar para crear un administrador de confianza para verificar los clientes.
core.management.security-realm.authentication.truststore.add=Agrega un almac\u00E9n de llaves a utilizar para crear un administrador de confianza para verificar clientes. 
core.management.security-realm.authentication.truststore.remove=Borra un almac\u00E9n de llaves a utilizar para crear un administrador de confianza para verificar clientes. 
core.management.security-realm.authentication.truststore.keystore-password=La contrase\u00F1a para abrir el almac\u00E9n de llaves
core.management.security-realm.authentication.truststore.keystore-path=La ruta del almac\u00E9n de llaves.
core.management.security-realm.authentication.truststore.keystore-relative-to=El nombre de otra ruta nombrada previamente o de una de las rutas est\u00E1ndar que el sistema proporciona. Si se proporciona un 'relativo-a' entonces el valor del atributo 'ruta' se trata como relativo a la ruta especificada por este atributo.
core.management.security-realm.authentication.jaas=Configuraci\u00F3n para utilizar un JAAS LoginContext para autenticar los usuarios.
core.management.security-realm.authentication.jaas.add=Agrega una configuraci\u00F3n para usar JAAS para autenticaci\u00F3n.
core.management.security-realm.authentication.jaas.remove=Borra una configuraci\u00F3n para usar JAAS para autenticaci\u00F3n.
core.management.security-realm.authentication.jaas.name=El nombre de la configuraci\u00F3n JAAS a utilizar.
core.management.security-realm.authentication.ldap=Configuraci\u00F3n para utilizar LDAP como repositorio del usuario.
core.management.security-realm.authentication.ldap.add=Agrega una configuraci\u00F3n para utilizar LDAP como repositorio del usuario.
core.management.security-realm.authentication.ldap.remove=Borra una configuraci\u00F3n para utilizar LDAP como repositorio del usuario.
core.management.security-realm.authentication.ldap.connection=El nombre de la conexi\u00F3n a utilizar para conectarse a LDAP.
core.management.security-realm.authentication.ldap.base-dn=El nombre distinguido de base para comenzar la b\u00FAsqueda del usuario.
core.management.security-realm.authentication.ldap.recursive=Si la b\u00FAsqueda debe ser recursiva. 
core.management.security-realm.authentication.ldap.user-dn=El nombre del atributo, el cual es el nombre distinguido del usuario.
core.management.security-realm.authentication.ldap.username-attribute=El nombre del atributo para buscar el usuario. Este filtro luego realizar\u00E1 una b\u00FAsqueda simple, en donde el nombre del usuario que el usuario introduce coincide con el atributo especificado aqu\u00ED.
core.management.security-realm.authentication.ldap.advanced-filter=El filtro definido por completo a utilizar para buscar el usuario con base en el ID de usuario introducido. El filtro debe contener una variable en la forma {0} - esto se reemplazar\u00E1 con el nombre del usuario que el usuario proporcione.
core.management.security-realm.authentication.properties=Configuraci\u00F3n para utilizar una lista de usuarios almacenados dentro de un archivo de propiedades como repositorio del usuario. Las entradas dentro del archivo de propiedades son username\={credentials} cada usuarios se especifica en su propia l\u00EDnea.
core.management.security-realm.authentication.properties.add=Agrega una configuraci\u00F3n para utilizar una lista de usuarios almacenados dentro de un archivo de propiedades como repositorio del usuario.
core.management.security-realm.authentication.properties.remove=Borra una configuraci\u00F3n para utilizar una lista de usuarios almacenados dentro de un archivo de propiedades como repositorio del usuario.
core.management.security-realm.authentication.properties.path=La ruta del archivo de propiedades que contiene los usuarios.
core.management.security-realm.authentication.properties.relative-to=El nombre de otra ruta nombrada previamente o de una de las rutas est\u00E1ndar que el sistema proporciona. Si se proporciona 'relativo-a' entonces el valuor del atributo 'ruta' se trata como relativo a la ruta especificada por este atributo.
core.management.security-realm.authentication.properties.plain-text=Si las credenciales dentro del archivo de propiedades est\u00E1n almacenadas en texto simple. Si no entonces se espera que la credencial est\u00E9 codificada en hex Digest control de 'username \: realm \: password'.
core.management.security-realm.authentication.xml=Configuraci\u00F3n a utilizar una lista de usuarios almacenados directamente dentro del archivo de configuraci\u00F3n standalone.xml o host.xml como repositorio del usuario.
core.management.security-realm.authentication.xml.add=Agrega una configuraci\u00F3n para utilizar una lista de usuarios almacenados directamente dentro del archivo de configuraci\u00F3n standalone.xml o host.xml  como repositorio del usuario.
core.management.security-realm.authentication.xml.remove=Borra una configuraci\u00F3n para utilizar una lista de usuarios almacenados directamente dentro del archivo de configuraci\u00F3n standalone.xml o host.xml  como repositorio del usuario.
core.management.security-realm.authentication.xml.user=Un usuario autorizado.
core.management.security-realm.authentication.xml.user.add=Agrega un usuario autorizado.
core.management.security-realm.authentication.xml.user.remove=Borra un usuario autorizado.
core.management.security-realm.authentication.xml.user.password=La contrase\u00F1a del usuario.
core.management.security-realm.authorization=Configuraci\u00F3n del lado del servidor para cargar informaci\u00F3n adicional del usuario como los roles a utilizar para los chuqueos posteriores de autorizaci\u00F3n.
core.management.security-realm.authorization.properties=Configuraci\u00F3n a utilizar el archivo de propiedades para cargar los roles de los usuarios. Las entradas dentro del archivo de propiedades son username\={roles} en donde roles es una lista de roles de usuarios.
core.management.security-realm.authorization.properties.add=Agrega una configuraci\u00F3n para utilizar un archivo de propiedades para cargar roles de usuarios.
core.management.security-realm.authorization.properties.remove=Borra una configuraci\u00F3n para utilizar un archivo de propiedades para cargar roles de usuarios.
core.management.security-realm.authorization.properties.path=La ruta del archivo de propiedades que contiene los roles de usuarios.
core.management.security-realm.authorization.properties.relative-to=El nombre de otra ruta nombrada previamente o una de las rutas est\u00E1ndar que el  sistema proporciona. Si se proporciona 'relative-to' entonces el valor del atributo  'path' se trata como relativo a la ruta especificada por este atributo.
core.management.ldap-connections=Configuraciones de f\u00E1bricas de conexiones que un contexto de seguridad puede utilizar para acceder a servidores LDAP como fuente de autenticaci\u00F3n e informaci\u00F3n de  autorizaci\u00F3n.
core.management.ldap-connection=Una f\u00E1brica de conexiones que un dominio de seguridad puede utilizar para acceder un servidor LDAP como una fuente de autenticaci\u00F3n e informaci\u00F3n de autorizaci\u00F3n.
core.management.ldap-connection.add=Agrega una f\u00E1brica de conexiones que un dominio de seguridad puede utilizar para acceder un servidor LDAP como una fuente de autenticaci\u00F3n e informaci\u00F3n de autorizaci\u00F3n.
core.management.ldap-connection.remove=Borra una f\u00E1brica de conexiones que un dominio de seguridad puede utilizar para acceder un servidor LDAP como una fuente de autenticaci\u00F3n e informaci\u00F3n de autorizaci\u00F3n.
core.management.ldap-connection.url=La URL a usar para conectarse al servidor LDAP.
core.management.ldap-connection.search-dn=El nombre distinguido a utilizar al conectarse al servidor LDAP para realizar b\u00FAsquedas.
core.management.ldap-connection.search-credential=La credencial a utilizar al conectarse al realizar una b\u00FAsqueda.
core.management.ldap-connection.initial-context-factory=La f\u00E1brica de contexto inicial para establecer el LdapContext.
core.management.management-interfaces=Interfaces expuestas por los servicios de administraci\u00F3n para permitir que los que realizan las llamadas de manera externa realicen tareas de administraci\u00F3n.
core.management.native-interface=Configuraci\u00F3n de la interfaz de administraci\u00F3n nativa del servidor
core.management.native-interface.add=Agrega la configuraci\u00F3n de la interfaz de administraci\u00F3n nativa del servidor
core.management.native-interface.interface=Interfaz de red en la cual se debe abrir el socket del servidor para la comunicaci\u00F3n de administraci\u00F3n nativa. Debe ser 'indefinida' si se configura el atributo 'socket-binding'.
core.management.native-interface.port=Puerto en el cual se debe abrir el socket del servidor para la comunicaci\u00F3n de administraci\u00F3n nativa. Debe ser 'indefinida' si se configura el atributo 'socket-binding'.
core.management.native-interface.security-realm=Los l\u00EDmites de seguridad a utilizar para la interfaz de administraci\u00F3n nativa.
core.management.native-interface.socket-binding=El nombre de la configuraci\u00F3n de enlace de sockets a utilizar para el socket de la interfaz de administraci\u00F3n nativa.
core.management.native-remoting-interface=Configuraci\u00F3n de la interfaz de administraci\u00F3n nativa del servidor usando un conector del sub-sistema remoto.
core.management.native-remoting-interface.add=Agrega la configuraci\u00F3n de la interfaz de administraci\u00F3n nativa del servidor usando un conector del sub-sistema remoto.
core.management.http-interface=Configuraci\u00F3n de la interfaz de administraci\u00F3n HTTP del servidor
core.management.http-interface.add=Agrega la configuraci\u00F3n de la interfaz de administraci\u00F3n HTTP del servidor
core.management.http-interface.interface=Interfaz de red en la cual se debe abrir el socket del servidor para la comunicaci\u00F3n de administraci\u00F3n HTTP.
core.management.http-interface.port=Puerto en el cual se debe abrir el socket del servidor para la comunicaci\u00F3n de administraci\u00F3n HTTP.
core.service-container=El contenedor central que administra todos los servicios en un servidor aut\u00F3nomo ejecutando en un controlador host en un dominio de administraci\u00F3n.
extension=Un m\u00F3dulo que extiende todas las funcionalidades est\u00E1ndar de un dominio o un servidor aut\u00F3nomo.
extension.module=El nombre del m\u00F3dulo.
extension.add=Agrega una extensi\u00F3n.
extension.remove=Borra una extensi\u00F3n.
extension.subsystem=Un sub-sistema proporcionado por la extensi\u00F3n. Aqu\u00ED lo que le brindamos es  informaci\u00F3n sobre el esquema xml y la interfaz de administraci\u00F3n que el subsistema proporciona no la configuraci\u00F3n del sub-sistema mismo. 
extension.subsystem.xml-namespaces=Una lista de URIs para los espacios de nombre XML soportados por el analizador sint\u00E1ctico XML del sub-sistema. Puede estar vac\u00EDo si la extensi\u00F3n no asoci\u00F3 claramente un espacio de nombre XML con un sub-sistema en particular.
extension.subsystem.management-major-version=Versi\u00F3n importante de la interfaz de administraci\u00F3n del sub-sistema. Puede estar indefinido si el subsistema actualmente no proporciona una interfaz de administraci\u00F3n con versiones.
extension.subsystem.management-minor-version=Versi\u00F3n menor de la interfaz de administraci\u00F3n del sub-sistema. Puede estar indefinido si el subsistema actualmente no proporciona una interfaz de administraci\u00F3n con versiones.
named_path=Una ruta nombrada del sistema de archivos pero sin ning\u00FAn requerimiento para especificar la ruta. Si no se especifica una ruta IP entonces act\u00FAa como un comod\u00EDn en el modelo (por ejemplo, a nivel del dominio) hasta que se aplica una definici\u00F3n de ruta completamente especificada en un nivel m\u00E1s bajo (por ejemplo, a nivel de host, donde se conocen las direcciones disponibles).
specified_path=Una ruta nombrada del sistema de archivos.
path.name=El nombre de la ruta. No puede ser una de las rutas fijas est\u00E1ndar que el sistema proporciona\: <ul><li>jboss.home - el directorio ra\u00EDz de la distribuci\u00F3n JBoss AS</li><li>user.home - directorio de inicio del usuario</li><li>user.dir - directorio de trabajo actual del usuario</li><li>java.home - java installation directory</li><li>jboss.server.base.dir - directorio ra\u00EDz para una instancia individual del servidor</li></ul> Note que el sistema proporciona otras rutas est\u00E1ndar que se pueden sobreescribir declar\u00E1ndolas en el archivo de configuraci\u00F3n. Vea la documentaci\u00F3n del atributo 'relative-to' para ver una lista completa de rutas est\u00E1ndar.
path.path=La ruta real del sistema de archivos. Tratada como una ruta absoluta a menos de que se especifique el atributo 'relative-to', en cuyo caso el valuor se trata como relativo a esa ruta. <p>Si se trata como una ruta absoluta entonces el nombre de la ruta real en tiempo de ejecuci\u00F3n especificado por el valor de este atributo se determinar\u00E1 as\u00ED\: </p>Si este valor ya es absoluto entonces el valor se utiliza directamente. De otra manera, el nombre de ruta en tiempo de ejecuci\u00F3n se resuelve de una manera dependiente del sistema.  En sistemas UNIX, un nombre de ruta relativo se hace absoluto resolvi\u00E9ndolo frente al directorio del usuario actual. En sistemas Microsoft Windows, un nombre de ruta  relativo se hace absoluto resolvi\u00E9ndolo frente al directorio actual del controlador nombrado por el nombre de la ruta, si hay uno; si no entonces se resuelve frente al directorio del usuario actual.
path.relative-to=El nombre de otra ruta nombrada previamente o de una de las rutas est\u00E1ndar que el  sistema proporciona. Si se brinda 'relative-to' entonces el valor del atributo 'path' se trata como relativo a la ruta especificada por este atributo. Las rutas est\u00E1ndar que el sistema proporciona incluyen\:<ul><li>jboss.home - el directorio ra\u00EDz de la distribuci\u00F3n JBoss AS</li><li>user.home - el directorio de inicio del usuario</li><li>user.dir - el directorio de trabajo actual del usuario</li><li>java.home - directorio de instalaci\u00F3n java</li><li>jboss.server.base.dir - directorio ra\u00EDz para una instancia individual del servidor</li><li>jboss.server.data.dir - directorio que el servidor utilizar\u00E1 para almacenamiento de archivos de datos persistentes</li><li>jboss.server.log.dir - directorio que el servidor utilizar\u00E1 para el almacenamiento de archivos de registro</li><li>jboss.server.tmp.dir - directorio que el servidor utilizar\u00E1 para almacenamiento de archivos temporales</li><li>jboss.domain.servers.dir - directorio bajo el cual un controlador de hosts crear\u00E1 el \u00E1rea de trabajo para instancias individuales del servidor</li></ul>
path.add=Agregar una nueva ruta.
path.add.path=El valor del atributo 'path' de la ruta
path.add.relative-to=El valor del atributo 'relative-to' de la ruta
path.remove=Borrar una ruta
profile=Un grupo nombrado de configuraciones del sub-sistema.
profile.name=El nombre del perfil
profile.add=Agregar un nuevo 'profile'
profile.add.includes=El valor del nuevo atributo 'includes' del perfil
profile.describe=Presenta como salida los sub-sistemas del perfil como una lista de operaciones que se pueden ejecutar para crear el mismo modelo. 
profile.remove=Borrar un 'profile'
profile.remove.name=El valor del atributo 'name' del perfil
profile.includes=Una lista de otros perfiles a incluir en este perfil
profile.include=Especifica que el contenido de un perfil nombrado se debe incluir en el perfil cuya definici\u00F3n incluya este objeto.
profile.include.profile=El nombre del perfil inclu\u00EDdo
profile.includes.add=Agregar un perfil a la lista de los perfiles inclu\u00EDdos
profile.includes.add.include=El nombre del perfil inclu\u00EDdo
profile.includes.remove=Borrar un perfil de la lista de perfiles inclu\u00EDdos
profile.includes.remove.include=El nombre del perfil inclu\u00EDdo
profile.subsystem=Los sub-sistemas que componen el perfil.
named_interface=Una interfaz de red nombrada pero sin ning\u00FAn criterio requerido para determinar la direcci\u00F3n IP a la cual asociar  esa interfaz. Si no se define un criterio de selecci\u00F3n de la direcci\u00F3n IP entonces act\u00FAa como un comod\u00EDn en el modelo (por ejemplo, a nivel del dominio) hasta que se aplica una definici\u00F3n de interfaz completamente especificada en un nivel m\u00E1s bajo (por ejemplo, a nivel de host, donde se conocen las direcciones disponibles).
specified_interface=Una interfaz de red nombrada junto con el criterio requerido para determinar la direcci\u00F3n IP a la cual asociar esa interfaz.
interface.name=El nombre de la interfaz.
interface.criteria=Obsoleto. Un grupo de criterios que se pueden utilizar en tiempo de ejecuci\u00F3n para determinar la direcci\u00F3n IP a utilizar para una interfaz.
interface.add=Agregar una nueva especificaci\u00F3n de la interfaz.
interface.add.criteria=Obsoleto.
interface.remove=Borra una especificaci\u00F3n de interfaz.
interface.any-address=Atributo que indica que los sockets utilizando esta interfaz se deben enlazar a una direcci\u00F3n comod\u00EDn. LA direcci\u00F3n comod\u00EDn IPv6 (\:\:) se utilizar\u00E1 a menos de que la propiedad del sistema java.net.preferIpV4Stack se configure como verdadera, en cuyo caso se utilizar\u00E1 la direcci\u00F3n comod\u00EDn IPv4 (0.0.0.0). Si un socket est\u00E1 enlzado a una direcci\u00F3n local IPv6 en una m\u00E1quina con doble pila, puede aceptar t\u00E1fico IPv6 y IPv4; si est\u00E1 enlzado a una direcci\u00F3n local IPv4 (mapeado para IPv4) s\u00F3lo puede aceptar tr\u00E1fico IPv4.
interface.any-ipv4-address=Atributo que indica que los sockets utilizando esta interfaz se deben enlazar a la direcci\u00F3n comod\u00EDn IPv4 (0.0.0.0).
interface.any-ipv6-address=Atributo que indica que los sockets utilizando esta interfaz se deben enlazar a la direcci\u00F3n comod\u00EDn IPv6 (\:\:).
interface.inet-address=Atributo que indica que parte del criterio de selecci\u00F3n para escoger una direcci\u00F3n IP para esta interfaz debe o no debe ser que la direcci\u00F3n coincida con el valor dado. El valor puede ser una direcci\u00F3n IP en IPv6 o en notaci\u00F3n decimal IPv4 o un nombre de host que se pueda resolver a una direcci\u00F3n IP. Un valor 'indefinido' significa que este atributo no es relevante a la selecci\u00F3n de direcci\u00F3n IP.
interface.link-local-address=Atributo que indica que parte del criterio de selecci\u00F3n para escoger una direcci\u00F3n IP para esta interfaz debe o no debe ser que la direcci\u00F3n es de enlace local (link-local). Un valor de 'indefinido' o 'falso'  significa que este atributo no es relevante para la selecci\u00F3n de direcci\u00F3n IP.
interface.loopback=Atributo que indica que parte del criterio de selecci\u00F3n para escoger una direcci\u00F3n IP para esta interfaz debe ser o no que la direcci\u00F3n sea loopback. Un valor de 'indefinido' o 'falso'  significa que este atributo no es relevante para la selecci\u00F3n de direcci\u00F3n IP.
interface.loopback-address=Atributo que indica que la direcci\u00F3n IP para esta interfaz debe ser el valor dado si existe una interfaz loopback en la m\u00E1quina. Es posible que una 'direcci\u00F3n loopback' no est\u00E9 configurada en la interfaz loopback de la m\u00E1quina. Difiere de la direcci\u00F3n inet ya que el valor dado se utilizar\u00E1 incluso si no se puede encontrar un NIC que tenga la direcci\u00F3n IP especificada asociada con esta. Un valor de 'indefinido' o 'falso'  significa que este atributo no es relevante para la selecci\u00F3n de direcci\u00F3n IP.
interface.multicast=Atributo que indica que parte del criterio de selecci\u00F3n para escoger una direcci\u00F3n IP para esta interfaz debe o no debe ser que la interfaz de red soporte multicast. Un valor de 'indefinido' o 'falso'  significa que este atributo no es relevante para la selecci\u00F3n de direcci\u00F3n IP.
interface.nic=Atributo que indica que parte del criterio de selecci\u00F3n para escoger una direcci\u00F3n IP para esta interfaz debe o no debe ser que la interfaz de red tenga el nombre dado. El nombre de una interfaz de red (por ejemplo, eth0, eth1, lo). Un valor de 'indefinido'  significa que este atributo no es relevante para la selecci\u00F3n de direcci\u00F3n IP.
interface.nic-match=Atributo que indica que parte del criterio de selecci\u00F3n para escoger una direcci\u00F3n IP para esta interfaz debe ser si su interfaz de red tiene un nombre que coincida con la expresi\u00F3n regular dada. El valor es una expresi\u00F3n regular frente a la cual los nombres de las interfaces de red disponibles en la m\u00E1quina coincidan para poder encontrar una interfaz aceptable. Un valor de 'indefinido'  significa que este atributo no es relevante para la selecci\u00F3n de direcci\u00F3n IP.
interface.point-to-point=Atributo que indica que parte del criterio de selecci\u00F3n para escoger una direcci\u00F3n IP para esta interfaz debe ser o no que la interfaz de red sea una interfaz de punto-a-punto. Un valor de 'indefinido' o 'falso'  significa que este atributo no es relevante para la selecci\u00F3n de direcci\u00F3n IP.
interface.public-address=Atributo que indica que parte del criterio de selecci\u00F3n para escoger una direcci\u00F3n IP para esta interfaz debe ser o no que la direcci\u00F3n sea una direcci\u00F3n enrutable p\u00FAblicamente. Un valor de 'indefinido' o 'falso'  significa que este atributo no es relevante para la selecci\u00F3n de direcci\u00F3n IP.
interface.site-local-address=Atributo que indica que parte del criterio de selecci\u00F3n para escoger una direcci\u00F3n IP para esta interfaz debe ser o no que la direcci\u00F3n sea local. Un valor de 'indefinido' o 'falso'  significa que este atributo no es relevante para la selecci\u00F3n de direcci\u00F3n IP.
interface.subnet-match=Atributo que indica que parte del criterio de selecci\u00F3n para escoger una direcci\u00F3n IP para esta interfaz debe ser o no que la direcci\u00F3n est\u00E9 inclu\u00EDda en la definici\u00F3n de la subred dada. El valor es una direcci\u00F3n IP de red y el n\u00FAmero de bits en el prefijo de red de la direcci\u00F3n escrita despu\u00E9s de la "barra"; por ejemplo,  "192.168.0.0/16". Un valor 'indefinido' significa que este atributo no es relevante a la selecci\u00F3n de direcci\u00F3n IP.
interface.up=Atributo que indica que parte del criterio de selecci\u00F3n para escoger una direcci\u00F3n IP para esta interfaz debe o no debe ser que la interfaz de red est\u00E9 trabajando. Un valor de 'indefinido' o 'falso'  significa que este atributo no es relevante para la selecci\u00F3n de direcci\u00F3n IP.
interface.virtual=Atributo que indica que parte del criterio de selecci\u00F3n para escoger una direcci\u00F3n IP para esta interfaz debe o no debe ser que la interfaz de red sea virtual. Un valor de 'indefinido' o 'falso'  significa que este atributo no es relevante para la selecci\u00F3n de direcci\u00F3n IP.
interface.not=Atributo que indica que parte del criterio de selecci\u00F3n para escoger una direcci\u00F3n IP para esta interfaz debe ser que la direcci\u00F3n IP *no* coincida con ning\u00FAn del criterio del grupo anidado. El valor del atributo es un grupo de criterios (por ejemplo,  'loopback') cuyo significado normal se invierte). Un valor de 'indefinido'  significa que este atributo no es relevante para la selecci\u00F3n de direcci\u00F3n IP.
interface.any=Atributo que indica que parte del criterio de selecci\u00F3n para escoger una direcci\u00F3n IP para esta interfaz debe ser que la direcci\u00F3n IP coincida con por lo menos uno de los criterios de un grupo anidado sin necesariamente coincidir con todos los criterios anidados. El valor del atributo es un grupo de criterios. Un valor de 'indefinido'  significa que este atributo no es relevante para la selecci\u00F3n de direcci\u00F3n IP.
socket-binding-group=Contiene una lista de configuraciones de socket.
socket-binding-group.name=El nombre del grupo de enlaces de sockets.
socket-binding-group.default-interface=Nombre de una interfaz que se debe utilizar como la interfaz para cualquier socket que no declare uno expl\u00EDcitamente.
socket-binding-group.socket-binding=Configuraciones de sockets individuales.
socket-binding-group.port-offset=Incremento a aplicar a los valores de puertos base definidos en los enlaces de socket para derivar los valores de tiempo de ejecuci\u00F3n a utilizar en este servidor.
socket-binding-group.includes=Una lista de nombre de grupos de enlace de sockete, cuyos enlaces se incluyan en este socket-binding-group. Esta interfaz predeterminada del grupo de enlace se aplicar\u00E1 a cualquier enlace inclu\u00EDdo que no especifique una interfaz.
socket-binding-group.add=Agrega un grupo de enlaces de sockets
socket-binding-group.remove=Borra un grupo de enlaces de sockets
socket-binding-group.include.add=Agrega un grupo de enlaces de sockets al atributo 'includes' del grupo de enlances de sockets.
socket-binding-group.include.add.include=El nombre del grupo de enlaces de sockets a incluir.
socket-binding-group.include.remove=Borra un grupo de enlaces de sockets del atributo 'includes' del grupo de enlances de sockets.
socket-binding-group.include.remove.include=El nombre del grupo de enlaces de sockets que ya no se va a incluir.
socket-binding=Informaci\u00F3n de configuraci\u00F3n para un socket.
socket-binding.name=Borra un elemento de configuraci\u00F3n de bloqueo del cach\u00E9.
socket-binding.interface=Nombre de la interfaz a la cual el socket se debe enlazar o para sockets multicast, la interfaz en la cual se debe escuchar. Esta debe ser una de las interfaces declaradas.
socket-binding.port=N\u00FAmero del puerto al cual se debe enlazar el socket.
socket-binding.fixed-port=Si el valor del puerto debe permanecer fijo incluso si se aplican compensaciones num\u00E9ricas a los otros sockets en el grupo de sockets.
socket-binding.multicast-address=Direcci\u00F3n multicast en la cual el socket debe recibri tr\u00E1fico multicast. Si no se especifica el socket no se configurar\u00E1 para recibir multicast.
socket-binding.multicast-port=Puerto en el cual el socket debe recibir tr\u00E1fico multicast. Se debe configurar si  'multicast-address' es configurado.
socket-binding.add=Agrega una configuraci\u00F3n de enlaces de sockets al grupo.
socket-binding.remove=Borra una configuraci\u00F3n de enlaces de sockets del grupo.
socket-binding.bound=Si se ha enlazado un socket utilizando esta configuraci\u00F3n de enlace de sockets.
socket-binding.bound-address=La direcci\u00F3n a la cual el socket utilizando esta configuraci\u00F3n de enlace de sockets se ha enlazado o es indefinido si no se ha enlazado ning\u00FAn socket.
socket-binding.bound-port=El puerto al cual se ha enlazado el socket que est\u00E1 utilizando esta configuraci\u00F3n de enlace de sockets o es indefinido si no se ha enlazado ning\u00FAn socket.
socket-binding.client-mappings=Especifica cero o m\u00E1s mapeos de cliente para este enlace de sockets. Un cliente que se conecta a este socket debe usar la direcci\u00F3n de destino especificada en el mapeo que coincide con su interfaz de salida deseada. Esto tiene en cuenta las topolog\u00EDas de red avanzadas que usan la traducci\u00F3n de direcciones de red o tienen enlaces en m\u00FAltiples interfaces de red a funcionar. Cada mapeo se debe evaluar en el orden declarado  y se utiliza la primera coincidencia para determinar el destino.
socket-binding.client-mappings.source-network=Red fuente a la cual se enlaza la conexi\u00F3n del cliente. Este valor es de la forma ip/m\u00E1scara de red. Un cliente debe coincidir con este valor frente a la interfaz de red host cliente deseado y si coincide entonces el cliente debe conectarse a los valores de destino correspondientes. Si se omite entonces este mapeo debe coincidir con cualquier interfaz.
socket-binding.client-mappings.destination-address=La direcci\u00F3n de destino a la cual se debe conectar un cliente si la red fuente coincide. Este valor puede ser un nombre de host o una direcci\u00F3n ip.
socket-binding.client-mappings.destination-port=El puerto de destino al cual se debe conectar un cliente si la red fuente coincide. Si se omite entonces este mapeo re-utilizar\u00E1 el puerto de enlace de sockets efectivo.
remote-destination-outbound-socket-binding=Informaci\u00F3n de configuraci\u00F3n para un destino remoto o un enlace de socket saliente. 
remote-destination-outbound-socket-binding.name=Nombre del enlace de socket saliente. Los servicios que necesitan acceder a la informaci\u00F3n de configuraci\u00F3n del socket la encontrar\u00E1n usando este nombre.
remote-destination-outbound-socket-binding.source-interface=El nombre de la interfaz que se utilizar\u00E1 para la direcci\u00F3n fuente del socket saliente.
remote-destination-outbound-socket-binding.source-port=N\u00FAmero del puerto el cual se utilizar\u00E1 como puerto fuente del socket saliente.
remote-destination-outbound-socket-binding.host=El nombre del host o la direcci\u00F3n IP del destino remoto al cual se conectar\u00E1 este socket saliente.
remote-destination-outbound-socket-binding.port=N\u00FAmero del puerto del destino remoto al cual se debe conectar el socket saliente. 
remote-destination-outbound-socket-binding.add=Agrega un enlace de socket saliente de destino remoto a un grupo de enlace de sockets
remote-destination-outbound-socket-binding.remove=Borra un enlace de socket saliente de destino remoto de un grupo de enlace de sockets
remote-destination-outbound-socket-binding.fixed-source-port=Si el valor del puerto debe permanecer fijo incluso si se aplican compensaciones num\u00E9ricas a los otros sockets salientes en el grupo de sockets.
local-destination-outbound-socket-binding=Informaci\u00F3n de configuraci\u00F3n para un destino local o un enlace de socket saliente. 
local-destination-outbound-socket-binding.name=Nombre del enlace de socket saliente. Los servicios que necesitan acceder a la informaci\u00F3n de configuraci\u00F3n del socket la encontrar\u00E1n usando este nombre.
local-destination-outbound-socket-binding.source-interface=El nombre de la interfaz que se utilizar\u00E1 para la direcci\u00F3n fuente del socket saliente.
local-destination-outbound-socket-binding.source-port=N\u00FAmero del puerto el cual se utilizar\u00E1 como puerto fuente del socket saliente.
local-destination-outbound-socket-binding.socket-binding-ref=El nombre del enlace de socket local que se utilizar\u00E1 para determinar el puerto al cual se conecta este socket saliente.
local-destination-outbound-socket-binding.add=Agrega un enlace de socket saliente de destino local a un grupo de enlace de sockets
local-destination-outbound-socket-binding.remove=Borra un enlace de socket saliente de destino local de un grupo de enlace de sockets
local-destination-outbound-socket-binding.fixed-source-port=Si el valor del puerto debe permanecer fijo incluso si se aplican compensaciones num\u00E9ricas a los otros sockets salientes en el grupo de sockets.
subsystem.describe=Presenta el sub-sistema como una lista de operaciones que se pueden ejecutar para crear el modelo original. 
system-property.add=Agrega una propiedad del sistema o actualiza una existente.
system-property.remove=Borra una propiedad del sistema. 
system-property.value=El valor de la propiedad del sistema.
system-property.boottime=Si es verdadero entonces la propiedad del sistema se pasa a la l\u00EDnea de comandos a la MVJ del servidor iniciado. Si es falso entonces se enviar\u00E1 al servidor como parte de la secuencia de arranque.
deployment=Una implementaci\u00F3n representa cualquier cosa que se pueda implementar (por ejemplo, una aplicaci\u00F3n tal como EJB-JAR, WAR, EAR, cualquier clase de fichero est\u00E1ndar tal como RAR o implementaci\u00F3n especifica de JBoss) en un servidor.
deployment.name=Identificador \u00FAnico de la implementaci\u00F3n. Debe ser \u00FAnico a trav\u00E9s de todas las implementaciones.
deployment.runtime-name=Nombre por el cual se debe conocer la implementaci\u00F3n dentro del tiempo de ejecuci\u00F3n de un servidor. Esto ser\u00EDa equivalente al nombre del archivo de un archivo de implementaci\u00F3n y formar\u00EDa la base para tales cosas como la aplicaci\u00F3n predeterminada Java Enterprise Edition y los nombres de los m\u00F3dulos. Usualmente esto ser\u00EDa lo mismo que 'nombre', pero en algunos casos es posible que los usuarios deseen tener dos implementaciones con el mismo 'nombre-tiempo de ejecuci\u00F3n' (por ejemplo, dos versiones de "foo.war") ambas disponibles en el repositorio de contenido de la implementaci\u00F3n, en cuyo caso las implementaciones necesitar\u00EDan tener diferentes valores de 'nombre' pero tendr\u00EDan el mismo 'nombre-tiempo de ejecuci\u00F3n'.
deployment.content=Lista de partes del contenido que componen la implementaci\u00F3n.
deployment.hash=El hash de contenido de la implementaci\u00F3n administrada que se ha cargado al repositorio de contenido de la implementaci\u00F3n del servidor aut\u00F3nomo o del dominio.
deployment.inputstream=El \u00EDndice en los flujos de entrada adjuntos de la operaci\u00F3n del flujo de entrada que tiene contenido de implementaci\u00F3n que se debe cargar en el repositorio de contenido de la implementaci\u00F3n del servidor aut\u00F3nomo o del dominio.
deployment.enabled=Valor boolean que indica si el contenido de la implementaci\u00F3n se implementa actualmente en el tiempo de ejecuci\u00F3n (o se debe implementar en el tiempo de ejecuci\u00F3n la siguiente vez que el servidor inicia).
deployment.persistent=Valor boolean que indica si la existencia de la implementaci\u00F3n se debe registrar en la configuraci\u00F3n del servidor persistente. S\u00F3lo es relevante para un servidor en modo aut\u00F3nomo. Por defecto es verdadero. Una implementaci\u00F3n administrada por un escaner de implementaci\u00F3n tendria esto establecido como falso para asegurarse de que la implementaci\u00F3n s\u00F3lo se implementa en el arranque del servidor si el escaner detecta de nuevo la implementaci\u00F3n.
deployment.upload-bytes=Indica que el contenido de la implementaci\u00F3n en el array de bystes inclu\u00EDdo se debe agregar al repositorio de contenido de la implementaci\u00F3n. Note que esta  operaci\u00F3n no indica que el contenido se debe implementar en el tiempo de ejecuci\u00F3n.
deployment.bytes=Array de bytes que contiene el contenido de implementaci\u00F3n que se debe cargar en el repositorio de contenido de la implementaci\u00F3n del servidor aut\u00F3nomo o del dominio.
deployment.upload-url=Indica que el contenido de la implementaci\u00F3n disponible en la URL inclu\u00EDda se debe agregar al repositorio de contenido de la implementaci\u00F3n. Note que esta  operaci\u00F3n no indica que el contenido se debe implementar en el tiempo de ejecuci\u00F3n.
deployment.url=La URL en la cual el contenido de implementaci\u00F3n est\u00E1 disponible para cargar en el repositorio de contenido de la implementaci\u00F3n del servidor aut\u00F3nomo o del dominio. Note que la URL debe ser accesible desde el destino de la operaci\u00F3n (es decir, el controlador de dominio o el servidor aut\u00F3nomo).
deployment.upload-stream=Indica que el contenido de la implementaci\u00F3n disponible en el \u00EDndice de flujo de entrada se debe agregar al repositorio de contenido de la implementaci\u00F3n. Note que esta  operaci\u00F3n no indica que el contenido se debe implementar en el tiempo de ejecuci\u00F3n.
deployment.path=Ruta (relativa o absoluta) al contenido no administrado que es parte de la implementaci\u00F3n.
deployment.relative-to=Nombre de una ruta del sistema para el cual el valor de la 'ruta' es relativa. Si no est\u00E1 establecido entonces la 'ruta' se considera como absoluta.
deployment.archive=Bandera que indica si el contenido no administrado en un fichero zip (verdadero) o expandido (falso).
deployment.add=Agrega contenido cargado con anterioridad a la lista de contenido disponible para ser utilizado. No implementa el contenido a menos de que el par\u00E1metro 'habilitado' sea 'verdadero'.
deployment.deploy=Implementa el contenido de implementaci\u00F3n especificado en el tiempo de ejecuci\u00F3n opcionalmente reemplazando el contenido existente.
deployment.deploy.name=El nombre del nuevo contenido.
deployment.deploy.to-replace=El nombre del contenido que se va a reemplazar.
deployment.replace=Reemplace el contenido existente en el tiempo de ejecuci\u00F3n con el nuevo contenido. El nuevo contenido se debe haber cargado previamente en el repositorio de contenido de la implementaci\u00F3n.
deployment.replace.name=El nombre del nuevo contenido.
deployment.replace.to-replace=El nombre del contenido que se va a reemplazar.
deployment.full-replace=Agrega el contenido de implementaci\u00F3n cargado anteriormente a la lista de contenido disponible para utilizaci\u00F3n, reemplaza el contenido existente del mismo nombre en el tiempo de ejecuci\u00F3n y borra el contenido reemplazado de la lista de contenido disponible para utilizaci\u00F3n. Esto es equivalente a una secuencia 'add', 'undeploy', 'deploy', 'remove' en donde el nuevo contenido tiene el mismo nombre que el contenido que se est\u00E1 reemplazando. Se debe especificar precisamente  'runtime-name', 'hash', 'input-stream-index', 'bytes' o 'url'.
deployment.undeploy=Borrar la implementaci\u00F3n del contenido del tiempo de ejecuci\u00F3n. El contenido permanece en la lista de contenido disponible para uso.
deployment.redeploy=Borrar la implementaci\u00F3n del contenido existente del tiempo de ejecuci\u00F3n y volverlo a implementar de nuevo.
deployment.status=El estatus de ejecuci\u00F3n actual de una implementaci\u00F3n. Los modos de estatus posibles son OK, FAILED y STOPPED. FAILED indica que falta una dependencia o que un servicio no pudo iniciar. STOPPED indica que la implementaci\u00F3n no se habilit\u00F3 o que se detuvo de manera manual.
deployment.subsystem=Recursos del tiempo de ejecuci\u00F3n creados cuando la implementaci\u00F3n se despliega, organizados por el sub-sistema responsable del recurso del tiempo de ejecuci\u00F3n.
deployment.subdeployment=Recursos del tiempo de ejecuci\u00F3n asociados con una implementaci\u00F3n hija empacada dentro de otra implementaci\u00F3n; por ejemplo un war empacado dentro de un ear.
global.read-attribute=Obtiene el valor de un atributo para el recurso seleccionado
global.read-attribute.name=El nombre del atributo para el cual obtener el valor bajo el recurso seleccionado
global.read-attribute.include-defaults=Boolean para habilitar/inhabilitar la lectura predeterminada. En el caso de que est\u00E9 configurado como falso s\u00F3lo se retornan los atributos establecidos por un usuario ignorando los indefinidos.
global.read-attribute.reply=El valor del atributo. El tipo ser\u00E1 el del atributo encontrado
global.read-children-names=Obtiene los nombres de todos los hijos bajo el recurso seleccionado con el tipo dado
global.read-children-names.child-type=El nombre del nodo bajo el cual se obtienen los nombres de los hijos
global.read-children-names.reply=Los nombres de los hijos
global.read-children-types=Obtiene los nombres de los tipos de todos los hijos bajo el recurso seleccionado
global.read-children-types.reply=Los tipos de hijos
global.read-children-resources=Lee la informaci\u00F3n sobre los hijos de un recurso que son de un tipo dado
global.read-children-resources.child-type=El nombre del recurso bajo el cial obtener los recursos hijos
global.read-children-resources.recursive=Si debe obtener los hijos de manera recursiva. El valor predeterminado es falso si no est\u00E1 presente. 
global.read-children-resources.recursive-depth=La profundidad bajo la cual se debe incluir la informaci\u00F3n sobre los recursos hijos.
global.read-children-resources.proxies=Si debe incluir recursos remotos en una petici\u00F3n recursiva (es decir recursos a nivel de host en una petici\u00F3n de la ra\u00EDz dominio; ejecutando recursos del servidor en una petici\u00F3n de un host). Si no est\u00E1 presente entonces por defecto es falso
global.read-children-resources.include-runtime=Si debe incluir atributos en el tiempo de ejecuci\u00F3n (es decir, aquellos valores que no provienen de la configuraci\u00F3n persistente) en la respuesta. Si no est\u00F1a presente entonces es falso por defecto. Se ignora si el par\u00E1metro 'recursive' se establece como 'verdadero'; es decir, los atributos del tiempo de ejecuci\u00F3n s\u00F3lo se pueden leer en peticiones no-recursivas.
global.read-children-resources.include-defaults=Boolean para habilitar/inhabilitar la lectura predeterminada. En el caso de que est\u00E9 configurado como falso s\u00F3lo se retornan los atributos establecidos por un usuario ignorando los indefinidos.
global.read-children-resources.reply=Los recursos de los hijos
global.read-operation=Obtiene los detalles de una operaci\u00F3n para el recurso dado
global.read-operation.locale=El local para obtener la descripci\u00F3n de la operaci\u00F3n. Si es nulo entonces se utilizar\u00E1 el local predeterminado
global.read-operation.reply=El nombre de la operaci\u00F3n para la cual se deben obtener detalles
global.read-operation.type=La descripci\u00F3n de la operaci\u00F3n. No definido si no se encuentra
global.read-operation-names=Obtiene los nombres de todas las operaciones para el recurso dado
global.read-operation-names.reply=Los nombres de las operaciones
global.read-resource=Lee los valores del atributo del recurso modelo junto con informaci\u00F3n b\u00E1sica o completa sobre los recursos hijos
global.read-resource.recursive=Si debe incluir informaci\u00F3n completa sobre los recursos hijos de manera recursiva. El valor predeterminado es falso si no est\u00E1 presente. 
global.read-resource.recursive-depth=La profundidad bajo la cual se debe incluir la informaci\u00F3n sobre los recursos hijos.
global.read-resource.proxies=Si debe incluir recursos remotos en una petici\u00F3n recursiva (es decir recursos a nivel de host en una petici\u00F3n de la ra\u00EDz dominio; ejecutando recursos del servidor en una petici\u00F3n de un host). Si no est\u00E1 presente entonces por defecto es falso.
global.read-resource.include-runtime=Si debe incluir atributos en el tiempo de ejecuci\u00F3n (es decir, aquellos valores que no provienen de la configuraci\u00F3n persistente) en la respuesta. Si no est\u00E1 presente entonces es falso por defecto.
global.read-resource.include-defaults=Boolean para habilitar/inhabilitar la lectura predeterminada. En el caso de que est\u00E9 configurado como falso s\u00F3lo se retornan los atributos establecidos por un usuario ignorando los indefinidos.
global.read-resource.reply=Los valores del atributo del recurso junto con informaci\u00F3n sobre los recursos hijos
global.read-resource-description=Obtiene la descripci\u00F3n de los atributos de un recurso, los tipos de hijos y  opcionalmente las operaciones
global.read-resource-description.locale=El local para obtener la descripci\u00F3n del recurso. Si es nulo entonces se utilizar\u00E1 el local predeterminado
global.read-resource-description.operations=Si debe incluir descripciones de las operaciones del recurso. Por defecto es falso
global.read-resource-description.inherited=Si 'operations' es verdadero entonces si debe incluir descripciones de las operaciones heredadas del recurso. Por defecto es verdadero.
global.read-resource-description.recursive=Si debe incluir descripciones recursivas de recursos hijos. Por defecto es falso
global.read-resource-description.proxies=Si debe incluir recursos remotos en una petici\u00F3n recursiva (es decir recursos a nivel de host en una petici\u00F3n de la ra\u00EDz dominio; ejecutando recursos del servidor en una petici\u00F3n de un host). Si no est\u00E1 presente entonces por defecto es falso
global.read-resource-description.recursive-depth=La profundidad bajo la cual se debe incluir la informaci\u00F3n sobre los recursos hijos.
global.read-resource-description.reply=La descripci\u00F3n del recurso
global.undefine-attribute=Establece el valor de un atributo para el recurso seleccionado como 'indefinido'
global.undefine-attribute.name=El nombre del atributo , el cual se debe establecer como 'indefinido'
global.write-attribute=Establece el valor de un atributo para el recurso seleccionado
global.write-attribute.name=El nombre del atributo para el cual establecer el valor bajo el recurso seleccionado
global.write-attribute.value=El valor del atributo para el cual establecer el valor bajo el recurso seleccionado. Puede ser nulo si el modelo subyacente soporta valores nulos.
global.validate-address=Verifica si un recurso con la direcci\u00F3n pasada como argumento existe.
global.validate-address.value=La direcci\u00F3n a verificar.
global.validate-address.reply=Reporte sobre el chequeo de la direcci\u00F3n.
global.validate-address.reply.valid=Indica si un recurso con la direcci\u00F3n pasada como argumento existe.
global.validate-address.reply.problem=Es inclu\u00EDdo solo si la direcci\u00F3n no es v\u00E1lida y describe lo que est\u00E1 mal con la direcci\u00F3n.
global.validate-operation=Valida que una operaci\u00F3n sea v\u00E1lida de acuerdo con su descripci\u00F3n. Se presentar\u00E1n los errores que hayan en la descripci\u00F3n de fallo de la operaci\u00F3n.
global.validate-operation.value=La operaci\u00F3n a validar.
root.composite=Una operaci\u00F3n que agrupa m\u00FAltiples peticiones de operaci\u00F3n en una sola petici\u00F3n de operaci\u00F3n.
root.composite.steps=Una lista de peticiones de operaci\u00F3n que constituyen la petici\u00F3n compuesta.
root.composite.reply=Una respuesta de una operaci\u00F3n compuesta que consiste de todos los resultados de pasos.
read-config-as-xml=Lee la configuraci\u00F3n actual y la retorna en formato XML.
read-config-as-xml.response=La forma XML de la configuraci\u00F3n persistente.
jvm=La configuraci\u00F3n de la MVJ para procesos / servidores administrados.
jvm.add=Agrega una nueva configuraci\u00F3n de la MVJ.
jvm.remove=Borra una configuraci\u00F3n existente de la MVJ.
jvm.name=El nombre de la configuraci\u00F3n de la MVJ.
jvm.heap=El tama\u00F1o inicial del heap asignado por la MVJ.
jvm.heap.max=El tama\u00F1o m\u00E1ximo del heap asignado por la MVJ.
jvm.permgen=El tama\u00F1o inicial de la generaci\u00F3n permanente.
jvm.permgen.max=El tama\u00F1o m\u00E1ximo de la generaci\u00F3n permanente.
jvm.stack=La configuraci\u00F3n del tama\u00F1o de la pila de la MVJ.
jvm.agent.lib=La biblioteca del agente de la MVJ.
jvm.agent.path=La ruta del agente de la MVJ.
jvm.javaagent=El agente java.
jvm.option=Una opci\u00F3n de la MVJ.
jvm.options=Las opciones de la MVJ.
jvm.option.add=Agregar una opci\u00F3n de la mvj.
jvm.option.remove=Borrar una opci\u00F3n de la mvj.
jvm.env.variables=Las variables de entorno de la MVJ.
jvm.system.properties=Las propiedades del sistema de la MVJ.
jvm.java.home=La p\u00E1gina de inicio de java
jvm.type=El tipo de la MVJ puede ser SUN o IBM
jvm.debug.enabled=Valor boolean que indica si la depuraci\u00F3n est\u00E1 habilitada.
jvm.debug.options=Las opciones de depuraci\u00F3n.
jvm.env.classpath.ignored=Ignore la ruta de clase del entorno.
snapshot.delete.description=Borra una toma de pantalla del directorio de tomas de pantalla
snapshot.delete.name=El nombre de la toma de pantalla a borrar. No se necesita el nombre completo en tanto lo que se pase identifique de manera \u00FAnica una toma de pantalla dentro del directorio de tomas de pantalla. Si se utiliza 'all' entonces se borrar\u00E1n todas las tomas de pantalla en el directorio de tomas de pantalla.
snapshot.list.description=Lista las tomas de pantalla
snapshot.list.reply.dir=El directorio en donde se almacenan las tomas de pantalla
snapshot.list.reply.names=Los nombres de las tomas de pantalla dentro del directorio de las tomas de pantalla
snapshot.take.description=Realiza una toma de pantalla de la configuraci\u00F3n actual
snapshot.take.reply.name=La ubicaci\u00F3n del archivo en la m\u00E1quina a donde pertenece la configuraci\u00F3n
vault=V\u00E1lvula de seguridad para los atributos.
vault.code=Nombre completamente calificado de la implementaci\u00F3n de la v\u00E1lvula de seguridad.
vault.option=Opci\u00F3n de la v\u00E1lvula de seguridad.
vault.options=Opciones de la v\u00E1lvula de seguridad.
vault.add=Agrega la v\u00E1lvula de seguridad.
vault.remove=Borra la v\u00E1lvula de seguridad.
core.resolve-expression=Operaci\u00F3n que acepta una expresi\u00F3n como entrada (o una cadena que se puede analizar sint\u00E1cticamente en una expresi\u00F3n) y la resuelve frente a las propiedades locales del sistema y variables del entorno.
core.resolve-expression.expression=La expresi\u00F3n a resolver.
core.resolve-expression.reply=La expresi\u00F3n resuelta o la cadena forman el valor de entrada original si no represent an expression.
