namespaces=O mapa do namespace usado no documento de configura\u00E7\u00E3o, onde as chaves s\u00E3o prefixos de namespace e valores s\u00E3o URIs de esquema.
namespaces.add=Adiciona o mapeamento do prefixo do namespace ao mapa do atributo dos namespaces.
namespaces.add.prefix=O prefixo do namespace a ser adicionado
namespaces.add.uri=O uri do esquema do namespace a ser adicionado.
namespaces.remove=Remove o mapeamento do prefixo do namespace a partir do mapa do atributo dos namespaces.
namespaces.remove.namespace=O prefixo do namespace a ser removido.
schema-locations=O mapa das localiza\u00E7\u00F5es dos esquemas XML usado no documento XML da configura\u00E7\u00E3o, onde as chaves s\u00E3o URIs de esquema e valores s\u00E3o localiza\u00E7\u00F5es onde o esquema pode ser encontrado.
schema-locations.add=Adiciona o mapeamento da localiza\u00E7\u00E3o do esquema para o mapa do atributo schema-locations
schema-locations.add.uri=O uri da localiza\u00E7\u00E3o do esquema a ser adicionado
schema-locations.add.schema-location=A localiza\u00E7\u00E3o onde o esquema adicionado pode ser encontrado.
schema-locations.remove=Remove o mapeamento de localiza\u00E7\u00E3o a partir do mapa do atributo schema-locations
schema-locations.remove.schema-uri=O URI da localiza\u00E7\u00E3o do esquema a ser removido.
core.management=Os servi\u00E7os de gerenciamento usados para controlar o servidor aut\u00F4nomo ou um controlador do host num dom\u00EDnio de gerenciamento.
core.management.security-realms=Os realms de seguran\u00E7a dispon\u00EDveis para acesso de controle dos servi\u00E7os de gerenciamento.
core.management.security-realm=O realm de seguran\u00E7a que pode ser associado com uma interface de gerenciamento e usado para controlar o acesso aos servi\u00E7os de gerenciamento.
core.management.security-realm.add=Adiciona o realm de seguran\u00E7a que pode ser associado com uma interface de gerenciamento e usado para acesso de controle aos servi\u00E7os de gerenciamento.
core.management.security-realm.remove=Remove o realm de seguran\u00E7a que pode ser associado com uma interface de gerenciamento e usado para controlar o acesso aos servi\u00E7os de gerenciamento.
core.management.security-realm.server-identity=Configura\u00E7\u00E3o das identidades que representam o servidor.
core.management.security-realm.server-identity.secret=Configura\u00E7\u00E3o da identidade baseada na senha/secreta de um servidor ou controlador do host.
core.management.security-realm.server-identity.secret.add=Adiciona uma identidade baseada na senha/secreta para um servidor ou controlador do host.
core.management.security-realm.server-identity.secret.remove=Remove um Adicinonar a identidade baseada na senha/secreta para um servidor ou controlador do host.
core.management.security-realm.server-identity.secret.value=A senha / secreta - Base64 Codificada.
core.management.security-realm.server-identity.ssl=Configura\u00E7\u00E3o da identidade SSL de um servidor ou controlador do host.
core.management.security-realm.server-identity.ssl.add=Adiciona a identidade SSL de um servidor ou controlador do host.
core.management.security-realm.server-identity.ssl.remove=Remove a identidade SSL de um servidor ou controlador do host.
core.management.security-realm.server-identity.ssl.protocol=O protocolo de uso na cria\u00E7\u00E3o do SSLContext.
core.management.security-realm.server-identity.ssl.keystore-password=A senha para abertura do keystore.
core.management.security-realm.server-identity.ssl.keystore-path=O caminho ao keystore.
core.management.security-realm.server-identity.ssl.keystore-relative-to=O nome de outro caminho nomeado anteriormente, ou de caminhos padr\u00F5es fornecidos pelo sistema. Caso o 'relative-to' seja fornecido, o valor do atributo 'caminho' \u00E9 tratado como relativo ao caminho por este atributo.
core.management.security-realm.authentication=A configura\u00E7\u00E3o dos mecanismos ao lado do servidor. Opcionalmente, um truststore pode ser definido e um nome de usu\u00E1rio/senha baseados no armazenamento podem ser definidos. A autentica\u00E7\u00E3o tentar\u00E1 primeiro usar o truststore e caso isto n\u00E3o esteja definido, ela retornar\u00E1 \u00E0 autentica\u00E7\u00E3o do nome do usu\u00E1rio/senha. Caso nada disto seja especificado, o \u00FAnico mecanismo dispon\u00EDvel ser\u00E1 o mecanismo local para a interface Nativo, sendo que a interface HTTP n\u00E3o estar\u00E1 dispon\u00EDvel. 
core.management.security-realm.authentication.truststore=A configura\u00E7\u00E3o de um keystore para uso da cria\u00E7\u00E3o de um gerenciador trust para verifica\u00E7\u00E3o de clientes.
core.management.security-realm.authentication.truststore.add=Adiciona um kestore para uso da cria\u00E7\u00E3o de um gerenciador trust para verifica\u00E7\u00E3o de clientes.
core.management.security-realm.authentication.truststore.remove=Remove um keystore para uso da cria\u00E7\u00E3o do gerenciador trust para verifica\u00E7\u00E3o de clientes.
core.management.security-realm.authentication.truststore.keystore-password=A senha a ser aberta para a keystore.
core.management.security-realm.authentication.truststore.keystore-path=O caminho do keystore.
core.management.security-realm.authentication.truststore.keystore-relative-to=O nome de outro caminho anteriormente nomeado, ou um dos caminhos padr\u00F5es fornecidos pelo sistema. Caso o 'relative-to' seja fornecido, o valor do atributo 'caminho' ser\u00E1 tratado como caminho espec\u00EDfico desse atributo.
core.management.security-realm.authentication.jaas=A configura\u00E7\u00E3o de uso do JAAS LoginContext para autentica\u00E7\u00E3o dos usu\u00E1rios.
core.management.security-realm.authentication.jaas.add=Adiciona uma configura\u00E7\u00E3o de uso do JAAS para autentica\u00E7\u00E3o.
core.management.security-realm.authentication.jaas.remove=Remove uma configura\u00E7\u00E3o de uso JAAS para autentica\u00E7\u00E3o.
core.management.security-realm.authentication.jaas.name=O nome da configura\u00E7\u00E3o JAAS para uso.
core.management.security-realm.authentication.ldap=Configura\u00E7\u00E3o de uso LDAP como o reposit\u00F3rio do usu\u00E1rio.
core.management.security-realm.authentication.ldap.add=Adiciona uma configura\u00E7\u00E3o para uso do LDAP como reposit\u00F3rio do usu\u00E1rio.
core.management.security-realm.authentication.ldap.remove=Remove uma configura\u00E7\u00E3o para uso do LDAP como reposit\u00F3rio do usu\u00E1rio.
core.management.security-realm.authentication.ldap.connection=O nome da conex\u00E3o para uso de conex\u00E3o ao LDAP.
core.management.security-realm.authentication.ldap.base-dn=O nome distinto base para iniciar a busca pelo usu\u00E1rio.
core.management.security-realm.authentication.ldap.recursive=Se \u00E9 que a busca deve ser recursiva.
core.management.security-realm.authentication.ldap.user-dn=O nome do atributo pelo qual o nome distingui-se do usu\u00E1rio.
core.management.security-realm.authentication.ldap.username-attribute=O nome do atributo para busca pelo usu\u00E1rio. Esse filtro ir\u00E1 executar uma busca simples onde o nome do usu\u00E1rio inserido pelo usu\u00E1rio combina com o atributo especificado.
core.management.security-realm.authentication.ldap.advanced-filter=O filtro inteiramente definido para busca do usu\u00E1rio baseado na ID do usu\u00E1rio inserida. O filtro deve conter uma vari\u00E1vel em forma de {0} - ele ser\u00E1 substitu\u00EDdo pelo nome do usu\u00E1rio fornecido pelo usu\u00E1rio.
core.management.security-realm.authentication.properties=A configura\u00E7\u00E3o de uso da lista dos usu\u00E1rios armazenados com o arquivo de propriedades como um reposit\u00F3rio do usu\u00E1rio. As entradas com o arquivo de propriedades s\u00E3o username\={credentials} com cada usu\u00E1rio sendo especificado na pr\u00F3pria linha.
core.management.security-realm.authentication.properties.add=Adiciona uma configura\u00E7\u00E3o para uso da lista de usu\u00E1rios com o arquivo de propriedades como reposit\u00F3rio do usu\u00E1rio.
core.management.security-realm.authentication.properties.remove=Remove uma configura\u00E7\u00E3o para uso de uma lista de usu\u00E1rios armazenados com um arquivo de propriedade como reposit\u00F3rio de usu\u00E1rio. 
core.management.security-realm.authentication.properties.path=O caminho do arquivo de propriedade contendo os usu\u00E1rios.
core.management.security-realm.authentication.properties.relative-to=O nome de outro caminho anteriormente nomeado, ou um dos caminhos padr\u00F5es fornecidos pelo sistema. Caso 'relative-to' seja fornecido, o valor do atributo 'caminho' \u00E9 tratado como caminho especificado por esse atributo. 
core.management.security-realm.authentication.properties.plain-text=S\u00E3o as credenciais com o arquivo de propriedades armazenado no texto plano. Caso nenhuma credencial seja esperada a ser hexa-codificada Digest hash pelo 'username \: realm \: password'.
core.management.security-realm.authentication.xml=A configura\u00E7\u00E3o a usar uma lista de usu\u00E1rios diretamente com o arquivo de configura\u00E7\u00E3o standalone.xml ou host.xml como uma propriedade de usu\u00E1rio.
core.management.security-realm.authentication.xml.add=Adiciona uma configura\u00E7\u00E3o para uso de uma lista de usu\u00E1rios armazenada diretamente com o arquivo de configura\u00E7\u00E3o standalone.xml ou host.xml como um reposit\u00F3rio do usu\u00E1rio.
core.management.security-realm.authentication.xml.remove=Remove a configura\u00E7\u00E3o a usar uma lista de usu\u00E1rios armazenados diretamente com o arquivo de configura\u00E7\u00E3o standalone.xml ou host.xml como o reposit\u00F3rio do usu\u00E1rio.
core.management.security-realm.authentication.xml.user=Um usu\u00E1rio autorizado.
core.management.security-realm.authentication.xml.user.add=Adiciona um usu\u00E1rio autorizado.
core.management.security-realm.authentication.xml.user.remove=Remove um usu\u00E1rio autorizado.
core.management.security-realm.authentication.xml.user.password=A senha do usu\u00E1rio.
core.management.security-realm.authorization=Configura\u00E7\u00E3o ao lado do servidor para carregamento da informa\u00E7\u00E3o do usu\u00E1rio adicional tal como fun\u00E7\u00F5es a serem usadas para checagens de autoriza\u00E7\u00E3o subsequente.
core.management.security-realm.authorization.properties=Configura\u00E7\u00E3o a usar o arquivo de propriedades para carregar as fun\u00E7\u00F5es dos usu\u00E1rios. As entradas com o arquivo das propriedades s\u00E3o username\={roles}, onde fun\u00E7\u00F5es \u00E9 uma lista de v\u00EDrgula separada das fun\u00E7\u00F5es dos usu\u00E1rios.
core.management.security-realm.authorization.properties.add=Adiciona uma configura\u00E7\u00E3o a usar o arquivo de propriedade para carregar as fun\u00E7\u00F5es dos usu\u00E1rios.
core.management.security-realm.authorization.properties.remove=Remove a configura\u00E7\u00E3o a usar o arquivo de propriedades para carregar as fun\u00E7\u00F5es dos usu\u00E1rios.
core.management.security-realm.authorization.properties.path=O caminho do arquivo das propriedades contendo as fun\u00E7\u00F5es dos usu\u00E1rios.
core.management.security-realm.authorization.properties.relative-to=O nome de outro caminho nomeado anteriormente, ou de um dos caminhos padr\u00F5es fornecidos pelo sistema. Caso 'relative-to' seja fornecido, o valor do atributo 'caminho' \u00E9 tratado como relativo ao caminho especificado por esse atributo.
core.management.ldap-connections=Configura\u00E7\u00F5es das cria\u00E7\u00F5es da conex\u00E3o que podem ser usadas pelo realm de seguran\u00E7a para acesso dos servidores LDAP como uma fonte de informa\u00E7\u00E3o de autoriza\u00E7\u00E3o e autentica\u00E7\u00E3o.
core.management.ldap-connection=Uma cria\u00E7\u00E3o da conex\u00E3o que pode ser usada pelo realm de seguran\u00E7a para acesso ao servidor LDAP como uma fonte de informa\u00E7\u00E3o de autoriza\u00E7\u00E3o e autentica\u00E7\u00E3o.
core.management.ldap-connection.add=Adiciona uma cria\u00E7\u00E3o de conex\u00E3o que pode ser usada pelo realm de seguran\u00E7a para acesso a um servidor LDAP como uma fonte de informa\u00E7\u00E3o e autoriza\u00E7\u00E3o.
core.management.ldap-connection.remove=Remove uma cria\u00E7\u00E3o de conex\u00E3o que era utilizada por um realm de seguran\u00E7a para acesso a um servidor LDAP como fonte de informa\u00E7\u00E3o de autoriza\u00E7\u00E3o e autentica\u00E7\u00E3o.
core.management.ldap-connection.url=O URL a ser usado para conectar-se ao servidor LDAP.
core.management.ldap-connection.search-dn=O nome distinguido a ser usado quando na conex\u00E3o ao servidor LDAP, para execu\u00E7\u00E3o de buscas.
core.management.ldap-connection.search-credential=O credencial a ser usado na conex\u00E3o, para execu\u00E7\u00E3o de buscas.
core.management.ldap-connection.initial-context-factory=A cria\u00E7\u00E3o do contexto inicial para estabelecer o LdapContext.
core.management.management-interfaces=As interfaces expostas pelos servi\u00E7os de gerenciamento para permitir que chamadores externos executem tarefas de gerenciamento.
core.management.native-interface=Configura\u00E7\u00E3o da interface de gerenciamento nativo do servidor
core.management.native-interface.add=Adiciona a configura\u00E7\u00E3o da interface do gerenciamento nativo do servidor
core.management.native-interface.interface=A interface da rede pela qual o soquete do servidor para a comunica\u00E7\u00E3o do gerenciamento nativo deve ser aberta. Ela deve ser 'indefinida', caso o atributo 'socket-binding' esteja configurado.
core.management.native-interface.port=A porta pela qual o soquete do servidor para a comunica\u00E7\u00E3o de gerenciamento nativo deve ser aberta. Ela deve ser 'indefinida', caso o atributo'socket-binding' esteja configurado. 
core.management.native-interface.security-realm=O realm de seguran\u00E7a a ser usado para interface de gerenciamento nativo.
core.management.native-interface.socket-binding=O nome da configura\u00E7\u00E3o binding do soquete a ser usado para o soquete da interface de gerenciamento.
core.management.native-remoting-interface=A configura\u00E7\u00E3o da interface do gerenciamento nativo do servidor usando um conector a partir do sub-sistema remoto.
core.management.native-remoting-interface.add=Adiciona a configura\u00E7\u00E3o da interface de gerenciamento nativo do servidor usando um conector a partir do sub-sistema remoto.
core.management.http-interface=Configura\u00E7\u00E3o da interface do gerenciamento HTTP do servidor
core.management.http-interface.add=Adiciona a configura\u00E7\u00E3o da interface do gerenciamento HTTP do servidor
core.management.http-interface.interface=A interface da rede pela qual o soquete do servidor para a comunica\u00E7\u00E3o do gerenciamento HTTP deve ser operado.
core.management.http-interface.port=A porta pela qual o soquete do servidor da comunica\u00E7\u00E3o do gerenciamento HTTP deve ser aberta. 
core.service-container=O recipiente central que gerencia todos os servi\u00E7os num servidor aut\u00F4nomo rodando ou em um controlador host num dom\u00EDnio de gerenciamento.
extension=Um m\u00F3dulo que estende as capacidades padr\u00F5es de um dom\u00EDnio ou um servidor aut\u00F4nomo.
extension.module=O nome do m\u00F3dulo.
extension.add=Adiciona uma extens\u00E3o.
extension.remove=Remove uma extens\u00E3o.
extension.subsystem=Um sub-sistema fornecido pela extens\u00E3o. A informa\u00E7\u00E3o fornecida \u00E9 a respeito do esquema xml e interface de gerenciamento fornecida pelo sub-sistema e n\u00E3o a configura\u00E7\u00E3o do pr\u00F3prio sub-sistema.
extension.subsystem.xml-namespaces=Uma lista de URLs para namespaces XML suportados pelo pesquisador XML do sub-sistema. Ela pode ser vazia, caso a extens\u00E3o n\u00E3o associou claramente um namespace XML com um sub-sistema particular.
extension.subsystem.management-major-version=Uma vers\u00E3o maior da interface do gerenciamento do sub-sistema. Ela pode ser indefinida, caso o sub-sistema n\u00E3o fornecer uma interface do gerenciamento com vers\u00E3o.
extension.subsystem.management-minor-version=Vers\u00E3o secund\u00E1ria da interface do gerenciamento do sub-sistema. Ela pode estar indefinida, caso o sub-sistema n\u00E3o fornecer uma interface de gerenciamento com vers\u00E3o.
named_path=O caminho do filesystem nomeado, mas sem uma solicita\u00E7\u00E3o para especificar o caminho atual. Caso o caminho atual n\u00E3o seja especificado, isto age como um espa\u00E7o reservado no modelo (ex.\: no n\u00EDvel do dom\u00EDnio) at\u00E9 que uma defini\u00E7\u00E3o do caminho especificado seja aplicada no n\u00EDvel mais baixo (ex.\: n\u00EDvel do host, onde os endere\u00E7os dispon\u00EDveis s\u00E3o conhecidos.)
specified_path=O caminho do filesystem nomeado.
path.name=O nome do caminho. N\u00E3o pode ser um dos caminhos padr\u00F5es fixados pelo sistema\: <ul><li>jboss.home - o diret\u00F3rio raiz JBoss AS distribution</li><li>user.home - home directory</li><li>user.dir do usu\u00E1rio - current working directory</li><li>java.home do usu\u00E1rio - java installation directory</li><li>jboss.server.base.dir - diret\u00F3rio raiz para uma instance</li></ul> do servidor individual. Perceba que o sistema fornece outros caminhos que n\u00E3o podem ser substitu\u00EDdos por suas declara\u00E7\u00F5es no arquivo de configura\u00E7\u00E3o. Consulte a documenta\u00E7\u00E3o do atributo 'relative-to' para uma lista completa dos caminhos padr\u00F5es. 
path.path=O caminho do filesystem atual. Tratado como um caminho absoluto, a n\u00E3o ser que o atributo 'relative-to' seja especificado. Neste caso, o valor \u00E9 tratado como relativo ao caminho. <p>Caso tratado como um caminho absoluto, o pathname do per\u00EDodo de rodagem especificado pelo valor desse atributo ser\u00E1 determinado conforme a seguir\: </p>Caso esse valor j\u00E1 seja absoluto, o valor ser\u00E1 usado diretamente. Do contr\u00E1rio, o pathname do per\u00EDodo de rodagem ser\u00E1 resolvido numa maneira independente de sistema. Nos sistemas do UNIX, um pathname relativo torna-se absoluto pela resolu\u00E7\u00E3o do mesmo em rela\u00E7\u00E3o ao diret\u00F3rio do usu\u00E1rio atual. Nos sistemas do Microsoft Windows, um pathname relativo torna-se absoluto pela resolu\u00E7\u00E3o do mesmo em rela\u00E7\u00E3o ao diret\u00F3rio atual do drive nomeado pelo pathname, caso haja um. Do contr\u00E1rio, ele ser\u00E1 resolvido em rela\u00E7\u00E3o ao diret\u00F3rio do usu\u00E1rio atual.
path.relative-to=O nome de outro caminho nomeado anteriormente, ou um dos caminhos padr\u00F5es fornecidos pelo sistema. Caso o 'relative-to' seja fornecido, o valor do atributo 'path' \u00E9 tratado como relativo ao caminho especificado por esse atributo. Os caminhos padr\u00F5es fornecidos pelo sistema incluem\: <ul><li>jboss.home - o diret\u00F3rio raiz do JBoss AS distribution</li><li>user.home - home directory</li><li>user.dir do usu\u00E1rio - trabalho atual directory</li><li>java.home do usu\u00E1rio - java installation directory</li><li>jboss.server.base.dir - diret\u00F3rio raiz para um servidor individual de instance</li><li>jboss.server.data.dir - diret\u00F3rio em que o servidor ir\u00E1 usar para o arquivo de dados persistentesi storage</li><li>jboss.server.log.dir - diret\u00F3rio em que o servidor ir\u00E1 usar para o arquivo de registro de log storage</li><li>jboss.server.tmp.dir - diret\u00F3rio em que o servidor ir\u00E1 usar para o arquivo tempor\u00E1rio storage</li><li>jboss.domain.servers.dir - diret\u00F3rio pelo qual um controlador criar\u00E1 a \u00E1rea de trabalho para o servidor individual instances</li></ul>
path.add=Adiciona um novo caminho.
path.add.path=O valor do atributo 'caminho' do caminho
path.add.relative-to=O valor do atributo 'relative-to' do caminho
path.remove=remove um caminho
profile=Um conjunto nomeador das configura\u00E7\u00F5es do sub-sistema.
profile.name=O nome do perfil
profile.add=Adiciona um novo 'perfil'
profile.add.includes=O valor do atributo 'inclui' o novo perfil
profile.describe=Os resultados dos sub-sistemas do perfil como um lista de opera\u00E7\u00F5es que podem ser executadas para criar o mesmo modelo
profile.remove=Remove um 'perfil'
profile.remove.name=O valor do atributo 'nome' do perfil
profile.includes=Uma lista de perfis a serem inclu\u00EDdas nesse perfil
profile.include=Especifica que os conte\u00FAdos do perfil nomeado est\u00E3o prestes a ser inclu\u00EDdos no perfil cuja defini\u00E7\u00E3o inclui esse item.
profile.include.profile=O nome do perfil inclu\u00EDdo
profile.includes.add=Adiciona uma lista de perfis inclu\u00EDdos
profile.includes.add.include=O nome do perfil inclu\u00EDdo
profile.includes.remove=Remove um perfil da lista de perfis inclu\u00EDdos
profile.includes.remove.include=O nome do perfil inclu\u00EDdo
profile.subsystem=Os sub-sistemas que fazem o perfil.
named_interface=A interface da rede nomeada, mas sem qualquer crit\u00E9rio solicitado para determina\u00E7\u00E3o do endere\u00E7o IP a ser associado com aquela interface. Caso nenhum crit\u00E9rio de sele\u00E7\u00E3o do endere\u00E7o IP seja definido, isto age como um espa\u00E7o reservado nesse modelo (ex.\: no n\u00EDvel do dom\u00EDnio) at\u00E9 uma defini\u00E7\u00E3o de interface inteiramente especificada, onde endere\u00E7os dispon\u00EDveis s\u00E3o conhecidos.)
specified_interface=A interface de rede, juntamente com o crit\u00E9rio requerido para determinar o endere\u00E7o IP, com o objetivo de associar com aquela interface.
interface.name=O nome da interface.
interface.criteria=Preterido. Um conjunto de crit\u00E9rio usado no per\u00EDodo de rodagem para determinar qual endere\u00E7o IP a ser usado para aquela interface.
interface.add=Adiciona uma nova especifica\u00E7\u00E3o da interface.
interface.add.criteria=Preterido.
interface.remove=Remove uma especifica\u00E7\u00E3o da interface. 
interface.any-address=Atributo indicando que soquetes usando essa interface devem ser vinculados a um endere\u00E7o curinga. O endere\u00E7o curinga IPv6 (\:\:) ser\u00E1 usado a n\u00E3o ser que a propriedade de sistema seja configurada para verdadeiro. Neste caso, o endere\u00E7o curinga IPv4 (0.0.0.0) ser\u00E1 usado. Caso um soquete seja limitado a um endere\u00E7o qualquer local IPv6 numa m\u00E1quina de pilha dual, ele poder\u00E1 aceitar ambos os tr\u00E1fegos IPv6 er IPv4. E, caso ele seja limitado a um endere\u00E7o qualquer local IPv4 (IPv4-mapeado), ele poder\u00E1 apenas aceitar o tr\u00E1fego IPv4.
interface.any-ipv4-address=O atributo indicando que os soquetes usando essa interface devem ser limitados ao endere\u00E7o curinga IPv4 (0.0.0.0).
interface.any-ipv6-address=O atributo indicando que os soquetes usando essa interface devem ser limitadas ao endere\u00E7o curinga IPv6 (\:\:).
interface.inet-address=O atributo indicando que a parte do crit\u00E9rio de sele\u00E7\u00E3o para escolha do endere\u00E7o IP para essa interface deve ser independente do endere\u00E7o combinar com o valor gerado. O valor \u00E9 tanto um endere\u00E7o IP no IPv6 ou IPv4 pontuados de uma nota\u00E7\u00E3o decimal, ou um hostname que pode ser resolvido a um endere\u00E7o IP. Um valor 'indefinido' significa que esse atributo n\u00E3o \u00E9 relevante \u00E0 sele\u00E7\u00E3o do endere\u00E7o IP.
interface.link-local-address=O atributo indicando que parte do crit\u00E9rio de sele\u00E7\u00E3o para escolha do endere\u00E7o IP para essa interface deve ocorrer independente do endere\u00E7o ser um link local ou n\u00E3o. Um valor 'indefinido' ou 'falso' significa que esse atributo n\u00E3o \u00E9 relevante \u00E0 sele\u00E7\u00E3o do endere\u00E7o IP.
interface.loopback=O atributo indicando que parte do crit\u00E9rio de sele\u00E7\u00E3o para escolha de um endere\u00E7o IP para essa interface deve ocorrer independente do endere\u00E7o loopback. Um valor 'indefinido' ou 'falso' n\u00E3o \u00E9 relevante \u00E0 sele\u00E7\u00E3o do endere\u00E7o IP.
interface.loopback-address=O atributo indica que o endere\u00E7o IP para essa interface deve ser um valor gerado, caso a interface loopback existir na m\u00E1quina. Um 'endere\u00E7o loopback' pode n\u00E3o ser configurado na interface loopback da m\u00E1quina. Isso difere-se do endere\u00E7o inet no sentido em que o valor gerado ser\u00E1 usado, mesmo se nenhum NIC, que possui o endere\u00E7o IP especificado associado ao mesmo, puder ser encontrado. Um valor 'indefinido' ou 'falso' significa que esse atributo n\u00E3o \u00E9 relevante \u00E0 sele\u00E7\u00E3o do endere\u00E7o IP.
interface.multicast=O atributo indicando que parte do crit\u00E9rio de sele\u00E7\u00E3o para escolha do endere\u00E7o IP para essa interface deve ocorrer independente de sua interface de rede suportar o multicast. Um valor 'indefinido' ou 'falso' significa que esse atributo n\u00E3o \u00E9 relevante \u00E0 sele\u00E7\u00E3o do endere\u00E7o IP.
interface.nic=O atributo indicando que parte do crit\u00E9rio de sele\u00E7\u00E3o de escolha de um endere\u00E7o IP para essa interface deve ocorrer independente dessa interface de rede possuir o nome gerado. O nome da interface de rede (e.x.\: eth0, eth1, lo). O valor 'indefinido' significa que esse atributo n\u00E3o \u00E9 relevante \u00E0 sele\u00E7\u00E3o do endere\u00E7o IP.
interface.nic-match=O atributo indicando que parte do crit\u00E9rio de sele\u00E7\u00E3o de escolha de um endere\u00E7o IP para essa interface deve ocorrer independente de sua interface de rede possuir um nome que coincide com a express\u00E3o regular gerada. O valor \u00E9 uma express\u00E3o cuja qual aos nomes das interfaces de rede dispon\u00EDveis podem coincidir para encontrar uma interface aceit\u00E1vel. O valor 'indefinido' significa que esse atributo n\u00E3o \u00E9 relevante \u00E0 sele\u00E7\u00E3o do endere\u00E7o IP.
interface.point-to-point=O atributo indica que parte do crit\u00E9rio de sele\u00E7\u00E3o para escolha de um endere\u00E7o IP para essa interface deve ocorrer independente de sua interface de rede ser uma interface ponto-a-ponto. Um valor 'indefinido' ou 'falso' significa que esse atributo n\u00E3o \u00E9 relevante \u00E0 sele\u00E7\u00E3o do endere\u00E7o IP
interface.public-address=O atributo indicando que parte do crit\u00E9rio de sele\u00E7\u00E3o de um endere\u00E7o IP para essa interface deve ser realizada independente de ser ou n\u00E3o um endere\u00E7o rote\u00E1vel p\u00FAblico. O valor 'indefinido' ou 'falso' n\u00E3o \u00E9 relevante \u00E0 sele\u00E7\u00E3o de endere\u00E7o IP
interface.site-local-address=o atributo indicando que parte do crit\u00E9rio de sele\u00E7\u00E3o para um endere\u00E7o IP para essa interface deve ocorrer independente de ser um endere\u00E7o local do site. Um valor 'indefinido' ou 'falso' significa que esse atributo n\u00E3o \u00E9 relevante \u00E0 sele\u00E7\u00E3o do endere\u00E7o IP
interface.subnet-match=O atributo indicando que parte do crit\u00E9rio de sele\u00E7\u00E3o para escolha de um endere\u00E7o IP para essa interface deve ocorrer independente do endere\u00E7o encaixar-se na defini\u00E7\u00E3o do subnet gerado. O valor \u00E9 um endere\u00E7o IP da rede e o n\u00FAmero de bits no prefixo da rede do endere\u00E7o, gravado na "nota\u00E7\u00E3o da barra", ex.\: "192.168.0.0/16". O valor 'indefinido' significa que o atributo n\u00E3o \u00E9 relevante \u00E0 sele\u00E7\u00E3o do endere\u00E7o IP.
interface.up=O atributo indicando que parte do crit\u00E9rio de sele\u00E7\u00E3o para escolha do endere\u00E7o IP para essa interface deve ocorrer independente de sua interface da rede estar rodando. O valor 'indefinido' ou 'falso' significa que o atributo n\u00E3o \u00E9 relevante \u00E0 sele\u00E7\u00E3o do endere\u00E7o IP 
interface.virtual=O atributo indicando que parte do crit\u00E9rio de sele\u00E7\u00E3o para escolha do endere\u00E7o IP para essa interface deve ocorrer independente de sua interface de rede ser uma interface virtual. O valor 'indefinido' ou 'falso' significa que esse atributo n\u00E3o \u00E9 relevante \u00E0 sele\u00E7\u00E3o do endere\u00E7o IP
interface.not=O atributo indicando que parte do crit\u00E9rio de sele\u00E7\u00E3o para escolha de um endere\u00E7o IP para essa interface deve ser que o endere\u00E7o IP *n\u00E3o* encontre qualquer conjunto aninhado de crit\u00E9rio. O valor do atributo \u00E9 um conjunto de crit\u00E9rio (ex.\: 'loopback') cujo significado normal \u00E9 revertido. O valor 'indefinido' significa que esse atributo n\u00E3o \u00E9 relevante \u00E0 sele\u00E7\u00E3o do endere\u00E7o IP.
interface.any=O atributo indicando que parte do crit\u00E9rio de sele\u00E7\u00E3o para escolha de um endere\u00E7o IP dessa interface deve ser um endere\u00E7o IP que segue pelo menos um dos conjuntos aninhados de crit\u00E9rio, mas n\u00E3o necessariamente todos os crit\u00E9rios aninhados. O valor 'indefinido' significa que esse atributo n\u00E3o \u00E9 relevante \u00E0 sele\u00E7\u00E3o do endere\u00E7o IP.
socket-binding-group=Cont\u00E9m uma lista de configura\u00E7\u00F5es de soquete.
socket-binding-group.name=O nome do grupo binding do soquete.
socket-binding-group.default-interface=O nome de uma interface que deve ser usada como a interface para quaisquer soquetes que n\u00E3o declaram um claramente.
socket-binding-group.socket-binding=Configura\u00E7\u00F5es de soquete individual.
socket-binding-group.port-offset=Incremento a ser aplicado aos valores da porta base definida nos bindings do soquete para derivar os valores do per\u00EDodo de rodagem com o objetivo de uso nesse servidor.
socket-binding-group.includes=Uma lista de nomes do grupo binding de soquetes cujos bindings est\u00E3o inclusos no grupo binding de soquete. Essa interface padr\u00E3o do grupo binding ser\u00E1 aplicada a quaisquer bindings inclusos que n\u00E3o especificam uma interface.
socket-binding-group.add=Adiciona o grupo binding de soquete.
socket-binding-group.remove=Remove o grupo binding de soquete.
socket-binding-group.include.add=Adiciona o grupo binding de soquete ao atributo 'incluir' do grupo binding de soquete.
socket-binding-group.include.add.include=O nome do gruopo binding de soquete a ser inclu\u00EDdo.
socket-binding-group.include.remove=Remove o grupo binding de soquete a partir do atributo 'incluir' do grupo binding de soquete.
socket-binding-group.include.remove.include=O nome do grupo binding de soquete a n\u00E3o ser mais inclu\u00EDdo.
socket-binding=Informa\u00E7\u00E3o da configura\u00E7\u00E3o para um soquete.
socket-binding.name=O nome do soquete. Os servi\u00E7os que precisam acessar a informa\u00E7\u00E3o de configura\u00E7\u00E3o do soquete encontrar\u00E3o isto usando este nome.
socket-binding.interface=O nome da interface pela qual o soquete deve ser limitado, ou para soquetes multicast, a interface pela qual isto deve escutar. Isto deve ser uma das interfaces declaradas.
socket-binding.port=O n\u00FAmero da porta pela qual o soquete deve ser vinculado.
socket-binding.fixed-port=Se \u00E9 que o valor da porta deve permanecer fixa, mesmo se deslocamentos num\u00E9ricos forem aplicados a outros soquetes no grupo do soquete. 
socket-binding.multicast-address=Endere\u00E7o multicast pelo qual o soquete deve receber o tr\u00E1fego multicast. Caso n\u00E3o especificado, o soquete n\u00E3o ser\u00E1 configurado para receber o multicast.
socket-binding.multicast-port=A porta pela qual o soquete deve receber o tr\u00E1fego multicast. Ela deve ser configurada, caso o 'endere\u00E7o-multicast' esteja configurado.
socket-binding.add=Adiciona a configura\u00E7\u00E3o binding do soquete ao grupo.
socket-binding.remove=Remove a configura\u00E7\u00E3o binding do soquete do grupo.
socket-binding.bound=Se \u00E9 que o soquete atual dessa configura\u00E7\u00E3o binding do soquete foi vinculado.
socket-binding.bound-address=O endere\u00E7o pelo qual o soquete atual usando essa configura\u00E7\u00E3o binding de soquete foi vinculado, ou indefinido caso nenhum soquete tenha sido vinculado. 
socket-binding.bound-port=A porta pela qual o soquete atual usando essa configura\u00E7\u00E3o binding foi vinculada, ou indefinida caso nenhum soquete tenha sido vinculado.
socket-binding.client-mappings=Especifica zero ou mais mapeamentos de clientes para esse binding de soquete. Uma conex\u00E3o de cliente a esse soquete deve ser usada no endere\u00E7o de destino especificado no mapeamento que coincide com a pr\u00F3pria interface de sa\u00EDda desejada. Isso permite para topologias de rede avan\u00E7ada que usa tanto da tradu\u00E7\u00E3o do endere\u00E7o da rede ou possuir bindings em interfaces de rede para fun\u00E7\u00E3o. Cada mapeamento deve ser avaliado ou em ordem declarada, sendo que a primeira combina\u00E7\u00E3o com \u00EAxito ser\u00E1 usada para determinar o destino.
socket-binding.client-mappings.source-network=A rede de fonte que a conex\u00E3o do cliente conecta-se. Esse valor \u00E9 formul\u00E1rio do ip/netmask. Um cliente deve coincidir esse valor em rela\u00E7\u00E3o \u00E0 interface de rede do host e caso coincida, o cliente deve conectar-se aos valores de destino correspondentes. Caso omitido, esse mapeamento deve coincidir com qualquer interface.
socket-binding.client-mappings.destination-address=O endere\u00E7o de destino que o cliente deve conectar-se, caso a rede de fonte coincidir. Esse valor pode ser tanto um hostname ou um endere\u00E7o ip.
socket-binding.client-mappings.destination-port=A porta de destino que um cliente deve conectar-se, caso a rede de fonte coincidir. Caso omitido, esse mapeamento usar\u00E1 novamente a porta de binding do soquete efetivo.
remote-destination-outbound-socket-binding=A informa\u00E7\u00E3o da configura\u00E7\u00E3o para, destina\u00E7\u00E3o remota, de um binding do soquete de sa\u00EDda.
remote-destination-outbound-socket-binding.name=O nome do binding de soquete de sa\u00EDda. Os servi\u00E7os que precisam acessar a informa\u00E7\u00E3o da configura\u00E7\u00E3o do soquete encontrar\u00E3o isto pelo uso deste nome.
remote-destination-outbound-socket-binding.source-interface=O nome da interface pela qual ser\u00E1 usada para o endere\u00E7o de fonte do soquete de sa\u00EDda.
remote-destination-outbound-socket-binding.source-port=O n\u00FAmero de porta pelo qual ser\u00E1 usado como porta de fonte do soquete de sa\u00EDda.
remote-destination-outbound-socket-binding.host=O nome do host ou endere\u00E7o IP da destina\u00E7\u00E3o remota pela qual esse soquete de sa\u00EDda ir\u00E1 se conectar.
remote-destination-outbound-socket-binding.port=O n\u00FAmero da porta do destino remoto pelo qual o soquete de sa\u00EDda deve se conectar.
remote-destination-outbound-socket-binding.add=Adiciona o binding do soquete de sa\u00EDda da destina\u00E7\u00E3o remota a um grupo binding do soquete
remote-destination-outbound-socket-binding.remove=Remove o binding do soquete de sa\u00EDda do destino, a partir de um grupo binding do soquete
remote-destination-outbound-socket-binding.fixed-source-port=Se \u00E9 que o valor da porta deve permanecer fixa, mesmo se os deslocamentos forem aplicados em outros soquetes de sa\u00EDda no grupo do soquete.
local-destination-outbound-socket-binding=\ A informa\u00E7\u00E3o da configura\u00E7\u00E3o para, destino local, do binding de soquete de sa\u00EDda.
local-destination-outbound-socket-binding.name=O nome do soquete de sa\u00EDda. Os servi\u00E7o que precisam acessar a informa\u00E7\u00E3o de configura\u00E7\u00E3o do soquete ir\u00E3o encontrar isto usando esse nome.
local-destination-outbound-socket-binding.source-interface=O nome da interface que ser\u00E1 usada pelo endere\u00E7o da fonte do soquete de sa\u00EDda.
local-destination-outbound-socket-binding.source-port=O n\u00FAmero da porta pela qual ser\u00E1 usada como porta de fonte do soquete de sa\u00EDda.
local-destination-outbound-socket-binding.socket-binding-ref=O nome do binding de soquete local que ser\u00E1 usado para determinar a porta pela qual esse soquete de sa\u00EDda conecta-se.
local-destination-outbound-socket-binding.add=Adiciona um binding de soquete de sa\u00EDda de destino local a um grupo binding do soquete
local-destination-outbound-socket-binding.remove=Remove o binding de soquete de sa\u00EDda do destino local a um grupo binding do soquete.
local-destination-outbound-socket-binding.fixed-source-port=Se \u00E9 que o valor da porta deve permanecer fixo, mesmo que os deslocamentos num\u00E9ricos sejam aplicados aos soquetes de sa\u00EDda no grupo do soquete.
subsystem.describe=Sa\u00EDdas do sistema como uma lista de opera\u00E7\u00F5es que podem ser executadas para criar o modelo original
system-property.add=Adiciona a propriedade de sistema ou atualiza uma existente.
system-property.remove=Remove a propriedade de sistema.
system-property.value=O valor da propriedade de sistema.
system-property.boottime=Caso verdadeiro, a propriedade de sistema \u00E9 passada \u00E0 linha de comando ao jvm do servidor inicializado. Caso falso, ela ser\u00E1 enviada ao servidor como parte da sequ\u00EAncia de inicializa\u00E7\u00E3o.
deployment=A implanta\u00E7\u00E3o representa tudo o que pode ser implantado (ex.\: um aplicativo tal como o EJB-JAR, WAR, EAR, qualquer tipo de arquivo padr\u00E3o tal como o RAR ou implanta\u00E7\u00E3o espec\u00EDfica do JBoss) num servidor.
deployment.name=O identificador \u00FAnico da implanta\u00E7\u00E3o. Ele deve ser \u00FAnico por todas as implanta\u00E7\u00F5es.
deployment.runtime-name=O nome pelo qual a implanta\u00E7\u00E3o deve ser conhecido pelo per\u00EDodo de rodagem do servidor. Isso deve ser equivalente ao nome do arquivo de um arquivo de implanta\u00E7\u00E3o, al\u00E9m de formar a base para certas coisas como os nomes do m\u00F3dulo ou o aplicativo da Edi\u00E7\u00E3o Java Enterprise padr\u00E3o. Normalmente, isto seria o mesmo ao 'nome', mas em alguns casos os usu\u00E1rio podem desejar possuir duas implanta\u00E7\u00F5es com o mesmo 'nome do per\u00EDodo de rodagem' (ex.\: duas vers\u00F5es do "foo.war") ambas dispon\u00EDveis no reposit\u00F3rio do conte\u00FAdo da implanta\u00E7\u00E3o, cujo caso as implanta\u00E7\u00F5es dever\u00E3o possuir valores de 'nomes' distintos, por\u00E9m possuindo o mesmo 'nome do per\u00EDodo de rodagem'.
deployment.content=Lista dos trechos de conte\u00FAdos que cont\u00EAm a implanta\u00E7\u00E3o.
deployment.hash=O hash do conte\u00FAdo da implanta\u00E7\u00E3o gerenciado que foi carregado ao reposit\u00F3rio do conte\u00FAdo da implanta\u00E7\u00E3o do servidor aut\u00F4nomo ou dom\u00EDnio.
deployment.inputstream=O \u00EDndice nos fluxos de entrada anexados da opera\u00E7\u00E3o do fluxo de entrada que cont\u00E9m o conte\u00FAdo da implanta\u00E7\u00E3o. Esse deve ser carregado ao dom\u00EDnio do conte\u00FAdo da implanta\u00E7\u00E3o do servidor aut\u00F4nomo ou de dom\u00EDnio.
deployment.enabled=O Boolean indicando se \u00E9 que o conte\u00FAdo de implanta\u00E7\u00E3o est\u00E1 sendo implantado no per\u00EDodo de rodagem (ou deve ser implantado no per\u00EDodo de rodagem a pr\u00F3xima vez em que o servidor for iniciado.)
deployment.persistent=O Boolean indicando se \u00E9 que a exist\u00EAncia da implanta\u00E7\u00E3o deve ser gravada na configura\u00E7\u00E3o do servidor persistente. Ele \u00E9 apenas relevante a um servidor de modo aut\u00F4nomo. O padr\u00E3o \u00E9 'verdadeiro'. A implanta\u00E7\u00E3o gerenciada pelo scanner da implanta\u00E7\u00E3o teria essa configura\u00E7\u00E3o como 'falso', com o objetivo de garantir que a implanta\u00E7\u00E3o \u00E9 apenas implantada no in\u00EDcio do servidor, caso o scanner detecte novamente a implanta\u00E7\u00E3o.
deployment.upload-bytes=Indica que o conte\u00FAdo de implanta\u00E7\u00E3o no byte array deve ser adicionado ao reposit\u00F3rio do conte\u00FAdo de implanta\u00E7\u00E3o. Perceba que essa opera\u00E7\u00E3o n\u00E3o indica que o conte\u00FAdo deve ser implantado no per\u00EDodo de rodagem.
deployment.bytes=Byte array contendo o conte\u00FAdo de implanta\u00E7\u00E3o que deve ser carregado ao reposit\u00F3rio do conte\u00FAdo de implanta\u00E7\u00E3o do servidor aut\u00F4nomo ou dom\u00EDnio.
deployment.upload-url=Indica que o conte\u00FAdo da implanta\u00E7\u00E3o dispon\u00EDvel no URL incluso deve ser adicionado ao reposit\u00F3rio do conte\u00FAdo da implanta\u00E7\u00E3o. Perceba que essa opera\u00E7\u00E3o n\u00E3o indica que o conte\u00FAdo deve ser implantado no per\u00EDodo de rodagem.
deployment.url=O URL pelo qual o conte\u00FAdo da implanta\u00E7\u00E3o est\u00E1 dispon\u00EDvel para carregamento no reposit\u00F3rio do conte\u00FAdo da implanta\u00E7\u00E3o do servidor aut\u00F4nomo ou de dom\u00EDnio. Perceba que o URL deve ser acess\u00EDvel a partir da destina\u00E7\u00E3o da opera\u00E7\u00E3o (ex.\: o Controlador de Dom\u00EDnio ou servidor aut\u00F4nomo).
deployment.upload-stream=Indica que o conte\u00FAdo da implanta\u00E7\u00E3o dispon\u00EDvel no \u00EDndice do fluxo de entrada inclu\u00EDdo deve ser adicionado ao reposit\u00F3rio do conte\u00FAdo de implanta\u00E7\u00E3o. Perceba que essa opera\u00E7\u00E3o n\u00E3o indica que o conte\u00FAdo deve ser implantado no per\u00EDodo de rodagem.
deployment.path=O caminho (relativo ou absoluto) para conte\u00FAdo n\u00E3o gerenci\u00E1vel que faz parte da implanta\u00E7\u00E3o.
deployment.relative-to=O nome de um caminho de sistema pelo qual o valor do 'caminho' \u00E9 relativo. Caso n\u00E3o esteja configurado, o 'caminho' \u00E9 considerado absoluto.
deployment.archive=Um aviso indicando se \u00E9 que o conte\u00FAdo n\u00E3o gerenci\u00E1vel \u00E9 um arquivo comprimido (verdadeiro) ou destacado (falso).
deployment.add=Adiciona conte\u00FAdo carregado anteriormente \u00E0 lista do conte\u00FAdo dispon\u00EDvel para uso. Na realidade, n\u00E3o implanta o conte\u00FAdo a n\u00E3o ser que o par\u00E2metro 'ativado' seja 'verdadeiro'.
deployment.deploy=Implanta o conte\u00FAdo da implanta\u00E7\u00E3o especificada no per\u00EDodo de rodagem, opcionalmente substituindo o conte\u00FAdo existente.
deployment.deploy.name=O nome do novo contexto.
deployment.deploy.to-replace=O nome do conte\u00FAdo que est\u00E1 prestes a ser substitu\u00EDdo.
deployment.replace=Substitua o conte\u00FAdo existente no per\u00EDodo de rodagem pelo novo conte\u00FAdo. O novo conte\u00FAdo deve ter sido carregado anteriormente a um reposit\u00F3rio do conte\u00FAdo de implanta\u00E7\u00E3o. 
deployment.replace.name=O nome do novo conte\u00FAdo.
deployment.replace.to-replace=O nome do conte\u00FAdo que est\u00E1 prestes a ser substitu\u00EDdo.
deployment.full-replace=Adiciona o conte\u00FAdo de implanta\u00E7\u00E3o carregado \u00E0 lista de conte\u00FAdo dispon\u00EDvel para uso, substituindo o conte\u00FAdo existente de mesmo nome no per\u00EDodo de rodagem, al\u00E9m de remover o conte\u00FAdo da lista de conte\u00FAdo dispon\u00EDvel para uso. Isto \u00E9 equivalente a uma sequ\u00EAncia 'adicionar', 'desimplantar', 'implantar' e 'remover' onde o novo conte\u00FAdo possui o mesmo nome ao do conte\u00FAdo sendo substitu\u00EDdo. Um dos 'runtime-name', 'hash', 'input-stream-index', 'bytes' ou 'url' deve ser especificado com precis\u00E3o. 
deployment.undeploy=O conte\u00FAdo de desimplanta\u00E7\u00E3o do per\u00EDodo de rodagem. O conte\u00FAdo continua na lista do conte\u00FAdo dispon\u00EDvel para uso.
deployment.redeploy=Desimplante o conte\u00FAdo existente a partir do per\u00EDodo de rodagem e o implante novamente.
deployment.status=O status do per\u00EDodo de rodagem atual da implanta\u00E7\u00E3o. Os poss\u00EDveis modos de status s\u00E3o OK, FAILED e STOPPED. FAILED indica que est\u00E1 faltando a depend\u00EAncia ou o servi\u00E7o n\u00E3o pode ser iniciado. STOPPED indica que a implanta\u00E7\u00E3o n\u00E3o foi ativada ou foi interrompida manualmente.
deployment.subsystem=Os recursos do per\u00EDodo de rodagem criados na implanta\u00E7\u00E3o s\u00E3o implantados, organizados por sub-sistemas respons\u00E1veis pelo recurso do per\u00EDodo de rodagem.
deployment.subdeployment=Os recursos do per\u00EDodo de rodagem associados com a implanta\u00E7\u00E3o filho empacotada dentro de outra implanta\u00E7\u00E3o. Por exemplo\: um war empacotado dentro de um ear.
global.read-attribute=Obt\u00E9m o valor de um atributo para o recurso selecionado
global.read-attribute.name=O nome do atributo para obter o valor sob o recurso selecionado\n
global.read-attribute.include-defaults=O Boolean para ativar/desativar a leitura padr\u00E3o. No caso dele ser configurado para falso, apenas o atributo configurado pelo usu\u00E1rio \u00E9 retornado ignorando-o indefinitivamente.
global.read-attribute.reply=O valor do atributo. O tipo ser\u00E1 aquele que o atributo encontrar
global.read-children-names=Obtenha os nomes de todos os filhos sob o recurso selecionado com o tipo gerado
global.read-children-names.child-type=O nome pelo qual obter os nomes dos filhos
global.read-children-names.reply=Os nomes dos filhos
global.read-children-types=Obt\u00E9m os nomes do tipo de todos os filhos sob o recurso selecionado
global.read-children-types.reply=Os tipos do filho
global.read-children-resources=L\u00EA informa\u00E7\u00E3o sobre todos os filhos do recurso que s\u00E3o de um tipo gerado
global.read-children-resources.child-type=O nome do recurso pelo qual obter os recursos filho
global.read-children-resources.recursive=Se \u00E9 que obter o filho recursivamente.Caso ausente, o padr\u00E3o ser\u00E1 falso
global.read-children-resources.recursive-depth=A profundidade pela qual a informa\u00E7\u00E3o sobre os recursos filho devem ser inclu\u00EDdos.
global.read-children-resources.proxies=Se \u00E9 que incluir os recursos remotos numa fila recursiva (ex.\: recursos do n\u00EDvel do host numa fila da raiz do dom\u00EDnio; rodando os recursos do servidor numa fila de um host). Caso ausente, o padr\u00E3o ser\u00E1 falso
global.read-children-resources.include-runtime=Se \u00E9 que incluir os atributos no per\u00EDodo de rodagem (ex.\: aqueles cujos valores n\u00E3o v\u00EAm da configura\u00E7\u00E3o de persist\u00EAncia) na resposta. Caso ausente, o padr\u00E3o ser\u00E1 falso. Isto ser\u00E1 ignorado caso o par\u00E2metro 'recursivo' esteja configurado para 'verdadeiro'. Por exemplo\: os atributos do per\u00EDodo de rodagem podem apenas ser lidos nas filas n\u00E3o-recursivas.
global.read-children-resources.include-defaults=O Boolean para ativar/desativar a leitura padr\u00E3o. No caso disto estar configurado para falso, apenas o atributo configurado pelo usu\u00E1rio \u00E9 retornado ignorando a indefini\u00E7\u00E3o. 
global.read-children-resources.reply=Os recursos filhos
global.read-operation=Obt\u00E9m os detalhes de uma opera\u00E7\u00E3o no recurso gerado
global.read-operation.locale=A localiza\u00E7\u00E3o para obter a descri\u00E7\u00E3o da opera\u00E7\u00E3o. Caso isto seja nulo, a localiza\u00E7\u00E3o padr\u00E3o ser\u00E1 usada 
global.read-operation.reply=O nome da opera\u00E7\u00E3o para obter detalhes
global.read-operation.type=A descri\u00E7\u00E3o da opera\u00E7\u00E3o. Isto ser\u00E1 indefinido, caso n\u00E3o seja encontrado
global.read-operation-names=Obt\u00E9m os nomes de todas as opera\u00E7\u00F5es para o recurso gerado
global.read-operation-names.reply=Os nomes da opera\u00E7\u00E3o
global.read-resource=L\u00EA os valores do atributo do recurso do modelo juntamente com a informa\u00E7\u00E3o tanto completa ou b\u00E1sica sobre quaisquer recursos filhos
global.read-resource.recursive=Se \u00E9 que incluir a informa\u00E7\u00E3o completa sobre os recursos filhos, recursivamente. Caso ausente, o padr\u00E3o ser\u00E1 falso
global.read-resource.recursive-depth=A profundidade pela qual a informa\u00E7\u00E3o sobre os recursos filhos devem se inclu\u00EDdos.
global.read-resource.proxies=Se \u00E9 que incluir os recursos remotos numa fila recursiva (ex.\: recursos \u00E0 n\u00EDvel host numa fila da raiz do dom\u00EDnio\: os recursos do servidor rodando numa fila de um host). Caso ausente, o padr\u00E3o falso ser\u00E1 usado.
global.read-resource.include-runtime=Se \u00E9 que incluir os atributos do per\u00EDodo de rodagem (ex.\: aqueles cujos valores n\u00E3o v\u00EAm da configura\u00E7\u00E3o persistente) na resposta. Caso ausente, o padr\u00E3o ser\u00E1 falso. 
global.read-resource.include-defaults=O Boolean para ativar/desativar a leitura padr\u00E3o. No caso disto estar configurado para falso, apenas o atributo configurado pelo usu\u00E1rio \u00E9 retornado ignorando a indefini\u00E7\u00E3o.
global.read-resource.reply=Os valores do atributo do recurso juntamente com a informa\u00E7\u00E3o sobre quaisquer recursos filhos
global.read-resource-description=Obt\u00E9m a descri\u00E7\u00E3o dos atributos de recurso, tipos de filho e, opcionalmente, opera\u00E7\u00F5es
global.read-resource-description.locale=A localiza\u00E7\u00E3o para obter a descri\u00E7\u00E3o do recurso. Caso seja nulo, a localiza\u00E7\u00E3o padr\u00E3o ser\u00E1 usada
global.read-resource-description.operations=Se \u00E9 que incluir as descri\u00E7\u00F5es das opera\u00E7\u00F5es do recurso. O padr\u00E3o \u00E9 falso
global.read-resource-description.inherited=Caso 'opera\u00E7\u00F5es' sejam verdadeiro, se \u00E9 que incluir as descri\u00E7\u00F5es das opera\u00E7\u00F5es herdados das opera\u00E7\u00F5es herdadas do recurso. O padr\u00E3o \u00E9 verdadeiro.
global.read-resource-description.recursive=Se \u00E9 que incluir as descri\u00E7\u00F5es recursivas dos recursos filhos. O padr\u00E3o \u00E9 falso.
global.read-resource-description.proxies=Se \u00E9 que incluir os recursos numa fila recursiva (ex.\: os recursos \u00E0 n\u00EDvel do host numa fila da raiz do dom\u00EDnio\: os recursos do servidor rodando numa fila de um host). Caso ausente, o padr\u00E3o ser\u00E1 falso
global.read-resource-description.recursive-depth=A profundidade pela qual a informa\u00E7\u00E3o sobre os recursos filhos deve ser inclu\u00EDda.
global.read-resource-description.reply=A descri\u00E7\u00E3o do recurso
global.undefine-attribute=Determina o valor de um atributo do recurso selecionado para 'indefinido'
global.undefine-attribute.name=O nome do atributo pelo qual deve ser configurado para 'indefinido'
global.write-attribute=Determina o valor de um atributo para o recurso selecionado
global.write-attribute.name=O nome do atributo para determinar o valor sob o recurso selecionado
global.write-attribute.value=O valor do atributo a determinar o valor sob o recurso selecionado. Isto pode ser nulo, caso o modelo subjacente suportar os valores nulos.
global.validate-address=Verifica se \u00E9 que o recurso com o endere\u00E7o passado como argumento existe.
global.validate-address.value=O endere\u00E7o a ser checado.
global.validate-address.reply=Relata a checagem do endere\u00E7o.
global.validate-address.reply.valid=Indica se \u00E9 que o recurso com o endere\u00E7o passado como argumento existe.
global.validate-address.reply.problem=\u00C9 apenas inclu\u00EDdo, caso o endere\u00E7o n\u00E3o \u00E9 v\u00E1lido e descreve o que est\u00E1 errado com o endere\u00E7o.
global.validate-operation=Valida que uma opera\u00E7\u00E3o \u00E9 v\u00E1lida de acordo com sua descri\u00E7\u00E3o. Quaisquer erros presentes ser\u00E3o apresentados na descri\u00E7\u00E3o de falha da opera\u00E7\u00E3o.
global.validate-operation.value=A opera\u00E7\u00E3o a ser validada.
root.composite=Uma opera\u00E7\u00E3o que a opera\u00E7\u00E3o m\u00FAltipla dos grupos solicita numa solicita\u00E7\u00E3o de opera\u00E7\u00E3o \u00FAnica.
root.composite.steps=A lista de solicita\u00E7\u00F5es da opera\u00E7\u00E3o que constituem a solicita\u00E7\u00E3o composta.
root.composite.reply=A resposta da opera\u00E7\u00E3o composta que consiste de todos os resultados da etapa.
read-config-as-xml=L\u00EA a configura\u00E7\u00E3o atual e a retorna num formato XML.
read-config-as-xml.response=O formato XML da configura\u00E7\u00E3o persistente.
jvm=A configura\u00E7\u00E3o JVM para servidores/processos gerenciados.
jvm.add=Adiciona uma nova configura\u00E7\u00E3o JVM.
jvm.remove=Remove uma configura\u00E7\u00E3o JVM existente.
jvm.name=O nome da configura\u00E7\u00E3o JVM.
jvm.heap=O tamanho inicial da pilha alocado pelo JVM.
jvm.heap.max=O tamanho m\u00E1ximo da pilha que pode ser alocado pelo JVM.
jvm.permgen=O tamanho de gera\u00E7\u00E3o permanente inicial.
jvm.permgen.max=O tamanho m\u00E1ximo da gera\u00E7\u00E3o permanente.
jvm.stack=As configura\u00E7\u00F5es do tamanho da pilha JVM.
jvm.agent.lib=O lib do agente JVM.
jvm.agent.path=O caminho do agente JVM.
jvm.javaagent=O agente java.
jvm.option=A op\u00E7\u00E3o JVM.
jvm.options=As op\u00E7\u00F5es JVM.
jvm.option.add=Adiciona a op\u00E7\u00E3o jvm.
jvm.option.remove=Remove a op\u00E7\u00E3o jvm.
jvm.env.variables=As vari\u00E1veis do ambiente JVM.
jvm.system.properties=As propriedades do sistema JVM.
jvm.java.home=A p\u00E1gina principal do java
jvm.type=O tipo JVM pode ser tanto SUN ou IBM
jvm.debug.enabled=O valor do Boolean indicando se \u00E9 que a depura\u00E7\u00E3o est\u00E1 ativada.
jvm.debug.options=As op\u00E7\u00F5es de depura\u00E7\u00E3o.
jvm.env.classpath.ignored=Ignora o classpath do ambiente.
snapshot.delete.description=Deleta o trecho do diret\u00F3rio dos trechos.
snapshot.delete.name=O nome do trecho a ser deletado. O nome completo n\u00E3o \u00E9 necess\u00E1rio, contanto que o que seja passado unicamente identifique o trecho com o diret\u00F3rio dos trechos. Caso 'todos' seja usado, todos os trechos no diret\u00F3rio de trecho ser\u00E3o deletados.
snapshot.list.description=Lista dos trechos
snapshot.list.reply.dir=O diret\u00F3rio onde os trechos s\u00E3o armazeenados
snapshot.list.reply.names=Os nomes dos trechos com o diret\u00F3rio dos trechos
snapshot.take.description=Leva um trecho da configura\u00E7\u00E3o atual
snapshot.take.reply.name=A localiza\u00E7\u00E3o do arquivo na m\u00E1quina que a configura\u00E7\u00E3o pertence
vault=Vault de Seguran\u00E7a para os atributos.
vault.code=Nome Inteiramente Qualificado da Implanta\u00E7\u00E3o Vault de Seguran\u00E7a.
vault.option=Op\u00E7\u00E3o Vault de Seguran\u00E7a.
vault.options=Op\u00E7\u00F5es Vault de Seguran\u00E7a.
vault.add=Adiciona o Vault de Seguran\u00E7a.
vault.remove=Remove o Vault de Seguran\u00E7a.
core.resolve-expression=A opera\u00E7\u00E3o que aceita uma express\u00E3o como entrada (ou uma sequ\u00EAncia que pode ser analisada numa express\u00E3o) e a resolve nas propriedades do sistema local e vari\u00E1veis de ambiente. 
core.resolve-expression.expression=A express\u00E3o a ser resolvida.
core.resolve-expression.reply=A express\u00E3o resolvida, ou o formul\u00E1rio da sequ\u00EAncia do valor de entrada original, caso ele n\u00E3o representar uma express\u00E3o.
