namespaces=Map von im Konfigurations-XML-Dokument verwendeten Namespaces, wobei Schl\u00FCssel Namespace-Pr\u00E4fixe und Werte Schema-URIs sind.
namespaces.add=F\u00FCgt der Namespaces-Attribute-Map ein Namespace-Pr\u00E4fix-Mapping hinzu.
namespaces.add.prefix=Der Pr\u00E4fix des hinzuzuf\u00FCgenden Namespace.
namespaces.add.uri=Die Schema-uri des hinzuzuf\u00FCgenden Namespace.
namespaces.remove=Entfernt ein Namespace-Pr\u00E4fix-Mapping aus der Namespaces-Attribute-Map.
namespaces.remove.namespace=Der Pr\u00E4fix des zu entfernenden Namespace.
schema-locations.add.schema-location=Der Speicherort, an dem das hinzugef\u00FCgt Schema gefunden werden kann.
schema-locations.remove=Entfernt das Speicherort-Mapping des Schemas aus der Map des  schema-locations Attributes.
schema-locations.remove.schema-uri=Die URI des zu entfernenden Schema-Speicherorts.
core.management.security-realm.server-identity=Konfiguration der Identit\u00E4ten, die den Server repr\u00E4sentieren.
core.management.security-realm.server-identity.secret.value=Das Geheimnis / Passwort - Base64 verschl\u00FCsselt.
core.management.security-realm.server-identity.ssl=Konfiguration der SSL-Identit\u00E4t eines Servers oder Host-Controllers.
core.management.security-realm.server-identity.ssl.add=F\u00FCgt die SSL-Identit\u00E4t eines Servers oder Host-Controllers hinzu.
core.management.security-realm.server-identity.ssl.remove=Entfernt die SSL-Identit\u00E4t eines Servers oder Host-Controllers.
core.management.security-realm.server-identity.ssl.protocol=Das bei der Erstellung des SSLContext zu verwendende Protokoll.
core.management.security-realm.server-identity.ssl.keystore-password=Das zum \u00D6ffnen des Keystore zu verwendende Passwort.
core.management.security-realm.server-identity.ssl.keystore-path=Der Pfad des Keystore.
core.management.security-realm.authentication.truststore.keystore-password=Das zum \u00D6ffnen des Keystore zu verwendende Passwort.
core.management.security-realm.authentication.truststore.keystore-path=Der Pfad des Keystore.
core.management.security-realm.authentication.jaas=Als JAAS-LoginContext zur Authentifizierung zu verwendende Konfiguration.
core.management.security-realm.authentication.jaas.add=F\u00FCgt eine Konfiguration zur Verwendung von JAAS zur Authentifizierung hinzu.
core.management.security-realm.authentication.jaas.remove=Entfernt eine Konfiguration zur Verwendung von JAAS zur Authentifizierung.
core.management.security-realm.authentication.jaas.name=Der Name der zu verwendenden JAAS-Konfiguration.
core.management.security-realm.authentication.ldap.connection=Der Name der f\u00FCr die Verbindung mit LDAP zu verwendenden Verbindung.
core.management.security-realm.authentication.ldap.recursive=Ob die Suche rekursiv sein soll.
core.management.security-realm.authentication.properties.path=Der Pfad der die Nutzer enthaltenden Properties-Datei. 
core.management.security-realm.authentication.xml.user=Ein autorisierter Nutzer.
core.management.security-realm.authentication.xml.user.add=F\u00FCgt einen autorisierten Nutzer hinzu.
core.management.security-realm.authentication.xml.user.remove=Entfernt einen autorisierten Nutzer.
core.management.security-realm.authentication.xml.user.password=Das Passwort des Nutzers.
core.management.security-realm.authorization.properties.add=F\u00FCgt eine Konfiguration zur Verwendung einer Properties-Datei zum Laden von Benutzerrollen hinzu.
core.management.security-realm.authorization.properties.remove=Entfernt eine Konfiguration zur Verwendung einer Properties-Datei zum Laden von Benutzerrollen.
core.management.security-realm.authorization.properties.path=Der Pfad der Properties-Datei, der die Benutzerrollen enth\u00E4lt. 
core.management.ldap-connection.url=Die f\u00FCr die Verbindung zum LDAP-Server zu verwendende URL. 
core.management.ldap-connection.initial-context-factory=Die anf\u00E4ngliche Context-Factory zur Schaffung des LdapContext.
core.management.native-interface=Konfiguration des nativen Management-Interface des Servers
core.management.native-interface.add=F\u00FCgt die Konfiguration des nativen Management-Interface des Servers hinzu
core.management.native-interface.interface=Netzwerk-Interface, an dem das Socket des Servers f\u00FCr native Management-Kommunikation ge\u00F6ffnet werden sollte. Muss 'undefined' sein, wenn das 'socket-binding'-Attribut eingestellt ist.
core.management.native-interface.port=Port, an dem das Socket des Servers f\u00FCr native Management-Kommunikation ge\u00F6ffnet werden sollte. Muss 'undefined' sein, wenn das 'socket-binding'-Attribut eingestellt ist.
core.management.http-interface=Konfiguration des HTTP Management-Interface des Servers
core.management.http-interface.add=F\u00FCgt die Konfiguration des HTTP Management-Interface des Servers hinzu
core.management.http-interface.port=Port, an dem das Socket des Servers f\u00FCr HTTP Management-Kommunikation ge\u00F6ffnet werden sollte. 
extension.module=Der Name des Moduls.
extension.add=F\u00FCgt eine Erweiterung hinzu. 
extension.remove=Entfernt eine Erweiterung. 
extension.subsystem=Ein von der Erweiterung geliefertes Subsystem. Was hier bereitgestellt wird sind vom Untersystem gelieferte Informationen zum xml-Schema und dem Management-Interface, nicht die Konfiguration des Untersystems selbst. 
specified_path=Ein benannter Dateisystem-Pfad. 
path.add=Einen neuen Pfad hinzuf\u00FCgen.
path.add.path=Der Wert des 'path'-Attributs des Pfads
path.add.relative-to=TDer Wert des 'relative-to'-Attributs des Pfades
path.remove=Einen Pfad entfernen
profile=Ein benannter Satz von Untersystem Konfigurationen.
profile.name=Der Name des Profils
profile.add=Ein neues 'profile' hinzuf\u00FCgen
profile.add.includes=Der Wert des 'includes'-Attributs des neuen Profils
profile.describe=Gibt die Untersysteme des Profils als eine Liste von Operationen aus, die zur Erstellung desselben Modells ausgef\u00FChrt werden kann
profile.remove=Entfernt ein 'profile'
profile.remove.name=Der Wert des 'name'-Attributs des Profils
profile.includes=Eine Liste anderer Profile, die in diesem Profil eingeschlossen werden sollen
profile.include.profile=Der Name des eingeschlossenen Profils
profile.includes.add=Der Liste eingeschlossener Profile ein Profil hinzuf\u00FCgen
profile.includes.add.include=Der Name des eingeschlossenen Profils
profile.includes.remove=Ein Profil aus der Liste eingeschlossener Profile entfernen
profile.includes.remove.include=Der Name des eingeschlossenen Profils
profile.subsystem=Die Untersysteme, aus denen das Profil besteht.
specified_interface=Ein benanntes Netzwerk-Interface sowie die ben\u00F6tigten Kriterien zur Bestimmung der mit diesem Interface assoziierten IP-Adresse. 
interface.name=Der Name des Interface.
interface.criteria=Veraltet. Ein Satz von Kriterien, die zur Runtime dazu eingesetzt werden k\u00F6nnen, welche IP-Adresse f\u00FCr ein Interface verwendet werden soll.
interface.add=Eine neue Interface-Spezifikation hinzuf\u00FCgen.
interface.add.criteria=Veraltet.
interface.remove=Eine Interface-Spezifikation entfernen.
interface.any-address=Attribut das anzeigt, dass dieses Interface verwendende Sockets an eine Platzhalter-Adresse gebunden werden sollten. Es wird die IPv6 Platzhalter-Adresse (\:\:) verwendet, au\u00DFer die java.net.preferIpV4Stack System-Property ist auf "true" eingestellt, in welchem Fall die IPv4 Platzhalter-Adresse (0.0.0.0) verwendet wird. Wird ein Socket an eine IPv6 anylocal-Adresse an einer dual-stack Maschine gebunden, so kann es sowohl IPv6 als auch IPv4 Traffic akzeptieren; wird es an eine IPv4 (IPv4-gemappte) anylocal-Adresse gebunden, so kann es nur IPv4 Traffic akzeptieren.
interface.any-ipv4-address=Attribut das anzeigt, dass dieses Interface verwendende Sockets an die IPv4 Platzhalter-Adresse (0.0.0.0) gebunden werden sollten.
interface.any-ipv6-address=Attribut das anzeigt, dass dieses Interface verwendende Sockets an die IPv6 Platzhalter-Adresse (\:\:) gebunden werden sollten.
socket-binding-group=Enth\u00E4lt eine Liste von Socket-Konfigurationen.
socket-binding-group.name=Der Name der Socket-Binding-Gruppe. 
socket-binding-group.default-interface=Name eines Interface, das als Interface f\u00FCr Sockets verwenden soll, die keines explizit deklariert haben. 
socket-binding-group.add=F\u00FCgt eine Socket-Binding-Gruppe hinzu.
socket-binding-group.remove=Entfernt eine Socket-Binding-Gruppe.
socket-binding-group.include.add=F\u00FCgt dem 'includes'-Attribut der Socket Binding Gruppe eine Socket Binding Gruppe hinzu. 
socket-binding-group.include.add.include=Der Name der Socket-Binding-Gruppe, die enthalten sein soll.  
socket-binding-group.include.remove=Entfernt eine  Socket-Binding-Gruppe aus dem 'includes'-Attribut der Socket-Binding-Gruppe.
socket-binding-group.include.remove.include=Der Name der Socket-Binding-Gruppe, die nicht mehr l\u00E4nger enthalten sein soll.  
socket-binding=Konfigurationsinformationen f\u00FCr ein Socket.
socket-binding.name=Der Name des Socket. Dienste, die auf die Konfigurationsinformationen des Sockets zugreifen m\u00FCssen, finden es \u00FCber diesen Namen.
socket-binding.port=Nummer des Ports, an den das Socket gebunden werden sollte.
socket-binding.add=F\u00FCgt der Gruppe eine Socket-Binding-Konfiguration hinzu.
socket-binding.remove=Entfernt eine Socket-Binding-Konfiguration aus der Gruppe.
system-property.add=F\u00FCgt eine System-Property hinzu oder aktualisiert eine bestehende. 
system-property.remove=Entfernt eine System-Property.
system-property.value=Der Wert der System-Property.
deployment.name=Eindeutiger Bezeichner des Deployments. Muss \u00FCber alle Deployments hinweg eindeutig sein.
deployment.content=Liste von Content-Teilen, aus denen das Deployment besteht.
deployment.path=Pfad (relativ oder absolut) zu nicht gemanagtem Content, der Teil des Deployments ist.
deployment.deploy.name=Der Name des neuen Content.
deployment.deploy.to-replace=Der Name des zu ersetzenden Content.
deployment.replace=Ersetzen Sie den bestehenden Content zur Runtime durch neuen Content. Der neue Content muss zuvor im Deployment Content Repository hochgeladen worden sein.
deployment.replace.name=Der Name des neuen Content.
deployment.replace.to-replace=Der Name des zu ersetzenden Content.
deployment.status=Der aktuelle Runtime-Status eines Deployments. M\u00F6gliche Status-Modi sind OK, FAILED und STOPPED. FAILED zeigt an, dass eine Abh\u00E4ngigkeit fehlt oder ein Dienst nicht starten k\u00F6nnte. STOPPED zeigt an, dass das Deployment nicht aktiviert war oder manuell gestoppt wurde. 
global.read-attribute=Ruft den Wert eines Attributs f\u00FCr die gew\u00E4hlte Ressource ab
global.read-attribute.reply=Der Wert des Attributs. Der Typ ist derselbe, wie der des gefundenen Attributs 
global.read-children-resources.reply=Die untergeordneten Ressourcen
global.read-resource-description.reply=Die Beschreibung der Ressource.
global.undefine-attribute=Setzt den Wert eines Attributs der gew\u00E4hlten Ressource auf 'undefined'
global.undefine-attribute.name=Der Name des Attributs, das auf 'undefined' gesetzt werden soll
global.write-attribute=Setzt den Wert eines Attributs f\u00FC die gew\u00E4hlte Ressource 
global.validate-address.value=Die zu pr\u00FCfende Adresse. 
global.validate-address.reply=Bericht der Adressenpr\u00FCfung.
global.validate-operation.value=Die zu validierende Operation. 
read-config-as-xml=Liest die aktuelle Konfiguration und gibt sie im XML-Format wieder.
read-config-as-xml.response=Die XML-Form der persistenten Konfiguration.
jvm=Die JVM-Konfiguration f\u00FCr gemanagte Prozesse / Server.
jvm.add=Hinzuf\u00FCgen einer neuen JVM-Konfiguration.
jvm.remove=Entfernung einer JVM-Konfiguration.
jvm.name=Der Name der JVM-Konfiguration.
jvm.heap=Die von der JVM uspr\u00FCnglich zugewiesene Heap-Gr\u00F6\u00DFe.
jvm.heap.max=Die maximale Heap-Gr\u00F6\u00DFe die von der JVM ugewiesen werden kann.
jvm.permgen.max=Die maximale Gr\u00F6\u00DFe der permanenten Generierung.
jvm.stack=Die Gr\u00F6\u00DFeneinstellungen des JVM-Stack. 
jvm.agent.lib=Die JVM Agent-lib.
jvm.agent.path=Der JVM Agent-Pfad.
jvm.javaagent=Der java-Agent.
jvm.option=Eine JVM-Option.
jvm.options=Die JVM-Optionen.
jvm.option.add=Hinzuf\u00FCgen einer jvm-Option.
jvm.option.remove=Entfernen einer jvm-Option.
jvm.env.variables=Die JVM-Umgebungsvariablen.
jvm.system.properties=Sie JVM-System-Properties.
jvm.java.home=Das java Home
jvm.type=Der JVM-Typ kann entweder SUN oder IBM sein
jvm.debug.options=Die Optionen zur Fehlerbehebung.
jvm.env.classpath.ignored=Ignorieren Sie den Umgebungs-Klassenpfad.
snapshot.delete.description=L\u00F6scht einen Schnappschuss aus dem Schnappschuss-Verzeichnis
snapshot.delete.name=Der Name des zu l\u00F6schenden Schnappschusses. Es wird nicht der gesamte Name ben\u00F6tigt, so lange der eingegebene Teil den Schnappschuss innerhalb des Schnappschuss-Verzeichnisses eindeutig identifiziert. Wird 'all' verwendet, so werden alle Schnappsch\u00FCsse im Schnappschuss-Verzeichnis gel\u00F6scht.
snapshot.list.description=Listet die Schnappsch\u00FCsse
snapshot.list.reply.dir=Das Verzeichnis, in dem die Schnappsch\u00FCsse aufbewahrt werden
snapshot.list.reply.names=Die Namen der Schnappsch\u00FCsse innerhalb des Schnappschuss-Verzeichnisses
snapshot.take.description=Macht einen Schnappschuss der aktuellen Konfiguration
vault=Security Vault f\u00FCr Attribute.
vault.code=Vollst\u00E4ndiger Name der Security Vault Implementierung.
vault.option=Security Vault Option.
vault.options=Security Vault Optionen.
vault.add=F\u00FCgen Sie den Security Vault hinzu.
vault.remove=Entfernen Sie den Security Vault.
core.resolve-expression.expression=Der aufzul\u00F6sende Ausdruck.
core.resolve-expression.reply=Der aufgel\u00F6ste Ausdruck oder die String-Form des urspr\u00FCnglichen Eingabewerts, falls dieser keinen Ausdruck repr\u00E4sentierte. 
