namespaces=\u8A2D\u5B9A XML \u30C9\u30AD\u30E5\u30E1\u30F3\u30C8\u3067\u5229\u7528\u3055\u308C\u308B\u540D\u524D\u7A7A\u9593\u30DE\u30C3\u30D7\u3002\u3053\u3053\u3067\u306F\u3001\u30AD\u30FC\u306F\u540D\u524D\u7A7A\u9593\u306E\u30D7\u30EC\u30D5\u30A3\u30C3\u30AF\u30B9\u3001\u5024\u306F\u30B9\u30AD\u30FC\u30DE URI \u3068\u306A\u3063\u3066\u3044\u307E\u3059\u3002
namespaces.add=\u540D\u524D\u7A7A\u9593\u30D7\u30EC\u30D5\u30A3\u30C3\u30AF\u30B9\u306E\u30DE\u30C3\u30D4\u30F3\u30B0\u3092\u540D\u524D\u7A7A\u9593\u5C5E\u6027\u306E\u30DE\u30C3\u30D7\u306B\u8FFD\u52A0\u3057\u307E\u3059\u3002
namespaces.add.prefix=\u8FFD\u52A0\u4E88\u5B9A\u306E\u540D\u524D\u7A7A\u9593\u30D7\u30EC\u30D5\u30A3\u30C3\u30AF\u30B9
namespaces.add.uri=\u8FFD\u52A0\u4E88\u5B9A\u306E\u540D\u524D\u7A7A\u9593\u30B9\u30AD\u30FC\u30DE uri
namespaces.remove=\u540D\u524D\u7A7A\u9593\u5C5E\u6027\u306E\u30DE\u30C3\u30D7\u304B\u3089\u540D\u524D\u7A7A\u9593\u30D7\u30EC\u30D5\u30A3\u30C3\u30AF\u30B9\u30DE\u30C3\u30D4\u30F3\u30B0\u3092\u524A\u9664\u3057\u307E\u3059\u3002
namespaces.remove.namespace=\u524A\u9664\u4E88\u5B9A\u306E\u540D\u524D\u7A7A\u9593\u30D7\u30EC\u30D5\u30A3\u30C3\u30AF\u30B9
schema-locations=\u8A2D\u5B9A XML \u6587\u66F8\u3067\u5229\u7528\u3059\u308B XML \u30B9\u30AD\u30FC\u30DE\u306E\u30ED\u30B1\u30FC\u30B7\u30E7\u30F3\u30DE\u30C3\u30D7\u3002\u3053\u3053\u3067\u306F\u30AD\u30FC\u306F\u30B9\u30AD\u30FC\u30DE URI \u3067\u5024\u306F\u30B9\u30AD\u30FC\u30DE\u304C\u3042\u308B\u5834\u6240\u3067\u3059\u3002
schema-locations.add=\u30B9\u30AD\u30FC\u30DE\u306E\u30ED\u30B1\u30FC\u30B7\u30E7\u30F3\u30DE\u30C3\u30D4\u30F3\u30B0\u3092schema-locations \u5C5E\u6027\u306E\u30DE\u30C3\u30D7\u306B\u8FFD\u52A0\u3057\u307E\u3059\u3002
schema-locations.add.uri=\u8FFD\u52A0\u4E88\u5B9A\u306E\u30B9\u30AD\u30FC\u30DE\u30ED\u30B1\u30FC\u30B7\u30E7\u30F3 uri
schema-locations.add.schema-location=\u8FFD\u52A0\u3057\u305F\u30B9\u30AD\u30FC\u30DE\u304C\u3042\u308B\u5834\u6240
schema-locations.remove=\u30B9\u30AD\u30FC\u30DE\u306E\u30ED\u30B1\u30FC\u30B7\u30E7\u30F3\u30DE\u30C3\u30D4\u30F3\u30B0\u3092 schema-locations \u5C5E\u6027\u304B\u3089\u524A\u9664\u3057\u307E\u3059\u3002
schema-locations.remove.schema-uri=\u524A\u9664\u4E88\u5B9A\u306E\u30B9\u30AD\u30FC\u30DE\u30ED\u30B1\u30FC\u30B7\u30E7\u30F3 uri
core.management=\u7BA1\u7406\u30C9\u30E1\u30A4\u30F3\u306B\u3042\u308B\u30B9\u30BF\u30F3\u30C9\u30A2\u30ED\u30FC\u30F3\u30B5\u30FC\u30D0\u30FC\u3042\u308B\u3044\u306F\u30DB\u30B9\u30C8\u306E\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u3092\u5236\u5FA1\u3059\u308B\u305F\u3081\u306B\u5229\u7528\u3059\u308B\u7BA1\u7406\u30B5\u30FC\u30D3\u30B9
core.management.security-realms=\u7BA1\u7406\u30B5\u30FC\u30D3\u30B9\u3078\u306E\u30A2\u30AF\u30BB\u30B9\u5236\u5FA1\u306B\u5229\u7528\u53EF\u80FD\u306A\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30EC\u30EB\u30E0
core.management.security-realm=\u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u306B\u95A2\u9023\u4ED8\u3051\u308B\u3053\u3068\u304C\u3067\u304D\u3001\u7BA1\u7406\u30B5\u30FC\u30D3\u30B9\u3078\u306E\u30A2\u30AF\u30BB\u30B9\u3092\u5236\u5FA1\u3059\u308B\u969B\u306B\u5229\u7528\u53EF\u80FD\u306A\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30EC\u30EB\u30E0
core.management.security-realm.add=\u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u306B\u95A2\u9023\u4ED8\u3051\u308B\u3053\u3068\u304C\u3067\u304D\u3001\u7BA1\u7406\u30B5\u30FC\u30D3\u30B9\u3078\u306E\u30A2\u30AF\u30BB\u30B9\u3092\u5236\u5FA1\u3059\u308B\u969B\u306B\u5229\u7528\u53EF\u80FD\u306A\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30EC\u30EB\u30E0\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
core.management.security-realm.remove=\u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u306B\u95A2\u9023\u4ED8\u3051\u308B\u3053\u3068\u304C\u3067\u304D\u3001\u7BA1\u7406\u30B5\u30FC\u30D3\u30B9\u3078\u306E\u30A2\u30AF\u30BB\u30B9\u3092\u5236\u5FA1\u3059\u308B\u969B\u306B\u5229\u7528\u53EF\u80FD\u306A\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30EC\u30EB\u30E0\u3092\u524A\u9664\u3057\u307E\u3059\u3002
core.management.security-realm.server-identity=\u30B5\u30FC\u30D0\u30FC\u3092\u6307\u3059\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u8A2D\u5B9A
core.management.security-realm.server-identity.secret=\u30B5\u30FC\u30D0\u30FC\u3042\u308B\u3044\u306F\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u306E\u79D8\u5BC6\uFF0F\u30D1\u30B9\u30EF\u30FC\u30C9\u30D9\u30FC\u30B9\u306E\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u8A2D\u5B9A
core.management.security-realm.server-identity.secret.add=\u30B5\u30FC\u30D0\u30FC\u3042\u308B\u3044\u306F\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u306E\u79D8\u5BC6\uFF0F\u30D1\u30B9\u30EF\u30FC\u30C9\u30D9\u30FC\u30B9\u306E\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
core.management.security-realm.server-identity.secret.remove=\u30B5\u30FC\u30D0\u30FC\u3042\u308B\u3044\u306F\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u306E\u79D8\u5BC6\uFF0F\u30D1\u30B9\u30EF\u30FC\u30C9\u30D9\u30FC\u30B9\u306E\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u3092\u524A\u9664\u3057\u307E\u3059\u3002
core.management.security-realm.server-identity.secret.value=\u79D8\u5BC6\uFF0F\u30D1\u30B9\u30EF\u30FC\u30C9 - Base64 \u3067\u30A8\u30F3\u30B3\u30FC\u30C9\u3055\u308C\u3066\u3044\u307E\u3059\u3002
core.management.security-realm.server-identity.ssl=\u30B5\u30FC\u30D0\u30FC\u3042\u308B\u3044\u306F\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u306E SSL \u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u8A2D\u5B9A
core.management.security-realm.server-identity.ssl.add=\u30B5\u30FC\u30D0\u30FC\u3042\u308B\u3044\u306F\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u306E SSL \u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
core.management.security-realm.server-identity.ssl.remove=\u30B5\u30FC\u30D0\u30FC\u3042\u308B\u3044\u306F\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u306E SSL \u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u3092\u524A\u9664\u3057\u307E\u3059\u3002
core.management.security-realm.server-identity.ssl.protocol=SSLContext \u4F5C\u6210\u6642\u306B\u4F7F\u3046\u30D7\u30ED\u30C8\u30B3\u30EB
core.management.security-realm.server-identity.ssl.keystore-password=\u30AD\u30FC\u30B9\u30C8\u30A2\u3092\u958B\u304F\u305F\u3081\u306E\u30D1\u30B9\u30EF\u30FC\u30C9
core.management.security-realm.server-identity.ssl.keystore-path=\u30AD\u30FC\u30B9\u30C8\u30A2\u306E\u30D1\u30B9
core.management.security-realm.server-identity.ssl.keystore-relative-to=\u4EE5\u524D\u306B\u540D\u524D\u6307\u5B9A\u3055\u308C\u305F\u5225\u306E\u30D1\u30B9\u540D\u3001\u3042\u308B\u3044\u306F\u30B7\u30B9\u30C6\u30E0\u304C\u63D0\u793A\u3059\u308B\u6A19\u6E96\u30D1\u30B9\u3002'relative-to' \u304C\u6307\u5B9A\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u306F\u3001'path' \u5C5E\u6027\u306E\u5024\u306F\u3053\u306E\u5C5E\u6027\u304C\u6307\u5B9A\u3057\u305F\u30D1\u30B9\u3092\u8D77\u70B9\u3068\u3057\u305F\u76F8\u5BFE\u30D1\u30B9\u3068\u3057\u3066\u51E6\u7406\u3055\u308C\u307E\u3059\u3002
core.management.security-realm.authentication=\u30B5\u30FC\u30D0\u30FC\u5074\u306E\u8A8D\u8A3C\u30E1\u30AB\u30CB\u30BA\u30E0\u8A2D\u5B9A\u3002\u30AA\u30D7\u30B7\u30E7\u30F3\u3067\u3001\u30C8\u30E9\u30B9\u30C8\u30B9\u30C8\u30A2\u3068\u30E6\u30FC\u30B6\u30FC\uFF0F\u30D1\u30B9\u30EF\u30FC\u30C9\u30D9\u30FC\u30B9\u306E\u30B9\u30C8\u30A2\u3092\u5B9A\u7FA9\u53EF\u80FD\u3067\u3059\u3002\u8A8D\u8A3C\u306F\u307E\u305A\u3001\u30C8\u30E9\u30B9\u30C8\u30B9\u30C8\u30A2\u3092\u4F7F\u3046\u3088\u3046\u306B\u8A66\u884C\u3057\u3001\u30C8\u30E9\u30B9\u30C8\u30B9\u30C8\u30A2\u304C\u306A\u3044\u5834\u5408\u306F\u3001\u30E6\u30FC\u30B6\u30FC\uFF0F\u30D1\u30B9\u30EF\u30FC\u30C9\u8A8D\u8A3C\u306B\u623B\u308A\u307E\u3059\u3002\u4F55\u3082\u6307\u5B9A\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u3001\u552F\u4E00\u5229\u7528\u3067\u304D\u308B\u30E1\u30AB\u30CB\u30BA\u30E0\u306F\u30CD\u30FC\u30C6\u30A3\u30D6\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u306E\u30ED\u30FC\u30AB\u30EB\u30E1\u30AB\u30CB\u30BA\u30E0\u3067\u3001HTTP \u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u306F\u30A2\u30AF\u30BB\u30B9\u3067\u304D\u307E\u305B\u3093\u3002
core.management.security-realm.authentication.truststore=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u691C\u8A3C\u3092\u884C\u3046\u30C8\u30E9\u30B9\u30C8\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u3092\u4F5C\u6210\u3059\u308B\u306E\u306B\u4F7F\u3046\u30AD\u30FC\u30B9\u30C8\u30A2\u8A2D\u5B9A
core.management.security-realm.authentication.truststore.add=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u691C\u8A3C\u3092\u884C\u3046\u30C8\u30E9\u30B9\u30C8\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u3092\u4F5C\u6210\u3059\u308B\u306E\u306B\u4F7F\u3046\u30AD\u30FC\u30B9\u30C8\u30A2\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
core.management.security-realm.authentication.truststore.remove=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u691C\u8A3C\u3092\u884C\u3046\u30C8\u30E9\u30B9\u30C8\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u3092\u4F5C\u6210\u3059\u308B\u306E\u306B\u4F7F\u3046\u30AD\u30FC\u30B9\u30C8\u30A2\u3092\u524A\u9664\u3057\u307E\u3059\u3002
core.management.security-realm.authentication.truststore.keystore-password=\u30AD\u30FC\u30B9\u30C8\u30A2\u3092\u958B\u304F\u305F\u3081\u306E\u30D1\u30B9\u30EF\u30FC\u30C9
core.management.security-realm.authentication.truststore.keystore-path=\u30AD\u30FC\u30B9\u30C8\u30A2\u306E\u30D1\u30B9
core.management.security-realm.authentication.truststore.keystore-relative-to=\u4EE5\u524D\u306B\u540D\u524D\u6307\u5B9A\u3055\u308C\u305F\u5225\u306E\u30D1\u30B9\u540D\u3001\u3042\u308B\u3044\u306F\u30B7\u30B9\u30C6\u30E0\u304C\u63D0\u793A\u3059\u308B\u6A19\u6E96\u30D1\u30B9\u3002'relative-to' \u304C\u6307\u5B9A\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u306F\u3001'path' \u5C5E\u6027\u306E\u5024\u306F\u3053\u306E\u5C5E\u6027\u304C\u6307\u5B9A\u3057\u305F\u30D1\u30B9\u3092\u8D77\u70B9\u3068\u3057\u305F\u76F8\u5BFE\u30D1\u30B9\u3068\u3057\u3066\u51E6\u7406\u3055\u308C\u307E\u3059\u3002
core.management.security-realm.authentication.jaas=\u30E6\u30FC\u30B6\u30FC\u8A8D\u8A3C\u3092\u884C\u3046 JAAS LoginContext \u3092\u4F7F\u3046\u8A2D\u5B9A
core.management.security-realm.authentication.jaas.add=\u8A8D\u8A3C\u306B JAAS \u3092\u4F7F\u3046\u8A2D\u5B9A\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
core.management.security-realm.authentication.jaas.remove=\u8A8D\u8A3C\u306B JAAS \u3092\u4F7F\u3046\u8A2D\u5B9A\u3092\u524A\u9664\u3057\u307E\u3059\u3002
core.management.security-realm.authentication.jaas.name=\u5229\u7528\u3059\u308B JAAS \u8A2D\u5B9A\u540D
core.management.security-realm.authentication.ldap=\u30E6\u30FC\u30B6\u30FC\u30EC\u30DD\u30B8\u30C8\u30EA\u3068\u3057\u3066LDAP \u3092\u4F7F\u3046\u8A2D\u5B9A
core.management.security-realm.authentication.ldap.add=\u30E6\u30FC\u30B6\u30FC\u30EC\u30DD\u30B8\u30C8\u30EA\u3068\u3057\u3066LDAP \u3092\u4F7F\u3046\u8A2D\u5B9A\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
core.management.security-realm.authentication.ldap.remove=\u30E6\u30FC\u30B6\u30FC\u30EC\u30DD\u30B8\u30C8\u30EA\u3068\u3057\u3066LDAP \u3092\u4F7F\u3046\u8A2D\u5B9A\u3092\u524A\u9664\u3057\u307E\u3059\u3002
core.management.security-realm.authentication.ldap.connection=LDAP \u306B\u63A5\u7D9A\u3059\u308B\u305F\u3081\u306B\u4F7F\u3046\u63A5\u7D9A\u540D
core.management.security-realm.authentication.ldap.base-dn=\u30E6\u30FC\u30B6\u30FC\u691C\u7D22\u3092\u958B\u59CB\u3059\u308B\u305F\u3081\u306E\u57FA\u672C\u8B58\u5225\u540D
core.management.security-realm.authentication.ldap.recursive=\u691C\u7D22\u304C\u518D\u5E30\u7684\u304B\u3069\u3046\u304B
core.management.security-realm.authentication.ldap.user-dn=\u30E6\u30FC\u30B6\u30FC\u306E\u8B58\u5225\u540D\u3067\u3042\u308B\u5C5E\u6027\u540D
core.management.security-realm.authentication.ldap.username-attribute=\u30E6\u30FC\u30B6\u30FC\u691C\u7D22\u306E\u305F\u3081\u306E\u5C5E\u6027\u540D\u3002\u3053\u306E\u30D5\u30A3\u30EB\u30BF\u30FC\u306F\u7C21\u6613\u691C\u7D22\u3092\u5B9F\u884C\u3057\u3001\u30E6\u30FC\u30B6\u30FC\u304C\u5165\u529B\u3057\u305F\u30E6\u30FC\u30B6\u30FC\u540D\u3068\u3053\u3053\u3067\u6307\u5B9A\u3057\u305F\u5C5E\u6027\u3092\u30DE\u30C3\u30C1\u3057\u307E\u3059\u3002
core.management.security-realm.authentication.ldap.advanced-filter=\u5165\u529B\u3057\u305F\u30E6\u30FC\u30B6\u30FC ID \u3092\u5143\u306B\u30E6\u30FC\u30B6\u30FC\u3092\u691C\u7D22\u3059\u308B\u969B\u306B\u5229\u7528\u3059\u308B\u5B8C\u5168\u5B9A\u7FA9\u30D5\u30A3\u30EB\u30BF\u30FC\u3002\u3053\u306E\u30D5\u30A3\u30EB\u30BF\u30FC\u306B\u306F {0} \u3068\u3044\u3063\u305F\u5F62\u5F0F\u306E\u5909\u6570\u3092\u542B\u3080\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002\u3053\u308C\u306F\u30E6\u30FC\u30B6\u30FC\u304C\u63D0\u4F9B\u3059\u308B\u30E6\u30FC\u30B6\u30FC\u540D\u3068\u7F6E\u304D\u63DB\u3048\u3089\u308C\u307E\u3059\u3002
core.management.security-realm.authentication.properties=.properties \u30D5\u30A1\u30A4\u30EB\u5185\u306B\u683C\u7D0D\u3057\u305F\u30E6\u30FC\u30B6\u30FC\u4E00\u89A7\u3092\u30E6\u30FC\u30B6\u30FC\u30EC\u30DD\u30B8\u30C8\u30EA\u3068\u3057\u3066\u4F7F\u3046\u3088\u3046\u8A2D\u5B9A\u3002.properties \u30D5\u30A1\u30A4\u30EB\u5185\u306B\u3042\u308B\u30A8\u30F3\u30C8\u30EA\u306F username\={credentials} \u3067\u3001\u5404\u30E6\u30FC\u30B6\u30FC\u306F\u305D\u306E\u30E6\u30FC\u30B6\u30FC\u306E\u884C\u3067\u6307\u5B9A\u3055\u308C\u3066\u3044\u307E\u3059\u3002
core.management.security-realm.authentication.properties.add=.properties \u30D5\u30A1\u30A4\u30EB\u5185\u306B\u683C\u7D0D\u3055\u308C\u3066\u3044\u308B\u30E6\u30FC\u30B6\u30FC\u4E00\u89A7\u3092\u30E6\u30FC\u30B6\u30FC\u30EC\u30DD\u30B8\u30C8\u30EA\u3068\u3057\u3066\u4F7F\u3046\u8A2D\u5B9A\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
core.management.security-realm.authentication.properties.remove=.properties \u30D5\u30A1\u30A4\u30EB\u5185\u306B\u683C\u7D0D\u3055\u308C\u3066\u3044\u308B\u30E6\u30FC\u30B6\u30FC\u4E00\u89A7\u3092\u30E6\u30FC\u30B6\u30FC\u30EC\u30DD\u30B8\u30C8\u30EA\u3068\u3057\u3066\u4F7F\u3046\u8A2D\u5B9A\u3092\u524A\u9664\u3057\u307E\u3059\u3002
core.management.security-realm.authentication.properties.path=\u30E6\u30FC\u30B6\u30FC\u3092\u542B\u3080 .properties \u30D5\u30A1\u30A4\u30EB\u306E\u30D1\u30B9
core.management.security-realm.authentication.properties.relative-to=\u4EE5\u524D\u306B\u540D\u524D\u6307\u5B9A\u3055\u308C\u305F\u5225\u306E\u30D1\u30B9\u540D\u3001\u3042\u308B\u3044\u306F\u30B7\u30B9\u30C6\u30E0\u304C\u63D0\u793A\u3059\u308B\u6A19\u6E96\u30D1\u30B9\u3002'relative-to' \u304C\u6307\u5B9A\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u306F\u3001'path' \u5C5E\u6027\u306E\u5024\u306F\u3053\u306E\u5C5E\u6027\u304C\u6307\u5B9A\u3057\u305F\u30D1\u30B9\u3092\u8D77\u70B9\u3068\u3057\u305F\u76F8\u5BFE\u30D1\u30B9\u3068\u3057\u3066\u51E6\u7406\u3055\u308C\u307E\u3059\u3002
core.management.security-realm.authentication.properties.plain-text=\u30D7\u30EC\u30FC\u30F3\u30C6\u30AD\u30B9\u30C8\u306B\u4FDD\u5B58\u3055\u308C\u3066\u3044\u308B .properties \u30D5\u30A1\u30A4\u30EB\u5185\u306E\u8A8D\u8A3C\u60C5\u5831\u3002\u305D\u3046\u3067\u306A\u3044\u5834\u5408\u3001\u8A8D\u8A3C\u60C5\u5831\u306F 'username \: realm \: password' \u306E16 \u9032\u30A8\u30F3\u30B3\u30FC\u30C9\u306E\u30C0\u30A4\u30B8\u30A7\u30B9\u30C8\u30CF\u30C3\u30B7\u30E5\u3068\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
core.management.security-realm.authentication.xml=standalone.xml \u3042\u308B\u3044\u306F host.xml \u8A2D\u5B9A\u30D5\u30A1\u30A4\u30EB\u5185\u306B\u30E6\u30FC\u30B6\u30FC\u30EC\u30DD\u30B8\u30C8\u30EA\u3068\u3057\u3066\u76F4\u63A5\u4FDD\u5B58\u3057\u305F\u30E6\u30FC\u30B6\u30FC\u4E00\u89A7\u3092\u4F7F\u3046\u8A2D\u5B9A
core.management.security-realm.authentication.xml.add=standalone.xml \u3042\u308B\u3044\u306F host.xml \u8A2D\u5B9A\u30D5\u30A1\u30A4\u30EB\u5185\u306B\u30E6\u30FC\u30B6\u30FC\u30EC\u30DD\u30B8\u30C8\u30EA\u3068\u3057\u3066\u76F4\u63A5\u4FDD\u5B58\u3057\u305F\u30E6\u30FC\u30B6\u30FC\u4E00\u89A7\u3092\u4F7F\u3046\u8A2D\u5B9A\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
core.management.security-realm.authentication.xml.remove=standalone.xml \u3042\u308B\u3044\u306F host.xml \u8A2D\u5B9A\u30D5\u30A1\u30A4\u30EB\u5185\u306B\u30E6\u30FC\u30B6\u30FC\u30EC\u30DD\u30B8\u30C8\u30EA\u3068\u3057\u3066\u76F4\u63A5\u4FDD\u5B58\u3057\u305F\u30E6\u30FC\u30B6\u30FC\u4E00\u89A7\u3092\u4F7F\u3046\u8A2D\u5B9A\u3092\u524A\u9664\u3057\u307E\u3059\u3002
core.management.security-realm.authentication.xml.user=\u8A8D\u5B9A\u30E6\u30FC\u30B6\u30FC
core.management.security-realm.authentication.xml.user.add=\u8A8D\u5B9A\u30E6\u30FC\u30B6\u30FC\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
core.management.security-realm.authentication.xml.user.remove=\u8A8D\u5B9A\u30E6\u30FC\u30B6\u30FC\u3092\u524A\u9664\u3057\u307E\u3059\u3002
core.management.security-realm.authentication.xml.user.password=\u30E6\u30FC\u30B6\u30FC\u306E\u30D1\u30B9\u30EF\u30FC\u30C9
core.management.security-realm.authorization=\u5F8C\u7D9A\u306E\u8A8D\u8A3C\u30C1\u30A7\u30C3\u30AF\u306A\u3069\u3067\u4F7F\u3046\u3088\u3046\u306B\u30ED\u30FC\u30EB\u306A\u3069\u3001\u30E6\u30FC\u30B6\u30FC\u8A73\u7D30\u60C5\u5831\u3092\u8AAD\u307F\u8FBC\u3080\u305F\u3081\u306E\u30B5\u30FC\u30D0\u30FC\u5074\u306E\u8A2D\u5B9A
core.management.security-realm.authorization.properties=.properties \u30D5\u30A1\u30A4\u30EB\u3092\u5229\u7528\u3057\u30E6\u30FC\u30B6\u30FC\u30ED\u30FC\u30EB\u3092\u30ED\u30FC\u30C9\u3059\u308B\u305F\u3081\u306E\u8A2D\u5B9A\u3002.properties \u30D5\u30A1\u30A4\u30EB\u5185\u306E\u30A8\u30F3\u30C8\u30EA\u306Fusername\={roles} \u3067\u3001roles \u306E\u90E8\u5206\u306F\u30E6\u30FC\u30B6\u30FC\u30ED\u30FC\u30EB\u3092\u30B3\u30F3\u30DE\u533A\u5207\u308A\u3067\u30EA\u30B9\u30C8\u30A2\u30C3\u30D7\u3057\u307E\u3059\u3002
core.management.security-realm.authorization.properties.add=.properties \u30D5\u30A1\u30A4\u30EB\u3092\u5229\u7528\u3057\u30E6\u30FC\u30B6\u30FC\u30ED\u30FC\u30EB\u3092\u30ED\u30FC\u30C9\u3059\u308B\u305F\u3081\u306E\u8A2D\u5B9A\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
core.management.security-realm.authorization.properties.remove=.properties \u30D5\u30A1\u30A4\u30EB\u3092\u5229\u7528\u3057\u30E6\u30FC\u30B6\u30FC\u30ED\u30FC\u30EB\u3092\u30ED\u30FC\u30C9\u3059\u308B\u305F\u3081\u306E\u8A2D\u5B9A\u3092\u524A\u9664\u3057\u307E\u3059\u3002
core.management.security-realm.authorization.properties.path=\u30E6\u30FC\u30B6\u30FC\u30ED\u30FC\u30EB\u3092\u542B\u3080 .properties \u30D5\u30A1\u30A4\u30EB\u306E\u30D1\u30B9
core.management.security-realm.authorization.properties.relative-to=\u4EE5\u524D\u306B\u540D\u524D\u6307\u5B9A\u3055\u308C\u305F\u5225\u306E\u30D1\u30B9\u540D\u3001\u3042\u308B\u3044\u306F\u30B7\u30B9\u30C6\u30E0\u304C\u63D0\u793A\u3059\u308B\u6A19\u6E96\u30D1\u30B9\u3002'relative-to' \u304C\u6307\u5B9A\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u306F\u3001'path' \u5C5E\u6027\u306E\u5024\u306F\u3053\u306E\u5C5E\u6027\u304C\u6307\u5B9A\u3057\u305F\u30D1\u30B9\u3092\u8D77\u70B9\u3068\u3057\u305F\u76F8\u5BFE\u30D1\u30B9\u3068\u3057\u3066\u51E6\u7406\u3055\u308C\u307E\u3059\u3002
core.management.ldap-connections=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30EC\u30EB\u30E0\u304C\u8A8D\u8A3C\u30BD\u30FC\u30B9\u3042\u308B\u3044\u306F\u8A8D\u8A3C\u60C5\u5831\u3068\u3057\u3066LDAP \u30B5\u30FC\u30D0\u30FC\u3078\u30A2\u30AF\u30BB\u30B9\u3067\u304D\u308B\u3088\u3046\u306B\u5229\u7528\u3059\u308B\u63A5\u7D9A\u30D5\u30A1\u30AF\u30C8\u30EA\u8A2D\u5B9A
core.management.ldap-connection=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30EC\u30EB\u30E0\u304C\u8A8D\u8A3C\u30BD\u30FC\u30B9\u3042\u308B\u3044\u306F\u8A8D\u8A3C\u60C5\u5831\u3068\u3057\u3066LDAP \u30B5\u30FC\u30D0\u30FC\u3078\u30A2\u30AF\u30BB\u30B9\u3067\u304D\u308B\u3088\u3046\u306B\u5229\u7528\u3059\u308B\u63A5\u7D9A\u30D5\u30A1\u30AF\u30C8\u30EA
core.management.ldap-connection.add=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30EC\u30EB\u30E0\u304C\u8A8D\u8A3C\u30BD\u30FC\u30B9\u3042\u308B\u3044\u306F\u8A8D\u8A3C\u60C5\u5831\u3068\u3057\u3066LDAP \u30B5\u30FC\u30D0\u30FC\u3078\u30A2\u30AF\u30BB\u30B9\u3067\u304D\u308B\u3088\u3046\u306B\u5229\u7528\u3059\u308B\u63A5\u7D9A\u30D5\u30A1\u30AF\u30C8\u30EA\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
core.management.ldap-connection.remove=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30EC\u30EB\u30E0\u304C\u8A8D\u8A3C\u30BD\u30FC\u30B9\u3042\u308B\u3044\u306F\u8A8D\u8A3C\u60C5\u5831\u3068\u3057\u3066LDAP \u30B5\u30FC\u30D0\u30FC\u3078\u30A2\u30AF\u30BB\u30B9\u3067\u304D\u308B\u3088\u3046\u306B\u5229\u7528\u3059\u308B\u63A5\u7D9A\u30D5\u30A1\u30AF\u30C8\u30EA\u3092\u524A\u9664\u3057\u307E\u3059\u3002
core.management.ldap-connection.url=LDAP \u30B5\u30FC\u30D0\u30FC\u3078\u63A5\u7D9A\u3059\u308B\u305F\u3081\u306B\u5229\u7528\u3059\u308B URL
core.management.ldap-connection.search-dn=\u691C\u7D22\u3092\u884C\u3046\u305F\u3081\u306B LDAP \u30B5\u30FC\u30D0\u30FC\u3078\u63A5\u7D9A\u6642\u306B\u5229\u7528\u3059\u308B\u8B58\u5225\u540D
core.management.ldap-connection.search-credential=\u63A5\u7D9A\u3057\u691C\u7D22\u3092\u884C\u3046\u969B\u306B\u5229\u7528\u3059\u308B\u8A8D\u8A3C\u60C5\u5831
core.management.ldap-connection.initial-context-factory=LdapContext \u3092\u4F5C\u6210\u3059\u308B\u521D\u671F\u30B3\u30F3\u30C6\u30AD\u30B9\u30C8\u30D5\u30A1\u30AF\u30C8\u30EA
core.management.management-interfaces=\u7BA1\u7406\u30B5\u30FC\u30D3\u30B9\u304C\u516C\u958B\u3059\u308B\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u3067\u3001\u5916\u90E8\u306E\u547C\u3073\u51FA\u3057\u5143\u304C\u7BA1\u7406\u30BF\u30B9\u30AF\u3092\u5B9F\u884C\u3067\u304D\u308B\u3088\u3046\u306B\u3057\u307E\u3059\u3002
core.management.native-interface=\u30B5\u30FC\u30D0\u30FC\u306E\u30CD\u30FC\u30C6\u30A3\u30D6\u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u8A2D\u5B9A
core.management.native-interface.add=\u30B5\u30FC\u30D0\u30FC\u306E\u30CD\u30FC\u30C6\u30A3\u30D6\u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u8A2D\u5B9A\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
core.management.native-interface.interface=\u30CD\u30FC\u30C6\u30A3\u30D6\u7BA1\u7406\u901A\u4FE1\u7528\u306E\u30B5\u30FC\u30D0\u30FC\u30BD\u30B1\u30C3\u30C8\u3092\u958B\u304F\u3079\u304D\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u3002'socket-binding' \u5C5E\u6027\u304C\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u306F 'undefined' \u3067\u306A\u3051\u308C\u3070\u306A\u308A\u307E\u305B\u3093\u3002
core.management.native-interface.port=\u30CD\u30FC\u30C6\u30A3\u30D6\u7BA1\u7406\u901A\u4FE1\u7528\u306E\u30B5\u30FC\u30D0\u30FC\u30BD\u30B1\u30C3\u30C8\u3092\u958B\u304F\u3079\u304D\u30DD\u30FC\u30C8\u3002'socket-binding' \u5C5E\u6027\u304C\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u306F 'undefined' \u3067\u306A\u3051\u308C\u3070\u306A\u308A\u307E\u305B\u3093\u3002
core.management.native-interface.security-realm=\u30CD\u30FC\u30C6\u30A3\u30D6\u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u306B\u5229\u7528\u3059\u308B\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30EC\u30EB\u30E0
core.management.native-interface.socket-binding=\u30CD\u30FC\u30C6\u30A3\u30D6\u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u306E\u30BD\u30B1\u30C3\u30C8\u3092\u4F7F\u3046\u305F\u3081\u306E\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u8A2D\u5B9A\u540D
core.management.native-remoting-interface=\u30EA\u30E2\u30FC\u30C8\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u304B\u3089\u306E\u30B3\u30CD\u30AF\u30BF\u30FC\u3092\u4F7F\u3046\u30B5\u30FC\u30D0\u30FC\u306E\u30CD\u30FC\u30C6\u30A3\u30D6\u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u8A2D\u5B9A
core.management.native-remoting-interface.add=\u30EA\u30E2\u30FC\u30C8\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u304B\u3089\u306E\u30B3\u30CD\u30AF\u30BF\u30FC\u3092\u4F7F\u3046\u30B5\u30FC\u30D0\u30FC\u306E\u30CD\u30FC\u30C6\u30A3\u30D6\u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u8A2D\u5B9A\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
core.management.http-interface=\u30B5\u30FC\u30D0\u30FC\u306E HTTP \u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u306E\u8A2D\u5B9A
core.management.http-interface.add=\u30B5\u30FC\u30D0\u30FC\u306E HTTP \u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u306E\u8A2D\u5B9A\u3092\u8FFD\u52A0
core.management.http-interface.interface=HTTP \u7BA1\u7406\u901A\u4FE1\u3067\u30B5\u30FC\u30D0\u30FC\u306E\u30BD\u30B1\u30C3\u30C8\u3092\u958B\u304F\u3079\u304D\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9
core.management.http-interface.port=HTTP \u7BA1\u7406\u901A\u4FE1\u3067\u30B5\u30FC\u30D0\u30FC\u306E\u30BD\u30B1\u30C3\u30C8\u3092\u958B\u304F\u3079\u304D\u30DD\u30FC\u30C8
core.service-container=\u7A3C\u50CD\u4E2D\u306E\u30B9\u30BF\u30F3\u30C9\u30A2\u30ED\u30FC\u30F3\u30B5\u30FC\u30D0\u30FC\u304B\u3001\u7BA1\u7406\u30C9\u30E1\u30A4\u30F3\u306E\u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u5185\u306B\u3042\u308B\u5168\u30B5\u30FC\u30D3\u30B9\u3092\u7BA1\u7406\u3059\u308B\u96C6\u7D04\u30B3\u30F3\u30C6\u30CA\u30FC
extension=\u30C9\u30E1\u30A4\u30F3\u3042\u308B\u3044\u306F\u30B9\u30BF\u30F3\u30C9\u30A2\u30ED\u30FC\u30F3\u30B5\u30FC\u30D0\u30FC\u306E\u6A19\u6E96\u6A5F\u80FD\u3092\u62E1\u5F35\u3059\u308B\u30E2\u30B8\u30E5\u30FC\u30EB
extension.module=\u30E2\u30B8\u30E5\u30FC\u30EB\u540D
extension.add=\u62E1\u5F35\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
extension.remove=\u62E1\u5F35\u3092\u524A\u9664\u3057\u307E\u3059\u3002
extension.subsystem=\u62E1\u5F35\u306B\u3088\u308A\u63D0\u4F9B\u3055\u308C\u308B\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u3002\u3053\u3053\u3067\u63D0\u4F9B\u3055\u308C\u308B\u306E\u306F\u3001\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u304C\u63D0\u4F9B\u3059\u308B xml \u30B9\u30AD\u30FC\u30DE\u3068\u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u306B\u95A2\u3059\u308B\u60C5\u5831\u3067\u3001\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u81EA\u4F53\u306E\u8A2D\u5B9A\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3002
extension.subsystem.xml-namespaces=\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u306E XML \u30D1\u30FC\u30B5\u30FC\u304C\u30B5\u30DD\u30FC\u30C8\u3059\u308B XML \u540D\u524D\u7A7A\u9593\u306E URI \u4E00\u89A7\u3002\u62E1\u5F35\u304C\u660E\u78BA\u306BXML \u540D\u524D\u7A7A\u9593\u3068\u7279\u5B9A\u306E\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u3092\u95A2\u4FC2\u4ED8\u3051\u3066\u3044\u308B\u5834\u5408\u306F\u7A7A\u3067\u3082\u69CB\u3044\u307E\u305B\u3093\u3002
extension.subsystem.management-major-version=\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u306E\u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u306E\u30E1\u30B8\u30E3\u30FC\u30D0\u30FC\u30B8\u30E7\u30F3\u3002\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u304C\u73FE\u5728\u30D0\u30FC\u30B8\u30E7\u30F3\u5316\u3055\u308C\u305F\u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u3092\u63D0\u4F9B\u3057\u3066\u3044\u308B\u5834\u5408\u306F undefined \u3067\u3082\u69CB\u3044\u307E\u305B\u3093\u3002
extension.subsystem.management-minor-version=\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u306E\u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u306E\u30DE\u30A4\u30CA\u30FC\u30D0\u30FC\u30B8\u30E7\u30F3\u3002\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u304C\u73FE\u5728\u30D0\u30FC\u30B8\u30E7\u30F3\u5316\u3055\u308C\u305F\u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u3092\u63D0\u4F9B\u3057\u3066\u3044\u308B\u5834\u5408\u306F undefined \u3067\u3082\u69CB\u3044\u307E\u305B\u3093\u3002
named_path=\u540D\u524D\u4ED8\u304D\u306E\u30D5\u30A1\u30A4\u30EB\u30B7\u30B9\u30C6\u30E0\u30D1\u30B9\u3067\u3059\u304C\u3001\u5B9F\u969B\u306E\u30D1\u30B9\u3092\u6307\u5B9A\u3059\u308B\u5FC5\u8981\u306F\u3042\u308A\u307E\u305B\u3093\u3002\u5B9F\u969B\u306E\u30D1\u30B9\u304C\u6307\u5B9A\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u3001\u3088\u308A\u4F4E\u3044\u30EC\u30D9\u30EB (\u4F8B\uFF1A\u5229\u7528\u53EF\u80FD\u306A\u30A2\u30C9\u30EC\u30B9\u304C\u5206\u304B\u3063\u3066\u3044\u308B\u30DB\u30B9\u30C8\u30EC\u30D9\u30EB\u306A\u3069) \u3067\u5B8C\u5168\u6307\u5B9A\u306E\u30D1\u30B9\u5B9A\u7FA9\u304C\u9069\u7528\u3055\u308C\u308B\u307E\u3067\u3001\u30E2\u30C7\u30EB(\u4F8B\uFF1A\u30C9\u30E1\u30A4\u30F3\u30EC\u30D9\u30EB) \u306E\u30D7\u30EC\u30FC\u30B9\u30DB\u30EB\u30C0\u30FC\u3068\u3057\u3066\u306E\u5F79\u5272\u3092\u679C\u305F\u3057\u307E\u3059\u3002
specified_path=\u540D\u524D\u4ED8\u304D\u306E\u30D5\u30A1\u30A4\u30EB\u30B7\u30B9\u30C6\u30E0\u30D1\u30B9
path.name=\u30D1\u30B9\u306E\u540D\u524D\u3002\u30B7\u30B9\u30C6\u30E0\u63D0\u4F9B\u306E\u6A19\u6E96\u56FA\u5B9A\u30D1\u30B9\u306E\uFF11\u3064\u3092\u53D6\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002<ul><li>jboss.home - JBoss AS \u30C7\u30A3\u30B9\u30C8\u30EA\u30D3\u30E5\u30FC\u30B7\u30E7\u30F3\u306E root \u30C7\u30A3\u30EC\u30AF\u30C8\u30EA</li><li>user.home - \u30E6\u30FC\u30B6\u30FC\u306E\u30DB\u30FC\u30E0\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA</li><li>user.dir - \u30E6\u30FC\u30B6\u30FC\u306E\u73FE\u5728\u4F5C\u696D\u4E2D\u306E\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA</li><li>java.home - java \u306E\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u8A2D\u5B9A\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA</li><li>jboss.server.base.dir - \u5404\u30B5\u30FC\u30D0\u30FC\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306E root \u30C7\u30A3\u30EC\u30AF\u30C8\u30EA</li></ul> \u6CE8\uFF1A\u30B7\u30B9\u30C6\u30E0\u3067\u306F\u305D\u306E\u4ED6\u306E\u6A19\u6E96\u30D1\u30B9\u3092\u63D0\u4F9B\u3057\u307E\u3059\u304C\u3001\u8A2D\u5B9A\u30D5\u30A1\u30A4\u30EB\u3067\u5BA3\u8A00\u3059\u308B\u3053\u3068\u3067\u3053\u306E\u30D1\u30B9\u306F\u30AA\u30FC\u30D0\u30FC\u30E9\u30A4\u30C9\u53EF\u80FD\u3067\u3059\u3002\u6A19\u6E96\u30D1\u30B9\u306E\u5B8C\u5168\u4E00\u89A7\u306B\u3064\u3044\u3066\u306F 'relative-to' \u5C5E\u6027\u306E\u30C9\u30AD\u30E5\u30E1\u30F3\u30C8\u3092\u53C2\u7167\u3057\u3066\u304F\u3060\u3055\u3044\u3002
path.path=\u5B9F\u969B\u306E\u30D5\u30A1\u30A4\u30EB\u30B7\u30B9\u30C6\u30E0\u30D1\u30B9\u3002'relative-to' \u5C5E\u6027\u3068\u3057\u3066\u6307\u5B9A\u3055\u308C\u3066\u3044\u306A\u3044\u9650\u308A\u3001\u7D76\u5BFE\u30D1\u30B9\u3068\u3057\u3066\u51E6\u7406\u3055\u308C\u307E\u3059\u3002'relative-to' \u5C5E\u6027\u3068\u3057\u3066\u3044\u308B\u5834\u5408\u306F\u3001\u305D\u306E\u30D1\u30B9\u3092\u8D77\u70B9\u306B\u3057\u305F\u76F8\u5BFE\u30D1\u30B9\u3068\u3057\u3066\u5024\u304C\u51E6\u7406\u3055\u308C\u307E\u3059\u3002<p>\u7D76\u5BFE\u30D1\u30B9\u3068\u3057\u3066\u51E6\u7406\u3055\u308C\u308B\u5834\u5408\u3001\u3053\u306E\u5C5E\u6027\u5024\u304C\u6307\u5B9A\u3059\u308B\u5B9F\u969B\u306E\u30E9\u30F3\u30BF\u30A4\u30E0\u30D1\u30B9\u540D\u306F\u4EE5\u4E0B\u306E\u3088\u3046\u306B\u6C7A\u5B9A\u3055\u308C\u307E\u3059\u3002</p>\u3053\u306E\u5024\u304C\u3059\u3067\u306B\u7D76\u5BFE\u30D1\u30B9\u306E\u5834\u5408\u3001\u5024\u306F\u76F4\u63A5\u5229\u7528\u3055\u308C\u307E\u3059\u3002\u305D\u3046\u3067\u306A\u3044\u5834\u5408\u3001\u30E9\u30F3\u30BF\u30A4\u30E0\u30D1\u30B9\u540D\u304C\u30B7\u30B9\u30C6\u30E0\u306B\u4F9D\u5B58\u3059\u308B\u5F62\u3067\u89E3\u6C7A\u3055\u308C\u307E\u3059\u3002UNIX \u30B7\u30B9\u30C6\u30E0\u3067\u306F\u3001\u76F8\u5BFE\u30D1\u30B9\u540D\u306F\u73FE\u5728\u306E\u30E6\u30FC\u30B6\u30FC\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u306B\u5BFE\u3057\u3066\u89E3\u6C7A\u3059\u308B\u3053\u3068\u3067\u7D76\u5BFE\u30D1\u30B9\u306B\u5909\u63DB\u3055\u308C\u307E\u3059\u3002Microsoft Windows \u30B7\u30B9\u30C6\u30E0\u3067\u306F\u3001\u30D1\u30B9\u540D\u3067\u6307\u5B9A\u3057\u3066\u3044\u308B\u30C9\u30E9\u30A4\u30D6\u306E\u73FE\u5728\u306E\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u304C\u3042\u308C\u3070\u305D\u308C\u306B\u5BFE\u3057\u3066\u89E3\u6C7A\u3059\u308B\u3053\u3068\u3067\u3001\u76F8\u5BFE\u30D1\u30B9\u304C\u7D76\u5BFE\u30D1\u30B9\u306B\u5909\u63DB\u3055\u308C\u307E\u3059\u3002\u306A\u3044\u5834\u5408\u306F\u3001\u73FE\u5728\u306E\u30E6\u30FC\u30B6\u30FC\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u306B\u5BFE\u3057\u3066\u89E3\u6C7A\u3055\u308C\u308B\u3053\u3068\u3067\u7D76\u5BFE\u30D1\u30B9\u306B\u5909\u63DB\u3055\u308C\u307E\u3059\u3002
path.relative-to=\u4EE5\u524D\u306B\u540D\u524D\u6307\u5B9A\u3055\u308C\u305F\u30D1\u30B9\u306E\u540D\u524D\u3001\u3042\u308B\u3044\u306F\u30B7\u30B9\u30C6\u30E0\u304C\u63D0\u4F9B\u3057\u305F\u6A19\u6E96\u30D1\u30B9\u306E1\u3064\u3002'relative-to' \u304C\u6307\u5B9A\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u306F\u3001'path' \u5C5E\u6027\u306E\u5024\u306F\u3053\u306E\u5C5E\u6027\u304C\u6307\u5B9A\u3057\u305F\u30D1\u30B9\u3092\u8D77\u70B9\u3068\u3057\u305F\u76F8\u5BFE\u30D1\u30B9\u3068\u3057\u3066\u51E6\u7406\u3055\u308C\u307E\u3059\u3002\u30B7\u30B9\u30C6\u30E0\u304C\u63D0\u4F9B\u3059\u308B\u6A19\u6E96\u30D1\u30B9\u306F\u4EE5\u4E0B\u306E\u901A\u308A\u3067\u3059\u3002<ul><li>jboss.home - JBoss AS \u30C7\u30A3\u30B9\u30C8\u30EA\u30D3\u30E5\u30FC\u30B7\u30E7\u30F3\u306E root \u30C7\u30A3\u30EC\u30AF\u30C8\u30EA</li><li>user.home - \u30E6\u30FC\u30B6\u30FC\u306E\u30DB\u30FC\u30E0\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA</li><li>user.dir - \u30E6\u30FC\u30B6\u30FC\u306E\u73FE\u5728\u4F5C\u696D\u4E2D\u306E\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA</li><li>java.home - java \u306E\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u8A2D\u5B9A\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA</li><li>jboss.server.base.dir - \u5404\u30B5\u30FC\u30D0\u30FC\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306E root \u30C7\u30A3\u30EC\u30AF\u30C8\u30EA</li><li>jboss.server.data.dir - \u30B5\u30FC\u30D0\u30FC\u304C\u6C38\u7D9A\u30C7\u30FC\u30BF\u306E\u30D5\u30A1\u30A4\u30EB\u4FDD\u5B58\u306B\u4F7F\u3046\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA</li><li>jboss.server.log.dir - \u30B5\u30FC\u30D0\u30FC\u304C\u30ED\u30B0\u30D5\u30A1\u30A4\u30EB\u306E\u4FDD\u5B58\u306B\u4F7F\u3046\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA</li><li>jboss.server.tmp.dir - \u30B5\u30FC\u30D0\u30FC\u304C\u4E00\u6642\u7684\u306A\u30D5\u30A1\u30A4\u30EB\u4FDD\u5B58\u306B\u4F7F\u3046\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA</li><li>jboss.domain.servers.dir - \u30DB\u30B9\u30C8\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u914D\u4E0B\u3067\u500B\u5225\u30B5\u30FC\u30D0\u30FC\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u306E\u4F5C\u696D\u30A8\u30EA\u30A2\u3092\u4F5C\u6210\u3059\u308B\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA</li></ul>
path.add=\u65B0\u898F\u30D1\u30B9\u306E\u8FFD\u52A0
path.add.path=\u30D1\u30B9\u306E 'path' \u5C5E\u6027\u306E\u5024
path.add.relative-to=\u30D1\u30B9\u306E 'relative-to' \u5C5E\u6027\u5024
path.remove=\u30D1\u30B9\u306E\u524A\u9664
profile=\u540D\u524D\u306E\u4ED8\u3044\u305F\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u8A2D\u5B9A\u30BB\u30C3\u30C8
profile.name=\u30D7\u30ED\u30D5\u30A1\u30A4\u30EB\u540D
profile.add=\u65B0\u898F 'profile' \u306E\u8FFD\u52A0
profile.add.includes=\u65B0\u898F\u30D7\u30ED\u30D5\u30A1\u30A4\u30EB\u306E 'includes' \u5C5E\u6027\u5024
profile.describe=\u540C\u3058\u30E2\u30C7\u30EB\u3092\u4F5C\u6210\u3059\u308B\u305F\u3081\u306B\u5B9F\u884C\u53EF\u80FD\u306A\u64CD\u4F5C\u4E00\u89A7\u3068\u3057\u3066\u3001\u30D7\u30ED\u30D5\u30A1\u30A4\u30EB\u306E\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u3092\u51FA\u529B\u3057\u307E\u3059\u3002
profile.remove='profile' \u306E\u524A\u9664
profile.remove.name=\u30D7\u30ED\u30D5\u30A1\u30A4\u30EB\u306E 'name' \u5C5E\u6027\u5024
profile.includes=\u3053\u306E\u30D7\u30ED\u30D5\u30A1\u30A4\u30EB\u306B\u542B\u3081\u308B\u305D\u306E\u4ED6\u306E\u30D7\u30ED\u30D5\u30A1\u30A4\u30EB\u4E00\u89A7
profile.include=\u5B9A\u7FA9\u306B\u3053\u306E\u30A2\u30A4\u30C6\u30E0\u3092\u542B\u3080\u30D7\u30ED\u30D5\u30A1\u30A4\u30EB\u306B\u3001\u540D\u524D\u4ED8\u304D\u306E\u30D7\u30ED\u30D5\u30A1\u30A4\u30EB\u30B3\u30F3\u30C6\u30F3\u30C4\u3092\u542B\u3081\u308B\u65E8\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
profile.include.profile=\u5BFE\u8C61\u30D7\u30ED\u30D5\u30A1\u30A4\u30EB\u306E\u540D\u524D
profile.includes.add=\u5BFE\u8C61\u30D7\u30ED\u30D5\u30A1\u30A4\u30EB\u306E\u4E00\u89A7\u306B\u30D7\u30ED\u30D5\u30A1\u30A4\u30EB\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
profile.includes.add.include=\u5BFE\u8C61\u30D7\u30ED\u30D5\u30A1\u30A4\u30EB\u306E\u540D\u524D
profile.includes.remove=\u5BFE\u8C61\u30D7\u30ED\u30D5\u30A1\u30A4\u30EB\u306E\u4E00\u89A7\u304B\u3089\u30D7\u30ED\u30D5\u30A1\u30A4\u30EB\u3092\u524A\u9664\u3057\u307E\u3059\u3002
profile.includes.remove.include=\u5BFE\u8C61\u30D7\u30ED\u30D5\u30A1\u30A4\u30EB\u306E\u540D\u524D
profile.subsystem=\u30D7\u30ED\u30D5\u30A1\u30A4\u30EB\u3092\u69CB\u6210\u3059\u308B\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0
named_interface=\u540D\u524D\u4ED8\u304D\u306E\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u3067\u3059\u304C\u3001\u3053\u306E\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u3068\u95A2\u9023\u3065\u3044\u305F IP \u30A2\u30C9\u30EC\u30B9\u3092\u6C7A\u5B9A\u3059\u308B\u5FC5\u9808\u57FA\u6E96\u306F\u5FC5\u8981\u3042\u308A\u307E\u305B\u3093\u3002IP \u30A2\u30C9\u30EC\u30B9\u306E\u9078\u629E\u57FA\u6E96\u304C\u5B9A\u7FA9\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u3001\u3088\u308A\u4F4E\u3044\u30EC\u30D9\u30EB (\u4F8B\uFF1A\u5229\u7528\u53EF\u80FD\u306A\u30A2\u30C9\u30EC\u30B9\u304C\u5206\u304B\u3063\u3066\u3044\u308B\u30DB\u30B9\u30C8\u30EC\u30D9\u30EB\u306A\u3069) \u3067\u5B8C\u5168\u6307\u5B9A\u306E\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u5B9A\u7FA9\u304C\u9069\u7528\u3055\u308C\u308B\u307E\u3067\u3001\u30E2\u30C7\u30EB(\u4F8B\uFF1A\u30C9\u30E1\u30A4\u30F3\u30EC\u30D9\u30EB) \u306E\u30D7\u30EC\u30FC\u30B9\u30DB\u30EB\u30C0\u30FC\u3068\u3057\u3066\u5F79\u5272\u3092\u679C\u305F\u3057\u307E\u3059\u3002
specified_interface=\u540D\u524D\u4ED8\u304D\u306E\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u3068\u3001\u305D\u306E\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u306B\u95A2\u9023\u4ED8\u3051\u308B IP \u30A2\u30C9\u30EC\u30B9\u6C7A\u5B9A\u306B\u5FC5\u8981\u306A\u57FA\u6E96\u3002
interface.name=\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u540D
interface.criteria=\u5EC3\u6B62\u4E88\u5B9A\u3002\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u306B\u3069\u306E IP \u30A2\u30C9\u30EC\u30B9\u3092\u5229\u7528\u3059\u308B\u304B\u6C7A\u5B9A\u3059\u308B\u305F\u3081\u306B\u3001\u30E9\u30F3\u30BF\u30A4\u30E0\u6642\u306B\u5229\u7528\u53EF\u80FD\u306A\u57FA\u6E96\u30BB\u30C3\u30C8
interface.add=\u65B0\u898F\u306E\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u4ED5\u69D8\u3092\u8FFD\u52A0
interface.add.criteria=\u5EC3\u6B62\u4E88\u5B9A
interface.remove=\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u4ED5\u69D8\u3092\u524A\u9664
interface.any-address=\u3053\u306E\u5C5E\u6027\u306F\u3001\u3053\u306E\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u3092\u4F7F\u3046\u30BD\u30B1\u30C3\u30C8\u304C\u30EF\u30A4\u30EB\u30C9\u30AB\u30FC\u30C9\u30A2\u30C9\u30EC\u30B9\u306B\u30D0\u30A4\u30F3\u30C9\u3059\u308B\u3088\u3046\u306B\u6307\u5B9A\u3057\u307E\u3059\u3002IPv6 \u306E\u30EF\u30A4\u30EB\u30C9\u30AB\u30FC\u30C9\u30A2\u30C9\u30EC\u30B9 (\:\:) \u306Fjava.net.preferIpV4Stack \u30B7\u30B9\u30C6\u30E0\u30D7\u30ED\u30D1\u30C6\u30A3\u304C true \u306B\u8A2D\u5B9A\u3055\u308C\u306A\u3044\u9650\u308A\u5229\u7528\u3055\u308C\u307E\u3059\u3002true \u306E\u5834\u5408\u306F IPv4 \u30EF\u30A4\u30EB\u30C9\u30AB\u30FC\u30C9\u30A2\u30C9\u30EC\u30B9\u306F (0.0.0.0) \u3092\u5229\u7528\u3057\u307E\u3059\u3002\u30BD\u30B1\u30C3\u30C8\u304C dual-stack \u30DE\u30B7\u30F3\u3067 IPv6 \u306E\u30ED\u30FC\u30AB\u30EB\u30A2\u30C9\u30EC\u30B9\u3068\u30D0\u30A4\u30F3\u30C9\u3057\u3066\u3044\u308B\u5834\u5408\u3001IPv6 \u304A\u3088\u3073 IPv4 \u30C8\u30E9\u30D5\u30A3\u30C3\u30AF\u3092\u53D7\u3051\u4ED8\u3051\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u3059\u3002IPv4 (IPv4-mapped) \u306E\u30ED\u30FC\u30AB\u30EB\u30A2\u30C9\u30EC\u30B9\u3068\u30D0\u30A4\u30F3\u30C9\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u306F\u3001IPv4 \u30C8\u30E9\u30D5\u30A3\u30C3\u30AF\u306E\u307F\u3092\u53D7\u3051\u4ED8\u3051\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u3059\u3002
interface.any-ipv4-address=\u3053\u306E\u5C5E\u6027\u306F\u3001\u3053\u306E\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u3092\u4F7F\u3063\u305F\u30BD\u30B1\u30C3\u30C8\u304C IPv4 \u30EF\u30A4\u30EB\u30C9\u30AB\u30FC\u30C9\u30A2\u30C9\u30EC\u30B9 (0.0.0.0) \u306B\u30D0\u30A4\u30F3\u30C9\u3059\u308B\u3088\u3046\u306B\u6307\u5B9A\u3057\u307E\u3059\u3002
interface.any-ipv6-address=\u3053\u306E\u5C5E\u6027\u306F\u3001\u3053\u306E\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u3092\u4F7F\u3063\u305F\u30BD\u30B1\u30C3\u30C8\u304C IPv6 \u30EF\u30A4\u30EB\u30C9\u30AB\u30FC\u30C9\u30A2\u30C9\u30EC\u30B9 (\:\:) \u306B\u30D0\u30A4\u30F3\u30C9\u3059\u308B\u3088\u3046\u306B\u6307\u5B9A\u3057\u307E\u3059\u3002
interface.inet-address=\u3053\u306E\u5C5E\u6027\u306F\u3001\u3053\u306E\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u306E IP \u30A2\u30C9\u30EC\u30B9\u306E\u9078\u629E\u57FA\u6E96\u306B\u3001\u300C\u30A2\u30C9\u30EC\u30B9\u304C\u6307\u5B9A\u306E\u5024\u3068\u4E00\u81F4\u3059\u308B\u300D\u3068\u3044\u3046\u57FA\u6E96\u3092\u542B\u3081\u308B\u304B\u3069\u3046\u304B\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002\u5024\u306F IPv6 \u3042\u308B\u3044\u306FIPv4 \u3067\u30C9\u30C3\u30C8\u5F62\u5F0F\u306E10 \u9032\u8868\u8A18\u306E IP \u30A2\u30C9\u30EC\u30B9\u3001\u307E\u305F\u306FIP \u30A2\u30C9\u30EC\u30B9\u306B\u5BFE\u3057\u3066\u89E3\u6C7A\u53EF\u80FD\u306A\u30DB\u30B9\u30C8\u540D\u306E\u3044\u305A\u308C\u304B\u3067\u3059\u3002'undefined' \u306E\u5024\u306F\u3001\u3053\u306E\u5C5E\u6027\u304C\u9078\u629E\u3057\u305F IP \u30A2\u30C9\u30EC\u30B9\u3068\u306F\u95A2\u9023\u304C\u306A\u3044\u3068\u3044\u3046\u610F\u5473\u3067\u3059\u3002
interface.link-local-address=\u3053\u306E\u5C5E\u6027\u306F\u3001\u3053\u306E\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u306E IP \u30A2\u30C9\u30EC\u30B9\u306E\u9078\u629E\u57FA\u6E96\u306B\u3001\u300C\u30A2\u30C9\u30EC\u30B9\u304Clink-local\u3068\u4E00\u81F4\u3059\u308B\u300D\u3068\u3044\u3046\u57FA\u6E96\u3092\u542B\u3081\u308B\u304B\u3069\u3046\u304B\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002'undefined' \u3068 'false' \u306E\u5024\u306F\u3001\u3053\u306E\u5C5E\u6027\u304C\u9078\u629E\u3057\u305F IP \u30A2\u30C9\u30EC\u30B9\u3068\u95A2\u9023\u304C\u306A\u3044\u3068\u3044\u3046\u610F\u5473\u3067\u3059\u3002
interface.loopback=\u3053\u306E\u5C5E\u6027\u306F\u3001\u3053\u306E\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u306E IP \u30A2\u30C9\u30EC\u30B9\u306E\u9078\u629E\u57FA\u6E96\u306B\u3001\u300C\u3053\u306E\u30A2\u30C9\u30EC\u30B9\u304C loopback \u30A2\u30C9\u30EC\u30B9\u3067\u3042\u308B\u300D\u3068\u3044\u3046\u57FA\u6E96\u3092\u542B\u3081\u308B\u304B\u3069\u3046\u304B\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002'undefined' \u3068 'false' \u306E\u5024\u306F\u3001\u3053\u306E\u5C5E\u6027\u304C\u9078\u629E\u3057\u305F IP \u30A2\u30C9\u30EC\u30B9\u3068\u95A2\u9023\u304C\u306A\u3044\u3068\u3044\u3046\u610F\u5473\u3067\u3059\u3002
interface.loopback-address=\u30EB\u30FC\u30D7\u30D0\u30C3\u30AF\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u304C\u30DE\u30B7\u30F3\u4E0A\u306B\u5B58\u5728\u3059\u308B\u5834\u5408\u3001\u3053\u306E\u5C5E\u6027\u306F\u3001\u3053\u306E\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u306E IP \u30A2\u30C9\u30EC\u30B9\u304C\u6307\u5B9A\u306E\u5024\u3067\u3042\u308B\u3053\u3068\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002'loopback address' \u306F\u5B9F\u969B\u306B\u30DE\u30B7\u30F3\u306E\u30EB\u30FC\u30D7\u30D0\u30C3\u30AF\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u306B\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u3082\u3042\u308A\u307E\u3059\u3002inet-address \u3068\u9055\u3046\u70B9\u306F\u3001IP \u6307\u5B9A\u306E\u30A2\u30C9\u30EC\u30B9\u3068\u95A2\u9023\u4ED8\u3051\u3089\u308C\u305F NIC \u304C\u898B\u3064\u304B\u3089\u306A\u3044\u5834\u5408\u3067\u3082\u6307\u5B9A\u306E\u5024\u3092\u4F7F\u3046\u70B9\u3067\u3059\u3002 'undefined' \u3068 'false' \u306E\u5024\u306F\u3001\u3053\u306E\u5C5E\u6027\u304C \u9078\u629E\u3057\u305F IP \u30A2\u30C9\u30EC\u30B9\u3068\u95A2\u9023\u304C\u306A\u3044\u3068\u3044\u3046\u610F\u5473\u3067\u3059\u3002
interface.multicast=\u3053\u306E\u5C5E\u6027\u306F\u3001\u3053\u306E\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u306E IP \u30A2\u30C9\u30EC\u30B9\u306E\u9078\u629E\u57FA\u6E96\u306B\u3001\u300C\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u304C\u30DE\u30EB\u30C1\u30AD\u30E3\u30B9\u30C8\u3092\u30B5\u30DD\u30FC\u30C8\u3059\u308B\u300D\u3068\u3044\u3046\u57FA\u6E96\u3092\u542B\u3081\u308B\u304B\u3069\u3046\u304B\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002'undefined' \u3068 'false' \u306E\u5024\u306F\u3001\u3053\u306E\u5C5E\u6027\u304C\u9078\u629E\u3057\u305F IP \u30A2\u30C9\u30EC\u30B9\u3068\u95A2\u9023\u304C\u306A\u3044\u3068\u3044\u3046\u610F\u5473\u3067\u3059\u3002
interface.nic=\u3053\u306E\u5C5E\u6027\u306F\u3001\u3053\u306E\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u306E IP \u30A2\u30C9\u30EC\u30B9\u306E\u9078\u629E\u57FA\u6E96\u306B\u3001\u300C\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u306B\u306F\u6307\u5B9A\u306E\u540D\u524D\u304C\u3042\u308B\u300D\u3068\u3044\u3046\u57FA\u6E96\u3092\u542B\u3081\u308B\u304B\u3069\u3046\u304B\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u540D (\u4F8B\uFF1Aeth0\u3001eth1\u3001lo)\u3002'undefined' \u306E\u5024\u306F\u3001\u3053\u306E\u5C5E\u6027\u304C\u9078\u629E\u3057\u305F IP \u30A2\u30C9\u30EC\u30B9\u3068\u95A2\u9023\u304C\u306A\u3044\u3068\u3044\u3046\u610F\u5473\u3067\u3059\u3002
interface.nic-match=\u3053\u306E\u5C5E\u6027\u306F\u3001\u3053\u306E\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u306E IP \u30A2\u30C9\u30EC\u30B9\u306E\u9078\u629E\u57FA\u6E96\u306B\u3001\u300C\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u304C\u6307\u5B9A\u306E\u6B63\u898F\u8868\u73FE\u3068\u4E00\u81F4\u3059\u308B\u300D\u3068\u3044\u3046\u57FA\u6E96\u3092\u542B\u3081\u308B\u304B\u3069\u3046\u304B\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002\u5024\u306F\u3001\u30DE\u30B7\u30F3\u3067\u5229\u7528\u53EF\u80FD\u306A\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u540D\u304C\u8A31\u5BB9\u7BC4\u56F2\u306E\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u3068\u30DE\u30C3\u30C1\u3059\u308B\u304B\u691C\u7D22\u3059\u308B\u969B\u306B\u4F7F\u3046\u6B63\u898F\u8868\u73FE\u3067\u3059\u3002 'undefined' \u306E\u5024\u306F\u3001\u3053\u306E\u5C5E\u6027\u304C\u9078\u629E\u3057\u305F IP \u30A2\u30C9\u30EC\u30B9\u3068\u95A2\u9023\u304C\u306A\u3044\u3068\u3044\u3046\u610F\u5473\u3067\u3059\u3002
interface.point-to-point=\u3053\u306E\u5C5E\u6027\u306F\u3001\u3053\u306E\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u306E IP \u30A2\u30C9\u30EC\u30B9\u306E\u9078\u629E\u57FA\u6E96\u306B\u3001\u300C\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u304Cpoint-to-point \u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u3067\u3042\u308B\u300D\u3068\u3044\u3046\u57FA\u6E96\u3092\u542B\u3081\u308B\u304B\u3069\u3046\u304B\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002'undefined' \u3068 'false' \u306E\u5024\u306F\u3001\u3053\u306E\u5C5E\u6027\u304C\u9078\u629E\u3057\u305F IP \u30A2\u30C9\u30EC\u30B9\u3068\u95A2\u9023\u304C\u306A\u3044\u3068\u3044\u3046\u610F\u5473\u3067\u3059\u3002
interface.public-address=\u3053\u306E\u5C5E\u6027\u306F\u3001\u3053\u306E\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u306E IP \u30A2\u30C9\u30EC\u30B9\u306E\u9078\u629E\u57FA\u6E96\u306B\u3001\u300C\u30A2\u30C9\u30EC\u30B9\u304C\u30D1\u30D6\u30EA\u30C3\u30AF\u30EB\u30FC\u30C6\u30A3\u30F3\u30B0\u304C\u53EF\u80FD\u306A\u30A2\u30C9\u30EC\u30B9 (publicly routable address) \u300D\u3068\u3044\u3046\u57FA\u6E96\u3092\u542B\u3081\u308B\u304B\u3069\u3046\u304B\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002'undefined' \u3068 'false' \u306E\u5024\u306F\u3001\u3053\u306E\u5C5E\u6027\u304C\u9078\u629E\u3057\u305F IP \u30A2\u30C9\u30EC\u30B9\u3068\u95A2\u9023\u304C\u306A\u3044\u3068\u3044\u3046\u610F\u5473\u3067\u3059\u3002
interface.site-local-address=\u3053\u306E\u5C5E\u6027\u306F\u3001\u3053\u306E\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u306E IP \u30A2\u30C9\u30EC\u30B9\u306E\u9078\u629E\u57FA\u6E96\u306B\u3001\u300C\u30A2\u30C9\u30EC\u30B9\u304C site-local \u30A2\u30C9\u30EC\u30B9\u3067\u3042\u308B \u300D\u3068\u3044\u3046\u57FA\u6E96\u3092\u542B\u3081\u308B\u304B\u3069\u3046\u304B\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002'undefined' \u3068 'false' \u306E\u5024\u306F\u3001\u3053\u306E\u5C5E\u6027\u304C\u9078\u629E\u3057\u305F IP \u30A2\u30C9\u30EC\u30B9\u3068\u95A2\u9023\u304C\u306A\u3044\u3068\u3044\u3046\u610F\u5473\u3067\u3059\u3002
interface.subnet-match=\u3053\u306E\u5C5E\u6027\u306F\u3001\u3053\u306E\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u306E IP \u30A2\u30C9\u30EC\u30B9\u306E\u9078\u629E\u57FA\u6E96\u306B\u3001\u300C\u30A2\u30C9\u30EC\u30B9\u304C\u6307\u5B9A\u306E\u30B5\u30D6\u30CD\u30C3\u30C8\u5B9A\u7FA9\u3068\u4E00\u81F4\u3059\u308B \u300D\u3068\u3044\u3046\u57FA\u6E96\u3092\u542B\u3081\u308B\u304B\u3069\u3046\u304B\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002\u5024\u306F\u3001\u30A2\u30C9\u30EC\u30B9\u306E\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u30D7\u30EC\u30D5\u30A3\u30C3\u30AF\u30B9\u306B\u3042\u308B\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF IP \u30A2\u30C9\u30EC\u30B9\u3068\u30D3\u30C3\u30C8\u6570\u3067\u3001"192.168.0.0/16" \u306A\u3069\u306E\u3088\u3046\u306B\u30B9\u30E9\u30C3\u30B7\u30E5\u8868\u8A18\u3092\u4F7F\u3044\u307E\u3059\u3002'undefined' \u306E\u5024\u306F\u3001\u3053\u306E\u5C5E\u6027\u304C\u9078\u629E\u3057\u305F IP \u30A2\u30C9\u30EC\u30B9\u3068\u95A2\u9023\u304C\u306A\u3044\u3068\u3044\u3046\u610F\u5473\u3067\u3059\u3002
interface.up=\u3053\u306E\u5C5E\u6027\u306F\u3001\u3053\u306E\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u306E IP \u30A2\u30C9\u30EC\u30B9\u306E\u9078\u629E\u57FA\u6E96\u306B\u3001\u300C\u3053\u306E\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u304C\u73FE\u5728\u4F5C\u52D5\u3057\u3066\u3044\u308B\u300D\u3068\u3044\u3046\u57FA\u6E96\u3092\u542B\u3081\u308B\u304B\u3069\u3046\u304B\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002'undefined' \u3068 'false' \u306E\u5024\u306F\u3001\u3053\u306E\u5C5E\u6027\u304C\u9078\u629E\u3057\u305F IP \u30A2\u30C9\u30EC\u30B9\u3068\u95A2\u9023\u304C\u306A\u3044\u3068\u3044\u3046\u610F\u5473\u3067\u3059\u3002
interface.virtual=\u3053\u306E\u5C5E\u6027\u306F\u3001\u3053\u306E\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u306E IP \u30A2\u30C9\u30EC\u30B9\u306E\u9078\u629E\u57FA\u6E96\u306B\u3001\u300C\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u304C\u4EEE\u60F3\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u3067\u3042\u308B\u300D\u3068\u3044\u3046\u57FA\u6E96\u3092\u542B\u3081\u308B\u304B\u3069\u3046\u304B\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002'undefined' \u3068 'false' \u306E\u5024\u306F\u3001\u3053\u306E\u5C5E\u6027\u304C\u9078\u629E\u3057\u305F IP \u30A2\u30C9\u30EC\u30B9\u3068\u95A2\u9023\u304C\u306A\u3044\u3068\u3044\u3046\u610F\u5473\u3067\u3059\u3002
interface.not=\u3053\u306E\u5C5E\u6027\u306F\u3001\u3053\u306E\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u306B\u5BFE\u3059\u308B IP \u30A2\u30C9\u30EC\u30B9\u3092\u9078\u629E\u3059\u308B\u57FA\u6E96\u306E\u4E00\u90E8\u306B\u300C\u3053\u306E IP \u30A2\u30C9\u30EC\u30B9\u306F\u30CD\u30B9\u30C8\u5316\u3057\u305F\u57FA\u6E96\u3092\u6E80\u305F\u3055\u306A\u3044\u300D\u3068\u3044\u3046\u3082\u306E\u3092\u542B\u3081\u308B\u304B\u3092\u6307\u5B9A\u3057\u3066\u3044\u307E\u3059\u3002\u5C5E\u6027\u306E\u5024\u306F\u3001\u901A\u5E38\u306E\u610F\u5473\u3068\u306F\u9006\u306B\u306A\u308B\u3088\u3046\u306A\u57FA\u6E96 (\u4F8B\uFF1A\u30EB\u30FC\u30D7\u30D0\u30C3\u30AF)  \u3067\u3059\u3002'undefined' \u306E\u5024\u306F\u3001\u3053\u306E\u5C5E\u6027\u304C IP \u30A2\u30C9\u30EC\u30B9\u306E\u9078\u629E\u3068\u95A2\u9023\u304C\u306A\u3044\u3068\u3044\u3046\u610F\u5473\u3067\u3059\u3002
interface.any=\u3053\u306E\u5C5E\u6027\u306F\u3001\u3053\u306E\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u306E IP \u30A2\u30C9\u30EC\u30B9\u306E\u9078\u629E\u57FA\u6E96\u306B\u3001\u300CIP \u30A2\u30C9\u30EC\u30B9\u304C\u5C11\u306A\u304F\u3068\u3082\u30CD\u30B9\u30C8\u5316\u3055\u308C\u305F\u57FA\u6E96\u306E1\u3064\u3092\u6E80\u305F\u3057\u3066\u3044\u308B\u304C\u3059\u3079\u3066\u3092\u6E80\u305F\u3057\u3066\u3044\u308B\u3068\u306F\u9650\u3089\u306A\u3044\u300D\u3068\u3044\u3046\u57FA\u6E96\u3092\u542B\u3081\u308B\u304B\u3069\u3046\u304B\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002\u3053\u306E\u5C5E\u6027\u306E\u5024\u306F\u3001\u57FA\u6E96\u30BB\u30C3\u30C8\u3067\u3059\u3002'undefined' \u306E\u5024\u306F\u3001\u3053\u306E\u5C5E\u6027\u304C\u9078\u629E\u3057\u305F IP \u30A2\u30C9\u30EC\u30B9\u3068\u95A2\u9023\u304C\u306A\u3044\u3068\u3044\u3046\u610F\u5473\u3067\u3059\u3002
socket-binding-group=\u30BD\u30B1\u30C3\u30C8\u8A2D\u5B9A\u4E00\u89A7\u3092\u542B\u307F\u307E\u3059\u3002
socket-binding-group.name=\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u30B0\u30EB\u30FC\u30D7\u540D
socket-binding-group.default-interface=\u660E\u793A\u7684\u306B\u5BA3\u8A00\u3055\u308C\u3066\u3044\u306A\u3044\u30BD\u30B1\u30C3\u30C8\u306B\u5BFE\u3057\u3066\u3001\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u3068\u3057\u3066\u5229\u7528\u3059\u3079\u304D\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u540D\u3002
socket-binding-group.socket-binding=\u500B\u5225\u306E\u30BD\u30B1\u30C3\u30C8\u8A2D\u5B9A
socket-binding-group.port-offset=\u3053\u306E\u30B5\u30FC\u30D0\u30FC\u3067\u30E9\u30F3\u30BF\u30A4\u30E0\u306E\u5024\u3092\u53D6\u5F97\u3059\u308B\u305F\u3081\u306B\u3001\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u3067\u5B9A\u7FA9\u3055\u308C\u305F\u30D9\u30FC\u30B9\u30DD\u30FC\u30C8\u306E\u5024\u306B\u9069\u7528\u3059\u308B\u5897\u5206\u5024
socket-binding-group.includes=\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u304C\u3053\u306E socket-binding-group \u306B\u542B\u307E\u308C\u308B\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u306E\u30B0\u30EB\u30FC\u30D7\u540D\u4E00\u89A7\u3002\u5BFE\u8C61\u306E\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u3067\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u3092\u6307\u5B9A\u3057\u3066\u3044\u306A\u3044\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u306B\u5BFE\u3057\u3066\u3001\u3053\u306E\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u30B0\u30EB\u30FC\u30D7\u306E\u30C7\u30D5\u30A9\u30EB\u30C8\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u3092\u9069\u7528\u3057\u307E\u3059\u3002
socket-binding-group.add=\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u30B0\u30EB\u30FC\u30D7\u306E\u8FFD\u52A0
socket-binding-group.remove=\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u30B0\u30EB\u30FC\u30D7\u306E\u524A\u9664
socket-binding-group.include.add=\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u30B0\u30EB\u30FC\u30D7\u306E 'includes' \u5C5E\u6027\u306B\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u30B0\u30EB\u30FC\u30D7\u3092\u8FFD\u52A0\u3057\u307E\u3059\u3002
socket-binding-group.include.add.include=\u542B\u3081\u305F\u3044\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u30B0\u30EB\u30FC\u30D7\u540D
socket-binding-group.include.remove=\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u30B0\u30EB\u30FC\u30D7\u306E 'includes' \u5C5E\u6027\u304B\u3089\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u30B0\u30EB\u30FC\u30D7\u3092\u524A\u9664\u3057\u307E\u3059\u3002
socket-binding-group.include.remove.include=\u4ECA\u5F8C\u542B\u3081\u306A\u3044\u3088\u3046\u306B\u3059\u308B\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u30B0\u30EB\u30FC\u30D7\u306E\u540D\u524D
socket-binding=\u30BD\u30B1\u30C3\u30C8\u306E\u8A2D\u5B9A\u60C5\u5831
socket-binding.name=\u30BD\u30B1\u30C3\u30C8\u540D\u3002\u30BD\u30B1\u30C3\u30C8\u60C5\u5831\u306B\u30A2\u30AF\u30BB\u30B9\u3059\u308B\u5FC5\u8981\u306E\u3042\u308B\u30B5\u30FC\u30D3\u30B9\u304C\u691C\u7D22\u3092\u884C\u3046\u5834\u5408\u3001\u3053\u306E\u540D\u524D\u3092\u4F7F\u3044\u307E\u3059\u3002
socket-binding.interface=\u30BD\u30B1\u30C3\u30C8\u3092\u30D0\u30A4\u30F3\u30C9\u3059\u3079\u304D\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u540D\u3002\u30DE\u30EB\u30C1\u30AD\u30E3\u30B9\u30C8\u30BD\u30B1\u30C3\u30C8\u306E\u5834\u5408\u306F\u3001\u30EA\u30C3\u30B9\u30F3\u3059\u3079\u304D\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u5148\u306E\u540D\u524D\u3002\u3053\u308C\u306F\u3001\u5BA3\u8A00\u6E08\u307F\u306E\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u306E\uFF11\u3064\u3067\u306A\u3051\u308C\u3070\u306A\u308A\u307E\u305B\u3093\u3002
socket-binding.port=\u30BD\u30B1\u30C3\u30C8\u306E\u30D0\u30A4\u30F3\u30C9\u5148\u306E\u30DD\u30FC\u30C8\u6570
socket-binding.fixed-port=\u6570\u5024\u306E\u30AA\u30D5\u30BB\u30C3\u30C8\u30DD\u30FC\u30C8\u304C\u30BD\u30B1\u30C3\u30C8\u30B0\u30EB\u30FC\u30D7\u306E\u5225\u306E\u30BD\u30B1\u30C3\u30C8\u306B\u9069\u7528\u3055\u308C\u308B\u5834\u5408\u3001\u30DD\u30FC\u30C8\u306E\u5024\u3092\u56FA\u5B9A\u3059\u3079\u304D\u304B\u3069\u3046\u304B
socket-binding.multicast-address=\u30BD\u30B1\u30C3\u30C8\u304C\u30DE\u30EB\u30C1\u30AD\u30E3\u30B9\u30C8\u306E\u30C8\u30E9\u30D5\u30A3\u30C3\u30AF\u3092\u53D7\u4FE1\u3079\u304D\u30DE\u30EB\u30C1\u30AD\u30E3\u30B9\u30C8\u30A2\u30C9\u30EC\u30B9\u3002\u6307\u5B9A\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u3001\u3053\u306E\u30BD\u30B1\u30C3\u30C8\u306F\u30DE\u30EB\u30C1\u30AD\u30E3\u30B9\u30C8\u3092\u53D7\u4FE1\u3059\u308B\u3088\u3046\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
socket-binding.multicast-port=\u30BD\u30B1\u30C3\u30C8\u304C\u30DE\u30EB\u30C1\u30AD\u30E3\u30B9\u30C8\u30C8\u30E9\u30D5\u30A3\u30C3\u30AF\u3092\u53D7\u4FE1\u3059\u3079\u304D\u30DD\u30FC\u30C8\u3002'multicast-address' \u304C\u8A2D\u5B9A\u3055\u308C\u308B\u5834\u5408\u306F\u3053\u308C\u3082\u8A2D\u5B9A\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002
socket-binding.add=\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u8A2D\u5B9A\u3092\u30B0\u30EB\u30FC\u30D7\u306B\u8FFD\u52A0\u3057\u307E\u3059\u3002
socket-binding.remove=\u30B0\u30EB\u30FC\u30D7\u304B\u3089\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u8A2D\u5B9A\u3092\u524A\u9664\u3057\u307E\u3059\u3002
socket-binding.bound=\u3053\u306E\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u8A2D\u5B9A\u3092\u4F7F\u3044\u5B9F\u969B\u306E\u30BD\u30B1\u30C3\u30C8\u3092\u30D0\u30A4\u30F3\u30C9\u3057\u305F\u304B\u3069\u3046\u304B
socket-binding.bound-address=\u3053\u306E\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u3092\u4F7F\u3044\u5B9F\u969B\u306E\u30BD\u30B1\u30C3\u30C8\u3092\u30D0\u30A4\u30F3\u30C9\u3057\u305F\u30A2\u30C9\u30EC\u30B9\u3002\u30BD\u30B1\u30C3\u30C8\u304C\u30D0\u30A4\u30F3\u30C9\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u5B9A\u7FA9\u3057\u307E\u305B\u3093\u3002
socket-binding.bound-port=\u3053\u306E\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u3092\u4F7F\u3044\u5B9F\u969B\u306E\u30BD\u30B1\u30C3\u30C8\u3092\u30D0\u30A4\u30F3\u30C9\u3057\u305F\u30DD\u30FC\u30C8\u3002\u30BD\u30B1\u30C3\u30C8\u304C\u30D0\u30A4\u30F3\u30C9\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u5B9A\u7FA9\u306A\u3057\u306B\u3057\u307E\u3059\u3002
socket-binding.client-mappings=\u3053\u306E\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u306B\u95A2\u3059\u308B\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30DE\u30C3\u30D4\u30F3\u30B0\u3092 0 \u3082\u3057\u304F\u306F\u305D\u308C\u4EE5\u4E0A\u6307\u5B9A\u3057\u307E\u3059\u3002\u3053\u306E\u30BD\u30B1\u30C3\u30C8\u306B\u63A5\u7D9A\u3057\u3066\u3044\u308B\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306F\u3001\u5E0C\u671B\u3059\u308B\u30A2\u30A6\u30C8\u30D0\u30A6\u30F3\u30C9\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u3068\u4E00\u81F4\u3059\u308B\u30DE\u30C3\u30D4\u30F3\u30B0\u3067\u6307\u5B9A\u3055\u308C\u305F\u3042\u3066\u5148\u306E\u30A2\u30C9\u30EC\u30B9\u3092\u4F7F\u3046\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002\u3053\u3046\u3059\u308B\u3053\u3068\u3067\u3001\u8A73\u7D30\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u30C8\u30DD\u30ED\u30B8\u30FC\u304C\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u30A2\u30C9\u30EC\u30B9\u5909\u63DB\u3092\u4F7F\u3046\u304B\u3001\u8907\u6570\u306E\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u3092\u6A5F\u80FD\u306B\u30D0\u30A4\u30F3\u30C9\u3057\u6A5F\u80FD\u3067\u304D\u308B\u3088\u3046\u306B\u306A\u308A\u307E\u3059\u3002\u30DE\u30C3\u30D4\u30F3\u30B0\u306F\u5BA3\u8A00\u3057\u305F\u9806\u756A\u306B\u8A55\u4FA1\u3055\u308C\u3001\u6700\u521D\u306B\u4E00\u81F4\u3057\u305F\u3082\u306E\u3092\u4F7F\u3044\u3042\u3066\u5148\u3092\u6C7A\u5B9A\u3057\u307E\u3059\u3002
socket-binding.client-mappings.source-network=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u63A5\u7D9A\u306E\u30D0\u30A4\u30F3\u30C9\u5148\u306E\u30BD\u30FC\u30B9\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u3002\u3053\u306E\u5024\u306Fip/network \u306E\u5F62\u5F0F\u3067\u3059\u3002\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306F\u3053\u306E\u5024\u3068\u5E0C\u671B\u306E\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u30DB\u30B9\u30C8\u30CD\u30C3\u30C8\u30EF\u30FC\u30AF\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u3068\u304C\u4E00\u81F4\u3059\u308B\u304B\u78BA\u8A8D\u3057\u3001\u4E00\u81F4\u3059\u308B\u5834\u5408\u3001\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306F\u8A72\u5F53\u306E\u3042\u3066\u5148\u306E\u5024\u306B\u63A5\u7D9A\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002\u7701\u7565\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u306F\u3001\u3053\u306E\u30DE\u30C3\u30D4\u30F3\u30B0\u306F\u3069\u306E\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u306B\u3082\u4E00\u81F4\u3057\u307E\u3059\u3002
socket-binding.client-mappings.destination-address=source-network \u304C\u4E00\u81F4\u3059\u308B\u5834\u5408\u306E\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306E\u63A5\u7D9A\u5148\u306E\u30A2\u30C9\u30EC\u30B9\u3002\u3053\u306E\u5024\u306F\u30DB\u30B9\u30C8\u540D\u304B ip \u30A2\u30C9\u30EC\u30B9\u306E\u3044\u305A\u308C\u304B\u3068\u306A\u308A\u307E\u3059\u3002
socket-binding.client-mappings.destination-port=source-network \u304C\u4E00\u81F4\u3059\u308B\u5834\u5408\u306E\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306E\u63A5\u7D9A\u5148\u306E\u30DD\u30FC\u30C8\u3002\u7701\u7565\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u306F\u3001\u3053\u306E\u30DE\u30C3\u30D4\u30F3\u30B0\u306F\u52B9\u679C\u7684\u306A\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u30DD\u30FC\u30C8\u3092\u518D\u5229\u7528\u3057\u307E\u3059\u3002
remote-destination-outbound-socket-binding=\u30EA\u30E2\u30FC\u30C8\u306E\u3042\u3066\u5148\u3067\u3042\u308B\u30A2\u30A6\u30C8\u30D0\u30A6\u30F3\u30C9\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u306B\u95A2\u3059\u308B\u8A2D\u5B9A\u60C5\u5831
remote-destination-outbound-socket-binding.name=\u30A2\u30A6\u30C8\u30D0\u30A6\u30F3\u30C9\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u540D\u3002\u30BD\u30B1\u30C3\u30C8\u60C5\u5831\u306B\u30A2\u30AF\u30BB\u30B9\u3059\u308B\u5FC5\u8981\u306E\u3042\u308B\u30B5\u30FC\u30D3\u30B9\u304C\u691C\u7D22\u3092\u884C\u3046\u5834\u5408\u3001\u3053\u306E\u540D\u524D\u3092\u4F7F\u3044\u307E\u3059\u3002
remote-destination-outbound-socket-binding.source-interface=\u30A2\u30A6\u30C8\u30D0\u30A6\u30F3\u30C9\u30BD\u30B1\u30C3\u30C8\u306E\u30BD\u30FC\u30B9\u30A2\u30C9\u30EC\u30B9\u306B\u5229\u7528\u3055\u308C\u308B\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u540D
remote-destination-outbound-socket-binding.source-port=\u30A2\u30A6\u30C8\u30D0\u30A6\u30F3\u30C9\u30BD\u30B1\u30C3\u30C8\u306E\u30BD\u30FC\u30B9\u30DD\u30FC\u30C8\u3068\u3057\u3066\u5229\u7528\u3055\u308C\u308B\u30DD\u30FC\u30C8\u6570
remote-destination-outbound-socket-binding.host=\u3053\u306E\u30A2\u30A6\u30C8\u30D0\u30A6\u30F3\u30C9\u30BD\u30B1\u30C3\u30C8\u306E\u30EA\u30E2\u30FC\u30C8\u63A5\u7D9A\u5148\u306E\u30DB\u30B9\u30C8\u540D\u304B IP \u30A2\u30C9\u30EC\u30B9
remote-destination-outbound-socket-binding.port=\u30A2\u30A6\u30C8\u30D0\u30A6\u30F3\u30C9\u30BD\u30B1\u30C3\u30C8\u304C\u63A5\u7D9A\u3059\u3079\u304D\u30EA\u30E2\u30FC\u30C8\u306E\u3042\u3066\u5148\u306E\u30DD\u30FC\u30C8\u6570
remote-destination-outbound-socket-binding.add=\u30EA\u30E2\u30FC\u30C8\u306E\u3042\u3066\u5148\u306E\u30A2\u30A6\u30C8\u30D0\u30A6\u30F3\u30C9\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u3092\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u30B0\u30EB\u30FC\u30D7\u306B\u8FFD\u52A0\u3057\u307E\u3059\u3002
remote-destination-outbound-socket-binding.remove=\u30EA\u30E2\u30FC\u30C8\u306E\u3042\u3066\u5148\u306E\u30A2\u30A6\u30C8\u30D0\u30A6\u30F3\u30C9\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u3092\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u30B0\u30EB\u30FC\u30D7\u304B\u3089\u524A\u9664\u3057\u307E\u3059\u3002
remote-destination-outbound-socket-binding.fixed-source-port=\u6570\u5024\u306E\u30AA\u30D5\u30BB\u30C3\u30C8\u30DD\u30FC\u30C8\u304C\u30BD\u30B1\u30C3\u30C8\u30B0\u30EB\u30FC\u30D7\u306E\u5225\u306E\u30A2\u30A6\u30C8\u30D0\u30A6\u30F3\u30C9\u30BD\u30B1\u30C3\u30C8\u306B\u9069\u7528\u3055\u308C\u308B\u5834\u5408\u3001\u30DD\u30FC\u30C8\u306E\u5024\u3092\u56FA\u5B9A\u3059\u3079\u304D\u304B\u3069\u3046\u304B
local-destination-outbound-socket-binding=\u30ED\u30FC\u30AB\u30EB\u306E\u3042\u3066\u5148\u3067\u3042\u308B\u30A2\u30A6\u30C8\u30D0\u30A6\u30F3\u30C9\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u306B\u95A2\u3059\u308B\u8A2D\u5B9A\u60C5\u5831
local-destination-outbound-socket-binding.name=\u30A2\u30A6\u30C8\u30D0\u30A6\u30F3\u30C9\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u540D\u3002\u30BD\u30B1\u30C3\u30C8\u60C5\u5831\u306B\u30A2\u30AF\u30BB\u30B9\u3059\u308B\u5FC5\u8981\u306E\u3042\u308B\u30B5\u30FC\u30D3\u30B9\u304C\u691C\u7D22\u3092\u884C\u3046\u5834\u5408\u3001\u3053\u306E\u540D\u524D\u3092\u4F7F\u3044\u307E\u3059\u3002
local-destination-outbound-socket-binding.source-interface=\u30A2\u30A6\u30C8\u30D0\u30A6\u30F3\u30C9\u30BD\u30B1\u30C3\u30C8\u306E\u30BD\u30FC\u30B9\u30A2\u30C9\u30EC\u30B9\u306B\u5229\u7528\u3055\u308C\u308B\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u540D
local-destination-outbound-socket-binding.source-port=\u30A2\u30A6\u30C8\u30D0\u30A6\u30F3\u30C9\u30BD\u30B1\u30C3\u30C8\u306E\u30BD\u30FC\u30B9\u30DD\u30FC\u30C8\u3068\u3057\u3066\u5229\u7528\u3055\u308C\u308B\u30DD\u30FC\u30C8\u6570
local-destination-outbound-socket-binding.socket-binding-ref=\u30A2\u30A6\u30C8\u30D0\u30A6\u30F3\u30C9\u30BD\u30B1\u30C3\u30C8\u306E\u63A5\u7D9A\u5148\u30DD\u30FC\u30C8\u3092\u6C7A\u5B9A\u3059\u308B\u306E\u306B\u5229\u7528\u3059\u308B\u30ED\u30FC\u30AB\u30EB\u306E socket-binding \u540D
local-destination-outbound-socket-binding.add=\u30ED\u30FC\u30AB\u30EB\u306E\u3042\u3066\u5148\u306E\u30A2\u30A6\u30C8\u30D0\u30A6\u30F3\u30C9\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u3092\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u30B0\u30EB\u30FC\u30D7\u306B\u8FFD\u52A0\u3057\u307E\u3059\u3002
local-destination-outbound-socket-binding.remove=\u30ED\u30FC\u30AB\u30EB\u306E\u3042\u3066\u5148\u306E\u30A2\u30A6\u30C8\u30D0\u30A6\u30F3\u30C9\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u3092\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u30B0\u30EB\u30FC\u30D7\u304B\u3089\u524A\u9664\u3057\u307E\u3059\u3002
local-destination-outbound-socket-binding.fixed-source-port=\u6570\u5024\u306E\u30AA\u30D5\u30BB\u30C3\u30C8\u30DD\u30FC\u30C8\u304C\u30BD\u30B1\u30C3\u30C8\u30B0\u30EB\u30FC\u30D7\u306E\u5225\u306E\u30A2\u30A6\u30C8\u30D0\u30A6\u30F3\u30C9\u30BD\u30B1\u30C3\u30C8\u306B\u9069\u7528\u3055\u308C\u308B\u5834\u5408\u3001\u30DD\u30FC\u30C8\u306E\u5024\u3092\u56FA\u5B9A\u3059\u3079\u304D\u304B\u3069\u3046\u304B
subsystem.describe=\u30AA\u30EA\u30B8\u30CA\u30EB\u30E2\u30C7\u30EB\u3092\u4F5C\u6210\u3059\u308B\u305F\u3081\u306B\u5B9F\u884C\u53EF\u80FD\u306A\u64CD\u4F5C\u4E00\u89A7\u3068\u3057\u3066\u3001\u30D7\u30ED\u30D5\u30A1\u30A4\u30EB\u306E\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u3092\u51FA\u529B\u3057\u307E\u3059\u3002
system-property.add=\u30B7\u30B9\u30C6\u30E0\u30D7\u30ED\u30D1\u30C6\u30A3\u306E\u8FFD\u52A0\u3042\u308B\u3044\u306F\u65E2\u5B58\u306E\u30D7\u30ED\u30D1\u30C6\u30A3\u306E\u66F4\u65B0
system-property.remove=\u30B7\u30B9\u30C6\u30E0\u30D7\u30ED\u30D1\u30C6\u30A3\u306E\u524A\u9664
system-property.value=\u30B7\u30B9\u30C6\u30E0\u30D7\u30ED\u30D1\u30C6\u30A3\u306E\u5024
system-property.boottime=True \u306E\u5834\u5408\u3001\u30B7\u30B9\u30C6\u30E0\u30D7\u30ED\u30D1\u30C6\u30A3\u306F\u30B3\u30DE\u30F3\u30C9\u30E9\u30A4\u30F3\u3067\u8D77\u52D5\u6E08\u307F\u306E\u30B5\u30FC\u30D0\u30FC jvm \u306B\u6E21\u3055\u308C\u307E\u3059\u3002False \u306E\u5834\u5408\u306F\u3001\u8D77\u52D5\u30B7\u30FC\u30B1\u30F3\u30B9\u306E\u4E00\u90E8\u3068\u3057\u3066\u30B5\u30FC\u30D0\u30FC\u306B\u30D7\u30C3\u30B7\u30E5\u3055\u308C\u307E\u3059\u3002
deployment=\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u3068\u306F\u30B5\u30FC\u30D0\u30FC\u306B\u30C7\u30D7\u30ED\u30A4\u53EF\u80FD\u306A\u3082\u306E (\u4F8B\uFF1AEJB-JAR\u3001WAR\u3001EAR \u306B\u52A0\u3048\u3001RAR \u3042\u308B\u3044\u306F JBoss \u56FA\u6709\u306E\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u306A\u3069\u305D\u306E\u4ED6\u306E\u6A19\u6E96\u30A2\u30FC\u30AB\u30A4\u30D6\u3068\u3044\u3063\u305F\u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3) \u3092\u3055\u3057\u307E\u3059\u3002
deployment.name=\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u306E\u4E00\u610F\u8B58\u5225\u5B50\u3002\u5168\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u3067\u4E00\u610F\u3067\u306A\u3051\u308C\u3070\u306A\u308A\u307E\u305B\u3093\u3002
deployment.runtime-name=\u30B5\u30FC\u30D0\u30FC\u306E\u30E9\u30F3\u30BF\u30A4\u30E0\u306E\u4E2D\u3067\u4F7F\u308F\u308C\u308B\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u540D\u3002\u3053\u308C\u306F\u3001\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30D5\u30A1\u30A4\u30EB\u306E\u30D5\u30A1\u30A4\u30EB\u540D\u3068\u540C\u3058\u3067\u3001\u30C7\u30D5\u30A9\u30EB\u30C8\u306E Java Enterprise Edition \u30A2\u30D7\u30EA\u30B1\u30FC\u30B7\u30E7\u30F3\u3084\u30E2\u30B8\u30E5\u30FC\u30EB\u540D\u306E\u3088\u3046\u306A\u3082\u306E\u306E\u57FA\u672C\u3092\u5F62\u6210\u3057\u307E\u3059\u304C\u3001\u5834\u5408\u306B\u3088\u3063\u3066\u306F\u3001\u540C\u3058 'runtime-name' \u3092\u6301\u30642\u3064\u306E\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u3092\u6301\u3061 ('foo.war' \u306E\u30D0\u30FC\u30B8\u30E7\u30F32\u3064\u306A\u3069)\u3001\u4E21\u65B9\u3092\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30B3\u30F3\u30C6\u30F3\u30C4\u306E\u30EC\u30DD\u30B8\u30C8\u30EA\u3067\u5229\u7528\u3067\u304D\u308B\u3088\u3046\u306B\u3057\u305F\u3044\u5834\u5408\u3082\u3042\u308B\u306F\u305A\u3067\u3059\u3002\u3053\u306E\u3088\u3046\u306A\u5834\u5408\u3001\u3053\u308C\u3089\u306E\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u306F\u5225\u306E 'name' \u5024\u3092\u6301\u3064\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u304C\u3001\u540C\u3058'runtime-name' \u3092\u6301\u3061\u307E\u3059\u3002
deployment.content=\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u3092\u69CB\u6210\u3059\u308B\u30B3\u30F3\u30C6\u30F3\u30C4\u306E\u4E00\u90E8\u306E\u4E00\u89A7
deployment.hash=\u30C9\u30E1\u30A4\u30F3\u3042\u308B\u3044\u306F\u30B9\u30BF\u30F3\u30C9\u30A2\u30ED\u30FC\u30F3\u30B5\u30FC\u30D0\u30FC\u306E\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30B3\u30F3\u30C6\u30F3\u30C4\u30EC\u30DD\u30B8\u30C8\u30EA\u306B\u30A2\u30C3\u30D7\u30ED\u30FC\u30C9\u3055\u308C\u305F\u7BA1\u7406\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30B3\u30F3\u30C6\u30F3\u30C4\u306E\u30CF\u30C3\u30B7\u30E5
deployment.inputstream=\u64CD\u4F5C\u306E\u5272\u308A\u5F53\u3066\u5165\u529B\u30B9\u30C8\u30EA\u30FC\u30E0\u3078\u306E\u30A4\u30F3\u30C7\u30C3\u30AF\u30B9\u3002\u3053\u308C\u306F\u3001\u30C9\u30E1\u30A4\u30F3\u3042\u308B\u3044\u306F\u30B9\u30BF\u30F3\u30C9\u30A2\u30ED\u30F3\u30B5\u30FC\u30D0\u30FC\u306E\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30B3\u30F3\u30C6\u30F3\u30C4\u30EC\u30DD\u30B8\u30C8\u30EA\u306B\u30A2\u30C3\u30D7\u30ED\u30FC\u30C9\u3059\u3079\u304D\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30B3\u30F3\u30C6\u30F3\u30C4\u3092\u542B\u3080\u5165\u529B\u30B9\u30C8\u30EA\u30FC\u30E0\u306E\u4E2D\u306B\u3042\u308A\u307E\u3059\u3002
deployment.enabled=\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30B3\u30F3\u30C6\u30F3\u30C4\u306F\u73FE\u5728\u30E9\u30F3\u30BF\u30A4\u30E0\u3067\u30C7\u30D7\u30ED\u30A4\u3055\u308C\u3066\u3044\u308B\u304B (\u3042\u308B\u3044\u306F\u3001\u6B21\u56DE\u30B5\u30FC\u30D0\u30FC\u304C\u8D77\u52D5\u3059\u308B\u3068\u304D\u306E\u30E9\u30F3\u30BF\u30A4\u30E0\u3067\u30C7\u30D7\u30ED\u30A4\u3059\u3079\u304D\u304B) \u793A\u3059 Boolean
deployment.persistent=\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u306E\u5B58\u5728\u3092\u6C38\u7D9A\u30B5\u30FC\u30D0\u30FC\u8A2D\u5B9A\u306B\u8A18\u9332\u3059\u3079\u304D\u304B\u793A\u3059 Boolean\u3002\u30B9\u30BF\u30F3\u30C9\u30A2\u30ED\u30FC\u30F3\u30E2\u30FC\u30C9\u306E\u30B5\u30FC\u30D0\u30FC\u306E\u307F\u5BFE\u8C61\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u306F true \u3067\u3059\u3002\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30B9\u30AD\u30E3\u30CA\u30FC\u304C\u7BA1\u7406\u3059\u308B\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u306F false \u306B\u3057\u3001\u30B9\u30AD\u30E3\u30CA\u30FC\u304C\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u3092\u518D\u5EA6\u691C\u51FA\u3057\u305F\u5834\u5408\u3082\u3001\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u304C\u30B5\u30FC\u30D0\u30FC\u8D77\u52D5\u6642\u306E\u307F\u306B\u30C7\u30D7\u30ED\u30A4\u3055\u308C\u308B\u3088\u3046\u306B\u3057\u307E\u3059\u3002
deployment.upload-bytes=\u5BFE\u8C61\u306E\u30D0\u30A4\u30C8\u30A2\u30EC\u30A4\u306E\u4E2D\u306E\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30B3\u30F3\u30C6\u30F3\u30C4\u3092\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30B3\u30F3\u30C6\u30F3\u30C4\u30EC\u30DD\u30B8\u30C8\u30EA\u306B\u8FFD\u52A0\u3059\u3079\u304D\u304B\u6307\u5B9A\u3057\u307E\u3059\u3002\u3053\u306E\u64CD\u4F5C\u306F\u3001\u30B3\u30F3\u30C6\u30F3\u30C4\u3092\u30E9\u30F3\u30BF\u30A4\u30E0\u306B\u30C7\u30D7\u30ED\u30A4\u3059\u3079\u304D\u304B\u306F\u6307\u5B9A\u3057\u3066\u3044\u307E\u305B\u3093\u3002
deployment.bytes=\u30C9\u30E1\u30A4\u30F3\u3042\u308B\u3044\u306F\u30B9\u30BF\u30F3\u30C9\u30A2\u30ED\u30FC\u30F3\u30B5\u30FC\u30D0\u30FC\u306E\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30B3\u30F3\u30C6\u30F3\u30C4\u30EC\u30DD\u30B8\u30C8\u30EA\u306B\u30A2\u30C3\u30D7\u30ED\u30FC\u30C9\u3059\u3079\u304D\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30B3\u30F3\u30C6\u30F3\u30C4\u3092\u542B\u3080\u30D0\u30A4\u30C8\u30A2\u30EC\u30A4
deployment.upload-url=\u5BFE\u8C61 URL \u3067\u5229\u7528\u53EF\u80FD\u306A\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30B3\u30F3\u30C6\u30F3\u30C4\u3092\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30B3\u30F3\u30C6\u30F3\u30C4\u30EC\u30DD\u30B8\u30C8\u30EA\u306B\u8FFD\u52A0\u3059\u3079\u304D\u304B\u6307\u5B9A\u3057\u307E\u3059\u3002\u3053\u306E\u64CD\u4F5C\u306F\u3001\u30B3\u30F3\u30C6\u30F3\u30C4\u3092\u30E9\u30F3\u30BF\u30A4\u30E0\u306B\u30C7\u30D7\u30ED\u30A4\u3059\u3079\u304D\u304B\u306F\u6307\u5B9A\u3057\u3066\u3044\u307E\u305B\u3093\u3002
deployment.url=\u30C9\u30E1\u30A4\u30F3\u3042\u308B\u3044\u306F\u30B9\u30BF\u30F3\u30C9\u30A2\u30ED\u30FC\u30F3\u30B5\u30FC\u30D0\u30FC\u306E\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30B3\u30F3\u30C6\u30F3\u30C4\u30EC\u30DD\u30B8\u30C8\u30EA\u3078\u306E\u30A2\u30C3\u30D7\u30ED\u30FC\u30C9\u306B\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30B3\u30F3\u30C6\u30F3\u30C4\u304C\u5229\u7528\u3067\u304D\u308B URL\u3002URL \u306F\u64CD\u4F5C\u306E\u5BFE\u8C61 (\u30C9\u30E1\u30A4\u30F3\u30B3\u30F3\u30C8\u30ED\u30FC\u30E9\u30FC\u3042\u308B\u3044\u306F\u30B9\u30BF\u30F3\u30C9\u30A2\u30ED\u30FC\u30F3\u30B5\u30FC\u30D0\u30FC) \u304B\u3089\u30A2\u30AF\u30BB\u30B9\u3067\u304D\u308B\u3088\u3046\u306B\u3057\u306A\u3051\u308C\u3070\u306A\u308A\u307E\u305B\u3093\u3002
deployment.upload-stream=\u5BFE\u8C61\u5165\u529B\u30B9\u30C8\u30EA\u30FC\u30E0\u30A4\u30F3\u30C7\u30C3\u30AF\u30B9\u3067\u5229\u7528\u53EF\u80FD\u306A\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30B3\u30F3\u30C6\u30F3\u30C4\u3092\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30B3\u30F3\u30C6\u30F3\u30C4\u30EC\u30DD\u30B8\u30C8\u30EA\u306B\u8FFD\u52A0\u3059\u3079\u304D\u304B\u6307\u5B9A\u3057\u307E\u3059\u3002\u3053\u306E\u64CD\u4F5C\u306F\u3001\u30B3\u30F3\u30C6\u30F3\u30C4\u3092\u30E9\u30F3\u30BF\u30A4\u30E0\u306B\u30C7\u30D7\u30ED\u30A4\u3059\u3079\u304D\u304B\u306F\u6307\u5B9A\u3057\u3066\u3044\u307E\u305B\u3093\u3002
deployment.path=\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u306E\u4E00\u90E8\u3067\u7BA1\u7406\u3057\u3066\u3044\u306A\u3044\u30B3\u30F3\u30C6\u30F3\u30C4\u3078\u306E\u30D1\u30B9 (\u76F8\u5BFE\u3042\u308B\u3044\u306F\u7D76\u5BFE)
deployment.relative-to='path' \u306E\u5024\u3092\u8D77\u70B9\u3068\u3057\u305F\u76F8\u5BFE\u30D1\u30B9\u3092\u7528\u3044\u305F\u30B7\u30B9\u30C6\u30E0\u30D1\u30B9\u306E\u540D\u524D\u3002\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u3001'path' \u306F\u7D76\u5BFE\u30D1\u30B9\u3068\u307F\u306A\u3055\u308C\u307E\u3059\u3002
deployment.archive=\u7BA1\u7406\u3057\u3066\u3044\u306A\u3044\u30B3\u30F3\u30C6\u30F3\u30C4\u304C zip \u30A2\u30FC\u30AB\u30A4\u30D6 (true) \u3042\u308B\u3044\u306F\u5C55\u958B\u30A2\u30FC\u30AB\u30A4\u30D6 (false) \u3067\u3042\u308B\u304B\u793A\u3059\u30D5\u30E9\u30B0
deployment.add=\u4EE5\u524D\u306B\u30A2\u30C3\u30D7\u30ED\u30FC\u30C9\u3055\u308C\u305F\u30B3\u30F3\u30C6\u30F3\u30C4\u3092\u5229\u7528\u53EF\u80FD\u306A\u30B3\u30F3\u30C6\u30F3\u30C4\u4E00\u89A7\u306B\u8FFD\u52A0\u3002 'enabled' \u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u304C 'true' \u51FA\u306A\u3044\u9650\u308A\u3001\u30B3\u30F3\u30C6\u30F3\u30C4\u306F\u5B9F\u969B\u306B\u306F\u30C7\u30D7\u30ED\u30A4\u3055\u308C\u307E\u305B\u3093\u3002
deployment.deploy=\u6307\u5B9A\u306E\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30B3\u30F3\u30C6\u30F3\u30C4\u3092\u30E9\u30F3\u30BF\u30A4\u30E0\u306B\u30C7\u30D7\u30ED\u30A4\u3057\u3001\u30AA\u30D7\u30B7\u30E7\u30F3\u3067\u65E2\u5B58\u306E\u30B3\u30F3\u30C6\u30F3\u30C4\u3092\u7F6E\u304D\u63DB\u3048\u307E\u3059\u3002
deployment.deploy.name=\u65B0\u898F\u30B3\u30F3\u30C6\u30F3\u30C4\u540D
deployment.deploy.to-replace=\u7F6E\u304D\u63DB\u3048\u305F\u3044\u30B3\u30F3\u30C6\u30F3\u30C4\u540D
deployment.replace=\u30E9\u30F3\u30BF\u30A4\u30E0\u306E\u65E2\u5B58\u30B3\u30F3\u30C6\u30F3\u30C4\u3092\u65B0\u898F\u30B3\u30F3\u30C6\u30F3\u30C4\u3067\u7F6E\u304D\u63DB\u3048\u307E\u3059\u3002\u5148\u306B\u65B0\u898F\u30B3\u30F3\u30C6\u30F3\u30C4\u3092\u3001\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30B3\u30F3\u30C6\u30F3\u30C4\u30EC\u30DD\u30B8\u30C8\u30EA\u3078\u30A2\u30C3\u30D7\u30ED\u30FC\u30C9\u3057\u3066\u304A\u304B\u306A\u3051\u308C\u3070\u306A\u308A\u307E\u305B\u3093\u3002
deployment.replace.name=\u65B0\u898F\u30B3\u30F3\u30C6\u30F3\u30C4\u540D
deployment.replace.to-replace=\u7F6E\u304D\u63DB\u3048\u305F\u3044\u30B3\u30F3\u30C6\u30F3\u30C4\u540D
deployment.full-replace=\u5229\u7528\u53EF\u80FD\u306A\u30B3\u30F3\u30C6\u30F3\u30C4\u4E00\u89A7\u306B\u30A2\u30C3\u30D7\u30ED\u30FC\u30C9\u6E08\u307F\u306E\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u30B3\u30F3\u30C6\u30F3\u30C4\u3092\u8FFD\u52A0\u3057\u3001\u30E9\u30F3\u30BF\u30A4\u30E0\u3067\u540C\u3058\u540D\u524D\u306E\u65E2\u5B58\u30B3\u30F3\u30C6\u30F3\u30C4\u3092\u7F6E\u304D\u63DB\u3048\u3001\u5229\u7528\u53EF\u80FD\u306A\u30B3\u30F3\u30C6\u30F3\u30C4\u4E00\u89A7\u304B\u3089\u3053\u306E\u7F6E\u304D\u63DB\u3048\u305F\u30B3\u30F3\u30C6\u30F3\u30C4\u3092\u524A\u9664\u3057\u307E\u3059\u3002\u3053\u308C\u306F\u3001'add'\u3001'undeploy'\u3001'deploy'\u3001'remove' \u306E\u30B7\u30FC\u30B1\u30F3\u30B9\u3068\u540C\u3058\u3067\u3001\u65B0\u898F\u30B3\u30F3\u30C6\u30F3\u30C4\u306F\u7F6E\u304D\u63DB\u3048\u308B\u30B3\u30F3\u30C6\u30F3\u30C4\u3068\u540C\u3058\u540D\u524D\u3092\u6301\u3061\u307E\u3059\u3002\u6B63\u78BA\u306B\u306F'runtime-name'\u3001'hash'\u3001'input-stream-index'\u3001'bytes' \u3042\u308B\u3044\u306F 'url' \u306E\u3044\u305A\u308C\u304B\u3092\u6307\u5B9A\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u3002 
deployment.undeploy=\u30E9\u30F3\u30BF\u30A4\u30E0\u304B\u3089\u30B3\u30F3\u30C6\u30F3\u30C4\u3092\u30A2\u30F3\u30C7\u30D7\u30ED\u30A4\u3057\u307E\u3059\u3002\u30B3\u30F3\u30C6\u30F3\u30C4\u306F\u5229\u7528\u53EF\u80FD\u306A\u30B3\u30F3\u30C6\u30F3\u30C4\u4E00\u89A7\u306B\u6B8B\u308A\u307E\u3059\u3002
deployment.redeploy=\u30E9\u30F3\u30BF\u30A4\u30E0\u304B\u3089\u65E2\u5B58\u30B3\u30F3\u30C6\u30F3\u30C4\u3092\u30A2\u30F3\u30C7\u30D7\u30ED\u30A4\u3057\u3001\u518D\u5EA6\u30C7\u30D7\u30ED\u30A4\u3057\u307E\u3059\u3002
deployment.status=\u30E9\u30F3\u30BF\u30A4\u30E0\u306E\u73FE\u5728\u306E\u30E9\u30F3\u30BF\u30A4\u30E0\u30B9\u30C6\u30FC\u30BF\u30B9\u3002\u5229\u7528\u53EF\u80FD\u306A\u30B9\u30C6\u30FC\u30BF\u30B9\u30E2\u30FC\u30C9\u306F\u3001OK\u3001FAILED\u3001STOPPED \u3067\u3059\u3002FAILED \u306F\u4F9D\u5B58\u6027\u304C\u306C\u3051\u3066\u3044\u308B\u304B\u3001\u30B5\u30FC\u30D3\u30B9\u304C\u958B\u59CB\u3055\u308C\u3066\u3044\u306A\u3044\u53EF\u80FD\u6027\u304C\u3042\u308B\u3053\u3068\u3092\u793A\u3057\u3001STOPPED \u306F\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u304C\u6709\u52B9\u306B\u306A\u3063\u3066\u3044\u306A\u3044\u304B\u3001\u624B\u52D5\u3067\u505C\u6B62\u3055\u308C\u305F\u3053\u3068\u3092\u793A\u3057\u307E\u3059\u3002
deployment.subsystem=\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u304C\u30C7\u30D7\u30ED\u30A4\u3055\u308C\u305F\u3068\u304D\u306B\u4F5C\u6210\u3055\u308C\u3001\u30E9\u30F3\u30BF\u30A4\u30E0\u30EA\u30BD\u30FC\u30B9\u3092\u62C5\u5F53\u3059\u308B\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u304C\u6574\u7406\u3059\u308B\u30E9\u30F3\u30BF\u30A4\u30E0\u30EA\u30BD\u30FC\u30B9
deployment.subdeployment=\u5225\u306E\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u5185\u306B\u30D1\u30C3\u30B1\u30FC\u30B8\u5316\u3055\u308C\u305F\u5B50\u306E\u30C7\u30D7\u30ED\u30A4\u30E1\u30F3\u30C8\u306B\u95A2\u9023\u4ED8\u3051\u3089\u308C\u305F\u30E9\u30F3\u30BF\u30A4\u30E0\u30EA\u30BD\u30FC\u30B9\u3002\u4F8B\uFF1Aear \u306E\u4E2D\u306B\u3042\u308B war \u30D1\u30C3\u30B1\u30FC\u30B8
global.read-attribute=\u9078\u629E\u3057\u305F\u30EA\u30BD\u30FC\u30B9\u306B\u5BFE\u3059\u308B\u5C5E\u6027\u306E\u5024\u3092\u53D6\u5F97\u3057\u307E\u3059\u3002
global.read-attribute.name=\u9078\u629E\u3057\u305F\u30EA\u30BD\u30FC\u30B9\u306E\u914D\u4E0B\u306B\u3042\u308B\u5024\u3092\u53D6\u5F97\u3059\u308B\u305F\u3081\u306E\u5C5E\u6027\u540D
global.read-attribute.include-defaults=\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u8AAD\u307F\u8FBC\u307F\u3092\u6709\u52B9\u5316\uFF0F\u7121\u52B9\u5316\u3059\u308B Boolean\u3002False \u306B\u8A2D\u5B9A\u3057\u3066\u3044\u308B\u5834\u5408\u306F\u3001\u30E6\u30FC\u30B6\u30FC\u304C\u8A2D\u5B9A\u3057\u305F\u5C5E\u6027\u306E\u307F\u8FD4\u3057\u3001\u672A\u5B9A\u7FA9\u306E\u5834\u5408\u306F\u7121\u8996\u3057\u307E\u3059\u3002
global.read-attribute.reply=\u5C5E\u6027\u306E\u5024\u3002\u578B\u306F\u3001\u898B\u3064\u304B\u3063\u305F\u5C5E\u6027\u306E\u578B\u3068\u306A\u308A\u307E\u3059\u3002
global.read-children-names=\u6307\u5B9A\u306E\u578B\u3092\u6301\u3064\u9078\u629E\u3057\u305F\u30EA\u30BD\u30FC\u30B9\u306E\u914D\u4E0B\u306B\u3042\u308B\u5B50\u3059\u3079\u3066\u306E\u540D\u524D\u3092\u53D6\u5F97\u3057\u307E\u3059\u3002
global.read-children-names.child-type=\u5B50\u306E\u540D\u524D\u3092\u53D6\u5F97\u3059\u308B\u30CE\u30FC\u30C9\u540D
global.read-children-names.reply=\u5B50\u306E\u540D\u524D
global.read-children-types=\u9078\u629E\u3057\u305F\u30EA\u30BD\u30FC\u30B9\u306E\u914D\u4E0B\u306B\u3042\u308B\u5B50\u3059\u3079\u3066\u306E\u578B\u540D\u3092\u53D6\u5F97\u3057\u307E\u3059\u3002
global.read-children-types.reply=\u5B50\u306E\u578B
global.read-children-resources=\u6307\u5B9A\u306E\u578B\u3092\u6301\u3064\u30EA\u30BD\u30FC\u30B9\u306E\u5B50\u3059\u3079\u3066\u306B\u95A2\u3059\u308B\u60C5\u5831\u3092\u8AAD\u307F\u8FBC\u307F\u307E\u3059\u3002
global.read-children-resources.child-type=\u5B50\u306E\u30EA\u30BD\u30FC\u30B9\u3092\u53D6\u5F97\u3059\u308B\u30EA\u30BD\u30FC\u30B9\u540D
global.read-children-resources.recursive=\u518D\u5E30\u7684\u306B\u5B50\u3092\u53D6\u5F97\u3059\u308B\u304B\u3069\u3046\u304B\u3002\u306A\u3044\u5834\u5408\u306F\u3001False \u304C\u30C7\u30D5\u30A9\u30EB\u30C8\u3067\u3059\u3002
global.read-children-resources.recursive-depth=\u5B50\u306E\u30EA\u30BD\u30FC\u30B9\u3092\u542B\u3080\u3079\u304D\u304B\u306B\u95A2\u3059\u308B\u60C5\u5831\u306E\u518D\u5E30\u51E6\u7406\u306E\u6DF1\u3055
global.read-children-resources.proxies=\u518D\u5E30\u7684\u306A\u30AF\u30A8\u30EA\u306B\u30EA\u30E2\u30FC\u30C8\u306E\u30EA\u30BD\u30FC\u30B9\u3092\u542B\u3081\u308B\u304B\u3069\u3046\u304B (\u30C9\u30E1\u30A4\u30F3 root \u306E\u30AF\u30A8\u30EA\u5185\u306E\u30DB\u30B9\u30C8\u30EC\u30D9\u30EB\u306E\u30EA\u30BD\u30FC\u30B9\u3002\u30DB\u30B9\u30C8\u306E\u30AF\u30A8\u30EA\u5185\u3067\u7A3C\u52D5\u4E2D\u306E\u30B5\u30FC\u30D0\u30FC\u30EA\u30BD\u30FC\u30B9)\u3002\u306A\u3044\u5834\u5408\u306F false \u304C\u30C7\u30D5\u30A9\u30EB\u30C8\u3067\u3059\u3002
global.read-children-resources.include-runtime=\u30E9\u30F3\u30BF\u30A4\u30E0\u5C5E\u6027\u3092\u30EC\u30B9\u30DD\u30F3\u30B9\u306B\u542B\u3080\u304B\u3069\u3046\u304B (\u5024\u304C\u6C38\u7D9A\u8A2D\u5B9A\u304B\u3089\u6765\u308B\u3082\u306E)\u3002\u306A\u3044\u5834\u5408\u306F false \u304C\u30C7\u30D5\u30A9\u30EB\u30C8\u3067\u3059\u3002'recursive' \u30D1\u30E9\u30E1\u30FC\u30BF\u30FC\u304C 'true' \u306B\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u306F\u7121\u8996 (runtime \u5C5E\u6027\u306F\u518D\u5E30\u7684\u30AF\u30A8\u30EA\u4EE5\u5916\u3067\u306E\u307F\u8AAD\u307F\u8FBC\u307F\u53EF\u80FD\u3067\u3059)\u3002
global.read-children-resources.include-defaults=\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u8AAD\u307F\u8FBC\u307F\u3092\u6709\u52B9\u5316\uFF0F\u7121\u52B9\u5316\u3059\u308B Boolean\u3002False \u306B\u8A2D\u5B9A\u3057\u3066\u3044\u308B\u5834\u5408\u306F\u3001\u30E6\u30FC\u30B6\u30FC\u304C\u8A2D\u5B9A\u3057\u305F\u5C5E\u6027\u306E\u307F\u8FD4\u3057\u3001\u672A\u5B9A\u7FA9\u306E\u5834\u5408\u306F\u7121\u8996\u3057\u307E\u3059\u3002
global.read-children-resources.reply=\u5B50\u306E\u30EA\u30BD\u30FC\u30B9
global.read-operation=\u6307\u5B9A\u306E\u30EA\u30BD\u30FC\u30B9\u306E\u64CD\u4F5C\u8A73\u7D30\u3092\u53D6\u5F97\u3057\u307E\u3059\u3002
global.read-operation.locale=\u64CD\u4F5C\u306E\u8AAC\u660E\u3092\u53D6\u5F97\u3059\u308B\u969B\u306E\u30ED\u30B1\u30FC\u30EB\u3002null \u306E\u5834\u5408\u306F\u3001\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u30ED\u30B1\u30FC\u30EB\u304C\u5229\u7528\u3055\u308C\u307E\u3059\u3002
global.read-operation.reply=\u8A73\u7D30\u3092\u53D6\u5F97\u3059\u308B\u64CD\u4F5C\u306E\u540D\u524D
global.read-operation.type=\u64CD\u4F5C\u306E\u8AAC\u660E\u3002\u898B\u3064\u304B\u3089\u306A\u3044\u5834\u5408\u306F\u5B9A\u7FA9\u3055\u308C\u3066\u3044\u307E\u305B\u3093\u3002
global.read-operation-names=\u6307\u5B9A\u306E\u30EA\u30BD\u30FC\u30B9\u306B\u5BFE\u3059\u308B\u5168\u64CD\u4F5C\u306E\u540D\u524D\u3092\u53D6\u5F97\u3057\u307E\u3059\u3002
global.read-operation-names.reply=\u64CD\u4F5C\u540D
global.read-resource=\u5B50\u30EA\u30BD\u30FC\u30B9\u306B\u95A2\u3059\u308B\u57FA\u672C\u60C5\u5831\u3042\u308B\u3044\u306F\u5B8C\u5168\u60C5\u5831\u3068\u3068\u3082\u306B\u3001\u30E2\u30C7\u30EB\u30EA\u30BD\u30FC\u30B9\u306E\u5C5E\u6027\u5024\u3092\u8AAD\u307F\u8FBC\u307F\u307E\u3059\u3002
global.read-resource.recursive=\u5B50\u30EA\u30BD\u30FC\u30B9\u306B\u95A2\u3059\u308B\u5B8C\u5168\u60C5\u5831\u3092\u518D\u5E30\u7684\u306B\u542B\u3081\u308B\u304B\u3069\u3046\u304B\u3002\u306A\u3044\u5834\u5408\u306F false \u304C\u30C7\u30D5\u30A9\u30EB\u30C8\u3067\u3059\u3002
global.read-resource.recursive-depth=\u5B50\u306E\u30EA\u30BD\u30FC\u30B9\u3092\u542B\u3080\u3079\u304D\u304B\u306B\u95A2\u3059\u308B\u60C5\u5831\u306E\u518D\u5E30\u51E6\u7406\u306E\u6DF1\u3055
global.read-resource.proxies=\u518D\u5E30\u7684\u306A\u30AF\u30A8\u30EA\u306B\u30EA\u30E2\u30FC\u30C8\u306E\u30EA\u30BD\u30FC\u30B9\u3092\u542B\u3081\u308B\u304B\u3069\u3046\u304B (\u30C9\u30E1\u30A4\u30F3 root \u306E\u30AF\u30A8\u30EA\u5185\u306E\u30DB\u30B9\u30C8\u30EC\u30D9\u30EB\u306E\u30EA\u30BD\u30FC\u30B9\u3002\u30DB\u30B9\u30C8\u306E\u30AF\u30A8\u30EA\u5185\u3067\u7A3C\u52D5\u4E2D\u306E\u30B5\u30FC\u30D0\u30FC\u30EA\u30BD\u30FC\u30B9)\u3002\u306A\u3044\u5834\u5408\u306F false \u304C\u30C7\u30D5\u30A9\u30EB\u30C8\u3067\u3059\u3002
global.read-resource.include-runtime=\u30E9\u30F3\u30BF\u30A4\u30E0\u5C5E\u6027\u3092\u30EC\u30B9\u30DD\u30F3\u30B9\u306B\u542B\u3080\u304B\u3069\u3046\u304B (\u5024\u304C\u6C38\u7D9A\u8A2D\u5B9A\u304B\u3089\u6765\u308B\u3082\u306E)\u3002\u306A\u3044\u5834\u5408\u306F false \u304C\u30C7\u30D5\u30A9\u30EB\u30C8\u3067\u3059\u3002
global.read-resource.include-defaults=\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u8AAD\u307F\u8FBC\u307F\u3092\u6709\u52B9\u5316\uFF0F\u7121\u52B9\u5316\u3059\u308B Boolean\u3002False \u306B\u8A2D\u5B9A\u3057\u3066\u3044\u308B\u5834\u5408\u306F\u3001\u30E6\u30FC\u30B6\u30FC\u304C\u8A2D\u5B9A\u3057\u305F\u5C5E\u6027\u306E\u307F\u8FD4\u3057\u3001\u672A\u5B9A\u7FA9\u306E\u5834\u5408\u306F\u7121\u8996\u3057\u307E\u3059\u3002
global.read-resource.reply=\u5B50\u30EA\u30BD\u30FC\u30B9\u306B\u95A2\u3059\u308B\u60C5\u5831\u3068\u30EA\u30BD\u30FC\u30B9\u306E\u5C5E\u6027\u5024
global.read-resource-description=\u30EA\u30BD\u30FC\u30B9\u306E\u5C5E\u6027\u3001\u5B50\u306E\u578B\u3001\u30AA\u30D7\u30B7\u30E7\u30F3\u3067\u64CD\u4F5C\u306E\u8A73\u7D30\u3092\u53D6\u5F97\u3057\u307E\u3059\u3002
global.read-resource-description.locale=\u30EA\u30BD\u30FC\u30B9\u306E\u8AAC\u660E\u3092\u53D6\u5F97\u3059\u308B\u969B\u306E\u30ED\u30B1\u30FC\u30EB\u3002null \u306E\u5834\u5408\u306F\u3001\u30C7\u30D5\u30A9\u30EB\u30C8\u306E\u30ED\u30B1\u30FC\u30EB\u304C\u5229\u7528\u3055\u308C\u307E\u3059\u3002
global.read-resource-description.operations=\u30EA\u30BD\u30FC\u30B9\u306E\u64CD\u4F5C\u8A73\u7D30\u3092\u542B\u3081\u308B\u304B\u3069\u3046\u304B\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u306F false \u3067\u3059\u3002
global.read-resource-description.inherited='operations' \u304C true \u306E\u5834\u5408\u3001\u30EA\u30BD\u30FC\u30B9\u306E\u7D99\u627F\u64CD\u4F5C\u306E\u8AAC\u660E\u3092\u542B\u3081\u308B\u304B\u3069\u3046\u304B\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u306F true \u3067\u3059\u3002
global.read-resource-description.recursive=\u5B50\u306E\u30EA\u30BD\u30FC\u30B9\u306E\u8AAC\u660E\u3092\u518D\u5E30\u7684\u306B\u542B\u3081\u308B\u304B\u3069\u3046\u304B\u3002\u30C7\u30D5\u30A9\u30EB\u30C8\u306F false \u3067\u3059\u3002
global.read-resource-description.proxies=\u518D\u5E30\u7684\u306A\u30AF\u30A8\u30EA\u306B\u30EA\u30E2\u30FC\u30C8\u306E\u30EA\u30BD\u30FC\u30B9\u3092\u542B\u3081\u308B\u304B\u3069\u3046\u304B (\u30C9\u30E1\u30A4\u30F3 root \u306E\u30AF\u30A8\u30EA\u5185\u306E\u30DB\u30B9\u30C8\u30EC\u30D9\u30EB\u306E\u30EA\u30BD\u30FC\u30B9\u3002\u30DB\u30B9\u30C8\u306E\u30AF\u30A8\u30EA\u5185\u3067\u7A3C\u52D5\u4E2D\u306E\u30B5\u30FC\u30D0\u30FC\u30EA\u30BD\u30FC\u30B9)\u3002\u306A\u3044\u5834\u5408\u306F false \u304C\u30C7\u30D5\u30A9\u30EB\u30C8\u3067\u3059\u3002
global.read-resource-description.recursive-depth=\u5B50\u306E\u30EA\u30BD\u30FC\u30B9\u3092\u542B\u3080\u3079\u304D\u304B\u306B\u95A2\u3059\u308B\u60C5\u5831\u306E\u518D\u5E30\u51E6\u7406\u306E\u6DF1\u3055
global.read-resource-description.reply=\u30EA\u30BD\u30FC\u30B9\u306E\u8AAC\u660E
global.undefine-attribute=\u9078\u629E\u3057\u305F\u30EA\u30BD\u30FC\u30B9\u306E\u5C5E\u6027\u5024\u3092 'undefined' \u306B\u8A2D\u5B9A\u3057\u307E\u3059\u3002
global.undefine-attribute.name='undefined' \u306B\u8A2D\u5B9A\u3059\u3079\u304D\u5C5E\u6027\u306E\u540D\u524D
global.write-attribute=\u9078\u629E\u3057\u305F\u30EA\u30BD\u30FC\u30B9\u306B\u5BFE\u3059\u308B\u5C5E\u6027\u306E\u5024\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
global.write-attribute.name=\u9078\u629E\u3057\u305F\u30EA\u30BD\u30FC\u30B9\u306E\u914D\u4E0B\u306B\u3042\u308B\u5024\u3092\u8A2D\u5B9A\u3059\u308B\u305F\u3081\u306E\u5C5E\u6027\u540D
global.write-attribute.value=\u9078\u629E\u3057\u305F\u30EA\u30BD\u30FC\u30B9\u306E\u914D\u4E0B\u306B\u3042\u308B\u5024\u3092\u8A2D\u5B9A\u3059\u308B\u305F\u3081\u306E\u5C5E\u6027\u5024\u3002\u57FA\u76E4\u30E2\u30C7\u30EB\u304C null \u5024\u306B\u5BFE\u5FDC\u3059\u308B\u5834\u5408\u306F null \u3082\u53EF\u3002
global.validate-address=\u5F15\u6570\u3068\u3057\u3066\u6E21\u3055\u308C\u305F\u30A2\u30C9\u30EC\u30B9\u3092\u6301\u3064\u30EA\u30BD\u30FC\u30B9\u304C\u5B58\u5728\u3059\u308B\u304B\u78BA\u8A8D
global.validate-address.value=\u78BA\u8A8D\u3059\u3079\u304D\u30A2\u30C9\u30EC\u30B9
global.validate-address.reply=\u30A2\u30C9\u30EC\u30B9\u78BA\u8A8D\u306E\u30EC\u30DD\u30FC\u30C8
global.validate-address.reply.valid=\u5F15\u6570\u3068\u3057\u3066\u6E21\u3055\u308C\u305F\u30A2\u30C9\u30EC\u30B9\u3092\u6301\u3064\u30EA\u30BD\u30FC\u30B9\u304C\u5B58\u5728\u3059\u308B\u304B\u3069\u3046\u304B\u3092\u793A\u3057\u307E\u3059\u3002
global.validate-address.reply.problem=\u30A2\u30C9\u30EC\u30B9\u304C\u7121\u52B9\u306A\u3068\u304D\u306E\u307F\u542B\u307E\u308C\u3001\u30A2\u30C9\u30EC\u30B9\u304C\u4E0D\u6B63\u306A\u7406\u7531\u3092\u8AAC\u660E\u3057\u307E\u3059\u3002
global.validate-operation=\u8AAC\u660E\u306B\u5F93\u3044\u64CD\u4F5C\u304C\u6709\u52B9\u304B\u3069\u3046\u304B\u3092\u691C\u8A3C\u3057\u307E\u3059\u3002\u64CD\u4F5C\u306E failure-description \u306B\u30A8\u30E9\u30FC\u304C\u3042\u308C\u3070\u8868\u793A\u3055\u308C\u307E\u3059\u3002
global.validate-operation.value=\u691C\u8A3C\u3059\u3079\u304D\u64CD\u4F5C
root.composite=\u8907\u6570\u306E\u30EA\u30AF\u30A8\u30B9\u30C8\u3092 1 \u3064\u306E\u64CD\u4F5C\u30EA\u30AF\u30A8\u30B9\u30C8\u306B\u307E\u3068\u3081\u308B\u64CD\u4F5C
root.composite.steps=\u8907\u5408\u30EA\u30AF\u30A8\u30B9\u30C8\u3092\u69CB\u6210\u3059\u308B\u64CD\u4F5C\u30EA\u30AF\u30A8\u30B9\u30C8\u306E\u4E00\u89A7
root.composite.reply=\u5168\u30B9\u30C6\u30C3\u30D7\u306E\u7D50\u679C\u3092\u542B\u3080\u8907\u5408\u64CD\u4F5C\u306E\u30EC\u30B9\u30DD\u30F3\u30B9
read-config-as-xml=\u73FE\u5728\u306E\u8A2D\u5B9A\u3092\u8AAD\u307F\u8FBC\u307F\u3001XML \u5F62\u5F0F\u3067\u8FD4\u3057\u307E\u3059\u3002
read-config-as-xml.response=\u6C38\u7D9A\u8A2D\u5B9A\u306E XML \u5F62\u5F0F
jvm=\u7BA1\u7406\u30D7\u30ED\u30BB\u30B9\uFF0F\u30B5\u30FC\u30D0\u30FC\u306E JVM \u8A2D\u5B9A
jvm.add=\u65B0\u898F JVM \u8A2D\u5B9A\u3092\u8FFD\u52A0
jvm.remove=\u65E2\u5B58\u306E JVM \u8A2D\u5B9A\u3092\u524A\u9664
jvm.name=JVM \u8A2D\u5B9A\u540D
jvm.heap=JVM \u304C\u5272\u308A\u5F53\u3066\u305F\u521D\u671F\u306E\u30D2\u30FC\u30D7\u30B5\u30A4\u30BA
jvm.heap.max=JVM \u304C\u5272\u308A\u5F53\u3066\u308B\u3053\u3068\u306E\u3067\u304D\u308B\u6700\u5927\u30D2\u30FC\u30D7\u30B5\u30A4\u30BA
jvm.permgen=\u521D\u671F\u306E\u6C38\u7D9A\u751F\u6210\u30B5\u30A4\u30BA
jvm.permgen.max=\u6C38\u7D9A\u751F\u6210\u306E\u6700\u5927\u30B5\u30A4\u30BA
jvm.stack=JVM \u30B9\u30BF\u30C3\u30AF\u30B5\u30A4\u30BA\u306E\u8A2D\u5B9A
jvm.agent.lib=JVM \u30A8\u30FC\u30B8\u30A7\u30F3\u30C8 lib
jvm.agent.path=JVM \u30A8\u30FC\u30B8\u30A7\u30F3\u30C8\u306E\u30D1\u30B9
jvm.javaagent=java \u30A8\u30FC\u30B8\u30A7\u30F3\u30C8
jvm.option=JVM \u30AA\u30D7\u30B7\u30E7\u30F3
jvm.options=JVM \u30AA\u30D7\u30B7\u30E7\u30F3
jvm.option.add=jvm \u30AA\u30D7\u30B7\u30E7\u30F3\u306E\u8FFD\u52A0
jvm.option.remove=jvm \u30AA\u30D7\u30B7\u30E7\u30F3\u306E\u524A\u9664
jvm.env.variables=JVM \u74B0\u5883\u5909\u6570
jvm.system.properties=JVM \u30B7\u30B9\u30C6\u30E0\u30D7\u30ED\u30D1\u30C6\u30A3
jvm.java.home=java \u30DB\u30FC\u30E0
jvm.type=JVM \u306E\u30BF\u30A4\u30D7\u306F SUN \u3042\u308B\u3044\u306F IBM \u306E\u3044\u305A\u308C\u304B\u3067\u3059\u3002
jvm.debug.enabled=\u30C7\u30D0\u30C3\u30B0\u3092\u6709\u52B9\u306B\u3059\u308B\u304B\u3092\u6307\u5B9A\u3059\u308B Boolean \u5024
jvm.debug.options=\u30C7\u30D0\u30C3\u30B0\u30AA\u30D7\u30B7\u30E7\u30F3
jvm.env.classpath.ignored=\u74B0\u5883\u30AF\u30E9\u30B9\u30D1\u30B9\u3092\u7121\u8996
snapshot.delete.description=snapshots \u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u304B\u3089\u306E\u30B9\u30CA\u30C3\u30D7\u30B7\u30E7\u30C3\u30C8\u3092\u524A\u9664
snapshot.delete.name=\u524A\u9664\u3057\u305F\u3044\u30B9\u30CA\u30C3\u30D7\u30B7\u30E7\u30C3\u30C8\u540D\u3002\u540D\u524D\u5168\u4F53\u306F\u5FC5\u8981\u3042\u308A\u307E\u305B\u3093\u3002\u6E21\u3055\u308C\u308B\u5024\u304C\u4E00\u610F\u3067\u3042\u308C\u3070 snapshots \u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u5185\u306E\u30B9\u30CA\u30C3\u30D7\u30B7\u30E7\u30C3\u30C8\u3092\u7279\u5B9A\u3057\u307E\u3059\u3002'all' \u304C\u4F7F\u308F\u308C\u3066\u3044\u308B\u5834\u5408\u3001snapshots \u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u306E\u30B9\u30CA\u30C3\u30D7\u30B7\u30E7\u30C3\u30C8\u3059\u3079\u3066\u3092\u524A\u9664\u3057\u307E\u3059\u3002
snapshot.list.description=\u30B9\u30CA\u30C3\u30D7\u30B7\u30E7\u30C3\u30C8\u3092\u30EA\u30B9\u30C8\u3057\u307E\u3059\u3002
snapshot.list.reply.dir=\u30B9\u30CA\u30C3\u30D7\u30B7\u30E7\u30C3\u30C8\u304C\u4FDD\u5B58\u3055\u308C\u3066\u3044\u308B\u30C7\u30A3\u30EC\u30AF\u30C8\u30EA
snapshot.list.reply.names=snapshots \u30C7\u30A3\u30EC\u30AF\u30C8\u30EA\u5185\u306E\u30B9\u30CA\u30C3\u30D7\u30B7\u30E7\u30C3\u30C8\u540D
snapshot.take.description=\u73FE\u5728\u306E\u8A2D\u5B9A\u306E\u30B9\u30CA\u30C3\u30D7\u30B7\u30E7\u30C3\u30C8\u3092\u53D6\u308A\u307E\u3059\u3002
snapshot.take.reply.name=\u5F53\u8A2D\u5B9A\u304C\u6240\u5C5E\u3059\u308B\u30DE\u30B7\u30F3\u4E0A\u306E\u30D5\u30A1\u30A4\u30EB\u306E\u5834\u6240
vault=\u5C5E\u6027\u306E\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30DC\u30FC\u30EB\u30C8
vault.code=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30DC\u30FC\u30EB\u30C8\u5B9F\u88C5\u306E\u5B8C\u5168\u4FEE\u98FE\u540D
vault.option=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30DC\u30FC\u30EB\u30C8\u306E\u30AA\u30D7\u30B7\u30E7\u30F3
vault.options=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30DC\u30FC\u30EB\u30C8\u306E\u30AA\u30D7\u30B7\u30E7\u30F3
vault.add=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30DC\u30FC\u30EB\u30C8\u306E\u8FFD\u52A0
vault.remove=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30DC\u30FC\u30EB\u30C8\u306E\u524A\u9664
core.resolve-expression=\u30A4\u30F3\u30D7\u30C3\u30C8 (\u3042\u308B\u3044\u306F\u89E3\u6790\u3057\u8868\u73FE\u306B\u5909\u63DB\u3055\u308C\u308B\u30B9\u30C8\u30EA\u30F3\u30B0) \u3068\u3057\u3066\u8868\u73FE\u3092\u53D7\u3051\u4ED8\u3051\u3001\u30ED\u30FC\u30AB\u30EB\u306E\u30B7\u30B9\u30C6\u30E0\u30D7\u30ED\u30D1\u30C6\u30A3\u3068\u74B0\u5883\u5909\u6570\u306B\u5BFE\u3057\u3053\u306E\u8868\u73FE\u3092\u89E3\u6C7A\u3059\u308B\u3068\u3044\u3046\u64CD\u4F5C
core.resolve-expression.expression=\u89E3\u6C7A\u306E\u5FC5\u8981\u306E\u3042\u308B\u8868\u73FE
core.resolve-expression.reply=\u89E3\u6C7A\u6E08\u307F\u306E\u8868\u73FE\u3001\u3042\u308B\u3044\u306F\u8868\u73FE\u3067\u306A\u3044\u5834\u5408\u306F\u30B9\u30C8\u30EA\u30F3\u30B0\u5F62\u5F0F\u306E\u5143\u306E\u5165\u529B\u5024
