cannotResolveAddress=No puede resolver la direcci\u00F3n %s as\u00ED que no la puede ligar a ninguna InetAddress
errorBootingContainer.0=Error al iniciar el contenedor
errorBootingContainer.2=Error al iniciar el contenedor debido a insuficiente espacio de pila para el hilo utilizado para ejecutar operaciones de arranque. El hilo se configur\u00F3 con un tama\u00F1o de pila de [%1$d]. El establecer la propiedad del sistema %2$s con un valor mayor que [%1$d] puede resolver este problema.
errorRevertingOperation=%s se atrap\u00F3 una excepci\u00F3n tratando de revertir la operaci\u00F3n %s en la direcci\u00F3n %s
failedExecutingOperation=No logr\u00F3 ejecutar la operaci\u00F3n %s en la direcci\u00F3n %s
failedSubsystemBootOperations=No logr\u00F3 ejecutar las operaciones de arranque %s del sub-sistema
failedToCloseResource=No logr\u00F3 cerrar el recurso %s
failedToPersistConfigurationChange=No logr\u00F3 persistir el cambio de configuraci\u00F3n 
failedToStoreConfiguration=No se logr\u00F3 almacenar la configuraci\u00F3n para %s
invalidSystemPropertyValue=Valor inv\u00E1lido %s para la propiedad del sistema %s -- usando el valor predeterminado [%d]
invalidWildcardAddress=Direcci\u00F3n %1$s es una direcci\u00F3n comod\u00EDn, la cual no coincidir\u00E1 con ninguna direcci\u00F3n espec\u00EDfica. No use el elemento de configuraci\u00F3n '%2$s' para especificar que una interfaz debe usar una direcci\u00F3n de comod\u00EDn; use '%3$s', '%4$s', o '%5$s'
noHandler=No hay manjeador para %s en la direcci\u00F3n %s
operationFailed.2=Operaci\u00F3n (%s) fall\u00F3 - direcci\u00F3n\: (%s)
operationFailed.3=Operaci\u00F3n (%s) fall\u00F3 - direcci\u00F3n\: (%s) - descripci\u00F3n de la falla\: %s
operationFailed.4=Operaci\u00F3n (%s) fall\u00F3 - direcci\u00F3n\: (%s) -- debido a insuficiente espacio de pila para el hilo utilizado para ejecutar operaciones. Si este error est\u00E1 ocurriendo durante el arranque del servidor entonces el establecer la propiedad del sistema %s con un valor mayor que [%d] puede resolver este problema.
wildcardAddressDetected=Direcci\u00F3n de comod\u00EDn detectada - ignorar\u00E1 otros criterios de la interfaz.
noFinalProxyOutcomeReceived=No se recibi\u00F3 el resultado de la respuesta final para la operaci\u00F3n %s con la direcci\u00F3n %s del proceso remoto en la direcci\u00F3n %s. El resultado de esta operaci\u00F3n s\u00F3lo incluir\u00E1 la respuesta preliminar del proceso remoto a la petici\u00F3n.
operationFailedOnClientError=Operaci\u00F3n (%s) fall\u00F3 - direcci\u00F3n\: (%s) - descripci\u00F3n de la falla\: %s
registerSubsystemNoWraper=Un sub-sistema '%s' fue registrado sin llamar a ExtensionContext.createTracker(). Los sub-sistemas se registran normalmente pero no se limpiar\u00E1n cuando la extensi\u00F3n se borre.
