cannotResolveAddress=\u30A2\u30C9\u30EC\u30B9%s \u3092\u89E3\u6C7A\u3067\u304D\u307E\u305B\u3093\u3002\u305D\u306E\u305F\u3081\u3001\u3069\u306E InetAddress \u3068\u3082\u4E00\u81F4\u3057\u307E\u305B\u3093\u3002
errorBootingContainer.0=\u30B3\u30F3\u30C6\u30CA\u30FC\u306E\u8D77\u52D5\u30A8\u30E9\u30FC
errorBootingContainer.2=\u8D77\u52D5\u64CD\u4F5C\u3092\u5B9F\u884C\u3059\u308B\u306E\u306B\u5229\u7528\u3059\u308B\u30B9\u30EC\u30C3\u30C9\u306B\u5341\u5206\u306A\u30B9\u30BF\u30C3\u30AF\u30B9\u30DA\u30FC\u30B9\u304C\u306A\u3044\u305F\u3081\u3001\u30B3\u30F3\u30C6\u30CA\u30FC\u306E\u30D6\u30FC\u30C8\u30A8\u30E9\u30FC\u304C\u767A\u751F\u3057\u307E\u3057\u305F\u3002\u3053\u306E\u30B9\u30EC\u30C3\u30C9\u306F\u3001[%1$d]\u3068\u3044\u3046\u30B9\u30BF\u30C3\u30AF\u30B5\u30A4\u30BA\u3067\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u307E\u3057\u305F\u3002\u30B7\u30B9\u30C6\u30E0\u30D7\u30ED\u30D1\u30C6\u30A3%2$s \u3092[%1$d]\u3088\u308A\u3082\u5927\u304D\u3044\u5024\u306B\u8A2D\u5B9A\u3057\u3001\u3053\u306E\u554F\u984C\u3092\u89E3\u6C7A\u3057\u3066\u307F\u3066\u304F\u3060\u3055\u3044\u3002
errorRevertingOperation=%s \u306F\u30A2\u30C9\u30EC\u30B9%s \u3067\u64CD\u4F5C%s \u3092\u5143\u306B\u623B\u305D\u3046\u3068\u3057\u3066\u3044\u308B\u9014\u4E2D\u3067\u4F8B\u5916\u3092\u691C\u51FA\u3057\u307E\u3057\u305F\u3002
failedExecutingOperation=\u30A2\u30C9\u30EC\u30B9%s \u3067\u64CD\u4F5C%s \u306E\u5B9F\u884C\u306B\u5931\u6557\u3057\u307E\u3057\u305F\u3002
failedSubsystemBootOperations=\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0%s \u306E\u30D6\u30FC\u30C8\u64CD\u4F5C\u3092\u5B9F\u884C\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
failedToCloseResource=\u30EA\u30BD\u30FC\u30B9%s \u3092\u7D42\u4E86\u3059\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
failedToPersistConfigurationChange=\u8A2D\u5B9A\u306E\u5909\u66F4\u3092\u6C38\u7D9A\u5316\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
failedToStoreConfiguration=%s \u306B\u8A2D\u5B9A\u3092\u4FDD\u5B58\u3067\u304D\u307E\u305B\u3093\u3067\u3057\u305F\u3002
invalidSystemPropertyValue=\u30B7\u30B9\u30C6\u30E0\u30D7\u30ED\u30D1\u30C6\u30A3%s \u306E\u5024%s \u306F\u7121\u52B9\u3067\u3059\u3002-- \u30C7\u30D5\u30A9\u30EB\u30C8\u5024[%d] \u3092\u5229\u7528\u3057\u307E\u3059\u3002
invalidWildcardAddress=\u30A2\u30C9\u30EC\u30B9%1$s\u306F\u30EF\u30A4\u30EB\u30C9\u30AB\u30FC\u30C9\u30A2\u30C9\u30EC\u30B9\u3067\u3001\u3044\u305A\u308C\u306E\u56FA\u6709\u30A2\u30C9\u30EC\u30B9\u306B\u3082\u30DE\u30C3\u30C1\u3057\u307E\u305B\u3093\u3002'%2$s' \u8A2D\u5B9A\u8981\u7D20\u3092\u4F7F\u3044\u3001\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u304C\u30EF\u30A4\u30EB\u30C9\u30AB\u30FC\u30C9\u30A2\u30C9\u30EC\u30B9\u3092\u5229\u7528\u3059\u308B\u3088\u3046\u306B\u6307\u5B9A\u3057\u306A\u3044\u3067\u304F\u3060\u3055\u3044\u3002'%3$s'\u3001'%4$s'\u3001'%5$s' \u306E\u3044\u305A\u308C\u304B\u3092\u5229\u7528\u3057\u3066\u304F\u3060\u3055\u3044\u3002
noHandler=\u30A2\u30C9\u30EC\u30B9%s\u306B%s\u306E\u30CF\u30F3\u30C9\u30E9\u30FC\u304C\u3042\u308A\u307E\u305B\u3093\u3002
operationFailed.2=\u64CD\u4F5C (%s) \u306E\u5931\u6557 - \u30A2\u30C9\u30EC\u30B9 \: (%s) 
operationFailed.3=\u64CD\u4F5C (%s) \u306E\u5931\u6557 - \u30A2\u30C9\u30EC\u30B9 \: (%s) - \u554F\u984C\u306E\u8A73\u7D30\: %s
operationFailed.4=\u64CD\u4F5C (%s) \u306E\u5931\u6557 - \u30A2\u30C9\u30EC\u30B9 \: (%s) -- \u64CD\u4F5C\u3092\u884C\u3046\u306E\u306B\u5229\u7528\u3059\u308B\u30B9\u30EC\u30C3\u30C9\u306B\u5341\u5206\u306A\u30B9\u30BF\u30C3\u30AF\u30B9\u30DA\u30FC\u30B9\u304C\u306A\u3044\u305F\u3081\u3067\u3059\u3002\u3053\u306E\u30A8\u30E9\u30FC\u304C\u30B5\u30FC\u30D0\u30FC\u306E\u8D77\u52D5\u6642\u306B\u767A\u751F\u3057\u305F\u5834\u5408\u3001\u30B7\u30B9\u30C6\u30E0\u30D7\u30ED\u30D1\u30C6\u30A3 %s \u306E\u5024\u3092[%d] \u3088\u308A\u3082\u5927\u304D\u3044\u5024\u306B\u8A2D\u5B9A\u3059\u308B\u3053\u3068\u3067\u3053\u306E\u554F\u984C\u3092\u89E3\u6C7A\u3057\u3066\u307F\u3066\u304F\u3060\u3055\u3044\u3002
wildcardAddressDetected=\u30EF\u30A4\u30EB\u30C9\u30AB\u30FC\u30C9\u306E\u30A2\u30C9\u30EC\u30B9\u304C\u691C\u51FA\u3055\u308C\u307E\u3057\u305F\u3002\u4ED6\u306E\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u57FA\u6E96\u306F\u7121\u8996\u3057\u307E\u3059\u3002
noFinalProxyOutcomeReceived=\u30A2\u30C9\u30EC\u30B9%s \u3067\u306E\u30EA\u30E2\u30FC\u30C8\u30D7\u30ED\u30BB\u30B9\u304B\u3089\u3001\u30A2\u30C9\u30EC\u30B9%s\u306E\u64CD\u4F5C%s\u306B\u5BFE\u3059\u308B\u6700\u7D42\u7D50\u679C\u306E\u30EC\u30B9\u30DD\u30F3\u30B9\u3092\u53D7\u3051\u53D6\u308C\u307E\u305B\u3093\u3067\u3057\u305F\u3002\u3053\u306E\u64CD\u4F5C\u306E\u7D50\u679C\u306B\u306F\u3001\u30EA\u30AF\u30A8\u30B9\u30C8\u306B\u5BFE\u3059\u308B\u30EA\u30E2\u30FC\u30C8\u30D7\u30ED\u30BB\u30B9\u306E\u4E8B\u524D\u30EC\u30B9\u30DD\u30F3\u30B9\u306E\u307F\u304C\u542B\u307E\u308C\u307E\u3059\u3002
operationFailedOnClientError=\u64CD\u4F5C (%s) \u306E\u5931\u6557 - \u30A2\u30C9\u30EC\u30B9 \: (%s) - \u554F\u984C\u306E\u8A73\u7D30\: %s
registerSubsystemNoWraper=\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0 '%s' \u306FExtensionContext.createTracker()\u306E\u547C\u3073\u51FA\u3057\u306A\u3057\u306B\u767B\u9332\u3055\u308C\u307E\u3057\u305F\u3002\u3053\u306E\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u306F\u6B63\u5E38\u306B\u767B\u9332\u3055\u308C\u307E\u3057\u305F\u304C\u3001\u7D99\u627F\u304C\u524A\u9664\u3055\u308C\u3066\u3082\u3053\u306E\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u306F\u524A\u9664\u3055\u308C\u307E\u305B\u3093\u3002
