# These files are generated via Zanata (https://translate.jboss.org/project/view/jboss_as).
# Please do not update this file as it will be overwritten.

cannotResolveAddress=N\u00E3o foi poss\u00EDvel resolver o endere\u00E7o %s, portanto n\u00E3o foi poss\u00EDvel combin\u00E1-lo com qualquer InetAddress
errorBootingContainer.0=Erro ao iniciar o recipiente
errorBootingContainer.2=Erro ao iniciar o recipiente devido ao espa\u00E7o insuficiente da pilha para o thread usado para executar as opera\u00E7\u00F5es de inicializa\u00E7\u00E3o. O thread foi configurado com o tamanho de pilha de [%1$d]. A configura\u00E7\u00E3o da propriedade do sistema %2$s para um valor mais alto que [%1$d], pode resolver este problema.
errorRevertingOperation=%s a exce\u00E7\u00E3o foi vista tentando reverter a opera\u00E7\u00E3o %s no endere\u00E7o %s
failedExecutingOperation=Falha ao executar a opera\u00E7\u00E3o %s no endere\u00E7o %s
failedSubsystemBootOperations=Falha ao executar o sub-sistema %s das opera\u00E7\u00F5es de inicializa\u00E7\u00E3o
failedToCloseResource=Falha ao encerrar o recurso %s
failedToPersistConfigurationChange=Falha ao persistir a altera\u00E7\u00E3o de configura\u00E7\u00E3o
failedToStoreConfiguration=Falha ao armazenar a configura\u00E7\u00E3o ao %s
invalidSystemPropertyValue=Valor inv\u00E1lido %s para a propriedade de sistema %s -- usando o valor padr\u00E3o [%d]
invalidWildcardAddress=O endere\u00E7o %1$s \u00E9 um endere\u00E7o curinga, que n\u00E3o coincidir\u00E1 com qualquer endere\u00E7o em espec\u00EDfico. N\u00E3o use o elemento de configura\u00E7\u00E3o '%2$s' para especificar que a interface usa o endere\u00E7o curinga\: use '%3$s', '%4$s', ou '%5$s'
noHandler=Nenhum manuseador para %s no endere\u00E7o %s
operationFailed.2=Falha na opera\u00E7\u00E3o (%s) - endere\u00E7o (%s)
operationFailed.3=Falha na opera\u00E7\u00E3o (%s) - endere\u00E7o (%s) - falha na descri\u00E7\u00E3o\: %s
operationFailed.4=Falha na opera\u00E7\u00E3o (%s) - endere\u00E7o\: (%s) -- devido ao espa\u00E7o insuficiente da pilha para o thread usado nas opera\u00E7\u00F5es de execu\u00E7\u00E3o. Caso esse erro estiver ocorrendo durante a inicializa\u00E7\u00E3o do servidor, a configura\u00E7\u00E3o da propriedade de sistema %s para um valor mais alto que [%d], poder\u00E1 resolver esse problema.
wildcardAddressDetected=Endere\u00E7o curinga detectado - ser\u00E1 ignorado outro crit\u00E9rio de interface
noFinalProxyOutcomeReceived=Foi recebido na resposta do resultado final para a opera\u00E7\u00E3o %s com endere\u00E7o %s a partir do processo remoto no endere\u00E7o %s. O resultado dessa opera\u00E7\u00E3o incluir\u00E1 apenas a resposta permiliar do processo remoto \u00E0 solicita\u00E7\u00E3o. 
operationFailedOnClientError=Falha na opera\u00E7\u00E3o (%s) - endere\u00E7o\: (%s) - falha na descri\u00E7\u00E3o\: %s
registerSubsystemNoWraper=O sub-sistema '%s' foi registrado sem a chamada ExtensionContext.createTracker(). Os sub-sistemas s\u00E3o normalmente registrados, mas n\u00E3o esvaziar\u00E3o quando a extens\u00E3o for removida. 
