cannotResolveAddress=Impossible de r\u00E9soudre l'adresse %s, donc impossible de la faire correspondre \u00E0 une adresse InetAddress
errorBootingContainer.0=Erreur de d\u00E9marrage du conteneur
errorBootingContainer.2=Erreur de d\u00E9marrage du conteneur d\u00FB au manque d'espace dans la pile pour le thread utilis\u00E9 pour ex\u00E9cuter les op\u00E9rations de d\u00E9marrage. Le thread a \u00E9t\u00E9 configur\u00E9 avec une taille de pile de [%1$d]. Vous pourrez sans doute r\u00E9soudre ce probl\u00E8me en d\u00E9finissant la propri\u00E9t\u00E9 syst\u00E8me %2$s avec une valeur sup\u00E9rieure \u00E0 [%1$d].
errorRevertingOperation=%s a intercept\u00E9 l'exception qui tentait de renvoyer l'op\u00E9ration %s \u00E0 l'adresse %s
failedExecutingOperation=N'a pas pu ex\u00E9cuter l'op\u00E9ration %s \u00E0 l'adresse %s
failedSubsystemBootOperations=N'a pas pu ex\u00E9cuter les op\u00E9rations d'amor\u00E7age %s du sous-syst\u00E8me
failedToCloseResource=N'a pas pu fermer la ressource %s
failedToPersistConfigurationChange=N'a pas pu faire persister le changement de configuration
failedToStoreConfiguration=N'a pas pu stocker la configuration \u00E0 %s
invalidSystemPropertyValue=Valeur %s non valide pour la propri\u00E9t\u00E9 de syst\u00E8me %s -- utilisant la valeur par d\u00E9faut [%d]
invalidWildcardAddress=L'addresse %1$s est une adresse g\u00E9n\u00E9rique, qui ne pourra pas correspondre \u00E0 une adresse particuli\u00E8re. N'utilisez pas l'\u00E9l\u00E9ment de configuration '%2$s' pour sp\u00E9cifier qu'une interface doive utiliser une adresse g\u00E9n\u00E9rique; utiliser '%3$s', '%4$s', ou '%5$s'
noHandler=Aucun gestionnaire pour %s \u00E0 l'adresse %s
operationFailed.2=L'op\u00E9ration (%s) a \u00E9chou\u00E9 - adresse \: (%s)
operationFailed.3=L'op\u00E9ration (%s) a \u00E9chou\u00E9 - adresse \: (%s) - Description de l'\u00E9chec \: %s
operationFailed.4=L'op\u00E9ration (%s) a \u00E9chou\u00E9 - adresse \: (%s) -- en raison d'un manque d'espace sur la pile pour le thread utilis\u00E9 pour ex\u00E9cuter les op\u00E9rations. Si cette erreur persiste pendant le d\u00E9marrage du serveur, vous pourrez sans doute r\u00E9soudre le probl\u00E8me en d\u00E9finissant la propri\u00E9t\u00E9 syst\u00E8me %s \u00E0 une valeur sup\u00E9rieure \u00E0  [%d].
wildcardAddressDetected=Adresse g\u00E9n\u00E9rique d\u00E9tect\u00E9e - ignorera les autres crit\u00E8res d'interface.
noFinalProxyOutcomeReceived=N'a pas re\u00E7u de r\u00E9ponse finale pour l'op\u00E9ration %s ayant pour adresse %s en provenance du processus %s \u00E0 l'adresse %s. Le r\u00E9sultat de cette op\u00E9ration n'inclura que la r\u00E9ponse pr\u00E9liminaire du processus distant.
operationFailedOnClientError=L'op\u00E9ration (%s) a \u00E9chou\u00E9 - adresse \: (%s) - Description de l'\u00E9chec \: %s
registerSubsystemNoWraper=Un sous-syst\u00E8me '%s' a \u00E9t\u00E9 enregistr\u00E9 sans faire appel \u00E0 ExtensionContext.createTracker(). Les sous-syst\u00E8mes ont \u00E9t\u00E9 enregistr\u00E9s normalement, mais ne seront pas nettoy\u00E9s quand l'extension sera supprim\u00E9e.
