# These files are generated via Zanata (https://translate.jboss.org/project/view/jboss_as).
# Please do not update this file as it will be overwritten.

cannotAddDeploymentAction=No se pueden agregar acciones de implementaci\u00F3n despu\u00E9s de iniciar la creaci\u00F3n de un plan de despliegue.
cannotAddDeploymentActionsAfterStart=No se pueden agregar acciones de implementaci\u00F3n despu\u00E9s de iniciar la creaci\u00F3n de un plan de despliegue.
cannotConvert=No se puede convertir %s a %s
cannotDeriveDeploymentName=No se puede derivar un nombre de implementaci\u00F3n de %s -- use una variante del m\u00E9todo sobrecargado que tome un par\u00E1metro 'nombre'
cannotUseDeploymentPlan=No puede utilizar un DeploymentPlan no creado por este administrador
channelClosed=Canal cerrado
domainDeploymentAlreadyExists=Implementaci\u00F3n con el nombre %s ya est\u00E1 presente en el dominio
failed=fallido
globalRollbackNotCompatible=El retroceso global no es compatible con un reinicio del servidor
gracefulShutdownAlreadyConfigured=El apagado completo ya est\u00E1 configurado con un tiempo de expiraci\u00F3n de %d ms
incompleteDeploymentReplace=S\u00F3lo puede existir una versi\u00F3n de implementaci\u00F3n con un nombre \u00FAnico dado en el dominio. El plan de implementaci\u00F3n especificaba que una nueva versi\u00F3n de implementaci\u00F3n %s reemplace una implementaci\u00F3n existente con el mismo nombre \u00FAnico pero no aplicaba el reemplazo a todos los grupos del servidor. Los grupos del servidor que faltaban fueron\: %s
invalidActionType=Tipo de acci\u00F3n inv\u00E1lido %s
invalidPrecedingAction=La acci\u00F3n anterior no fue un %s
invalidUri=%s no es una URI v\u00E1lida
invalidValue.3=Valor %s ilegal %d -- debe ser mayor que %d
invalidValue.4=Valor %s ilegal %d -- debe ser mayor que %d y menor que %d
maxDisplayUnitLength=La pantalla del agente inmobiliario es costosa; displayUnits debe ser 5 caracteres o menos
noActiveRequest=No se encontr\u00F3 una petici\u00F3n activa para %d
noFailureDetails=No se proporcionaron detalles sobre la falla
notConfigured=No hay %s configurados
nullVar=%s es nulo
objectIsClosed=%s est\u00E1 cerrado
operationOutcome=Resultado de la operaci\u00F3n es %s
operationsNotAllowed=Las operaciones %s no se permiten despu\u00E9s de modificaciones de contenido e implementaci\u00F3n
rollbackCancelled=Se cancel\u00F3 el retroceso
rollbackRolledBack=El retroceso mismo de deshizo
rollbackTimedOut=El retroceso expir\u00F3
serverDeploymentAlreadyExists=Implementaci\u00F3n con el nombre %s ya se encuentra presente en el servidor
unknownActionType=Tipo de acci\u00F3n desconocido %s
