patching=parche
patching.addon=complemento
patching.addon.cumulative-patch-id=Id de parche acumulativo.
patching.addon.patches=Una lista de parches instalados de manera activa.
patching.ageout-history=Borra una parte del historial de parches, la cual se considera como muy vieja y que ya no es \u00FAtil.
patching.layer=capa
patching.layer.cumulative-patch-id=Id de parche acumulativo.
patching.layer.patches=Una lista de parches instalados de manera activa.
patching.patch=Aplicar un parche.
patching.patch.input-stream-index=El \u00EDndice en los flujos de entrada adjuntos de la operaci\u00F3n del flujo de entrada que contiene el archivo parche comprimido que se debe cargar en el servidor para aplicar el parche.
patching.patch.override-all=Verdadero para evitar cualquier verificaci\u00F3n de contenido en los objetos miscel\u00E1neos que el parche cambi\u00F3.
patching.patch.override-modules=Verdadero para evitar cualquier verificaci\u00F3n de contenido en los m\u00F3dulos y paquetes OSGi afectados por el parche.
patching.patch.override=Lista de objetos miscel\u00E1neos en el parche que se pueden sobreescribir en el servidor ya sea si el objeto reporta un conflicto o no.
patching.patch.preserve=Lista de objetos miscel\u00E1neos que se deben mantener y no se deben modificar al aplicar el parche.
patching.patch-info=Informaci\u00F3n sobre un parche espec\u00EDfico
patching.patch-info.patch-id=El identificador del parche
patching.patch-info.verbose=Opcional, por defecto es falso y presenta un poco de informaci\u00F3n sobre el parche, verdadero para incluir informaci\u00F3n detallada sobre la capa y los parches para agregar incluidos en el parche.
patching.patch-info.type=Tipo de parche (\u00FAnico o acumulativo)
patching.patch-info.identity-name=El nombre de la identidad destino.
patching.patch-info.identity-version=La versi\u00F3n de la identidad destino
patching.patch-info.description=Descripci\u00F3n del parche
patching.patch-info.link=Enlace opcional para mayor informaci\u00F3n sobre el parche
patching.patch-info.elements=Elementos parche
patching.elements.patch-id=El identificador del elemento parche
patching.elements.type=Tipo del proveedor elemento (capa o complementario)
patching.elements.name=El nombre del proveedor elemento
patching.elements.description=La descripci\u00F3n del elemento parche
patching.rollback=Deshacer la aplicaci\u00F3n de un parche.
patching.rollback.patch-id=El id del parche a deshacer.
patching.rollback.override-all=Verdadero para evitar cualquier verificaci\u00F3n de contenido en los objetos miscel\u00E1neos que el parche cambi\u00F3 y que se est\u00E1 deshaciendo.
patching.rollback.override-modules=Verdadero para evitar cualquier verificaci\u00F3n de contenido en los m\u00F3dulos y paquetes OSGi afectados por el parche que se est\u00E1 deshaciendo.
patching.rollback.override=Lista de objetos miscel\u00E1neos en el parche que se pueden sobreescribir en el servidor ya sea si el objeto reporta un conflicto o no.
patching.rollback.preserve=Lista de objetos miscel\u00E1neos que se deben mantener y no se deben modificar al deshacer la aplicaci\u00F3n del parche.
patching.rollback.reset-configuration=La operaci\u00F3n para deshacer los cambios actualizar\u00E1 las configuraciones de instalaci\u00F3n y reestablecer\u00E1 las tomas de pantalla que se tomaron cuando se aplic\u00F3 el parche.
patching.rollback.rollback-to=Si el parche que se va a deshacer es uno que viene solo entonces significa que la operaci\u00F3n para deshacer los cambios tambi\u00E9n deshar\u00E1 los otros parches que vienen solos que se han aplicado encima del parche que se va a deshacer.
patching.rollback-last=Deshacer el parche aplicado por \u00FAltima vez.
patching.rollback-last.override-all=Verdadero para evitar cualquier verificaci\u00F3n de contenido en los objetos miscel\u00E1neos que el parche cambi\u00F3 y que se est\u00E1 deshaciendo.
patching.rollback-last.override-modules=Verdadero para evitar cualquier verificaci\u00F3n de contenido en los m\u00F3dulos y paquetes OSGi afectados por el parche que se est\u00E1 deshaciendo.
patching.rollback-last.override=Lista de objetos miscel\u00E1neos en el parche que se pueden sobreescribir en el servidor ya sea si el objeto reporta un conflicto o no.
patching.rollback-last.preserve=Lista de objetos miscel\u00E1neos que se deben mantener y no se deben modificar al deshacer la aplicaci\u00F3n del parche.
patching.rollback-last.reset-configuration=La operaci\u00F3n para deshacer los cambios actualizar\u00E1 las configuraciones de instalaci\u00F3n y reestablecer\u00E1 las tomas de pantalla que se tomaron cuando se aplic\u00F3 el parche.
patching.show-history=Mostrar el historial de los parches que se han aplicado.
patching.version=Versi\u00F3n actual de parche.
patching.cumulative-patch-id=Id de parche acumulativo.
patching.patches=Una lista de parches instalados de manera activa.
patching.module-path=Ruta de m\u00F3dulo utilizada para cargar los m\u00F3dulos JBoss.
patching.bundle-path=Ruta del agrupamiento utilizada para cargar los paquetes OSGi.
