patching=Patch
patching.addon=Add-on
patching.addon.cumulative-patch-id=Kumulative Patch-id.
patching.addon.patches=Liste von aktiv installierten Patches.
patching.ageout-history=Entfernt einen Teil der Patching-Historie, die als veraltet und nicht mehr von Nutzen angesehen wird.
patching.layer=Ebene
patching.layer.cumulative-patch-id=Kumulative Patch-id.
patching.layer.patches=Liste von aktiv installierten Patches.
patching.patch=Ein Patch anwenden.
patching.patch.input-stream-index=Der Index der mit der Operation zusammenh\u00E4ngenden Eingabestreams von dem Eingabestream, der die gezippte Patch-Datei enth\u00E4lt, die in den Server hochgeladen werden soll um den Patch anzuwenden.
patching.patch.override-all=True zur Umgehung von Inhaltsverfizierungen an den verschiedenen, durch den Patch ver\u00E4nderten Elementen.
patching.patch.override-modules=True zur Umgehung von Inhaltsverfizierungen an den vom Patch betroffenen Modulen und OSGi-B\u00FCndeln.
patching.patch.override=Liste der verschiedenen Elemente im Patch, die am Server au\u00DFer Kraft gesetzt werden k\u00F6nnen, ob das Element einen Konflikt meldet oder nicht.
patching.patch.preserve=Liste der verschiedenen Element, die gewahrt werden und nicht durch Anwendung des Patch ver\u00E4ndert werden d\u00FCrfen.
patching.rollback=Als Patch zur\u00FCcksetzen.
patching.rollback.patch-id=Die ID des zur\u00FCckzusetzenden Patch.
patching.rollback.override-all=True zur Umgehung von Inhaltsverfizierungen an den verschiedenen, durch den zur\u00FCckgesetzten Patch ver\u00E4nderten Elementen.
patching.rollback.override-modules=True zur Umgehung von Inhaltsverfizierungen an den vom zur\u00FCckgesetzten Patch betroffenen Modulen und OSGi-B\u00FCndeln.
patching.rollback.override=Liste der verschiedenen Elemente, die am Server au\u00DFer Kraft gesetzt werden k\u00F6nnen wenn der Patch zur\u00FCckgesetzt wird, ob das Element einen Konflikt meldet oder nicht.
patching.rollback.preserve=Liste der verschiedenen Element, die gewahrt werden und nicht durch Zur\u00FCcksetzen des Patch ver\u00E4ndert werden d\u00FCrfen.
patching.rollback.reset-configuration=Das Zur\u00FCcksetzen aktualisiert die Installationskonfigurationen und setzt die Schnappsch\u00FCsse zur\u00FCck, die bei der Anwendung des Patch gemacht wurden.
patching.rollback.rollback-to=Ist der zur\u00FCckzusetztende Patch ein einmaliger Patch, so bedeutet das, dass der Vorgang des Zur\u00FCcksetzens auch alle anderen einmaligen Patches zur\u00FCcksetzt, die neben dem zur\u00FCckzusetzenden Patch angewendet wurden.
patching.rollback-last=Den zuletzt angewendeten Patch zur\u00FCcksetzen.
patching.rollback-last.override-all=True zur Umgehung von Inhaltsverfizierungen an den verschiedenen, durch den zur\u00FCckgesetzten Patch ver\u00E4nderten Elementen.
patching.rollback-last.override-modules=True zur Umgehung von Inhaltsverfizierungen an den vom zur\u00FCckgesetzten Patch betroffenen Modulen und OSGi-B\u00FCndeln.
patching.rollback-last.override=Liste der verschiedenen Elemente, die am Server au\u00DFer Kraft gesetzt werden k\u00F6nnen wenn der Patch zur\u00FCckgesetzt wird, ob das Element einen Konflikt meldet oder nicht.
patching.rollback-last.preserve=Liste der verschiedenen Element, die gewahrt werden und nicht durch Zur\u00FCcksetzen des Patch ver\u00E4ndert werden d\u00FCrfen.
patching.rollback-last.reset-configuration=Das Zur\u00FCcksetzen aktualisiert die Installationskonfigurationen und setzt die Schnappsch\u00FCsse zur\u00FCck, die bei der Anwendung des Patch gemacht wurden.
patching.show-history=Anzeige der Historie angewendeter Patches.
patching.version=Aktuelle Patchversion.
patching.cumulative-patch-id=Kumulative Patch-id.
patching.patches=Liste von aktiv installierten Patches.
patching.module-path=Zum Laden der JBoss-Module verwendeter Modulpfad.
patching.bundle-path=Zum Laden der OSGi-B\u00FCndel verwendeter B\u00FCndelpfad.
