patching=patch
patching.addon=complemento
patching.addon.cumulative-patch-id=Id de patch cumulativo.
patching.addon.patches=A lista dos patches instalados ativamente.
patching.ageout-history=Remove uma parte do hist\u00F3rico do patch que \u00E9 considerado n\u00E3o \u00FAtil e muito velho.
patching.layer=camada
patching.layer.cumulative-patch-id=Id do patch cumulativo.
patching.layer.patches=A lista dos patches instalados ativamente.
patching.patch=Aplicar um patch.
patching.patch.input-stream-index=O \u00EDndice nos fluxos de entrada anexado da opera\u00E7\u00E3o do fluxo de entrada que cont\u00E9m o arquivo patch zipado que deveria ser carregado ao servidor para aplica\u00E7\u00E3o do patch.
patching.patch.override-all=Verdadeiro para ignorar qualquer verifica\u00E7\u00E3o de conte\u00FAdo nos itens diversos alterados pelo patch.
patching.patch.override-modules=Verdadeiro para ignorar qualquer verifica\u00E7\u00E3o nos m\u00F3dulos e pacotes OSGi afetados pelo patch.
patching.patch.override=Lista dos itens diversos no patch que pode ser substitu\u00EDdo no servidor, se \u00E9 que o item relata conflito ou n\u00E3o.
patching.patch.preserve=Lista os itens diversos que devem ser preservados e n\u00E3o modificados pela aplica\u00E7\u00E3o do patch.
patching.rollback=Reverter o patch.
patching.rollback.patch-id=A ID do patch para revers\u00E3o.
patching.rollback.override-all=Verdadeiro para ignorar qualquer verifica\u00E7\u00E3o de conte\u00FAdo nos itens diversos pelo patch que \u00E9 revertido.
patching.rollback.override-modules=Verdadeiro para ignorar qualquer verifica\u00E7\u00E3o de conte\u00FAdo nos m\u00F3dulos e os pacotes OSGi afetados pelo patch que \u00E9 revertido.
patching.rollback.override=Lista dos itens diversos que podem ser substitu\u00EDdos no servidor quando o patch \u00E9 revertido, se \u00E9 que o item relata um conflito ou n\u00E3o.
patching.rollback.preserve=Lista os itens diversos que devem ser preservados e n\u00E3o modificados pela revers\u00E3o do patch.
patching.rollback.reset-configuration=A opera\u00E7\u00E3o de revers\u00E3o ser\u00E1 atualizada para as configura\u00E7\u00F5es de instala\u00E7\u00E3o e reiniciar\u00E1 os snapshots que levados quando o patch foi aplicado.
patching.rollback.rollback-to=Caso o patch a ser revertido \u00E9 um patch \u00FAnico, isto significa que a opera\u00E7\u00E3o de revers\u00E3o tamb\u00E9m reverter\u00E1 todos os patches \u00FAnicos que foram aplicados ao patch para revers\u00E3o.
patching.rollback-last=Reverter o patch aplicado.
patching.rollback-last.override-all=Verdadeiro para ignorar qualquer verifica\u00E7\u00E3o de conte\u00FAdo nos itens diversos pelo patch que \u00E9 revertido.
patching.rollback-last.override-modules=Verdadeiro para ignorar qualquer verifica\u00E7\u00E3o de conte\u00FAdo nos m\u00F3dulos e os pacotes OSGi afetados pelo patch que \u00E9 revertido.
patching.rollback-last.override=Lista os itens diversos que podem ser substitu\u00EDdos no servidor quando o pacth \u00E9 revertido independente se \u00E9 que o item relata um conflito ou n\u00E3o.
patching.rollback-last.preserve=Lista os itens diversos que devem ser preservados e n\u00E3o modificados pela revers\u00E3o do patch.
patching.rollback-last.reset-configuration=A opera\u00E7\u00E3o de revers\u00E3o atualizar\u00E1 as configura\u00E7\u00F5es de instala\u00E7\u00E3o e reiniciar\u00E1 os snapshots levados  quando o patch foi aplicado.
patching.show-history=Apresentar o hist\u00F3rico dos patches que foram aplicados.
patching.version=Vers\u00E3o do patch atual.
patching.cumulative-patch-id=Id de patch cumulativo.
patching.patches=A lista dos patches instalado ativos.
patching.module-path=O caminho do m\u00F3dulo usado para carregar os m\u00F3dulos do JBoss.
patching.bundle-path=O caminho do pacote usado para carregar os pacotes OSGi.
