patching=\u30D1\u30C3\u30C1
patching.addon=\u30A2\u30C9\u30AA\u30F3
patching.addon.cumulative-patch-id=\u7D2F\u8A08\u30D1\u30C3\u30C1 id\u3002
patching.addon.patches=\u30A2\u30AF\u30C6\u30A3\u30D6\u306B\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u3055\u308C\u305F\u30D1\u30C3\u30C1\u306E\u4E00\u89A7\u3002
patching.ageout-history=\u53E4\u3059\u304E\u3066\u4F7F\u3044\u9053\u304C\u306A\u3044\u3068\u5224\u65AD\u3055\u308C\u305F\u3001\u30D1\u30C3\u30C1\u5C65\u6B74\u306E\u4E00\u90E8\u3092\u524A\u9664\u3057\u307E\u3059\u3002
patching.layer=\u30EC\u30A4\u30E4\u30FC
patching.layer.cumulative-patch-id=\u7D2F\u8A08\u30D1\u30C3\u30C1 id\u3002
patching.layer.patches=\u30A2\u30AF\u30C6\u30A3\u30D6\u306B\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u3055\u308C\u305F\u30D1\u30C3\u30C1\u306E\u4E00\u89A7\u3002
patching.patch=\u30D1\u30C3\u30C1\u3092\u9069\u7528\u3057\u307E\u3059\u3002
patching.patch.input-stream-index=\u30D1\u30C3\u30C1\u3092\u9069\u7528\u3059\u308B\u305F\u3081\u306B\u30B5\u30FC\u30D0\u30FC\u3078\u30A2\u30C3\u30D7\u30ED\u30FC\u30C9\u3059\u308B\u5FC5\u8981\u304C\u3042\u308B\u5727\u7E2E\u3055\u308C\u305F\u30D1\u30C3\u30C1\u30D5\u30A1\u30A4\u30EB\u304C\u542B\u307E\u308C\u308B\u3001\u64CD\u4F5C\u306E\u6DFB\u4ED8\u3055\u308C\u305F\u5165\u529B\u30B9\u30C8\u30EA\u30FC\u30E0\u3078\u306E\u30A4\u30F3\u30C7\u30C3\u30AF\u30B9\u3002
patching.patch.override-all=true \u3092\u8A2D\u5B9A\u3059\u308B\u3068\u3001\u30D1\u30C3\u30C1\u306B\u3088\u3063\u3066\u5909\u66F4\u3055\u308C\u305F\u305D\u306E\u4ED6\u306E\u9805\u76EE\u3067\u5185\u5BB9\u306E\u691C\u8A3C\u3092\u8FC2\u56DE\u3057\u307E\u3059\u3002
patching.patch.override-modules=true \u306B\u8A2D\u5B9A\u3059\u308B\u3068\u3001\u30D1\u30C3\u30C1\u306B\u5F71\u97FF\u3092\u53D7\u3051\u305F\u30E2\u30B8\u30E5\u30FC\u30EB\u304A\u3088\u3073 OSGi \u30D0\u30F3\u30C9\u30EB\u3067\u5185\u5BB9\u306E\u691C\u8A3C\u3092\u8FC2\u56DE\u3057\u307E\u3059\u3002
patching.patch.override=\u9805\u76EE\u306B\u3088\u308B\u7AF6\u5408\u5831\u544A\u306E\u6709\u7121\u306B\u95A2\u4FC2\u306A\u304F\u3001\u30B5\u30FC\u30D0\u30FC\u4E0A\u3067\u4E0A\u66F8\u304D\u53EF\u80FD\u306A\u30D1\u30C3\u30C1\u306E\u305D\u306E\u4ED6\u9805\u76EE\u306E\u4E00\u89A7\u3002
patching.patch.preserve=\u7DAD\u6301\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u3001\u30D1\u30C3\u30C1\u3092\u9069\u7528\u3057\u3066\u7DE8\u96C6\u3057\u3066\u306F\u306A\u3089\u306A\u3044\u305D\u306E\u4ED6\u306E\u9805\u76EE\u306E\u30EA\u30B9\u30C8\u3002
patching.rollback=\u30D1\u30C3\u30C1\u3092\u30ED\u30FC\u30EB\u30D0\u30C3\u30AF\u3057\u307E\u3059\u3002
patching.rollback.patch-id=\u30ED\u30FC\u30EB\u30D0\u30C3\u30AF\u3059\u308B\u30D1\u30C3\u30C1\u306E ID\u3002
patching.rollback.override-all=true \u3092\u8A2D\u5B9A\u3059\u308B\u3068\u3001\u30ED\u30FC\u30EB\u30D0\u30C3\u30AF\u3057\u305F\u30D1\u30C3\u30C1\u306B\u3088\u3063\u3066\u5909\u66F4\u3055\u308C\u305F\u305D\u306E\u4ED6\u306E\u9805\u76EE\u3067\u5185\u5BB9\u306E\u691C\u8A3C\u3092\u8FC2\u56DE\u3057\u307E\u3059\u3002
patching.rollback.override-modules=true \u306B\u8A2D\u5B9A\u3059\u308B\u3068\u3001\u30ED\u30FC\u30EB\u30D0\u30C3\u30AF\u3057\u305F\u30D1\u30C3\u30C1\u306B\u5F71\u97FF\u3092\u53D7\u3051\u305F\u30E2\u30B8\u30E5\u30FC\u30EB\u304A\u3088\u3073 OSGi \u30D0\u30F3\u30C9\u30EB\u3067\u5185\u5BB9\u306E\u691C\u8A3C\u3092\u8FC2\u56DE\u3057\u307E\u3059\u3002
patching.rollback.override=\u9805\u76EE\u306B\u3088\u308B\u7AF6\u5408\u5831\u544A\u306E\u6709\u7121\u306B\u95A2\u4FC2\u306A\u304F\u3001\u30D1\u30C3\u30C1\u304C\u30ED\u30FC\u30EB\u30D0\u30C3\u30AF\u3055\u308C\u305F\u3068\u304D\u306B\u30B5\u30FC\u30D0\u30FC\u4E0A\u3067\u4E0A\u66F8\u304D\u3067\u304D\u308B\u305D\u306E\u4ED6\u306E\u9805\u76EE\u306E\u4E00\u89A7\u3002
patching.rollback.preserve=\u7DAD\u6301\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u3001\u30D1\u30C3\u30C1\u3092\u30ED\u30FC\u30EB\u30D0\u30C3\u30AF\u3057\u3066\u7DE8\u96C6\u3057\u3066\u306F\u306A\u3089\u306A\u3044\u305D\u306E\u4ED6\u306E\u9805\u76EE\u306E\u30EA\u30B9\u30C8\u3002
patching.rollback.reset-configuration=\u30ED\u30FC\u30EB\u30D0\u30C3\u30AF\u64CD\u4F5C\u306F\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u8A2D\u5B9A\u3092\u66F4\u65B0\u3057\u3001\u30D1\u30C3\u30C1\u306E\u9069\u7528\u6642\u306B\u64AE\u3089\u308C\u305F\u30B9\u30CA\u30C3\u30D7\u30B7\u30E7\u30C3\u30C8\u3092\u30EA\u30BB\u30C3\u30C8\u3057\u307E\u3059\u3002
patching.rollback.rollback-to=\u30ED\u30FC\u30EB\u30D0\u30C3\u30AF\u3059\u308B\u30D1\u30C3\u30C1\u304C 1 \u56DE\u9650\u308A\u306E\u30D1\u30C3\u30C1\u3067\u3042\u308B\u5834\u5408\u3001\u30ED\u30FC\u30EB\u30D0\u30C3\u30AF\u64CD\u4F5C\u306B\u3088\u3063\u3066\u3001\u30ED\u30FC\u30EB\u30D0\u30C3\u30AF\u3059\u308B\u30D1\u30C3\u30C1\u3060\u3051\u3067\u306A\u304F\u3001\u9069\u7528\u3055\u308C\u305F\u4ED6\u306E 1 \u56DE\u9650\u308A\u306E\u30D1\u30C3\u30C1\u3082\u3059\u3079\u3066\u30ED\u30FC\u30EB\u30D0\u30C3\u30AF\u3057\u307E\u3059\u3002
patching.rollback-last=\u6700\u5F8C\u306B\u9069\u7528\u3055\u308C\u305F\u30D1\u30C3\u30C1\u3092\u30ED\u30FC\u30EB\u30D0\u30C3\u30AF\u3057\u307E\u3059\u3002
patching.rollback-last.override-all=true \u3092\u8A2D\u5B9A\u3059\u308B\u3068\u3001\u30ED\u30FC\u30EB\u30D0\u30C3\u30AF\u3057\u305F\u30D1\u30C3\u30C1\u306B\u3088\u3063\u3066\u5909\u66F4\u3055\u308C\u305F\u305D\u306E\u4ED6\u306E\u9805\u76EE\u3067\u5185\u5BB9\u306E\u691C\u8A3C\u3092\u8FC2\u56DE\u3057\u307E\u3059\u3002
patching.rollback-last.override-modules=true \u306B\u8A2D\u5B9A\u3059\u308B\u3068\u3001\u30ED\u30FC\u30EB\u30D0\u30C3\u30AF\u3057\u305F\u30D1\u30C3\u30C1\u306B\u5F71\u97FF\u3092\u53D7\u3051\u305F\u30E2\u30B8\u30E5\u30FC\u30EB\u304A\u3088\u3073 OSGi \u30D0\u30F3\u30C9\u30EB\u3067\u5185\u5BB9\u306E\u691C\u8A3C\u3092\u8FC2\u56DE\u3057\u307E\u3059\u3002
patching.rollback-last.override=\u9805\u76EE\u306B\u3088\u308B\u7AF6\u5408\u5831\u544A\u306E\u6709\u7121\u306B\u95A2\u4FC2\u306A\u304F\u3001\u30D1\u30C3\u30C1\u304C\u30ED\u30FC\u30EB\u30D0\u30C3\u30AF\u3055\u308C\u305F\u3068\u304D\u306B\u30B5\u30FC\u30D0\u30FC\u4E0A\u3067\u4E0A\u66F8\u304D\u3067\u304D\u308B\u305D\u306E\u4ED6\u306E\u9805\u76EE\u306E\u4E00\u89A7\u3002
patching.rollback-last.preserve=\u7DAD\u6301\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u3001\u30D1\u30C3\u30C1\u3092\u30ED\u30FC\u30EB\u30D0\u30C3\u30AF\u3057\u3066\u7DE8\u96C6\u3057\u3066\u306F\u306A\u3089\u306A\u3044\u305D\u306E\u4ED6\u306E\u9805\u76EE\u306E\u30EA\u30B9\u30C8\u3002
patching.rollback-last.reset-configuration=\u30ED\u30FC\u30EB\u30D0\u30C3\u30AF\u64CD\u4F5C\u306F\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u8A2D\u5B9A\u3092\u66F4\u65B0\u3057\u3001\u30D1\u30C3\u30C1\u306E\u9069\u7528\u6642\u306B\u64AE\u3089\u308C\u305F\u30B9\u30CA\u30C3\u30D7\u30B7\u30E7\u30C3\u30C8\u3092\u30EA\u30BB\u30C3\u30C8\u3057\u307E\u3059\u3002
patching.show-history=\u9069\u7528\u3055\u308C\u305F\u30D1\u30C3\u30C1\u306E\u5C65\u6B74\u3092\u8868\u793A\u3057\u307E\u3059\u3002
patching.version=\u73FE\u5728\u306E\u30D1\u30C3\u30C1\u30D0\u30FC\u30B8\u30E7\u30F3\u3002
patching.cumulative-patch-id=\u7D2F\u8A08\u30D1\u30C3\u30C1 id\u3002
patching.patches=\u30A2\u30AF\u30C6\u30A3\u30D6\u306B\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u3055\u308C\u305F\u30D1\u30C3\u30C1\u306E\u4E00\u89A7\u3002
patching.module-path=JBoss \u30E2\u30B8\u30E5\u30FC\u30EB\u3092\u30ED\u30FC\u30C9\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u308B\u30E2\u30B8\u30E5\u30FC\u30EB\u30D1\u30B9\u3002
patching.bundle-path=OSGi \u30D0\u30F3\u30C9\u30EB\u3092\u30ED\u30FC\u30C9\u3059\u308B\u305F\u3081\u306B\u4F7F\u7528\u3055\u308C\u308B\u30D0\u30F3\u30C9\u30EB\u30D1\u30B9\u3002
