platform-mbeans=Fornece a interface de gerenciamento para monitora\u00E7\u00E3o e gerenciamento da m\u00E1quina virtual do Java assim como o sistema operacional pelo qual a m\u00E1quina virtual do Java est\u00E1 rodando. Exp\u00F5e o JMX MBeans do JDK fornecido nos dom\u00EDnios java.lang, java.nio e java.util.logging JMX.
platform-mbeans.type=Os MBeans da plataforma, organizados pelo valor da propriedade 'tipo' no ObjectName do MBean.
object-name=A representa\u00E7\u00E3o da sequ\u00EAncia do nome do objeto desse objeto gerenciado da plataforma.
class-loading=A interface de gerenciamento para o sistema de carregamento da classe da m\u00E1quina virtual do Java.
class-loading.verbose=Se \u00E9 que a sa\u00EDda detalhada para o sistema do carregamento de classe est\u00E1 ativada.
class-loading.total-loaded-class-count=O n\u00FAmero total de classes que tem sido carregadas desde a m\u00E1quina virtual do Java iniciou a execu\u00E7\u00E3o.
class-loading.loaded-class-count=O n\u00FAmero de classes que est\u00E3o sendo carregadas na m\u00E1quina virtual do Java.
class-loading.unloaded-class-count=O n\u00FAmero total de classes descarregadas desde que a m\u00E1quina virtual iniciou a execu\u00E7\u00E3o.
compilation=A interface de gerenciamento para o sistema de compila\u00E7\u00E3o da m\u00E1quina virtual do Java
compilation.name=O nome do compilador Just-in-time (JIT).
compilation.compilation-time-monitoring-supported=Se \u00E9 que a m\u00E1quina virtual do Java suporta a monitora\u00E7\u00E3o do per\u00EDodo de compila\u00E7\u00E3o.
compilation.total-compilation-time=O per\u00EDodo aproximado de tempo acumulado (em mil\u00E9simos de segundos gastos na compila\u00E7\u00E3o). A implementa\u00E7\u00E3o da m\u00E1quina virtual do Java talvez n\u00E3o suporte a monitora\u00E7\u00E3o do per\u00EDodo de compila\u00E7\u00E3o. Caso, "a monitora\u00E7\u00E3o do per\u00EDodo de compila\u00E7\u00E3o seja suportada", ser\u00E1 "falso" tentar ler esse atributo atrav\u00E9s da opera\u00E7\u00E3o "leitura do atributo" e resultar\u00E1 em falha. Al\u00E9m disso, o valor desse atributo no resultado de uma opera\u00E7\u00E3o "leitura do atributo" ser\u00E1 "indefinido".
garbage-collectors=O recurso pai para os recursos fornecendo a interface de gerenciamento para a cole\u00E7\u00E3o de lixo da m\u00E1quina virtual do Java.
garbage-collectors.name=Os MBeans da Plataforma GarbageCollectorMXBean, organizados pelo valor da propriedade 'nome' no ObjectName do MBean.
garbage-collector=A interface de gerenciamento para um dos coletores de lixo na m\u00E1quina virtual do Java.
garbage-collector.name=O nome representando esse coletor de lixo.
garbage-collector.valid=Se \u00E9 que esse gerenciador de mem\u00F3ria \u00E9 v\u00E1lido na m\u00E1quina virtual do Java.
garbage-collector.memory-pool-names=O nome dos pools de mem\u00F3ria que esse coletor de lixo gerencia.
garbage-collector.collection-count=O n\u00FAmero total de cole\u00E7\u00F5es ocorridas.
garbage-collector.collection-time=O tempo aproximado da cole\u00E7\u00E3o acumulada em mil\u00E9simos de segundos.
memory=A interface de gerenciamento para o sistema de mem\u00F3ria da m\u00E1quina virtual do Java.
memory.verbose=Se \u00E9 que o resultado verboso para o sistema de mem\u00F3ria est\u00E1 ativado. 
memory.object-pending-finalization-count=O n\u00FAmero aproximado de objetos pelos quais a visualiza\u00E7\u00E3o est\u00E1 pendente.
memory.heap-memory-usage=O uso da mem\u00F3ria atual da pilha usada para aloca\u00E7\u00E3o do objeto.
memory.non-heap-memory-usage=O uso da mem\u00F3ria atual da mem\u00F3ria sem heap que \u00E9 usada pela m\u00E1quina virtual do Java.
memory.gc=Roda o coletor de lixo.
memory.usage.init=A quantia de mem\u00F3ria em bites que a m\u00E1quina virtual do Java solicita inicialmente do sistema de opera\u00E7\u00E3o para o gerenciamento de mem\u00F3ria.
memory.usage.used=A quantia de mem\u00F3ria usada em bites
memory.usage.committed=A quantia de mem\u00F3ria usada em bites que \u00E9 confirmada para a m\u00E1quina virtual Java a ser usada.
memory.usage.max=A quantia m\u00E1xima de mem\u00F3ria em bites que pode ser usada para o gerenciamento de mem\u00F3ria.
memory-managers=O recurso pai para os recursos fornecendo a interface do gerenciamento para os gerenciadores de mem\u00F3ria da m\u00E1quina virtual do Java.
memory-managers.name=Os MBeans da plataforma  MemoryManagerMXBean, organizados pelo valor da propriedade 'nome' no ObjectName do MBean.
memory-manager=A interface de gerenciamento para o gerenciamento de mem\u00F3ria. O gerenciador gerencia um ou mais pools de mem\u00F3ria da m\u00E1quina virtual do Java.
memory-manager.name=O nome representando esse gerenciador de mem\u00F3ria.
memory-manager.valid=Se \u00E9 que o gerenciador de mem\u00F3ria \u00E9 v\u00E1lido na m\u00E1quina virtual do Java.
memory-manager.memory-pool-names=Os nomes dos pools de mem\u00F3ria que esse gerenciador de mem\u00F3ria gerencia.
memory-pools=O recurso pai para os recursos fornecendo a interface de gerenciamento para os pools de mem\u00F3ria da m\u00E1quina virtual do Java.
memory-pools.name=Os MBeans da plataforma MemoryPoolMXBean, organizados pelo valor da propriedade 'nome' no ObjectName do MBean.
memory-pool=A interface de gerenciamento para o pool de mem\u00F3ria. O pool de mem\u00F3ria representa o recurso de mem\u00F3ria gerenciado pela m\u00E1quina virtual do Java e \u00E9 gerenciado por um ou mais gerenciadores da mem\u00F3ria.
memory-pool.name=O nome representando esse pool de mem\u00F3ria.
memory-pool.type=Esse tipo de pool de mem\u00F3ria.
memory-pool.valid=Se \u00E9 que o pool de mem\u00F3ria \u00E9 v\u00E1lido na m\u00E1quina virtual do Java. O pool de mem\u00F3ria torna-se inv\u00E1lido assim que a m\u00E1quina virtual do Java o remove do sistema de mem\u00F3ria.
memory-pool.usage=Um uso estimado de mem\u00F3ria desse pool de mem\u00F3ria. Ele pode ser "indefinido", caso o atributo "v\u00E1lido" for "falso".
memory-pool.peak-usage=O pico de uso da mem\u00F3ria desse pool de mem\u00F3ria desde que a m\u00E1quina virtual do Java foi inicializada ou desde que o pico foi reiniciado. Pode ser "indefinido" caso o atributo "v\u00E1lido" seja "falso".
memory-pool.memory-manager-names=Os nomes dos gerenciadores de mem\u00F3ria que gerenciam esse pool de mem\u00F3ria.
memory-pool.usage-threshold=O valor limite de uso desse pool de mem\u00F3ria em bites. O pool de mem\u00F3ria talvez n\u00E3o suporte o limite de uso. Caso o "limite de uso seja suportado", ser\u00E1 "falsa" a tentativa de leitura desse atributo atrav\u00E9s da opera\u00E7\u00E3o "leitura do atributo" e resultar\u00E1 na falha. Al\u00E9m disso, o valor desse atributo no resultado de uma opera\u00E7\u00E3o "leitura do recurso" ser\u00E1 "indefinido".
memory-pool.usage-threshold-exceeded=Se \u00E9 que o uso da mem\u00F3ria desse pool de mem\u00F3ria atinge ou excede o valor limite de uso. O pool de mem\u00F3ria talvez n\u00E3o suporte o limite de uso. Caso o "limite de uso seja suportado", ser\u00E1 "falsa" a tentativa de leitura desse atributo atrav\u00E9s da opera\u00E7\u00E3o "leitura do atributo" e resultar\u00E1 em falha. Al\u00E9m disso, o valor desse atributo no resultado de uma opera\u00E7\u00E3o "leitura do recurso" ser\u00E1 "indefinido".
memory-pool.usage-threshold-count=O n\u00FAmero de vezes que o uso da mem\u00F3ria ultrapassou o limite de uso. O pool da mem\u00F3ria talvez n\u00E3o suporte o limite de uso. Caso o "limite de uso seja suportado", ser\u00E1 "falsa" a tentativa de leitura desse atributo no resultado de uma opera\u00E7\u00E3o "leitura do recurso" e ser\u00E1 "indefinida".
memory-pool.usage-threshold-supported=Se \u00E9 que o pool de mem\u00F3ria suporta o limite de uso.
memory-pool.collection-usage-threshold=O valor do limite de uso da cole\u00E7\u00E3o desse pool de mem\u00F3ria em bites. O pool de mem\u00F3ria talvez n\u00E3o suporte o limite de uso da cole\u00E7\u00E3o. Caso o "limite de uso da cole\u00E7\u00E3o seja suportado", ser\u00E1 "falsa" a tentativa de leitura desse atributo atrav\u00E9s da opera\u00E7\u00E3o "leitura do atributo" e resultar\u00E1 em falha. Adicionado a isto, o valor desse atributo no resultado de uma opera\u00E7\u00E3o "leitura do atributo", ser\u00E1 "indefinido".
memory-pool.collection-usage-threshold-exceeded=Se \u00E9 que o uso da mem\u00F3ria desse pool de mem\u00F3ria ap\u00F3s a cole\u00E7\u00E3o mais recente atingiu ou excedeu seu limite de uso de cole\u00E7\u00E3o. O pool de mem\u00F3ria talvez n\u00E3o suporte o limite de uso de cole\u00E7\u00E3o. Caso o "limite de uso de cole\u00E7\u00E3o seja suportado", ser\u00E1 "falsa" a tentativa de leitura desse atributo atrav\u00E9s da opera\u00E7\u00E3o "leitura do atributo" e resultar\u00E1 na falha. Al\u00E9m disso, o valor desse atributo no resultado de uma opera\u00E7\u00E3o "leitura de recurso" ser\u00E1 "indefinido".
memory-pool.collection-usage-threshold-count=O n\u00FAmero de vezes que a m\u00E1quina virtual do Java detectou que o uso da mem\u00F3ria tenha atingido ou excedido o limite de uso da cole\u00E7\u00E3o. O pool de mem\u00F3ria talvez n\u00E3o suporte o limite de uso da cole\u00E7\u00E3o. Caso o "limite do uso de cole\u00E7\u00E3o seja suportado", ser\u00E1 "falsa" a tentativa de leitura desse atributo atrav\u00E9s da opera\u00E7\u00E3o "leitura do atributo" e resultar\u00E1 na falha. Adicionado a isto, o valor desse atributo no resultado da opera\u00E7\u00E3o "leitura do recurso" ser\u00E1 "indefinido". 
memory-pool.collection-usage=O uso da mem\u00F3ria ap\u00F3s a m\u00E1quina virtual do Java mais recente ter expandir empenho na reciclagem de objetos n\u00E3o utilizado nesse pool de mem\u00F3ria. Do contr\u00E1rio, "indefinido", caso esse atributo n\u00E3o seja suportado.
memory-pool.collection-usage-threshold-supported=Se \u00E9 que o pool de mem\u00F3ria suporta o limite de uso de cole\u00E7\u00E3o.
memory-pool.reset-peak-usage=Reinicia a estat\u00EDstica do uso do pico da mem\u00F3ria desse pool de mem\u00F3ria ao uso de mem\u00F3ria atual.
operating-system=A interface de gerenciamento para o sistema de opera\u00E7\u00E3o pelo qual a m\u00E1quina virtual do Java est\u00E1 rodando.
operating-system.name=O nome da opera\u00E7\u00E3o do sistema. Caso o gerenciador de seguran\u00E7a seja instalado e n\u00E3o permitir acesso ao "os.name" da propriedade de sistema, a opera\u00E7\u00E3o "leitura do atributo" falhar\u00E1 na leitura desse atributo. Al\u00E9m disso, o valor para o atributo no resultado para a opera\u00E7\u00E3o "leitura do recurso" ser\u00E1 "indefinido".
operating-system.arch=A arquitetura do sistema operacional. Caso o gerenciador de seguran\u00E7a for instalado e n\u00E3o permitir acesso ao "os.arch" da propriedade do sistema, a leitura da opera\u00E7\u00E3o "leitura do atributo" falhar\u00E1. Adicionado a isso, o valor desse atributo no resultado para a opera\u00E7\u00E3o "leitura do recurso" ser\u00E1 "indefinido".
operating-system.version=A vers\u00E3o do sistema de opera\u00E7\u00E3o. Caso o gerenciador de seguran\u00E7a for instalado e n\u00E3o permitir acesso ao "os.version" da propriedade do sistema, a leitura da opera\u00E7\u00E3o "leitura do atributo" falhar\u00E1. Al\u00E9m disso, o valor desse atributo no resultado para a opera\u00E7\u00E3o "leitura do recurso" ser\u00E1 "indefinido".
operating-system.available-processors=O n\u00FAmero de processadores dispon\u00EDveis \u00E0 m\u00E1quina virtual do Java.
operating-system.system-load-average=A carga m\u00E9dia do sistema para o \u00FAltimo minuto. A carga m\u00E9dia pode n\u00E3o estar dispon\u00EDvel em algumas plataformas. Caso a carga m\u00E9dia n\u00E3o esteja dispon\u00EDvel, um valor negativo ser\u00E1 retornado.
runtime=A interface de gerenciamento para o sistema do per\u00EDodo de rodagem da m\u00E1quina virtual do Java.
runtime.name=O nome representando a rodagem da m\u00E1quina virtual do Java.
runtime.vm-name=O nome de implanta\u00E7\u00E3o da m\u00E1quina virtual do Java. Caso o gereniador de seguran\u00E7a for instalado e n\u00E3o permitir acesso ao "java.vm.name" da propriedade do sistema, a opera\u00E7\u00E3o "leitura do atributo" falhar\u00E1 na leitura desse atributo. Al\u00E9m disso, o valor para o atributo no resultado para a opera\u00E7\u00E3o "leitura do recurso" ser\u00E1 "indefinido".
runtime.vm-vendor=O vendedor da implanta\u00E7\u00E3o da m\u00E1quina virtual. Caso o gerenciador de seguran\u00E7a  for instalado e n\u00E3o permitir acesso ao "java.vm.vendor" da propriedade do sistema, a opera\u00E7\u00E3o "leitura do atributo" falhar\u00E1 na leitura desse atributo. Adicionado a isso, o valor para o atributo no resultado para a opera\u00E7\u00E3o "leitura do recurso" ser\u00E1 "indefinido".
runtime.vm-version=A vers\u00E3o da implanta\u00E7\u00E3o da m\u00E1quina virtual. Caso o gerenciador de seguran\u00E7a for instalado e n\u00E3o permitir acesso ao "java.vm.version" da propriedade do sistema, a opera\u00E7\u00E3o "leitura do atributo" falhar\u00E1 na leitura desse atributo. Al\u00E9m disso, o valor para o atributo no resultado para a opera\u00E7\u00E3o "leitura do recurso" ser\u00E1 "indefinido".
runtime.spec-name=O nome da especifica\u00E7\u00E3o da m\u00E1quina virtual do Java. Caso o gerenciador de seguran\u00E7a for instalado e n\u00E3o permitir acessoo ao "java.vm.specification.name" da propriedade do sistema, a opera\u00E7\u00E3o "leitura do atributo" falhar\u00E1 na leitura desse atributo. Adicionado a isso, o valor para o atributo no resultado para a opera\u00E7\u00E3o "leitura do recurso" ser\u00E1 "indefinido".
runtime.spec-vendor=O vendedor da especifica\u00E7\u00E3o da m\u00E1quina virtual do Java. Caso o gerenciador de seguran\u00E7a for instalado e n\u00E3o permitir acesso ao  da "java.vm.specification.vendor" da propriedade de sistema, a opera\u00E7\u00E3o "leitura do atributo" falhar\u00E1 na leitura desse atributo. Al\u00E9m disso, o valor para o atributo no resultado para a opera\u00E7\u00E3o "leitura do recurso" ser\u00E1 "indefinido".
runtime.spec-version=O vers\u00E3o da especifica\u00E7\u00E3o da m\u00E1quina virtual do Java. Caso o gerenciador de seguran\u00E7a for instalado e n\u00E3o permitir acesso ao "java.vm.specification.version" da propriedade de sistema, a opera\u00E7\u00E3o "leitura do atributo" falhar\u00E1 na leitura desse atributo. Adicionado a isso, o valor para o atributo no resultado para a opera\u00E7\u00E3o "leitura do recurso" ser\u00E1 "indefinido".
runtime.management-spec-version=A vers\u00E3o da especifica\u00E7\u00E3o para a interface de gerenciamento implantada pela m\u00E1quina virtual do Java ativada.
runtime.class-path=O caminho de classe do Java que \u00E9 usado pelo carregador de classe do sistema para pesquisa dos arquivos de classe. Caso um gerenciador de seguran\u00E7a for instalado e n\u00E3o permitir acesso ao "java.class.path" da propriedade de sistema, a opera\u00E7\u00E3o "leitura do atributo" falhar\u00E1 na leitura. Al\u00E9m disso, o valor para o atributo no resultado para a opera\u00E7\u00E3o "leitura do recurso" ser\u00E1 "indefinido".
runtime.library-path=O caminho da biblioteca do Java. Caso o gerenciador de seguran\u00E7a seja instalado e n\u00E3o permitir acesso ao "java.library.path" da propriedade de sistema, a opera\u00E7\u00E3o "leitura do atributo" falhar\u00E1 na leitura. Adicionado a isso, o valor para o atributo no resultado para a opera\u00E7\u00E3o "leitura do recurso" ser\u00E1 "indefinido".
runtime.boot-class-path-supported=Se \u00E9 que a m\u00E1quina virtual do Java suporta o mecanismo do caminho usado pelo carregador  de classe bootstrap para pesquisa de arquivos de classe.
runtime.boot-class-path=O caminho da classe de inicia\u00E7\u00E3o que \u00E9 usado pelo carregador de classe bootstrap para busca dos arquivos de classe. Caso o "caminho de classe de inicializa\u00E7\u00E3o" for "falso" ou um gerenciador de seguran\u00E7a for instalado e o chamador n\u00E3o possuir ManagementPermission("monitor"), a opera\u00E7\u00E3o "leitura do atributo" falhar\u00E1 na leitura. Al\u00E9m disso, o valor para o atributo no resultado para a opera\u00E7\u00E3o "leitura do recurso" ser\u00E1 "indefinido".
runtime.input-arguments=Os argumentos de entrada passaram \u00E0 m\u00E1quina virtual do Java que n\u00E3o incluem os argumentos ao m\u00E9todo principal. Caso o gerenciador de seguran\u00E7a for instalado e o chamador n\u00E3o possuir ManagementPermission("monitor"), a leitura da opera\u00E7\u00E3o "leitura do atributo" falhar\u00E1. Adicionado a isso, o valor para o atributo no resultado para a opera\u00E7\u00E3o "leitura do recurso" ser\u00E1 "indefinido".
runtime.uptime=O tempo de avalia\u00E7\u00E3o da m\u00E1quina virtual do Java em mil\u00E9simos de segundos.
runtime.start-time=O per\u00EDodo inicial da m\u00E1quina virtual do Java em mil\u00E9simos de segundos.
runtime.system-properties=O mapa de nomes e valores de todas as propriedades. Caso o gerenciador de seguran\u00E7a for instalado e seu m\u00E9todo  n\u00E3o permitir acesso \u00E0s propriedades de sistema, a leitura da opera\u00E7\u00E3o "leitura do atributo" falhar\u00E1. Adicionado a isso, o valor para o atributo no resultado para a opera\u00E7\u00E3o "leitura do recurso" ser\u00E1 "indefinido".
threading=A interface de gerenciamento para o sistema limite da m\u00E1quina virtual do Java.
threading.thread-count=O n\u00FAmero atual de segmentos ativos incluindo ambos segmentos daemon e n\u00E3o daemon.\n\n
threading.peak-thread-count=O pico da contagem de segmentos ativos desde que a m\u00E1quina virtual do Java iniciou ou que o pico foi reiniciado.
threading.total-started-thread-count=O n\u00FAmero total de segmentos criados e iniciados desde que o a m\u00E1quina virtual do Java foi iniciada.
threading.daemon-thread-count=O n\u00FAmero atual de segmentos daemon ativos.
threading.all-thread-ids=Todas as IDs de segmento ativas. Caso o gerenciador de seguran\u00E7a e o chamador n\u00E3o possu\u00EDrem ManagementPermission("monitor"), a leitura da opera\u00E7\u00E3o "leitura do atributo" falhar\u00E1. Adicionado a isso, o valor para o atributo no resultado para a opera\u00E7\u00E3o "leitura do recurso" ser\u00E1 "indefinido".
threading.thread-contention-monitoring-supported=Se \u00E9 que a m\u00E1quina virtual do Java suporta a monitora\u00E7\u00E3o da conten\u00E7\u00E3o do segmento.
threading.thread-contention-monitoring-enabled=Se \u00E9 que a monitora\u00E7\u00E3o da conten\u00E7\u00E3o do segmento est\u00E1 ativado.
threading.current-thread-cpu-time=O per\u00EDodo de CPU total para o segmento atual em nanossegundos, ou -1 caso o "o per\u00EDodo do cpu da segmenta\u00E7\u00E3o estiver ativado". A implanta\u00E7\u00E3o da m\u00E1quina virtual do Java talvez n\u00E3o suporte o medida de tempo do CPU. Caso o o per\u00EDodo do cpu da segmenta\u00E7\u00E3ofor suportado", ser\u00E1 "falsa" a tentativa de leitura desse atributo atrav\u00E9s da opera\u00E7\u00E3o "leitura do atributo" falhar\u00E1. Adicionado a isso, o valor para o atributo no resultado para a opera\u00E7\u00E3o "leitura do recurso" ser\u00E1 "indefinido".
threading.current-thread-user-time=O per\u00EDodo do CPU que o segmento atual executou em modo do usu\u00E1rio em nanossegundos, ou -1 caso o "per\u00EDodo do cpu da segmenta\u00E7\u00E3o estiver ativado". A implanta\u00E7\u00E3o da m\u00E1quina virtual do Java talvez n\u00E3o suporte o medida de tempo do CPU. Caso o "per\u00EDodo do cpu da segmenta\u00E7\u00E3o for suportado", ser\u00E1 "falsa" a tentativa de leitura desse atributo atrav\u00E9s da opera\u00E7\u00E3o "leitura do atributo" falhar\u00E1. Adicionado a isso, o valor para o atributo no resultado para a opera\u00E7\u00E3o "leitura do recurso" ser\u00E1 "indefinido".
threading.thread-cpu-time-supported=Se \u00E9 que a implanta\u00E7\u00E3o da m\u00E1quina virtual do Java suporta a medida do tempo do CPU para qualquer thread.
threading.current-thread-cpu-time-supported=Se \u00E9 que a m\u00E1quina virtual do Java suporta a medida do tempo do CPU para o thread atual.
threading.thread-cpu-time-enabled=Se \u00E9 que a medida do tempo da CPU est\u00E1 ativada.
threading.object-monitor-usage-supported=Se \u00E9 que a m\u00E1quina virtual suporta a monitora\u00E7\u00E3o do uso do monitor do objeto.
threading.synchronizer-usage-supported=Se \u00E9 que a m\u00E1quina virtual do Java suporta a monitora\u00E7\u00E3o do uso do  pr\u00F3prio sincronizador.
threading.reset-peak-thread-count=Reinicia a contagem do thread de pico para o n\u00FAmero atual de threads ativos.
threading.find-deadlocked-threads=Encontra ciclos de thread que est\u00E3o na espera deadlock para adquirir os monitores de objeto ou sincronizadores pr\u00F3prios.
threading.find-monitor-deadlocked-threads=Encontra ciclos de threads que est\u00E3o na espera deadlock para adquirir monitores de objeto.
threading.find-threads.reply=Uma lista de ids de thread dos threads deadlocks, caso algum, ou 'indefinidos'.
threading.get-thread-info=Retorna a informa\u00E7\u00E3o do thread para um thread da id especificada. O rastreio da pilha, monitores bloqueados e sincronizadores bloqueados no objeto de resposta retornados ser\u00E3o esvaziados.
threading.get-thread-info.reply=Representa\u00E7\u00E3o sem d\u00EDgito do java.lang.management. O objeto ThreadInfo para o thread de uma ID gerada. "Indefinido" caso o thread de uma ID gerada n\u00E3o estiver ativa ou n\u00E3o existir.
threading.get-thread-infos=Retorna a informa\u00E7\u00E3o de thread para thread cuja ID esteja na lista de entrada.
threading.get-thread-infos.reply=A lista de representa\u00E7\u00E3o sem d\u00EDgito do java.lang.management. Os objetos ThreadInf, cada um contendo informa\u00E7\u00E3o a respeito do thread cuja ID est\u00E1 no elemento correspondente da lista de entrada das IDs. Um elemento ser\u00E1 "indefinido", caso o thread da ID gerada n\u00E3o estiver ativado ou n\u00E3o existir.
threading.get-thread-cpu-time=Retorna o tempo total do CPU para um thread de ID identificada em nanossegundos.
threading.get-thread-user-time=Retorna o tempo do CPU que um thread da ID especificada executou no modo do usu\u00E1rio em nanossegundos.
threading.dump-all-threads=Retorna a informa\u00E7\u00E3o do thread para todos os threads ativos com o rastreio da pilha e a informa\u00E7\u00E3o da sincroniza\u00E7\u00E3o.
threading.dump-threads.reply=A lista de representa\u00E7\u00F5es sem d\u00EDgito do java.lang.management. Os objetos ThreadInfo.
threading.id=A ID do thread, sendo que ela deve ser positiva.
threading.ids=A lista de ids do thread.
threading.max-depth=O n\u00FAmero m\u00E1ximo de entradas no rastreio da pilha a serem despejados. O Integer.MAX_VALUE pode ser usado para solicitar que a pilha completa seja despejada.
threading.locked-monitors=Se \u00E9 que o resultado deve ser incluir a informa\u00E7\u00E3o nos monitores bloqueados.
threading.locked-synchronizers=Se \u00E9 que o resultado deve incluir a informa\u00E7\u00E3o nos pr\u00F3prios sincronizadores bloqueados.
threading.stack.file-name=O nome do arquivo de fonte contendo o ponto de execu\u00E7\u00E3o representado pelo elemento de rastreio da pilha.
threading.stack.line-number=O n\u00FAmero da linha da linha da fonte contendo o ponto de execu\u00E7\u00E3o representado por esse elemento de rastreio da pilha.
threading.stack.class-name=O nome inteiramente qualificado da classe contendo o ponto de execu\u00E7\u00E3o representado por esse elemento de rastreio da pilha.
threading.stack.method-name=O nome do m\u00E9todo contendo o ponto de execu\u00E7\u00E3o representado pelo elemento de rastreio da pilha.
threading.stack.native-method=Se \u00E9 que o m\u00E9todo contendo o ponto de execu\u00E7\u00E3o representado pelo elemento de rastreio da pilha \u00E9 um m\u00E9todo nativo.
threading.lock.class-name=O nome inteiramente qualificado da classe do objeto de bloqueio.
threading.lock.identity-hash-code=O c\u00F3digo hash de indentidade do objeto de bloqueio a partir do m\u00E9todo System.identityHashCode(java.lang.Object).
threading.monitor.locked-stack-depth=A profundidade no rastreio da pilha se \u00E9 que o monitor do objeto foi bloqueado.
threading.monitor.locked-stack-frame=O quadro da pilha que bloqueou o monitor do objeto.
threading.thread-info.thread-id=A ID do thread.
threading.thread-info.thread-name=O nome do thread.
threading.thread-info.thread-state=O estado do thread.
threading.thread-info.blocked-time=O per\u00EDodo acumulado aproximadamente (em mil\u00E9simos de segundos) que o thread bloqueou para inserir ou reinserir um monitor uma vez que a monitora\u00E7\u00E3o de conten\u00E7\u00E3o do thread \u00E9 ativada, ou -1 caso a monitora\u00E7\u00E3o de conten\u00E7\u00E3o do thread n\u00E3o esteja ativada.
threading.thread-info.blocked-count=O n\u00FAmero total de vezes que o thread bloqueou para inser\u00E7\u00E3o ou reinser\u00E7\u00E3o do monitor.
threading.thread-info.waited-time=O per\u00EDodo de tempo aproximado (em mil\u00E9simos de segundos) que o thread esperou para notifica\u00E7\u00E3o, desde que a monitora\u00E7\u00E3o da conten\u00E7\u00E3o do thread foi ativada.
threading.thread-info.waited-count=O n\u00FAmero total de vezes que o thread esperou para notifica\u00E7\u00E3o.
threading.thread-info.lock-info=A representa\u00E7\u00E3o sem d\u00EDgito do java.lang.management. O LockInfo do objeto pelo qual o thread \u00E9 bloqueado na espera.
threading.thread-info.lock-name=A representa\u00E7\u00E3o da sequ\u00EAncia de um objeto pelo qual o thread \u00E9 bloqueado na espera.
threading.thread-info.lock-owner-id=A ID do thread que pertencente ao objeto pelo qual o thread \u00E9 bloqueado na espera.
threading.thread-info.lock-owner-name=O nome do thread que pertence ao objeto pelo qual o thread \u00E9 bloqueado na espera.
threading.thread-info.stack-trace=O rastreio da pilha do thread.
threading.thread-info.suspended=Se \u00E9 que o thread est\u00E1 suspenso.
threading.thread-info.in-native=Se \u00E9 que o thread associado est\u00E1 executando o c\u00F3digo nativo atrav\u00E9s da Interface Nativa do Java (JNI).
threading.thread-info.locked-monitors=A lista de representa\u00E7\u00F5es sem d\u00EDgito java.lang.management. Os objetos, cada qual representa um monitor de objeto bloqueado pelo thread.
threading.thread-info.locked-synchronizers=A lista de representa\u00E7\u00F5es sem d\u00EDgito java.lang.management. Os objetos LockInfo, que representam o sincronizador pr\u00F3prio bloqueado pelo thread.
buffer-pools=O recurso pai para os recursos fornecendo a interface para os pools do buffer da m\u00E1quina virtual.
buffer-pools.name=Os MBeans da plataforma BufferPoolMXBean, organizados pelo valor da propriedade 'nome' no ObjectName do MBean.
buffer-pool=A interface de gerenciamento para o pool do buffer, por exemplo um pool direto ou buffers mapeados.
buffer-pool.count=Um n\u00FAmero estimado de buffers no pool.
buffer-pool.memory-used=Uma estimativa da mem\u00F3ria que a m\u00E1quina virtual do Java est\u00E1 usando para esse pool de buffer, ou -1 caso uma estimativa do uso da mem\u00F3ria n\u00E3o estiver dispon\u00EDvel.
buffer-pool.total-capacity=Uma  estimativa da capacidade total de buffers no pool. A capacidade do buffer \u00E9 um n\u00FAmero de elementos que ele cont\u00E9m e o valor desse atributo \u00E9 uma estimativa da capacidade local de buffers no pool em bites.
buffer-pool.name=O nome representando esse pool do buffer.
logging=A interface de gerenciamento para a maior facilidade de registro em log da plataforma.
logging.logger-names=A lista dos nomes do registrador de log registrados no momento.
logging.get-logger-level=Obt\u00E9m o nome do ao n\u00EDvel do log associado com o registrador de log especificado. Caso o registrador de log especificado n\u00E3o existir, ser\u00E1 retornado "indefinido". 
logging.set-logger-level=Determina o registrador de log ao um novo n\u00EDvel. Caos o nome do n\u00EDvel n\u00E3o esteja "definido", o n\u00EDvel do registrador de log associado \u00E9 configurado para o N\u00EDvel analisado coincidente ao nome do n\u00EDvel. Caso o nome do n\u00EDvel for "indefinido", o n\u00EDvel do registrador do log \u00E9 determinado e o n\u00EDvel efetivo do registrador do log ser\u00E1 herdado pelo seu ancestral mais pr\u00F3ximo, com, um valor de n\u00EDvel (n\u00E3o-nulo) especificado.
logging.get-parent-logger-name=Retorna o nome do pai para o registrador do log. Caso o registrador do log especificado n\u00E3o existir, ser\u00E1 retornado "indefinido". Caso o registrador do log for o Registrador do log raiz no namespace, o resultado ser\u00E1 uma sequ\u00EAncia vazia.
logging.logger-name=O nome do Registrador do log.
logging.level-name=O nome do n\u00EDvel para determinar o registrador do log, ou "indefinido" caso a configurado o n\u00EDvel para heran\u00E7a do ancestral mais pr\u00F3ximo.
