platform-mbeans=Proporciona la interfaz de administraci\u00F3n para monitorear y administrar la m\u00E1quina virtual Java as\u00ED como el sistema operativo en el cual se encuentra ejecutando la m\u00E1quina virtual Java. Expone los MBeans JMX proporcionador por JDK en los dominios JMX java.lang, java.nio y java.util.logging.
platform-mbeans.type=Los MBeans de la plataforma organizados por el valor de la propiedad 'type' en el ObjectName del MBean.
object-name=Representaci\u00F3n en cadena del nombre del objeto de este objeto administrado por la plataforma.
class-loading=La interfaz de administraci\u00F3n para el sistema de carga de clases de la m\u00E1quina virtual Java
class-loading.verbose=Si la salida verbosa para el sistema de carga de clases se encuentra habilitada.
class-loading.total-loaded-class-count=El n\u00FAmero total de clases que se han cargado desde que la m\u00E1quina virtual Java ha iniciado ejecuci\u00F3n.
class-loading.loaded-class-count=El n\u00FAmero de clases que actualmente se encuentran cargadas en la m\u00E1quina virtual Java.
class-loading.unloaded-class-count=El n\u00FAmero total de clases que se han descargado desde que la m\u00E1quina virtual Java ha iniciado ejecuci\u00F3n.
compilation=La interfaz de administraci\u00F3n para el sistema de compilaci\u00F3n de la m\u00E1quina virtual Java
compilation.name=El nombre del compilador Just-in-time (JIT).
compilation.compilation-time-monitoring-supported=Si la m\u00E1quina virtual Java soporta el monitoreamiento del tiempo de compilaci\u00F3n.
compilation.total-compilation-time=El tiempo acumulado transcurrido aproximadamente (en milisegundos) que la compilaci\u00F3n tom\u00F3. Es posible que una implementaci\u00F3n de la m\u00E1quina virtual Java no soporte el monitoreamiento del tiempo de compilaci\u00F3n. Si "compilation-time-monitoring-supported" es "false" entonces el tratar de leer este atributo por medio de la operaci\u00F3n "read-attribute" fallar\u00E1 y el valor de este atributo en el resultado de una operaci\u00F3n "read-resource" ser\u00E1 "indefinido".
garbage-collectors=Recurso padre para los recursos que proporcionan la interfaz de administraci\u00F3n para los recolectores de basura de la m\u00E1quina virtual Java
garbage-collectors.name=Los MBeans de la plataforma GarbageCollectorMXBean organizados por el valor de la propiedad 'nombre' en el ObjectName del MBean.
garbage-collector=La interfaz de administraci\u00F3n para uno de los recolectores de basura en la m\u00E1quina virtual Java.
garbage-collector.name=El nombre que representa este recolector de basura.
garbage-collector.valid=Si este administrador de memoria es v\u00E1lido en la m\u00E1quina virtual Java.
garbage-collector.memory-pool-names=El nombre de los pools de memoria que este recolector de basura administra.
garbage-collector.collection-count=El n\u00FAmero total de recolecciones que han tenido lugar.
garbage-collector.collection-time=El tiempo aproximado acumulado transcurrido en milisegundos.
memory=La interfaz de administraci\u00F3n para el sistema de memoria de la m\u00E1quina virtual Java.
memory.verbose=Si la salida verbosa para el sistema de memoria se encuentra habilitado.
memory.object-pending-finalization-count=El n\u00FAmero aproximado de objetos para los cuales est\u00E1 pendiente la finalizaci\u00F3n.
memory.heap-memory-usage=El uso actual de la memoria del heap que se utiliza para asignar objetos
memory.non-heap-memory-usage=El uso actual de la memoria que no sea del heap que la maquina virtual Java utiliza
memory.gc=Ejecuta el recolector de basura.
memory.usage.init=La cantidad de memoria en bytes que la m\u00E1quina virtual Java inicialmente solicita desde el sistema operativo para la administraci\u00F3n de la memoria.
memory.usage.used=La cantidad de memoria utilizada en bytes.
memory.usage.committed=La cantidad de memoria en bytes que se compromete para el uso de la m\u00E1quina virtual Java.
memory.usage.max=La cantidad m\u00E1xima de memoria en bytes que se puede utilizar para la administraci\u00F3n de la memoria. 
memory-managers=Recurso padre para los recursos que proporcionan la interfaz de administraci\u00F3n para los administradores de memoria de la m\u00E1quina virtual Java.
memory-managers.name=Los MBeans de la plataforma MemoryManagerMXBean organizados por el valor de la propiedad 'nombre' en el ObjectName del MBean.
memory-manager=La interfaz de administraci\u00F3n para un administrador de memoria. Un administrador de memoria administra uno o m\u00E1s pools de memoria de la m\u00E1quina virtual Java.
memory-manager.name=El nombre que representa este administrador de memoria.
memory-manager.valid=Si este administrador de memoria es v\u00E1lido en la m\u00E1quina virtual Java.
memory-manager.memory-pool-names=Los nombres de los pools de memoria que este administrador de memoria administra.
memory-pools=Recurso padre para los recursos que proporcionan la interfaz de administraci\u00F3n para los pools de memoria de la m\u00E1quina virtual Java.
memory-pools.name=Los MBeans de la plataforma MemoryPoolMXBean organizados por el valor de la propiedad 'nombre' en el ObjectName del MBean.
memory-pool=La interfaz de administraci\u00F3n para un pool de memoria. Un pool de memoria representa el recurso de memoria administrada por la m\u00E1quina virtual Java y es administrada por uno o m\u00E1s administradores de memoria.
memory-pool.name=El nombre que representa este pool de memoria.
memory-pool.type=El tipo de este pool de memoria.
memory-pool.valid=Si este pool de memoria es v\u00E1lido en la m\u00E1quina virtual Java. Un pool de memoria se vuelve inv\u00E1lido una vez que la m\u00E1quina virtual Java lo borra del sistema de memoria.
memory-pool.usage=Un estimado del uso de la memoria de este pool de memoria. Puede ser "dndefinido" si el atributo "valid" es "falso".
memory-pool.peak-usage=El pico del uso de memoria de este pool de memoria desde que se inici\u00F3 la m\u00E1quina virtual Java o desde que el pico se re-inicio. Puede ser "indefinido" si el atributo "v\u00E1lido" es "falso".
memory-pool.memory-manager-names=Los nombres de los administradores de memoria que administran este pool de memoria.
memory-pool.usage-threshold=El valor del l\u00EDmite de uso de este pool de memoria en bytes. Puede que un pool de memoria no soporte un l\u00EDmite de uso. Si "usage-threshold-supported" es "false" entonces el tratar de leer este atributo por medio de la operaci\u00F3n "read-attribute" fallar\u00E1 y el valor de este atributo en el resultado de una operaci\u00F3n "read-resource" ser\u00E1 "indefinido".
memory-pool.usage-threshold-exceeded=Si el uso de memoria de este pool de memoria alcanza o excede su valor l\u00EDmite de uso. Puede que un pool de memoria no soporte un l\u00EDmite de uso. Si "usage-threshold-supported" es "false" entonces el tratar de leer este atributo por medio de la operaci\u00F3n "read-attribute" fallar\u00E1 y el valor de este atributo en el resultado de una operaci\u00F3n "read-resource" ser\u00E1 "indefinido".
memory-pool.usage-threshold-count=El n\u00FAmero de veces que el uso de memoria ha traspasado el l\u00EDmite de uso. Puede que un pool de memoria no soporte un l\u00EDmite de uso. Si "usage-threshold-supported" es "false" entonces el tratar de leer este atributo por medio de la operaci\u00F3n "read-attribute" fallar\u00E1 y el valor de este atributo en el resultado de una operaci\u00F3n "read-resource" ser\u00E1 "indefinido".
memory-pool.usage-threshold-supported=Si este pool de memoria soporta un l\u00EDmite de uso.
memory-pool.collection-usage-threshold=El valor del l\u00EDmite de uso de esta colexi\u00F3n en bytes. Puede que un pool de memoria no soporte un l\u00EDmite de uso de colecciones. Si "collection-usage-threshold-supported" es "false" entonces el tratar de leer este atributo por medio de la operaci\u00F3n "read-attribute" fallar\u00E1 y el valor de este atributo en el resultado de una operaci\u00F3n "read-resource" ser\u00E1 "indefinido".
memory-pool.collection-usage-threshold-exceeded=Si el uso de memoria de este pool de memoria despu\u00E9s de que la colecci\u00F3n m\u00E1s reciente en la cual la m\u00E1quina virtual Java ha invertido su esfuerzo ha alcanzado o excedido su valor l\u00EDmite de uso de colecciones. Puede que un pool de memoria no soporte un l\u00EDmite de uso de colecciones. Si "collection-usage-threshold-supported" es "false" entonces el tratar de leer este atributo por medio de la operaci\u00F3n "read-attribute" fallar\u00E1 y el valor de este atributo en el resultado de una operaci\u00F3n "read-resource" ser\u00E1 "indefinido".
memory-pool.collection-usage-threshold-count=El n\u00FAmero de veces que la m\u00E1quina virtual Java ha detectado que el uso de memoria ha alcanzado o ha excedido el l\u00EDmite de uso de la colecci\u00F3n. Puede que un pool de memoria no soporte un l\u00EDmite de uso de colecciones. Si "collection-usage-threshold-supported" es "false" entonces el tratar de leer este atributo por medio de la operaci\u00F3n "read-attribute" fallar\u00E1 y el valor de este atributo en el resultado de una operaci\u00F3n "read-resource" ser\u00E1 "indefinido".
memory-pool.collection-usage=El uso de memoria despu\u00E9s de que la m\u00E1quina virtual Java se esforz\u00F3 reciclando objetos no utilizados en este pool de memoria o es "undefined" si este atributo no se soporta.
memory-pool.collection-usage-threshold-supported=Si este pool de memoria soporta un l\u00EDmite de uso de colecciones.
memory-pool.reset-peak-usage=Re-establece la estad\u00EDstica de uso de memoria pico de este pool de memoria al uso actual de la memoria.
operating-system=La interfaz de administraci\u00F3n para el sistema operativo en el cual est\u00E1 ejecutando la m\u00E1quina virtual Java.
operating-system.name=El nombre del sistema operativo. Si un administrador de seguridad se instala y no permite acceso a la propiedad del sistema "os.name" entonces el tratar de leer este atributo por medio de la operaci\u00F3n "read-attribute" fallar\u00E1 y el valor de este atributo en el resultado de una operaci\u00F3n "read-resource" ser\u00E1 "indefinido".
operating-system.arch=La arquitectura del sistema operativo. Si un administrador de seguridad se instala y no permite acceso a la propiedad del sistema "os.arch" entonces el tratar de leer este atributo por medio de la operaci\u00F3n "read-attribute" fallar\u00E1 y el valor de este atributo en el resultado de una operaci\u00F3n "read-resource" ser\u00E1 "indefinido".
operating-system.version=La versi\u00F3n del sistema operativo. Si un administrador de seguridad se instala y no permite acceso a la propiedad del sistema "os.version" entonces el tratar de leer este atributo por medio de la operaci\u00F3n "read-attribute" fallar\u00E1 y el valor de este atributo en el resultado de una operaci\u00F3n "read-resource" ser\u00E1 "indefinido".
operating-system.available-processors=El n\u00FAmero de procesadores disponibles para la m\u00E1quina virtual Java.
operating-system.system-load-average=El promedio de carga del sistema para el \u00FAltimo minuto. Puede que el promedio de carga no est\u00E9 disponible en algunas plataformas; si el promedio de carga no est\u00E1 disponible entonces se retorna un valor negativo.
runtime=La interfaz de administraci\u00F3n para el sistema de tiempo de ejecuci\u00F3n de la m\u00E1quina virtual Java.
runtime.name=El nombre que representa la m\u00E1quina virtual Java en ejecuci\u00F3n.
runtime.vm-name=El nombre de la implementaci\u00F3n de la m\u00E1quina virtual Java. Si un administrador de seguridad se instala y no permite acceso a la propiedad del sistema "java.vm.name" entonces el tratar de leer este atributo por medio de la operaci\u00F3n "read-attribute" fallar\u00E1 y el valor de este atributo en el resultado de una operaci\u00F3n "read-resource" ser\u00E1 "indefinido".
runtime.vm-vendor=El vendedor de la implementaci\u00F3n de la m\u00E1quina virtual Java. Si un administrador de seguridad se instala y no permite acceso a la propiedad del sistema "java.vm.vendor" entonces el tratar de leer este atributo por medio de la operaci\u00F3n "read-attribute" fallar\u00E1 y el valor de este atributo en el resultado de una operaci\u00F3n "read-resource" ser\u00E1 "indefinido".
runtime.vm-version=La versi\u00F3n de la implementaci\u00F3n de la m\u00E1quina virtual Java. Si un administrador de seguridad se instala y no permite acceso a la propiedad del sistema "java.vm.version" entonces el tratar de leer este atributo por medio de la operaci\u00F3n "read-attribute" fallar\u00E1 y el valor de este atributo en el resultado de una operaci\u00F3n "read-resource" ser\u00E1 "indefinido".
runtime.spec-name=El nombre de la especificaci\u00F3n de la m\u00E1quina virtual Java. Si un administrador de seguridad se instala y no permite acceso a la propiedad del sistema "java.vm.specification.name" entonces el tratar de leer este atributo por medio de la operaci\u00F3n "read-attribute" fallar\u00E1 y el valor de este atributo en el resultado de una operaci\u00F3n "read-resource" ser\u00E1 "indefinido".
runtime.spec-vendor=El vendedor de la especificaci\u00F3n de la m\u00E1quina virtual Java. Si un administrador de seguridad se instala y no permite acceso a la propiedad del sistema "java.vm.specification.vendor" entonces el tratar de leer este atributo por medio de la operaci\u00F3n "read-attribute" fallar\u00E1 y el valor de este atributo en el resultado de una operaci\u00F3n "read-resource" ser\u00E1 "indefinido".
runtime.spec-version=La versi\u00F3n de la especificaci\u00F3n de la m\u00E1quina virtual Java. Si un administrador de seguridad se instala y no permite acceso a la propiedad del sistema "java.vm.specification.version" entonces el tratar de leer este atributo por medio de la operaci\u00F3n "read-attribute" fallar\u00E1 y el valor de este atributo en el resultado de una operaci\u00F3n "read-resource" ser\u00E1 "indefinido".
runtime.management-spec-version=La versi\u00F3n de la especificaci\u00F3n para la interfaz de administraci\u00F3n implementada por la m\u00E1quina virtual Java en ejecuci\u00F3n.
runtime.class-path=La ruta de clase Java que el cargador de clase del sistema utiliza para buscar archivos de clase. Si un administrador de seguridad se instala y no permite acceso a la propiedad del sistema "java.class.path" entonces el tratar de leer este atributo por medio de la operaci\u00F3n "read-attribute" fallar\u00E1 y el valor de este atributo en el resultado de una operaci\u00F3n "read-resource" ser\u00E1 "indefinido".
runtime.library-path=La ruta de la biblioteca Java. Si un administrador de seguridad se instala y no permite acceso a la propiedad del sistema "java.library.path" entonces el tratar de leer este atributo por medio de la operaci\u00F3n "read-attribute" fallar\u00E1 y el valor de este atributo en el resultado de una operaci\u00F3n "read-resource" ser\u00E1 "indefinido".
runtime.boot-class-path-supported=Si la m\u00E1quina virtual Java soporta el mecanismo de la ruta de clase de arranque que el cargador de clase bootstrap utiliza para buscar archivos de clase.
runtime.boot-class-path=La ruta de clase de arranque que el cargador de clase bootstrap utiliza para buscar archivos de clase. Si el atributo "boot-class-path-supported" es "false" o si un administrador de seguridad se instala y no tiene ManagementPermission("monitor") entonces el tratar de leer este atributo por medio de la operaci\u00F3n "read-attribute" fallar\u00E1 y el valor de este atributo en el resultado de una operaci\u00F3n "read-resource" ser\u00E1 "indefinido".
runtime.input-arguments=Los argumentos de entrada que se le pasan a la m\u00E1quina virtual Java, los cuales no incluyen los argumentos para el m\u00E9todo principal. Si un administrador de seguridad se instala y el que realiza la llamada no tiene ManagementPermission("monitor") entonces el tratar de leer este atributo por medio de la operaci\u00F3n "read-attribute" fallar\u00E1 y el valor de este atributo en el resultado de una operaci\u00F3n "read-resource" ser\u00E1 "indefinido".
runtime.uptime=El tiempo \u00FAtil de la m\u00E1quina virtual Java en milisegundos.
runtime.start-time=El tiempo de inicio de la m\u00E1quina virtual Java en milisegundos.
runtime.system-properties=Un mapa de nombres y valores de todas las propiedades del sistema. Si un administrador de seguridad se instala y su m\u00E9todo "checkPropertiesAccess" no permite acceso a las propiedades del sistema entonces el tratar de leer este atributo por medio de la operaci\u00F3n "read-attribute" fallar\u00E1 y el valor de este atributo en el resultado de una operaci\u00F3n "read-resource" ser\u00E1 "indefinido".
threading=La interfaz de administraci\u00F3n para el sistema de hilos de la m\u00E1quina virtual Java.
threading.thread-count=El n\u00FAmero de hilos vivos incluyendo los hilos demonios y los que no son demonios.
threading.peak-thread-count=El conteo de hilos vivos picos desde que la m\u00E1quina virtual Java inici\u00F3 o desde cuando se re-estableci\u00F3 el pico.
threading.total-started-thread-count=El n\u00FAmero total de hilos creados e iniciados desde que la m\u00E1quina virtual Java ha iniciado ejecuci\u00F3n.
threading.daemon-thread-count=El n\u00FAmero actual de hilos demonios vivos.
threading.all-thread-ids=Todos los ids de hilos vivos. Si un administrador de seguridad se instala y el que realiza la llamada no tiene ManagementPermission("monitor") entonces el tratar de leer este atributo por medio de la operaci\u00F3n "read-attribute" fallar\u00E1 y el valor de este atributo en el resultado de una operaci\u00F3n "read-resource" ser\u00E1 "indefinido".
threading.thread-contention-monitoring-supported=Si la m\u00E1quina virtual Java soporta el monitoreamiento de contenci\u00F3n de hilos.
threading.thread-contention-monitoring-enabled=Si el monitoreamiento de contenci\u00F3n de hilos est\u00E1 habilitada.
threading.current-thread-cpu-time=El tiempo total de la CPU para el hilo actual en nanosegundos o -1 si "thread-cpu-time-enabled" es "false". Es posible que una implementaci\u00F3n de la m\u00E1quina virtual Java no soporte la medida del tiempo de la CPU. Si "compilation-time-monitoring-supported" es "false" entonces el tratar de leer este atributo por medio de la operaci\u00F3n "read-attribute" fallar\u00E1 y el valor de este atributo en el resultado de una operaci\u00F3n "read-resource" ser\u00E1 "indefinido".
threading.current-thread-user-time=El tiempo de la CPU que el hilo actual ha ejecutado en nanosegundos o -1 si "thread-cpu-time-enabled" es "false". Es posible que una implementaci\u00F3n de la m\u00E1quina virtual Java no soporte la medida del tiempo de la CPU. Si "thread-cpu-time-supported" es "false" entonces el tratar de leer este atributo por medio de la operaci\u00F3n "read-attribute" fallar\u00E1 y el valor de este atributo en el resultado de una operaci\u00F3n "read-resource" ser\u00E1 "indefinido".
threading.thread-cpu-time-supported=Si la implementaci\u00F3n de la m\u00E1quina virtual Java soporta la medida del tiempo de CPU para cualquier hilo.
threading.current-thread-cpu-time-supported=Si la m\u00E1quina virtual Java soporta la medida del tiempo de CPU para el hilo actual.
threading.thread-cpu-time-enabled=Si la medida del tiempo CPU de hilos est\u00E1 habilitada. 
threading.object-monitor-usage-supported=Si la m\u00E1quina virtual Java soporta el monitoreamiento del uso del monitor de objetos.
threading.synchronizer-usage-supported=Si la m\u00E1quina virtual Java soporta el monitoreamiento del uso del sincronizador propietario.
threading.reset-peak-thread-count=Re-establece el conteo de hilos pico al n\u00FAmero actual de hilos vivos.
threading.find-deadlocked-threads=Encuentra los ciclos de hilos que se encuentran en un punto muerto en espera de adquirir monitores de objetos o sincronizadores propios.
threading.find-monitor-deadlocked-threads=Encuentra los ciclos de hilos que se encuentran en un punto muerto en espera de adquirir monitores de objetos.
threading.find-threads.reply=Una lista de ids de hilos de los hilos que se encuentren en puntos muertos, si hay alguno o de otra manera "undefined".
threading.get-thread-info=Retorna la informaci\u00F3n del hilo para un hilo del id especificado. El rastro de la pila, los monitores bloqueados y los sincronizadores bloqueados en el objeto de respuesta retornado estar\u00E1n vac\u00EDos.
threading.get-thread-info.reply=Representaci\u00F3n sin tipo de un objeto java.lang.management.ThreadInfo para el hilo del ID dado; es "undefined" si el hilo del ID dado no est\u00E1 vivo o no existe.
threading.get-thread-infos=Retorna la informaci\u00F3n del hilo para cada hilo cuyo ID se encuentre en la lista de entrada.
threading.get-thread-infos.reply=Una lista de representaciones sin tipo de objetos java.lang.management.ThreadInfo, cada uno de los cuales contiene informaci\u00F3n sobre un hilo cuyo ID est\u00E1 en el elemento correspondiente de la lista de entradas de IDs. Un elemento ser\u00E1 "indefinido" si el hilo del ID dado no est\u00E1 vivo o no existe.
threading.get-thread-cpu-time=Retorna el tiempo total de CPU para un hilo del id especificado en nanosegundos.
threading.get-thread-user-time=Retorna el tiempo de CPU que un hilo del id especificado ha ejecutado en modo de usuario en nanosegundos.
threading.dump-all-threads=Retorna la informaci\u00F3n del hilo para todos los hilos vivos con informaci\u00F3n de rastros de pilas y sincronizaci\u00F3n.
threading.dump-threads.reply=Una lista de representaciones sin tipo de objetos java.lang.management.ThreadInfo.
threading.id=El ID del hilo. Debe ser positivo.
threading.ids=Una lista de ids de hilos.
threading.max-depth=El n\u00FAmero m\u00E1ximo de entradas en el rastro de pila a vaciar. Integer.MAX_VALUE se puede utilizar para solicitar toda la pila que se va a vaciar.
threading.locked-monitors=Si el resultado debe incluir informaci\u00F3n sobre los monitores bloqueados.
threading.locked-synchronizers=Si el resultado debe incluir informaci\u00F3n sobre los sincronizadores propios bloqueados.
threading.stack.file-name=El nombre del archivo fuente que contiene el punto de ejecuci\u00F3n representado por este elemento de rastro de pila.
threading.stack.line-number=El n\u00FAmero de l\u00EDnea de la l\u00EDnea fuente que contiene el punto de ejecuci\u00F3n representado por este elemento de rastro de pila.
threading.stack.class-name=El nombre completamente calificado de la clase que contiene el punto de ejecuci\u00F3n representado por este elemento de rastro de pila.
threading.stack.method-name=El nombre del m\u00E9todo que contiene el punto de ejecuci\u00F3n representado por este elemento de rastro de pila.
threading.stack.native-method=Si el m\u00E9todo que contiene el punto de ejecuci\u00F3n representado por este elemento de rastro de pila es un m\u00E9todo nativo.
threading.lock.class-name=El nombre completamente calificado de la clase del objeto bloqueo.
threading.lock.identity-hash-code=El c\u00F3digo hash de identidad del objet bloqueo retornado del m\u00E9todo  System.identityHashCode(java.lang.Object).
threading.monitor.locked-stack-depth=La profundidad en el rastro de la pila en donde se bloque\u00F3 el monitor del objeto. 
threading.monitor.locked-stack-frame=El marco de trabajo de la pila que bloque\u00F3 el monitor del objeto.
threading.thread-info.thread-id=El ID del hilo. 
threading.thread-info.thread-name=El nombre del hilo. 
threading.thread-info.thread-state=El estado del hilo. 
threading.thread-info.blocked-time=El tiempo transcurrido acumulado aproximadamente (en milisegundos) que el hilo ha bloqueado para entrar o para volver a entrar a un monitor desde que el monitoreamiento de contenci\u00F3n de hilos est\u00E1 habilitado o -1 si el monitoreamiento de contenci\u00F3n de hilos no est\u00E1 habilitado. 
threading.thread-info.blocked-count=El n\u00FAmero total de veces que el hilo bloque\u00F3 para entrar o volver a entrar a un monitor.
threading.thread-info.waited-time=El tiempo transcurrido acumulado aproximadamente (en milisegundos) que el hilo ha esperado por la notificaci\u00F3n desde que se habilit\u00F3 el monitoreamiento de contenci\u00F3n de hilos. 
threading.thread-info.waited-count=El n\u00FAmero total de veces que el hilo ha esperado por la notificaci\u00F3n.
threading.thread-info.lock-info=Representaci\u00F3n sin tipo del java.lang.management.LockInfo de en objeto para el cual el hilo est\u00E1 bloqueado esperando.
threading.thread-info.lock-name=La representaci\u00F3n en cadena de un objeto para el cual el hilo est\u00E1 bloqueado esperando.
threading.thread-info.lock-owner-id=El id del hilo que es propietario del objeto para el cual el hilo est\u00E1 bloqueado esperando.
threading.thread-info.lock-owner-name=El nombre del hilo que es propietario del objeto para el cual el hilo est\u00E1 bloqueado esperando.
threading.thread-info.stack-trace=El rastro de la pila del hilo. 
threading.thread-info.suspended=Si el hilo est\u00E1 suspendido.
threading.thread-info.in-native=Si el hilo asociado est\u00E1 ejecutando c\u00F3digo nativo por medio de JNI (del ingl\u00E9s Java Native Interface).
threading.thread-info.locked-monitors=Una lista de representaciones sin tipo de objetos java.lang.management.MonitorInfo, cada uno de los cuales representa un monitor de objetos actualmente bloquedao por el hilo.
threading.thread-info.locked-synchronizers=Una lista de representaciones sin tipo de objetos java.lang.management.LockInfo, cada uno de los cuales representa un sincronizador propio actualmente bloquedao por el hilo.
buffer-pools=Recurso padre para los recursos que proporcionan la interfaz de administraci\u00F3n para los pools de buffer de la m\u00E1quina virtual Java.
buffer-pools.name=Los MBeans de la plataforma BufferPoolMXBean organizados por el valor de la propiedad 'nombre' en el ObjectName del MBean.
buffer-pool=La interfaz de administraci\u00F3n para un pool buffer, por ejemplo, un pool de buffers directos o mapeados.
buffer-pool.count=Un estimado del n\u00FAmero de buffers en el pool.
buffer-pool.memory-used=Un estimado de la memoria que la m\u00E1quina virtual Java est\u00E1 utilizando para este pool buffer en bytes o -1 si no hay disponible un estimado del uso de la memoria.
buffer-pool.total-capacity=Un estimado de la capacidad total de los buffers en este pool. La capacidad del  buffer es el n\u00FAmero de elementos que contiene y el valor de este atributo es un estimado de la capacidad total de buffers en el pool en bytes.
buffer-pool.name=El nombre que representa este pool de buffers.
logging=La interfaz de administraci\u00F3n para la funcionalidad de registro de la plataforma.
logging.logger-names=La lista de nombres del registro actualmente registrados.
logging.get-logger-level=Obtiene el nombre del nivel de registro asociado con el registro especificado. Si el registro especificado no existe entonces retorna "indefinido".
logging.set-logger-level=Establece el registro especificado al nuevo nivel especificado. Si el nombre del nivel no es "indefinido" entonces el nivel del registro especificado se establece al nivel analizado sint\u00E1cticamente que coincide con el nombre delnivel. Si el nombre del nivel es "indefinido" entonces el nivel del registro especificado se establece como nulo y el nivel efectivo del registro se hereda de su antecesor m\u00E1s cercano con un valor de nivel espec\u00EDfico (no nulo).
logging.get-parent-logger-name=Retorna el nombre del padre para el registro especificado. Si el registro especificado no existe entonces retorna "indefinido". Si el registro especificado es el registro ra\u00EDz en el espacio de nombre entonces el resultado ser\u00E1 una cadena vac\u00EDa.
logging.logger-name=El nombre de un registro.
logging.level-name=El nombre del nivel a establecer en el registro especificado o "indefinido" si establece el nivel a heredar de su ancestro m\u00E1s cercano.
