platform-mbeans=Proporciona la interfaz de administraci\u00F3n para monitorear y administrar la m\u00E1quina virtual Java as\u00ED como el sistema operativo en el cual se encuentra ejecutando la m\u00E1quina virtual Java. Expone los MBeans JMX proporcionador por JDK en los dominios JMX java.lang, java.nio y java.util.logging.
platform-mbeans.type=Los MBeans de la plataforma organizados por el valor de la propiedad 'type' en el ObjectName del MBean.
object-name=Representaci\u00F3n en cadena del nombre del objeto de este objeto administrado por la plataforma.
class-loading=La interfaz de administraci\u00F3n para el sistema de carga de clases de la m\u00E1quina virtual Java
class-loading.verbose=Si la salida verbosa para el sistema de carga de clases se encuentra habilitada.
class-loading.total-loaded-class-count=El n\u00FAmero total de clases que se han cargado desde que la m\u00E1quina virtual Java ha iniciado ejecuci\u00F3n.
class-loading.loaded-class-count=El n\u00FAmero de clases que actualmente se encuentran cargadas en la m\u00E1quina virtual Java.
class-loading.unloaded-class-count=El n\u00FAmero total de clases que se han descargado desde que la m\u00E1quina virtual Java ha iniciado ejecuci\u00F3n.
compilation=La interfaz de administraci\u00F3n para el sistema de compilaci\u00F3n de la m\u00E1quina virtual Java
compilation.name=El nombre del compilador Just-in-time (JIT).
compilation.compilation-time-monitoring-supported=Si la m\u00E1quina virtual Java soporta el monitoreamiento del tiempo de compilaci\u00F3n.
compilation.total-compilation-time=El tiempo acumulado transcurrido aproximadamente (en milisegundos) que la compilaci\u00F3n tom\u00F3. Es posible que una implementaci\u00F3n de la m\u00E1quina virtual Java no soporte el monitoreamiento del tiempo de compilaci\u00F3n. Si "compilation-time-monitoring-supported" es "false" entonces el tratar de leer este atributo por medio de la operaci\u00F3n "read-attribute" fallar\u00E1 y el valor de este atributo en el resultado de una operaci\u00F3n "read-resource" ser\u00E1 "indefinido".
garbage-collectors=Recurso padre para los recursos que proporcionan la interfaz de administraci\u00F3n para los recolectores de basura de la m\u00E1quina virtual Java
garbage-collectors.name=Los MBeans de la plataforma GarbageCollectorMXBean organizados por el valor de la propiedad 'nombre' en el ObjectName del MBean.
garbage-collector=La interfaz de administraci\u00F3n para uno de los recolectores de basura en la m\u00E1quina virtual Java.
garbage-collector.name=El nombre que representa este recolector de basura.
garbage-collector.valid=Si este administrador de memoria es v\u00E1lido en la m\u00E1quina virtual Java.
garbage-collector.memory-pool-names=El nombre de los pools de memoria que este recolector de basura administra.
garbage-collector.collection-count=El n\u00FAmero total de recolecciones que han tenido lugar.
garbage-collector.collection-time=El tiempo aproximado acumulado transcurrido en milisegundos.
memory=La interfaz de administraci\u00F3n para el sistema de memoria de la m\u00E1quina virtual Java.
memory.verbose=Si la salida verbosa para el sistema de memoria se encuentra habilitado.
memory.object-pending-finalization-count=El n\u00FAmero aproximado de objetos para los cuales est\u00E1 pendiente la finalizaci\u00F3n.
memory.heap-memory-usage=El uso actual de la memoria del heap que se utiliza para asignar objetos
memory.non-heap-memory-usage=El uso actual de la memoria que no sea del heap que la maquina virtual Java utiliza
memory.gc=Ejecuta el recolector de basura.
memory.usage.init=La cantidad de memoria en bytes que la m\u00E1quina virtual Java inicialmente solicita desde el sistema operativo para la administraci\u00F3n de la memoria.
memory.usage.used=La cantidad de memoria utilizada en bytes.
memory.usage.committed=La cantidad de memoria en bytes que se compromete para el uso de la m\u00E1quina virtual Java.
memory.usage.max=La cantidad m\u00E1xima de memoria en bytes que se puede utilizar para la administraci\u00F3n de la memoria. 
memory-managers=Recurso padre para los recursos que proporcionan la interfaz de administraci\u00F3n para los administradores de memoria de la m\u00E1quina virtual Java.
memory-managers.name=Los MBeans de la plataforma MemoryManagerMXBean organizados por el valor de la propiedad 'nombre' en el ObjectName del MBean.
memory-manager=La interfaz de administraci\u00F3n para un administrador de memoria. Un administrador de memoria administra uno o m\u00E1s pools de memoria de la m\u00E1quina virtual Java.
memory-manager.name=El nombre que representa este administrador de memoria.
memory-manager.valid=Si este administrador de memoria es v\u00E1lido en la m\u00E1quina virtual Java.
memory-manager.memory-pool-names=Los nombres de los pools de memoria que este administrador de memoria administra.
memory-pools=Recurso padre para los recursos que proporcionan la interfaz de administraci\u00F3n para los pools de memoria de la m\u00E1quina virtual Java.
memory-pools.name=Los MBeans de la plataforma MemoryPoolMXBean organizados por el valor de la propiedad 'nombre' en el ObjectName del MBean.
memory-pool=La interfaz de administraci\u00F3n para un pool de memoria. Un pool de memoria representa el recurso de memoria administrada por la m\u00E1quina virtual Java y es administrada por uno o m\u00E1s administradores de memoria.
memory-pool.name=El nombre que representa este pool de memoria.
memory-pool.type=El tipo de este pool de memoria.
memory-pool.valid=Si este pool de memoria es v\u00E1lido en la m\u00E1quina virtual Java. Un pool de memoria se vuelve inv\u00E1lido una vez que la m\u00E1quina virtual Java lo borra del sistema de memoria.
memory-pool.usage=Un estimado del uso de la memoria de este pool de memoria. Puede ser "dndefinido" si el atributo "valid" es "falso".
memory-pool.memory-manager-names=Los nombres de los administradores de memoria que administran este pool de memoria.
memory-pool.usage-threshold-supported=Si este pool de memoria soporta un l\u00EDmite de uso.
memory-pool.collection-usage-threshold-supported=Si este pool de memoria soporta un l\u00EDmite de uso de colecciones.
operating-system=La interfaz de administraci\u00F3n para el sistema operativo en el cual est\u00E1 ejecutando la m\u00E1quina virtual Java.
operating-system.available-processors=El n\u00FAmero de procesadores disponibles para la m\u00E1quina virtual Java.
runtime=La interfaz de administraci\u00F3n para el sistema de tiempo de ejecuci\u00F3n de la m\u00E1quina virtual Java.
runtime.name=El nombre que representa la m\u00E1quina virtual Java en ejecuci\u00F3n.
