platform-mbeans=Java \u4EEE\u60F3\u30DE\u30B7\u30F3\u307E\u305F\u306F Java \u4EEE\u60F3\u30DE\u30B7\u30F3\u304C\u7A3C\u52D5\u3057\u3066\u3044\u308B\u30AA\u30DA\u30EC\u30FC\u30C6\u30A3\u30F3\u30B0\u30B7\u30B9\u30C6\u30E0\u3092\u76E3\u8996\u3001\u7BA1\u7406\u3059\u308B\u305F\u3081\u306B\u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u3092\u63D0\u4F9B\u3057\u307E\u3059\u3002java.lang\u3001java.nio\u3001java.util.logging \u306E JMX \u30C9\u30E1\u30A4\u30F3\u3067 JDK \u63D0\u4F9B\u306E JMX MBean \u3092\u516C\u958B\u3057\u307E\u3059\u3002
platform-mbeans.type=MBean \u306E ObjectName \u3067 'type' \u30D7\u30ED\u30D1\u30C6\u30A3\u306E\u5024\u3067\u6574\u7406\u3055\u308C\u305F\u30D7\u30E9\u30C3\u30C8\u30D5\u30A9\u30FC\u30E0\u306E MBean 
class-loading=Java \u4EEE\u60F3\u30DE\u30B7\u30F3\u306E\u30AF\u30E9\u30B9\u30ED\u30FC\u30C7\u30A3\u30F3\u30B0\u30B7\u30B9\u30C6\u30E0\u306B\u5BFE\u3059\u308B\u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9
class-loading.verbose=\u30AF\u30E9\u30B9\u30ED\u30FC\u30C7\u30A3\u30F3\u30B0\u30B7\u30B9\u30C6\u30E0\u306E\u8A73\u7D30\u51FA\u529B\u3092\u6709\u52B9\u306B\u3059\u308B\u304B\u3069\u3046\u304B
class-loading.total-loaded-class-count=Java \u4EEE\u60F3\u30DE\u30B7\u30F3\u304C\u5B9F\u884C\u3092\u958B\u59CB\u3057\u3066\u304B\u3089\u30ED\u30FC\u30C9\u3055\u308C\u305F\u30AF\u30E9\u30B9\u306E\u5408\u8A08\u6570
class-loading.loaded-class-count=Java \u4EEE\u60F3\u30DE\u30B7\u30F3\u3067\u73FE\u5728\u30ED\u30FC\u30C9\u3055\u308C\u3066\u3044\u308B\u30AF\u30E9\u30B9\u6570
class-loading.unloaded-class-count=Java \u4EEE\u60F3\u30DE\u30B7\u30F3\u304C\u5B9F\u884C\u3092\u958B\u59CB\u3057\u3066\u304B\u3089\u30A2\u30F3\u30ED\u30FC\u30C9\u3055\u308C\u305F\u30AF\u30E9\u30B9\u306E\u5408\u8A08\u6570
compilation=Java \u4EEE\u60F3\u30DE\u30B7\u30F3\u306E\u30B3\u30F3\u30D1\u30A4\u30EB\u30B7\u30B9\u30C6\u30E0\u5411\u3051\u306E\u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9
compilation.name=Just-in-time (JIT) \u30B3\u30F3\u30D1\u30A4\u30E9\u30FC\u540D
compilation.compilation-time-monitoring-supported=Java \u4EEE\u60F3\u30DE\u30B7\u30F3\u304C\u30B3\u30F3\u30D1\u30A4\u30EB\u6642\u9593\u306E\u76E3\u8996\u306B\u5BFE\u5FDC\u3059\u308B\u304B\u3069\u3046\u304B
compilation.total-compilation-time=\u30B3\u30F3\u30D1\u30A4\u30EB\u306B\u8CBB\u3084\u3057\u305F\u7D2F\u7A4D\u7D4C\u904E\u6642\u9593 (\u30DF\u30EA\u79D2)\u3002Java \u4EEE\u60F3\u6642\u9593\u5B9F\u88C5\u306F\u30B3\u30F3\u30D1\u30A4\u30EB\u6642\u9593\u306E\u76E3\u8996\u306B\u306F\u5BFE\u5FDC\u3057\u306A\u3044\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002"complicaton-time-monitoring-supported" \u304C "false" \u306E\u5834\u5408\u3001"read-attribute" \u6F14\u7B97\u7D4C\u7531\u3067\u3053\u306E\u5C5E\u6027\u3092\u8AAD\u307F\u8FBC\u3082\u3046\u3068\u3057\u5931\u6557\u3057\u3001"read-resource" \u6F14\u7B97\u306E\u7D50\u679C\u306B\u3042\u308B\u3053\u306E\u5C5E\u6027\u5024\u306F "undefined" \u3068\u306A\u308A\u307E\u3059\u3002
garbage-collectors=Java \u4EEE\u60F3\u30DE\u30B7\u30F3\u306E\u30AC\u30FC\u30D9\u30C3\u30B8\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u3092\u884C\u3046\u969B\u306B\u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u3092\u63D0\u4F9B\u3059\u308B\u30EA\u30BD\u30FC\u30B9\u306E\u89AA\u30EA\u30BD\u30FC\u30B9
garbage-collectors.name=MBean ObjectName \u306E 'name' \u30D7\u30ED\u30D1\u30C6\u30A3\u306E\u5024\u3067\u6574\u7406\u3055\u308C\u305FGarbageCollectorMXBean \u30D7\u30E9\u30C3\u30C8\u30D5\u30A9\u30FC\u30E0\u306E MBean\u3002
garbage-collector=Java \u4EEE\u60F3\u30DE\u30B7\u30F3\u306E\u30AC\u30FC\u30D9\u30C3\u30B8\u30B3\u30EC\u30AF\u30BF\u30FC\u306E1\u3064\u306B\u5BFE\u3059\u308B\u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9
garbage-collector.name=\u3053\u306E\u30AC\u30FC\u30D9\u30C3\u30B8\u30B3\u30EC\u30AF\u30BF\u30FC\u3092\u793A\u3059\u540D\u524D
garbage-collector.valid=\u3053\u306E\u30E1\u30E2\u30EA\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u304C Java \u4EEE\u60F3\u30DE\u30B7\u30F3\u3067\u6709\u52B9\u304B\u3069\u3046\u304B
garbage-collector.memory-pool-names=\u3053\u306E\u30AC\u30FC\u30D9\u30C3\u30B8\u30B3\u30EC\u30AF\u30BF\u30FC\u304C\u7BA1\u7406\u3059\u308B\u30E1\u30E2\u30EA\u30D7\u30FC\u30EB\u306E\u540D\u524D
garbage-collector.collection-count=\u767A\u751F\u3057\u305F\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u306E\u5408\u8A08\u6570
garbage-collector.collection-time=\u7D2F\u7A4D\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u306E\u7D4C\u904E\u6642\u9593 (\u30DF\u30EA\u79D2)
memory=Java \u4EEE\u60F3\u30DE\u30B7\u30F3\u306E\u30E1\u30E2\u30EA\u30B7\u30B9\u30C6\u30E0\u5411\u3051\u306E\u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9
memory.verbose=\u30E1\u30E2\u30EA\u30B7\u30B9\u30C6\u30E0\u306E\u8A73\u7D30\u51FA\u529B\u3092\u6709\u52B9\u306B\u3059\u308B\u304B\u3069\u3046\u304B
memory.object-pending-finalization-count=\u6700\u7D42\u6C7A\u5B9A\u5F85\u3061\u306E\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306E\u6570
memory.heap-memory-usage=\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306E\u5272\u308A\u5F53\u3066\u306B\u5229\u7528\u3059\u308B\u30D2\u30FC\u30D7\u306E\u73FE\u5728\u306E\u30E1\u30E2\u30EA\u4F7F\u7528\u91CF
memory.non-heap-memory-usage=Java \u4EEE\u60F3\u30DE\u30B7\u30F3\u304C\u5229\u7528\u3059\u308B\u30D2\u30FC\u30D7\u4EE5\u5916\u306E\u30E1\u30E2\u30EA\u306E\u73FE\u5728\u306E\u4F7F\u7528\u91CF
memory.gc=\u30AC\u30FC\u30D9\u30C3\u30B8\u30B3\u30EC\u30AF\u30BF\u30FC\u3092\u5B9F\u884C
memory.usage.init=Java \u4EEE\u60F3\u30DE\u30B7\u30F3\u304C\u30E1\u30E2\u30EA\u7BA1\u7406\u7528\u306B\u30AA\u30DA\u30EC\u30FC\u30C6\u30A3\u30F3\u30B0\u30B7\u30B9\u30C6\u30E0\u304B\u3089\u30EA\u30AF\u30A8\u30B9\u30C8\u3059\u308B\u30E1\u30E2\u30EA\u91CF (\u30D0\u30A4\u30C8)
memory.usage.used=\u4F7F\u7528\u3057\u3066\u3044\u308B\u30E1\u30E2\u30EA\u91CF (\u30D0\u30A4\u30C8)
memory.usage.committed=Java \u4EEE\u60F3\u30DE\u30B7\u30F3\u304C\u5229\u7528\u3067\u304D\u308B\u3088\u3046\u30B3\u30DF\u30C3\u30C8\u3055\u308C\u3066\u3044\u308B\u30E1\u30E2\u30EA\u91CF (\u30D0\u30A4\u30C8)
memory.usage.max=\u30E1\u30E2\u30EA\u7BA1\u7406\u306B\u5229\u7528\u53EF\u80FD\u306A\u30E1\u30E2\u30EA\u6700\u5927\u91CF (\u30D0\u30A4\u30C8)
memory-managers=Java \u4EEE\u60F3\u30DE\u30B7\u30F3\u306E\u30E1\u30E2\u30EA\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u7528\u306B\u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u3092\u63D0\u4F9B\u3059\u308B\u30EA\u30BD\u30FC\u30B9\u306E\u89AA\u30EA\u30BD\u30FC\u30B9
memory-managers.name=MBean ObjectName \u306E 'name' \u30D7\u30ED\u30D1\u30C6\u30A3\u306E\u5024\u3067\u6574\u7406\u3055\u308C\u305FMemoryManagerMXBean \u30D7\u30E9\u30C3\u30C8\u30D5\u30A9\u30FC\u30E0\u306E MBean\u3002
memory-manager=\u30E1\u30E2\u30EA\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u306E\u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u3002\u30E1\u30E2\u30EA\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u306F\u3001Java \u4EEE\u60F3\u30DE\u30B7\u30F3\u306E\u30E1\u30E2\u30EA\u30D7\u30FC\u30EB\u30921\u3064\u4EE5\u4E0A\u7BA1\u7406\u3057\u307E\u3059\u3002
memory-manager.name=\u3053\u306E\u30E1\u30E2\u30EA\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u3092\u793A\u3059\u540D\u524D
memory-manager.valid=\u3053\u306E\u30E1\u30E2\u30EA\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u304C Java \u4EEE\u60F3\u30DE\u30B7\u30F3\u3067\u6709\u52B9\u304B\u3069\u3046\u304B
memory-manager.memory-pool-names=\u3053\u306E\u30E1\u30E2\u30EA\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u304C\u7BA1\u7406\u3059\u308B\u30E1\u30E2\u30EA\u30D7\u30FC\u30EB\u306E\u540D\u524D
memory-pools=Java \u4EEE\u60F3\u30DE\u30B7\u30F3\u306E\u30E1\u30E2\u30EA\u30D7\u30FC\u30EB\u7528\u306B\u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u3092\u63D0\u4F9B\u3059\u308B\u30EA\u30BD\u30FC\u30B9\u306E\u89AA\u30EA\u30BD\u30FC\u30B9
memory-pools.name=MBean ObjectName \u306E 'name' \u30D7\u30ED\u30D1\u30C6\u30A3\u306E\u5024\u3067\u6574\u7406\u3055\u308C\u305FMemoryPoolMXBean \u30D7\u30E9\u30C3\u30C8\u30D5\u30A9\u30FC\u30E0\u306E MBean\u3002
memory-pool=\u30E1\u30E2\u30EA\u30D7\u30FC\u30EB\u306E\u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u3002\u30E1\u30E2\u30EA\u30D7\u30FC\u30EB\u306F\u3001Java \u4EEE\u60F3\u30DE\u30B7\u30F3\u304C\u7BA1\u7406\u3059\u308B\u30E1\u30E2\u30EA\u30EA\u30BD\u30FC\u30B9\u3092\u8868\u3057\u3001\u30E1\u30E2\u30EA\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC 1 \u3064\u4EE5\u4E0A\u3092\u7BA1\u7406\u3057\u307E\u3059\u3002
memory-pool.name=\u3053\u306E\u30E1\u30E2\u30EA\u30D7\u30FC\u30EB\u3092\u793A\u3059\u540D\u524D
memory-pool.type=\u3053\u306E\u30E1\u30E2\u30EA\u30D7\u30FC\u30EB\u306E\u578B
memory-pool.valid=\u3053\u306E\u30E1\u30E2\u30EA\u30D7\u30FC\u30EB\u304C Java \u4EEE\u60F3\u30DE\u30B7\u30F3\u3067\u6709\u52B9\u304B\u3069\u3046\u304B\u3002Java \u4EEE\u60F3\u30DE\u30B7\u30F3\u304C\u30E1\u30E2\u30EA\u30B7\u30B9\u30C6\u30E0\u304B\u3089\u524A\u9664\u3059\u308B\u3068\u3001\u30E1\u30E2\u30EA\u30D7\u30FC\u30EB\u306F\u7121\u52B9\u306B\u306A\u308A\u307E\u3059\u3002
memory-pool.usage=\u3053\u306E\u30E1\u30E2\u30EA\u30D7\u30FC\u30EB\u306E\u63A8\u5B9A\u30E1\u30E2\u30EA\u4F7F\u7528\u91CF\u3002\u5C5E\u6027 "valid" \u304C "false" \u306E\u5834\u5408\u3001"undefined" \u306B\u306A\u308B\u5834\u5408\u304C\u3042\u308A\u307E\u3059\u3002
memory-pool.peak-usage=Java \u4EEE\u60F3\u30DE\u30B7\u30F3\u304C\u8D77\u52D5\u3057\u3066\u304B\u3089\u3001\u3042\u308B\u3044\u306F\u30D4\u30FC\u30AF\u304C\u30EA\u30BB\u30C3\u30C8\u3055\u308C\u3066\u304B\u3089\u3001\u3053\u306E\u30E1\u30E2\u30EA\u30D7\u30FC\u30EB\u306E\u30E1\u30E2\u30EA\u4F7F\u7528\u91CF\u304C\u30D4\u30FC\u30AF\u306B\u9054\u3057\u305F\u3068\u304D\u306E\u91CF\u3002\u5C5E\u6027 "valid" \u304C "false" \u306E\u5834\u5408\u3001"undefined" \u306B\u306A\u308B\u5834\u5408\u304C\u3042\u308A\u307E\u3059\u3002
memory-pool.memory-manager-names=\u3053\u306E\u30E1\u30E2\u30EA\u30D7\u30FC\u30EB\u3092\u7BA1\u7406\u3059\u308B\u30E1\u30E2\u30EA\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u540D
memory-pool.usage-threshold=\u3053\u306E\u30E1\u30E2\u30EA\u30D7\u30FC\u30EB\u306E\u5229\u7528\u95BE\u5024 (\u30D0\u30A4\u30C8)\u3002\u30E1\u30E2\u30EA\u30D7\u30FC\u30EB\u306F\u4F7F\u7528\u91CF\u306E\u95BE\u5024\u306B\u5BFE\u5FDC\u3057\u3066\u3044\u306A\u3044\u5834\u5408\u304C\u3042\u308A\u307E\u3059\u3002"usage-threshold-supported" \u304C "false" \u306E\u5834\u5408\u3001"read-attribute" \u6F14\u7B97\u7D4C\u7531\u3067\u3053\u306E\u5C5E\u6027\u3092\u8AAD\u307F\u8FBC\u3082\u3046\u3068\u3057\u5931\u6557\u3057\u3001"read-resource" \u6F14\u7B97\u306E\u7D50\u679C\u306B\u3042\u308B\u3053\u306E\u5C5E\u6027\u5024\u306F "undefined" \u3068\u306A\u308A\u307E\u3059\u3002
memory-pool.usage-threshold-exceeded=\u3053\u306E\u30E1\u30E2\u30EA\u30D7\u30FC\u30EB\u306E\u306E\u30E1\u30E2\u30EA\u4F7F\u7528\u91CF\u304C\u5229\u7528\u95BE\u5024\u306B\u5230\u9054\u3057\u3066\u3044\u308B\u306E\u304B\u3001\u8D85\u3048\u3066\u3044\u308B\u306E\u304B \u3002\u30E1\u30E2\u30EA\u30D7\u30FC\u30EB\u306F\u4F7F\u7528\u91CF\u306E\u95BE\u5024\u306B\u5BFE\u5FDC\u3057\u3066\u3044\u306A\u3044\u5834\u5408\u304C\u3042\u308A\u307E\u3059\u3002"usage-threshold-supported" \u304C "false" \u306E\u5834\u5408\u3001"read-attribute" \u6F14\u7B97\u7D4C\u7531\u3067\u3053\u306E\u5C5E\u6027\u3092\u8AAD\u307F\u8FBC\u3082\u3046\u3068\u3057\u5931\u6557\u3057\u3001"read-resource" \u6F14\u7B97\u306E\u7D50\u679C\u306B\u3042\u308B\u3053\u306E\u5C5E\u6027\u5024\u306F "undefined" \u3068\u306A\u308A\u307E\u3059\u3002
memory-pool.usage-threshold-count=\u30E1\u30E2\u30EA\u4F7F\u7528\u91CF\u304C\u5229\u7528\u95BE\u5024\u3092\u8D8A\u3048\u305F\u56DE\u6570\u3002\u30E1\u30E2\u30EA\u30D7\u30FC\u30EB\u306F\u4F7F\u7528\u91CF\u306E\u95BE\u5024\u306B\u5BFE\u5FDC\u3057\u3066\u3044\u306A\u3044\u5834\u5408\u304C\u3042\u308A\u307E\u3059\u3002"usage-threshold-supported" \u304C "false" \u306E\u5834\u5408\u3001"read-attribute" \u6F14\u7B97\u7D4C\u7531\u3067\u3053\u306E\u5C5E\u6027\u3092\u8AAD\u307F\u8FBC\u3082\u3046\u3068\u3057\u5931\u6557\u3057\u3001"read-resource" \u6F14\u7B97\u306E\u7D50\u679C\u306B\u3042\u308B\u3053\u306E\u5C5E\u6027\u5024\u306F "undefined" \u3068\u306A\u308A\u307E\u3059\u3002
memory-pool.usage-threshold-supported=\u3053\u306E\u30E1\u30E2\u30EA\u30D7\u30FC\u30EB\u304C\u5229\u7528\u95BE\u5024\u306B\u5BFE\u5FDC\u3057\u3066\u3044\u308B\u304B\u3069\u3046\u304B
memory-pool.collection-usage-threshold=\u3053\u306E\u30E1\u30E2\u30EA\u30D7\u30FC\u30EB\u306E\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u5229\u7528\u95BE\u5024 (\u30D0\u30A4\u30C8)\u3002\u30E1\u30E2\u30EA\u30D7\u30FC\u30EB\u306F\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u4F7F\u7528\u91CF\u306E\u95BE\u5024\u306B\u5BFE\u5FDC\u3057\u3066\u3044\u306A\u3044\u5834\u5408\u304C\u3042\u308A\u307E\u3059\u3002"collection-usage-threshold-supported" \u304C "false" \u306E\u5834\u5408\u3001"read-attribute" \u6F14\u7B97\u7D4C\u7531\u3067\u3053\u306E\u5C5E\u6027\u3092\u8AAD\u307F\u8FBC\u3082\u3046\u3068\u3057\u5931\u6557\u3057\u3001"read-resource" \u6F14\u7B97\u306E\u7D50\u679C\u306B\u3042\u308B\u3053\u306E\u5C5E\u6027\u5024\u306F "undefined" \u3068\u306A\u308A\u307E\u3059\u3002
memory-pool.collection-usage-threshold-exceeded=Java \u4EEE\u60F3\u30DE\u30B7\u30F3\u304C\u30E1\u30E2\u30EA\u3092\u6D88\u8CBB\u3057\u305F\u6700\u8FD1\u306E\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u306E\u5F8C\u306B\u3001\u3053\u306E\u30E1\u30E2\u30EA\u30D7\u30FC\u30EB\u306E\u30E1\u30E2\u30EA\u4F7F\u7528\u91CF\u304C\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u306E\u5229\u7528\u95BE\u5024\u306B\u5230\u9054\u3057\u3066\u3044\u308B\u306E\u304B\u3001\u8D85\u3048\u3066\u3044\u308B\u306E\u304B\u3002 \u30E1\u30E2\u30EA\u30D7\u30FC\u30EB\u306F\u4F7F\u7528\u91CF\u306E\u95BE\u5024\u306B\u5BFE\u5FDC\u3057\u3066\u3044\u306A\u3044\u5834\u5408\u304C\u3042\u308A\u307E\u3059\u3002"collection-usage-threshold-supported" \u304C "false" \u306E\u5834\u5408\u3001"read-attribute" \u6F14\u7B97\u7D4C\u7531\u3067\u3053\u306E\u5C5E\u6027\u3092\u8AAD\u307F\u8FBC\u3082\u3046\u3068\u3057\u5931\u6557\u3057\u3001"read-resource" \u6F14\u7B97\u306E\u7D50\u679C\u306B\u3042\u308B\u3053\u306E\u5C5E\u6027\u5024\u306F "undefined" \u3068\u306A\u308A\u307E\u3059\u3002
memory-pool.collection-usage-threshold-count=Java \u4EEE\u60F3\u30DE\u30B7\u30F3\u306B\u3088\u3063\u3066\u3001\u30E1\u30E2\u30EA\u4F7F\u7528\u91CF\u304C\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u306E\u5229\u7528\u95BE\u5024\u306B\u5230\u9054\u3057\u305F\u304B\u3001\u8D85\u904E\u3057\u305F\u3053\u3068\u304C\u691C\u51FA\u3055\u308C\u305F\u56DE\u6570\u3002\u30E1\u30E2\u30EA\u30D7\u30FC\u30EB\u306F\u4F7F\u7528\u91CF\u306E\u95BE\u5024\u306B\u5BFE\u5FDC\u3057\u3066\u3044\u306A\u3044\u5834\u5408\u304C\u3042\u308A\u307E\u3059\u3002"collection-usage-threshold-supported" \u304C "false" \u306E\u5834\u5408\u3001"read-attribute" \u6F14\u7B97\u7D4C\u7531\u3067\u3053\u306E\u5C5E\u6027\u3092\u8AAD\u307F\u8FBC\u3082\u3046\u3068\u3057\u5931\u6557\u3057\u3001"read-resource" \u6F14\u7B97\u306E\u7D50\u679C\u306B\u3042\u308B\u3053\u306E\u5C5E\u6027\u5024\u306F "undefined" \u3068\u306A\u308A\u307E\u3059\u3002
memory-pool.collection-usage=Java \u4EEE\u60F3\u30DE\u30B7\u30F3\u304C\u3053\u306E\u30E1\u30E2\u30EA\u30D7\u30FC\u30EB\u5185\u306E\u672A\u4F7F\u7528\u306E\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u3092\u518D\u5229\u7528\u3057\u3088\u3046\u3068\u30E1\u30E2\u30EA\u3092\u6D88\u8CBB\u3057\u305F\u5F8C\u306E\u30E1\u30E2\u30EA\u4F7F\u7528\u91CF\u3001\u3042\u308B\u3044\u306F\u3053\u306E\u5C5E\u6027\u306B\u5BFE\u5FDC\u3057\u3066\u3044\u306A\u3044\u5834\u5408\u306F "undefined" \u3068\u306A\u308A\u307E\u3059\u3002
memory-pool.collection-usage-threshold-supported=\u3053\u306E\u30E1\u30E2\u30EA\u30D7\u30FC\u30EB\u304C\u30B3\u30EC\u30AF\u30B7\u30E7\u30F3\u306E\u5229\u7528\u95BE\u5024\u306B\u5BFE\u5FDC\u3057\u3066\u3044\u308B\u304B
memory-pool.reset-peak-usage=\u3053\u306E\u30E1\u30E2\u30EA\u30D7\u30FC\u30EB\u306E\u30D4\u30FC\u30AF\u6642\u306E\u30E1\u30E2\u30EA\u4F7F\u7528\u91CF\u7D71\u8A08\u3092\u73FE\u5728\u306E\u30E1\u30E2\u30EA\u4F7F\u7528\u91CF\u306B\u30EA\u30BB\u30C3\u30C8\u3057\u307E\u3059\u3002
operating-system=Java \u4EEE\u60F3\u30DE\u30B7\u30F3\u304C\u5B9F\u884C\u4E2D\u306E\u30AA\u30DA\u30EC\u30FC\u30C6\u30A3\u30F3\u30B0\u30B7\u30B9\u30C6\u30E0\u5411\u3051\u306E\u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9
operating-system.name=\u30AA\u30DA\u30EC\u30FC\u30C6\u30A3\u30F3\u30B0\u30B7\u30B9\u30C6\u30E0\u540D\u3002\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u304C\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u3055\u308C\u3066\u304A\u308A\u3001\u30B7\u30B9\u30C6\u30E0\u30D7\u30ED\u30D1\u30C6\u30A3 "os.name" \u306B\u30A2\u30AF\u30BB\u30B9\u3067\u304D\u306A\u3044\u5834\u5408\u3001\u3053\u306E\u5C5E\u6027\u3092\u8AAD\u307F\u8FBC\u3080 "read-attribute" \u6F14\u7B97\u304C\u5931\u6557\u3057\u3001"read-resource" \u6F14\u7B97\u306E\u7D50\u679C\u306B\u3042\u308B\u3053\u306E\u5C5E\u6027\u5024\u306F "undefined" \u3068\u306A\u308A\u307E\u3059\u3002
operating-system.arch=\u30AA\u30DA\u30EC\u30FC\u30C6\u30A3\u30F3\u30B0\u30B7\u30B9\u30C6\u30E0\u306E\u30A2\u30FC\u30AD\u30C6\u30AF\u30C1\u30E3\u30FC\u3002\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u304C\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u3055\u308C\u3066\u304A\u308A\u3001\u30B7\u30B9\u30C6\u30E0\u30D7\u30ED\u30D1\u30C6\u30A3 "os.arch" \u306B\u30A2\u30AF\u30BB\u30B9\u3067\u304D\u306A\u3044\u5834\u5408\u3001\u3053\u306E\u5C5E\u6027\u3092\u8AAD\u307F\u8FBC\u3080 "read-attribute" \u6F14\u7B97\u304C\u5931\u6557\u3057\u3001"read-resource" \u6F14\u7B97\u306E\u7D50\u679C\u306B\u3042\u308B\u3053\u306E\u5C5E\u6027\u5024\u306F "undefined" \u3068\u306A\u308A\u307E\u3059\u3002
operating-system.version=\u30AA\u30DA\u30EC\u30FC\u30C6\u30A3\u30F3\u30B0\u30B7\u30B9\u30C6\u30E0\u306E\u30D0\u30FC\u30B8\u30E7\u30F3\u3002\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u304C\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u3055\u308C\u3066\u304A\u308A\u3001\u30B7\u30B9\u30C6\u30E0\u30D7\u30ED\u30D1\u30C6\u30A3 "os.version" \u306B\u30A2\u30AF\u30BB\u30B9\u3067\u304D\u306A\u3044\u5834\u5408\u3001\u3053\u306E\u5C5E\u6027\u3092\u8AAD\u307F\u8FBC\u3080 "read-attribute" \u6F14\u7B97\u304C\u5931\u6557\u3057\u3001"read-resource" \u6F14\u7B97\u306E\u7D50\u679C\u306B\u3042\u308B\u3053\u306E\u5C5E\u6027\u5024\u306F "undefined" \u3068\u306A\u308A\u307E\u3059\u3002
operating-system.available-processors=Java \u4EEE\u60F3\u30DE\u30B7\u30F3\u3067\u5229\u7528\u53EF\u80FD\u306A\u30D7\u30ED\u30BB\u30C3\u30B5\u30FC\u6570
operating-system.system-load-average=\u6700\u5F8C\u306E\u4E00\u5206\u306E\u30B7\u30B9\u30C6\u30E0\u30ED\u30FC\u30C9\u5E73\u5747\u3002\u30D7\u30E9\u30C3\u30C8\u30D5\u30A9\u30FC\u30E0\u306B\u3088\u3063\u3066\u306F\u30ED\u30FC\u30C9\u5E73\u5747\u304C\u5165\u624B\u3067\u304D\u306A\u3044\u5834\u5408\u3082\u3042\u308A\u307E\u3059\u3002\u30ED\u30FC\u30C9\u5E73\u5747\u304C\u5165\u624B\u3067\u304D\u306A\u3044\u5834\u5408\u306F\u3001\u8CA0\u306E\u5024\u304C\u8FD4\u3055\u308C\u307E\u3059\u3002
runtime=Java \u4EEE\u60F3\u30DE\u30B7\u30F3\u306E\u30E9\u30F3\u30BF\u30A4\u30E0\u30B7\u30B9\u30C6\u30E0\u5411\u3051\u306E\u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9
runtime.name=\u5B9F\u884C\u4E2D\u306E Java \u4EEE\u60F3\u30DE\u30B7\u30F3\u3092\u793A\u3059\u540D\u524D
runtime.vm-name=Java \u4EEE\u60F3\u30DE\u30B7\u30F3\u5B9F\u88C5\u540D\u3002\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u304C\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u3055\u308C\u3066\u304A\u308A\u3001\u30B7\u30B9\u30C6\u30E0\u30D7\u30ED\u30D1\u30C6\u30A3 "java.vm.name" \u306B\u30A2\u30AF\u30BB\u30B9\u3067\u304D\u306A\u3044\u5834\u5408\u3001\u3053\u306E\u5C5E\u6027\u3092\u8AAD\u307F\u8FBC\u3080 "read-attribute" \u6F14\u7B97\u304C\u5931\u6557\u3057\u3001"read-resource" \u6F14\u7B97\u306E\u7D50\u679C\u306B\u3042\u308B\u3053\u306E\u5C5E\u6027\u5024\u306F "undefined" \u3068\u306A\u308A\u307E\u3059\u3002
runtime.vm-vendor=Java \u4EEE\u60F3\u30DE\u30B7\u30F3\u5B9F\u88C5\u30D9\u30F3\u30C0\u30FC\u3002\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u304C\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u3055\u308C\u3066\u304A\u308A\u3001\u30B7\u30B9\u30C6\u30E0\u30D7\u30ED\u30D1\u30C6\u30A3 "java.vm.vendor" \u306B\u30A2\u30AF\u30BB\u30B9\u3067\u304D\u306A\u3044\u5834\u5408\u3001\u3053\u306E\u5C5E\u6027\u3092\u8AAD\u307F\u8FBC\u3080 "read-attribute" \u6F14\u7B97\u304C\u5931\u6557\u3057\u3001"read-resource" \u6F14\u7B97\u306E\u7D50\u679C\u306B\u3042\u308B\u3053\u306E\u5C5E\u6027\u5024\u306F "undefined" \u3068\u306A\u308A\u307E\u3059\u3002
runtime.vm-version=Java \u4EEE\u60F3\u30DE\u30B7\u30F3\u5B9F\u88C5\u30D0\u30FC\u30B8\u30E7\u30F3\u3002\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u304C\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u3055\u308C\u3066\u304A\u308A\u3001\u30B7\u30B9\u30C6\u30E0\u30D7\u30ED\u30D1\u30C6\u30A3 "java.vm.version" \u306B\u30A2\u30AF\u30BB\u30B9\u3067\u304D\u306A\u3044\u5834\u5408\u3001\u3053\u306E\u5C5E\u6027\u3092\u8AAD\u307F\u8FBC\u3080 "read-attribute" \u6F14\u7B97\u304C\u5931\u6557\u3057\u3001"read-resource" \u6F14\u7B97\u306E\u7D50\u679C\u306B\u3042\u308B\u3053\u306E\u5C5E\u6027\u5024\u306F "undefined" \u3068\u306A\u308A\u307E\u3059\u3002
runtime.spec-name=Java \u4EEE\u60F3\u30DE\u30B7\u30F3\u306E\u4ED5\u69D8\u540D\u3002\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u304C\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u3055\u308C\u3066\u304A\u308A\u3001\u30B7\u30B9\u30C6\u30E0\u30D7\u30ED\u30D1\u30C6\u30A3 "java.vm.specification.name" \u306B\u30A2\u30AF\u30BB\u30B9\u3067\u304D\u306A\u3044\u5834\u5408\u3001\u3053\u306E\u5C5E\u6027\u3092\u8AAD\u307F\u8FBC\u3080 "read-attribute" \u6F14\u7B97\u304C\u5931\u6557\u3057\u3001"read-resource" \u6F14\u7B97\u306E\u7D50\u679C\u306B\u3042\u308B\u3053\u306E\u5C5E\u6027\u5024\u306F "undefined" \u3068\u306A\u308A\u307E\u3059\u3002
runtime.spec-vendor=Java \u4EEE\u60F3\u30DE\u30B7\u30F3\u306E\u4ED5\u69D8\u30D9\u30F3\u30C0\u30FC\u3002\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u304C\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u3055\u308C\u3066\u304A\u308A\u3001\u30B7\u30B9\u30C6\u30E0\u30D7\u30ED\u30D1\u30C6\u30A3 "java.vm.specification.vendor" \u306B\u30A2\u30AF\u30BB\u30B9\u3067\u304D\u306A\u3044\u5834\u5408\u3001\u3053\u306E\u5C5E\u6027\u3092\u8AAD\u307F\u8FBC\u3080 "read-attribute" \u6F14\u7B97\u304C\u5931\u6557\u3057\u3001"read-resource" \u6F14\u7B97\u306E\u7D50\u679C\u306B\u3042\u308B\u3053\u306E\u5C5E\u6027\u5024\u306F "undefined" \u3068\u306A\u308A\u307E\u3059\u3002
runtime.spec-version=Java \u4EEE\u60F3\u30DE\u30B7\u30F3\u306E\u4ED5\u69D8\u30D0\u30FC\u30B8\u30E7\u30F3\u3002\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u304C\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u3055\u308C\u3066\u304A\u308A\u3001\u30B7\u30B9\u30C6\u30E0\u30D7\u30ED\u30D1\u30C6\u30A3 "java.vm.specification.version" \u306B\u30A2\u30AF\u30BB\u30B9\u3067\u304D\u306A\u3044\u5834\u5408\u3001\u3053\u306E\u5C5E\u6027\u3092\u8AAD\u307F\u8FBC\u3080 "read-attribute" \u6F14\u7B97\u304C\u5931\u6557\u3057\u3001"read-resource" \u6F14\u7B97\u306E\u7D50\u679C\u306B\u3042\u308B\u3053\u306E\u5C5E\u6027\u5024\u306F "undefined" \u3068\u306A\u308A\u307E\u3059\u3002
runtime.management-spec-version=\u5B9F\u884C\u4E2D\u306E Java \u4EEE\u60F3\u30DE\u30B7\u30F3\u304C\u5B9F\u88C5\u3059\u308B\u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u306E\u4ED5\u69D8\u30D0\u30FC\u30B8\u30E7\u30F3
runtime.class-path=\u30AF\u30E9\u30B9\u30D5\u30A1\u30A4\u30EB\u3092\u691C\u7D22\u3059\u308B\u305F\u3081\u306B\u30B7\u30B9\u30C6\u30E0\u30AF\u30E9\u30B9\u30ED\u30FC\u30C0\u30FC\u304C\u5229\u7528\u3059\u308B Java \u30AF\u30E9\u30B9\u30D1\u30B9\u3002\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u304C\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u3055\u308C\u3066\u304A\u308A\u3001\u30B7\u30B9\u30C6\u30E0\u30D7\u30ED\u30D1\u30C6\u30A3 "java.class.path" \u306B\u30A2\u30AF\u30BB\u30B9\u3067\u304D\u306A\u3044\u5834\u5408\u3001\u3053\u306E\u5C5E\u6027\u3092\u8AAD\u307F\u8FBC\u3080 "read-attribute" \u6F14\u7B97\u304C\u5931\u6557\u3057\u3001"read-resource" \u6F14\u7B97\u306E\u7D50\u679C\u306B\u3042\u308B\u3053\u306E\u5C5E\u6027\u5024\u306F "undefined" \u3068\u306A\u308A\u307E\u3059\u3002
runtime.library-path=Java \u30E9\u30A4\u30D6\u30E9\u30EA\u30D1\u30B9\u3002\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u304C\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u3055\u308C\u3066\u304A\u308A\u3001\u30B7\u30B9\u30C6\u30E0\u30D7\u30ED\u30D1\u30C6\u30A3 "java.library.path" \u306B\u30A2\u30AF\u30BB\u30B9\u3067\u304D\u306A\u3044\u5834\u5408\u3001\u3053\u306E\u5C5E\u6027\u3092\u8AAD\u307F\u8FBC\u3080 "read-attribute" \u6F14\u7B97\u304C\u5931\u6557\u3057\u3001"read-resource" \u6F14\u7B97\u306E\u7D50\u679C\u306B\u3042\u308B\u3053\u306E\u5C5E\u6027\u5024\u306F "undefined" \u3068\u306A\u308A\u307E\u3059\u3002
runtime.boot-class-path-supported=\u30D6\u30FC\u30C8\u30B9\u30C8\u30E9\u30C3\u30D7\u30AF\u30E9\u30B9\u30ED\u30FC\u30C0\u30FC\u304C\u30AF\u30E9\u30B9\u30D5\u30A1\u30A4\u30EB\u691C\u7D22\u306E\u305F\u3081\u306B\u5229\u7528\u3059\u308B\u30D6\u30FC\u30C8\u30AF\u30E9\u30B9\u30D1\u30B9\u306B\u3001Java \u4EEE\u60F3\u30DE\u30B7\u30F3\u304C\u5BFE\u5FDC\u3057\u3066\u3044\u308B\u304B\u3069\u3046\u304B
runtime.boot-class-path=\u30AF\u30E9\u30B9\u30D5\u30A1\u30A4\u30EB\u3092\u691C\u7D22\u3059\u308B\u305F\u3081\u306B\u30D6\u30FC\u30C8\u30AF\u30E9\u30B9\u30ED\u30FC\u30C0\u30FC\u304C\u5229\u7528\u3059\u308B\u30D6\u30FC\u30C8\u30AF\u30E9\u30B9\u30D1\u30B9\u3002\u5C5E\u6027 "boot-class-path-supported" \u304C "false" \u306B\u306A\u3063\u3066\u3044\u308B\u5834\u5408\u3001\u3042\u308B\u3044\u306F\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u304C\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u3055\u308C\u3066\u304A\u308A\u3001\u547C\u3073\u51FA\u3057\u5143\u306B ManagementPermission ("monitor") \u304C\u306A\u3044\u5834\u5408\u3001\u3053\u306E\u5C5E\u6027\u3092\u8AAD\u307F\u8FBC\u3080 "read-attribute" \u6F14\u7B97\u304C\u5931\u6557\u3057\u3001"read-resource" \u6F14\u7B97\u306E\u7D50\u679C\u306B\u3042\u308B\u3053\u306E\u5C5E\u6027\u5024\u306F "undefined" \u3068\u306A\u308A\u307E\u3059\u3002
runtime.input-arguments=\u4E3B\u8981\u30E1\u30BD\u30C3\u30C9\u3078\u306E\u5F15\u6570\u3092\u542B\u307E\u306A\u3044 Java \u4EEE\u60F3\u30DE\u30B7\u30F3\u3078\u6E21\u3059\u5165\u529B\u5F15\u6570\u3002\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u304C\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u3055\u308C\u3066\u304A\u308A\u3001\u547C\u3073\u51FA\u3057\u5143\u306B ManagementPermission ("monitor") \u304C\u306A\u3044\u5834\u5408\u3001\u3053\u306E\u5C5E\u6027\u3092\u8AAD\u307F\u8FBC\u3080 "read-attribute" \u6F14\u7B97\u304C\u5931\u6557\u3057\u3001"read-resource" \u6F14\u7B97\u306E\u7D50\u679C\u306B\u3042\u308B\u3053\u306E\u5C5E\u6027\u5024\u306F "undefined" \u3068\u306A\u308A\u307E\u3059\u3002
runtime.uptime=Java \u4EEE\u60F3\u30DE\u30B7\u30F3\u306E\u30A2\u30C3\u30D7\u30BF\u30A4\u30E0 (\u30DF\u30EA\u79D2)
runtime.start-time=Java \u4EEE\u60F3\u30DE\u30B7\u30F3\u306E\u8D77\u52D5\u6642\u9593 (\u30DF\u30EA\u79D2)
runtime.system-properties=\u30AA\u30DA\u30EC\u30FC\u30C6\u30A3\u30F3\u30B0\u30B7\u30B9\u30C6\u30E0\u540D\u3002\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u304C\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u3055\u308C\u3066\u304A\u308A\u3001\u30B7\u30B9\u30C6\u30E0\u30D7\u30ED\u30D1\u30C6\u30A3 "checkPropertiesAccess" \u30E1\u30BD\u30C3\u30C9\u306B\u3088\u308A\u30B7\u30B9\u30C6\u30E0\u30D7\u30ED\u30D1\u30C6\u30A3\u306B\u30A2\u30AF\u30BB\u30B9\u3067\u304D\u306A\u3044\u5834\u5408\u3001\u3053\u306E\u5C5E\u6027\u3092\u8AAD\u307F\u8FBC\u3080 "read-attribute" \u6F14\u7B97\u304C\u5931\u6557\u3057\u3001"read-resource" \u6F14\u7B97\u306E\u7D50\u679C\u306B\u3042\u308B\u3053\u306E\u5C5E\u6027\u5024\u306F "undefined" \u3068\u306A\u308A\u307E\u3059\u3002
threading=Java \u4EEE\u60F3\u30DE\u30B7\u30F3\u306E\u30B9\u30EC\u30C3\u30C9\u30B7\u30B9\u30C6\u30E0\u5411\u3051\u306E\u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9
threading.thread-count=\u30C7\u30FC\u30E2\u30F3\u304A\u3088\u3073\u975E\u30C7\u30FC\u30E2\u30F3\u30B9\u30EC\u30C3\u30C9\u4E21\u65B9\u3092\u542B\u3080\u30E9\u30A4\u30D6\u30B9\u30EC\u30C3\u30C9\u306E\u73FE\u5728\u306E\u6570
threading.peak-thread-count=Java \u4EEE\u60F3\u30DE\u30B7\u30F3\u3092\u958B\u59CB\u3001\u3042\u308B\u3044\u306F\u30D4\u30FC\u30AF\u304C\u30EA\u30BB\u30C3\u30C8\u3055\u308C\u3066\u304B\u3089\u306E\u30D4\u30FC\u30AF\u306E\u30E9\u30A4\u30D6\u30B9\u30EC\u30C3\u30C9\u6570
threading.total-started-thread-count=Java \u4EEE\u60F3\u30DE\u30B7\u30F3\u3092\u958B\u59CB\u3057\u3066\u304B\u3089\u4F5C\u6210\u304A\u3088\u3073\u8D77\u52D5\u3057\u305F\u30B9\u30EC\u30C3\u30C9\u306E\u7DCF\u6570
threading.daemon-thread-count=\u30E9\u30A4\u30D6\u30C7\u30FC\u30E2\u30F3\u30B9\u30EC\u30C3\u30C9\u306E\u73FE\u5728\u306E\u6570
threading.all-thread-ids=\u5168\u30E9\u30A4\u30D6\u30B9\u30EC\u30C3\u30C9\u306E ID\u3002 \u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u304C\u30A4\u30F3\u30B9\u30C8\u30FC\u30EB\u3055\u308C\u3066\u304A\u308A\u3001\u547C\u3073\u51FA\u3057\u5143\u306B ManagementPermission ("monitor") \u304C\u306A\u3044\u5834\u5408\u3001\u3053\u306E\u5C5E\u6027\u3092\u8AAD\u307F\u8FBC\u3080 "read-attribute" \u6F14\u7B97\u304C\u5931\u6557\u3057\u3001"read-resource" \u6F14\u7B97\u306E\u7D50\u679C\u306B\u3042\u308B\u3053\u306E\u5C5E\u6027\u5024\u306F "undefined" \u3068\u306A\u308A\u307E\u3059\u3002
threading.thread-contention-monitoring-supported=Java \u4EEE\u60F3\u30DE\u30B7\u30F3\u304C\u30B9\u30EC\u30C3\u30C9\u7AF6\u5408\u76E3\u8996\u306B\u5BFE\u5FDC\u3057\u3066\u3044\u308B\u304B\u3069\u3046\u304B
threading.thread-contention-monitoring-enabled=\u30B9\u30EC\u30C3\u30C9\u7AF6\u5408\u76E3\u8996\u3092\u6709\u52B9\u306B\u3059\u308B\u304B\u3069\u3046\u304B
threading.current-thread-cpu-time=\u73FE\u5728\u306E\u30B9\u30EC\u30C3\u30C9\u306E\u5408\u8A08 CPU \u6642\u9593 (\u30CA\u30CE\u79D2)\u3002\u3042\u308B\u3044\u306F "thread-cpu-time-enabled" \u304C "false" \u306E\u5834\u5408\u306F -1\u3002Java \u4EEE\u60F3\u6642\u9593\u5B9F\u88C5\u306F CPU\u6642\u9593\u306E\u6E2C\u5B9A\u306B\u306F\u5BFE\u5FDC\u3057\u306A\u3044\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002"thread-cpu-time-supported" \u304C "false" \u306E\u5834\u5408\u3001"read-attribute" \u6F14\u7B97\u7D4C\u7531\u3067\u3053\u306E\u5C5E\u6027\u3092\u8AAD\u307F\u8FBC\u3082\u3046\u3068\u3057\u5931\u6557\u3057\u3001"read-resource" \u6F14\u7B97\u306E\u7D50\u679C\u306B\u3042\u308B\u3053\u306E\u5C5E\u6027\u5024\u306F "undefined" \u3068\u306A\u308A\u307E\u3059\u3002
threading.current-thread-user-time=\u73FE\u5728\u306E\u30B9\u30EC\u30C3\u30C9\u304C\u30E6\u30FC\u30B6\u30FC\u30E2\u30FC\u30C9\u3067\u5B9F\u884C\u3057\u305F CPU \u6642\u9593 (\u30CA\u30CE\u79D2)\u3002\u3042\u308B\u3044\u306F "thread-cpu-time-enabled" \u304C "false" \u306E\u5834\u5408\u306F -1\u3002Java \u4EEE\u60F3\u6642\u9593\u5B9F\u88C5\u306F CPU\u6642\u9593\u306E\u6E2C\u5B9A\u306B\u306F\u5BFE\u5FDC\u3057\u306A\u3044\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002"thread-cpu-time-supported" \u304C "false" \u306E\u5834\u5408\u3001"read-attribute" \u6F14\u7B97\u7D4C\u7531\u3067\u3053\u306E\u5C5E\u6027\u3092\u8AAD\u307F\u8FBC\u3082\u3046\u3068\u3057\u5931\u6557\u3057\u3001"read-resource" \u6F14\u7B97\u306E\u7D50\u679C\u306B\u3042\u308B\u3053\u306E\u5C5E\u6027\u5024\u306F "undefined" \u3068\u306A\u308A\u307E\u3059\u3002
threading.thread-cpu-time-supported=Java \u4EEE\u60F3\u30DE\u30B7\u30F3\u5B9F\u88C5\u304C\u3001\u30B9\u30EC\u30C3\u30C9\u306E CPU \u6642\u9593\u6E2C\u5B9A\u306B\u5BFE\u5FDC\u3059\u308B\u304B\u3069\u3046\u304B
threading.current-thread-cpu-time-supported=Java \u4EEE\u60F3\u30DE\u30B7\u30F3\u304C\u73FE\u5728\u306E\u30B9\u30EC\u30C3\u30C9\u306E CPU \u6642\u9593\u6E2C\u5B9A\u306B\u5BFE\u5FDC\u3059\u308B\u304B\u3069\u3046\u304B
threading.thread-cpu-time-enabled=\u30B9\u30EC\u30C3\u30C9\u306E CPU \u6642\u9593\u6E2C\u5B9A\u3092\u6709\u52B9\u306B\u3059\u308B\u304B\u3069\u3046\u304B
threading.object-monitor-usage-supported=Java \u4EEE\u60F3\u30DE\u30B7\u30F3\u304C\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u30E2\u30CB\u30BF\u30FC\u306E\u4F7F\u7528\u91CF\u306E\u76E3\u8996\u306B\u5BFE\u5FDC\u3057\u3066\u3044\u308B\u304B\u3069\u3046\u304B
threading.synchronizer-usage-supported=Java \u4EEE\u60F3\u30DE\u30B7\u30F3\u304C\u6240\u6709\u53EF\u80FD\u306A\u30B7\u30F3\u30AF\u30ED\u30CA\u30A4\u30B6\u30FC\u306E\u4F7F\u7528\u91CF\u306E\u76E3\u8996\u306B\u5BFE\u5FDC\u3057\u3066\u3044\u308B\u304B\u3069\u3046\u304B
threading.reset-peak-thread-count=\u30D4\u30FC\u30AF\u306E\u30B9\u30EC\u30C3\u30C9\u30AB\u30A6\u30F3\u30C8\u3092\u73FE\u5728\u306E\u30E9\u30A4\u30D6\u30B9\u30EC\u30C3\u30C9\u6570\u306B\u30EA\u30BB\u30C3\u30C8\u3057\u307E\u3059\u3002
threading.find-deadlocked-threads=object monitor \u3042\u308B\u3044\u306F ownable synchronizer \u53D6\u5F97\u3092\u5F85\u6A5F\u3059\u308B\u30C7\u30C3\u30C9\u30ED\u30C3\u30AF\u306B\u3042\u308B\u30B9\u30EC\u30C3\u30C9\u30B5\u30A4\u30AF\u30EB\u3092\u691C\u7D22\u3057\u307E\u3059\u3002
threading.find-monitor-deadlocked-threads=object monitor \u53D6\u5F97\u3092\u5F85\u6A5F\u3059\u308B\u30C7\u30C3\u30C9\u30ED\u30C3\u30AF\u306B\u3042\u308B\u30B9\u30EC\u30C3\u30C9\u30B5\u30A4\u30AF\u30EB\u3092\u691C\u7D22\u3057\u307E\u3059\u3002
threading.find-threads.reply=\u30C7\u30C3\u30C9\u30ED\u30C3\u30AF\u3068\u306A\u3063\u305F\u30B9\u30EC\u30C3\u30C9\u304C\u3042\u308B\u5834\u5408\u306F\u305D\u306E\u30B9\u30EC\u30C3\u30C9 id \u4E00\u89A7\u3002\u306A\u3044\u5834\u5408\u306F "undefined"
threading.get-thread-info=\u6307\u5B9A id \u306E\u30B9\u30EC\u30C3\u30C9\u306B\u95A2\u3059\u308B\u30B9\u30EC\u30C3\u30C9\u60C5\u5831\u3092\u8FD4\u3057\u307E\u3059\u3002\u8FD4\u3055\u308C\u305F\u8FD4\u7B54\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u5185\u306E\u30B9\u30BF\u30C3\u30AF\u30C8\u30EC\u30FC\u30B9\u3001\u30ED\u30C3\u30AF\u3055\u308C\u305F\u30E2\u30CB\u30BF\u30FC\u3001\u30ED\u30C3\u30AF\u3055\u308C\u305F\u30B7\u30F3\u30AF\u30ED\u30CA\u30A4\u30B6\u30FC\u306F\u7A7A\u3068\u306A\u308A\u307E\u3059\u3002
threading.get-thread-info.reply=\u6307\u5B9A ID \u306E\u30B9\u30EC\u30C3\u30C9\u306B\u95A2\u3059\u308B java.lang.management.ThreadInfo \u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306E Detyped \u8868\u73FE\u3002\u6307\u5B9A ID \u306E\u30B9\u30EC\u30C3\u30C9\u304C\u751F\u304D\u3066\u3044\u306A\u3044\u3042\u308B\u3044\u306F\u3001\u5B58\u5728\u3057\u306A\u3044\u5834\u5408 "undefined"\u3002
threading.get-thread-infos=\u30A4\u30F3\u30D7\u30C3\u30C8\u4E00\u89A7\u306B ID \u304C\u3042\u308B\u5404\u30B9\u30EC\u30C3\u30C9\u306E\u30B9\u30EC\u30C3\u30C9\u60C5\u5831\u3092\u8FD4\u3057\u307E\u3059\u3002
threading.get-thread-infos.reply=\u6307\u5B9A ID \u306E\u30B9\u30EC\u30C3\u30C9\u306B\u95A2\u3059\u308B java.lang.management.ThreadInfo \u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306E Detyped \u8868\u73FE\u4E00\u89A7\u3002\u3053\u308C\u3089\u306E\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306F\u305D\u308C\u305E\u308C\u3001ID \u306E\u30A4\u30F3\u30D7\u30C3\u30C8\u4E00\u89A7\u306E\u8A72\u5F53\u8981\u7D20\u5185\u306B ID \u304C\u5165\u3063\u3066\u3044\u308B\u30B9\u30EC\u30C3\u30C9\u306B\u95A2\u3059\u308B\u60C5\u5831\u3092\u542B\u307F\u307E\u3059\u3002\u6307\u5B9A ID \u306E\u30B9\u30EC\u30C3\u30C9\u304C\u751F\u5B58\u3044\u306A\u3044\u3042\u308B\u3044\u306F\u3001\u5B58\u5728\u3057\u306A\u3044\u5834\u5408 "undefined"\u3002
threading.get-thread-cpu-time=\u6307\u5B9A ID \u306E\u30B9\u30EC\u30C3\u30C9\u306E\u5408\u8A08 CPU \u6642\u9593\u3092\u30CA\u30CE\u79D2\u3067\u8FD4\u3057\u307E\u3059\u3002
threading.get-thread-user-time=\u6307\u5B9A ID \u306E\u30B9\u30EC\u30C3\u30C9\u304C\u30E6\u30FC\u30B6\u30FC\u30E2\u30FC\u30C9\u3067\u5B9F\u884C\u3055\u308C\u305F CPU \u6642\u9593\u3092\u30CA\u30CE\u79D2\u3067\u8FD4\u3057\u307E\u3059\u3002
threading.dump-all-threads=\u30B9\u30BF\u30C3\u30AF\u30C8\u30EC\u30FC\u30B9\u3001\u540C\u671F\u60C5\u5831\u3092\u6301\u3064\u30E9\u30A4\u30D6\u30B9\u30EC\u30C3\u30C9\u3059\u3079\u3066\u306B\u95A2\u3059\u308B\u30B9\u30EC\u30C3\u30C9\u60C5\u5831\u3092\u8FD4\u3057\u307E\u3059\u3002
threading.dump-threads.reply=java.lang.management.ThreadInfo \u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306E detyped \u8868\u73FE\u4E00\u89A7\u3002
threading.id=\u30B9\u30EC\u30C3\u30C9\u306E\u30B9\u30EC\u30C3\u30C9 ID\u3002\u6B63\u3067\u306A\u3051\u308C\u3070\u306A\u308A\u307E\u305B\u3093\u3002
threading.ids=\u30B9\u30EC\u30C3\u30C9 id \u306E\u4E00\u89A7
threading.max-depth=\u30C0\u30F3\u30D7\u3055\u308C\u308B\u30B9\u30BF\u30C3\u30AF\u30C8\u30EC\u30FC\u30B9\u306E\u30A8\u30F3\u30C8\u30EA\u306E \u6700\u5927\u6570\u3002Integer.MAX_VALUE \u3092\u4F7F\u3044\u30B9\u30BF\u30C3\u30AF\u5168\u4F53\u3092\u30C0\u30F3\u30D7\u3059\u308B\u3088\u3046\u30EA\u30AF\u30A8\u30B9\u30C8\u3059\u308B\u3053\u3068\u3082\u53EF\u80FD\u3067\u3059\u3002
threading.locked-monitors=\u7D50\u679C\u306B\u30ED\u30C3\u30AF\u3055\u308C\u305F\u30E2\u30CB\u30BF\u30FC\u306B\u95A2\u3059\u308B\u60C5\u5831\u3092\u542B\u3080\u3079\u304D\u304B\u3069\u3046\u304B
threading.locked-synchronizers=\u7D50\u679C\u306B\u30ED\u30C3\u30AF\u3055\u308C\u305F\u6240\u6709\u53EF\u80FD\u306A\u30B7\u30F3\u30AF\u30ED\u30CA\u30A4\u30B6\u30FC\u306B\u95A2\u3059\u308B\u60C5\u5831\u3092\u542B\u3080\u3079\u304D\u304B\u3069\u3046\u304B
threading.stack.file-name=\u3053\u306E\u30B9\u30BF\u30C3\u30AF\u30C8\u30EC\u30FC\u30B9\u8981\u7D20\u3067\u8868\u73FE\u3055\u308C\u308B\u5B9F\u884C\u30DD\u30A4\u30F3\u30C8\u3092\u542B\u3080\u30BD\u30FC\u30B9\u30D5\u30A1\u30A4\u30EB\u540D
threading.stack.line-number=\u3053\u306E\u30B9\u30BF\u30C3\u30AF\u30C8\u30EC\u30FC\u30B9\u8981\u7D20\u3067\u8868\u73FE\u3055\u308C\u308B\u5B9F\u884C\u30DD\u30A4\u30F3\u30C8\u3092\u542B\u3080\u30BD\u30FC\u30B9\u30D5\u30A1\u30A4\u30EB\u306E\u884C\u756A\u53F7
threading.stack.class-name=\u3053\u306E\u30B9\u30BF\u30C3\u30AF\u30C8\u30EC\u30FC\u30B9\u8981\u7D20\u3067\u8868\u73FE\u3055\u308C\u308B\u5B9F\u884C\u30DD\u30A4\u30F3\u30C8\u3092\u542B\u3080\u30AF\u30E9\u30B9\u306E\u5B8C\u5168\u4FEE\u98FE\u540D
threading.stack.method-name=\u3053\u306E\u30B9\u30BF\u30C3\u30AF\u30C8\u30EC\u30FC\u30B9\u8981\u7D20\u3067\u8868\u73FE\u3055\u308C\u308B\u5B9F\u884C\u30DD\u30A4\u30F3\u30C8\u3092\u542B\u3080\u30E1\u30BD\u30C3\u30C9\u540D
threading.stack.native-method=\u3053\u306E\u30B9\u30BF\u30C3\u30AF\u30C8\u30EC\u30FC\u30B9\u8981\u7D20\u3067\u8868\u73FE\u3055\u308C\u308B\u5B9F\u884C\u30DD\u30A4\u30F3\u30C8\u3092\u542B\u3080\u30E1\u30BD\u30C3\u30C9\u304C\u30CD\u30FC\u30C6\u30A3\u30D6\u30E1\u30BD\u30C3\u30C9\u304B\u3069\u3046\u304B
threading.lock.class-name=\u30ED\u30C3\u30AF\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306E\u30AF\u30E9\u30B9\u306E\u5B8C\u5168\u4FEE\u98FE\u540D
threading.lock.identity-hash-code=System.identityHashCode(java.lang.Object) \u30E1\u30BD\u30C3\u30C9\u304B\u3089\u8FD4\u3059\u30ED\u30C3\u30AF\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306E\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30CF\u30C3\u30B7\u30E5\u30B3\u30FC\u30C9
threading.monitor.locked-stack-depth=\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u30E2\u30CB\u30BF\u30FC\u304C\u30ED\u30C3\u30AF\u3055\u308C\u305F\u30B9\u30BF\u30C3\u30AF\u3068\u30EC\u30FC\u30B9\u306E\u6DF1\u3055
threading.monitor.locked-stack-frame=\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u30E2\u30CB\u30BF\u30FC\u3092\u30ED\u30C3\u30AF\u3057\u305F\u30B9\u30BF\u30C3\u30AF\u30D5\u30EC\u30FC\u30E0
threading.thread-info.thread-id=\u30B9\u30EC\u30C3\u30C9\u306E ID
threading.thread-info.thread-name=\u30B9\u30EC\u30C3\u30C9\u306E\u540D\u524D
threading.thread-info.thread-state=\u30B9\u30EC\u30C3\u30C9\u306E\u30B9\u30C6\u30FC\u30BF\u30B9
threading.thread-info.blocked-time=\u30B9\u30EC\u30C3\u30C9\u7AF6\u5408\u76E3\u8996\u3092\u6709\u52B9\u306B\u3057\u3066\u304B\u3089\u30E2\u30CB\u30BF\u30FC\u306E\u5165\u5BA4\u3042\u308B\u3044\u306F\u518D\u5165\u5BA4\u3092\u30B9\u30EC\u30C3\u30C9\u304C\u30D6\u30ED\u30C3\u30AF\u3057\u305F\u7D2F\u7A4D\u7D4C\u904E\u6642\u9593 (\u30CA\u30CE\u79D2)\u3002\u3042\u308B\u3044\u306F\u30B9\u30EC\u30C3\u30C9\u7AF6\u5408\u76E3\u8996\u304C\u6709\u52B9\u51FA\u306A\u3044\u5834\u5408\u306F -1\u3002
threading.thread-info.blocked-count=\u30B9\u30EC\u30C3\u30C9\u304C\u30E2\u30CB\u30BF\u30FC\u306B\u5165\u5BA4\u3042\u308B\u3044\u306F\u518D\u5165\u5BA4\u3059\u308B\u306E\u3092\u30D6\u30ED\u30C3\u30AF\u3057\u305F\u7DCF\u6570
threading.thread-info.waited-time=\u30B9\u30EC\u30C3\u30C9\u7AF6\u5408\u76E3\u8996\u304C\u6709\u52B9\u306B\u306A\u3063\u3066\u304B\u3089\u30B9\u30EC\u30C3\u30C9\u304C\u901A\u77E5\u3092\u5F85\u3063\u305F\u7D2F\u7A4D\u7D4C\u904E\u6642\u9593 (\u30DF\u30EA\u79D2)
threading.thread-info.waited-count=\u30B9\u30EC\u30C3\u30C9\u304C\u901A\u77E5\u3092\u5F85\u3063\u305F\u7DCF\u6570
threading.thread-info.lock-info=\u30B9\u30EC\u30C3\u30C9\u304C\u30D6\u30ED\u30C3\u30AF\u3055\u308C\u305F\u72B6\u614B\u3067\u5F85\u6A5F\u3059\u308B\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306E java.lang.management.LockInfo \u306E detyped \u8868\u73FE
threading.thread-info.lock-name=\u30B9\u30EC\u30C3\u30C9\u304C\u30D6\u30ED\u30C3\u30AF\u3055\u308C\u305F\u72B6\u614B\u3067\u5F85\u6A5F\u3059\u308B\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306E\u6587\u5B57\u5217\u8868\u73FE
threading.thread-info.lock-owner-id=\u30B9\u30EC\u30C3\u30C9\u304C\u30D6\u30ED\u30C3\u30AF\u3055\u308C\u305F\u72B6\u614B\u3067\u5F85\u6A5F\u3059\u308B\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u3092\u6240\u6709\u3059\u308B\u30B9\u30EC\u30C3\u30C9 ID
threading.thread-info.lock-owner-name=\u30B9\u30EC\u30C3\u30C9\u304C\u30D6\u30ED\u30C3\u30AF\u3055\u308C\u305F\u72B6\u614B\u3067\u5F85\u6A5F\u3059\u308B\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u3092\u6240\u6709\u3059\u308B\u30B9\u30EC\u30C3\u30C9\u540D
threading.thread-info.stack-trace=\u30B9\u30EC\u30C3\u30C9\u306E\u30B9\u30BF\u30C3\u30AF\u30C8\u30EC\u30FC\u30B9
threading.thread-info.suspended=\u30B9\u30EC\u30C3\u30C9\u304C\u4E00\u6642\u505C\u6B62\u3055\u308C\u308B\u304B\u3069\u3046\u304B
threading.thread-info.in-native=\u95A2\u9023\u306E\u3042\u308B\u30B9\u30EC\u30C3\u30C9\u304C Java Native Interface (JNI) \u7D4C\u7531\u3067\u30CD\u30FC\u30C6\u30A3\u30D6\u30B3\u30FC\u30C9\u3092\u5B9F\u884C\u3059\u308B\u304B\u3069\u3046\u304B
threading.thread-info.locked-monitors=java.lang.management.MonitorInfo \u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306E detyped \u8868\u73FE\u4E00\u89A7\u3002\u3053\u308C\u3089\u306E\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306F\u3053\u306E\u30B9\u30EC\u30C3\u30C9\u306B\u73FE\u5728\u30ED\u30C3\u30AF\u3055\u308C\u3066\u3044\u308B\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u30E2\u30CB\u30BF\u30FC\u3092\u793A\u3057\u307E\u3059\u3002
threading.thread-info.locked-synchronizers=java.lang.management.MonitorInfo \u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306E detyped \u8868\u73FE\u4E00\u89A7\u3002\u3053\u308C\u3089\u306E\u30AA\u30D6\u30B8\u30A7\u30AF\u30C8\u306F\u3053\u306E\u30B9\u30EC\u30C3\u30C9\u306B\u73FE\u5728\u30ED\u30C3\u30AF\u3055\u308C\u3066\u3044\u308B\u6240\u6709\u53EF\u80FD\u306A\u30B7\u30F3\u30AF\u30ED\u30CA\u30A4\u30B6\u30FC\u3092\u793A\u3057\u307E\u3059\u3002
buffer-pools=Java \u4EEE\u60F3\u30DE\u30B7\u30F3\u306E\u30D0\u30C3\u30D5\u30A1\u30FC\u30D7\u30FC\u30EB\u7528\u306B\u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u3092\u63D0\u4F9B\u3059\u308B\u30EA\u30BD\u30FC\u30B9\u306E\u89AA\u30EA\u30BD\u30FC\u30B9
buffer-pools.name=MBean ObjectName \u306E 'name' \u30D7\u30ED\u30D1\u30C6\u30A3\u306E\u5024\u3067\u6574\u7406\u3055\u308C\u305F BufferPoolMXBean \u30D7\u30E9\u30C3\u30C8\u30D5\u30A9\u30FC\u30E0\u306E MBean\u3002
buffer-pool=\u30D0\u30C3\u30D5\u30A1\u30D7\u30FC\u30EB\u306E\u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9\u3002\u4F8B\uFF1A\u30C0\u30A4\u30EC\u30AF\u30C8\u30D0\u30C3\u30D5\u30A1\u30FC\u3042\u308B\u3044\u306F\u30DE\u30C3\u30D4\u30F3\u30B0\u3055\u308C\u305F\u30D0\u30C3\u30D5\u30A1\u30FC\u306E\u30D7\u30FC\u30EB
buffer-pool.count=\u30D7\u30FC\u30EB\u5185\u306E\u63A8\u5B9A\u30D0\u30C3\u30D5\u30A1\u30FC\u6570
buffer-pool.memory-used=Java \u4EEE\u60F3\u30DE\u30B7\u30F3\u304C\u3053\u306E\u30D0\u30C3\u30D5\u30A1\u30FC\u30D7\u30FC\u30EB\u306B\u5229\u7528\u3059\u308B\u63A8\u5B9A\u30E1\u30E2\u30EA\u91CF (\u30D0\u30A4\u30C8) \u3042\u308B\u3044\u306F\u63A8\u5B9A\u30E1\u30E2\u30EA\u4F7F\u7528\u91CF\u304C\u5165\u624B\u3067\u304D\u306A\u3044\u5834\u5408\u306F -1
buffer-pool.total-capacity=\u3053\u306E\u30D7\u30FC\u30EB\u5185\u306E\u30D0\u30C3\u30D5\u30A1\u30FC\u306E\u5408\u8A08\u63A8\u5B9A\u8A31\u5BB9\u91CF\u3002\u30D0\u30C3\u30D5\u30A1\u30FC\u306E\u8A31\u5BB9\u91CF\u306F\u3001\u30D7\u30FC\u30EB\u5185\u306B\u542B\u307E\u308C\u308B\u8981\u7D20\u6570\u3067\u3001\u3053\u306E\u5C5E\u6027\u5024\u304C\u3053\u306E\u30D7\u30FC\u30EB\u5185\u306E\u30D0\u30C3\u30D5\u30A1\u30FC\u306E\u5408\u8A08\u63A8\u5B9A\u8A31\u5BB9\u91CF (\u30D0\u30A4\u30C8) \u3068\u306A\u3063\u3066\u3044\u307E\u3059\u3002
buffer-pool.name=\u3053\u306E\u30D0\u30C3\u30D5\u30A1\u30FC\u30D7\u30FC\u30EB\u3092\u793A\u3059\u540D\u524D
logging=\u30D7\u30E9\u30C3\u30C8\u30D5\u30A9\u30FC\u30E0\u30ED\u30AE\u30F3\u30B0\u6A5F\u80FD\u5411\u3051\u306E\u7BA1\u7406\u30A4\u30F3\u30BF\u30FC\u30D5\u30A7\u30FC\u30B9
logging.logger-names=\u73FE\u5728\u767B\u9332\u3055\u308C\u3066\u3044\u308B\u30ED\u30AC\u30FC\u540D\u306E\u4E00\u89A7
logging.get-logger-level=\u6307\u5B9A\u306E\u30ED\u30AC\u30FC\u306B\u95A2\u9023\u4ED8\u3051\u3089\u308C\u305F\u30ED\u30B0\u30EC\u30D9\u30EB\u540D\u3092\u53D6\u5F97\u3057\u307E\u3059\u3002\u6307\u5B9A\u306E\u30ED\u30AC\u30FC\u304C\u5B58\u5728\u3057\u306A\u3044\u5834\u5408\u306F "undefined" \u304C\u8FD4\u3055\u308C\u307E\u3059\u3002
logging.set-logger-level=\u6307\u5B9A\u306E\u30ED\u30AC\u30FC\u3092\u6307\u5B9A\u306E\u65B0\u898F\u30EC\u30D9\u30EB\u306B\u8A2D\u5B9A\u3057\u307E\u3059\u3002 level-name \u304C "undefined" \u3067\u306A\u3044\u5834\u5408\u3001\u6307\u5B9A\u30ED\u30AC\u30FC\u306E\u30EC\u30D9\u30EB\u306Flevel-name \u306B\u5408\u3063\u305F\u89E3\u6790\u3055\u308C\u305F\u30EC\u30D9\u30EB\u306B\u8A2D\u5B9A\u3055\u308C\u307E\u3059\u3002level-name \u304C "undefined" \u306E\u5834\u5408\u306F\u3001\u6307\u5B9A\u30ED\u30AC\u30FC\u306E\u30EC\u30D9\u30EB\u3092 null \u306B\u8A2D\u5B9A\u3057\u3001\u3055\u3089\u306B\u7279\u5B9A\u306E (null \u4EE5\u5916) \u30EC\u30D9\u30EB\u306E\u5024\u3092\u6301\u3064\u6700\u3082\u8FD1\u3044\u7956\u5148\u304B\u3089\u30ED\u30AC\u30FC\u306E\u52B9\u679C\u7684\u30EC\u30D9\u30EB\u3092\u7D99\u627F\u3057\u307E\u3059\u3002
logging.get-parent-logger-name=\u6307\u5B9A\u30ED\u30AC\u30FC\u306E\u89AA\u306E\u540D\u524D\u3092\u8FD4\u3057\u307E\u3059\u3002\u6307\u5B9A\u30ED\u30AC\u30FC\u304C\u5B58\u5728\u3057\u306A\u3044\u5834\u5408\u306F "undefined" \u304C\u8FD4\u3055\u308C\u307E\u3059\u3002\u6307\u5B9A\u30ED\u30AC\u30FC\u304C\u540D\u524D\u7A7A\u9593\u3067 root Logger \u306E\u5834\u5408\u306F\u3001\u7D50\u679C\u306F\u7A7A\u306E\u6587\u5B57\u5217\u3068\u306A\u308A\u307E\u3059\u3002
logging.logger-name=\u30ED\u30AC\u30FC\u540D
logging.level-name=\u6307\u5B9A\u30ED\u30AC\u30FC\u306B\u8A2D\u5B9A\u3059\u308B\u30EC\u30D9\u30EB\u540D\u3002\u30EC\u30D9\u30EB\u3092\u6700\u3082\u8FD1\u3044\u7956\u5148\u304B\u3089\u7D99\u627F\u3059\u308B\u3088\u3046\u306B\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u308B\u5834\u5408\u306F "undefined"\u3002
