remoting=La configuration du sous-syst\u00E8me distant.
remoting.add=Ajoute le sous-syst\u00E8me distant.
remoting.remove=Supprime le sous-syst\u00E8me distant.
remoting.worker-read-threads=Le nombre de threads de lecture \u00E0 cr\u00E9er pour le worker distant.
remoting.worker-task-core-threads=Le nombre de threads principaux pour le pool de threds du worker distant.
remoting.worker-task-keepalive=Le nombre de millisecondes \u00E0 conserver pour garder les threads non prinicpaux de t\u00E2che de worker distant actifs.
remoting.worker-task-limit=Le nombre maximum de t\u00E2ches de worker remoting \u00E0 autoriser avant la rejection.
remoting.worker-task-max-threads=Le nombre maximum de threads pour le pool de threads du worker distant.
remoting.worker-write-threads=Le nombre de threads d'\u00E9criture \u00E0 cr\u00E9er pour le worker distant.
remoting.connector=Les connecteurs d'appel \u00E0 distance.
connector=La configuration d'un connecteur d'appel \u00E0 distance.
connector.add=Ajout d'un connecteur \u00E0 distance.
connector.remove=Suppression d'un connecteur d'appel \u00E0 distance.
connector.socket-binding=Le nom (ou noms) de liaison(s) de socket o\u00F9 s'attacher.
connector.authentication-provider=L'\u00E9l\u00E9ment "authentication-provider" contient le nom du fournisseur d'authentification \u00E0 utiliser pour les connexions entrantes.
connector.security=Configuration de s\u00E9curit\u00E9 pour ce connecteur.
connector.property=Propri\u00E9t\u00E9s pour configurer davantage le connecteur.
remoting.outbound-connection=Connexions sortantes distantes
outbound-connection=Connexion sortante distante
outbound-connection.add=Ajoute une connexion sortante distante bas\u00E9e URI g\u00E9n\u00E9rique 
outbound-connection.remove=Supprime une connexion sortante distante bas\u00E9e URI g\u00E9n\u00E9rique 
outbound-connection.name=Nom de la connexion sortante.
outbound-connection.uri=L'URI de connexion de la connexion sortante.
outbound-connection.property=Les Options XNIO qui seront utilis\u00E9es lors de la cr\u00E9ation de la connexion.
remoting.remote-outbound-connection=Les connexions sortantes distantes pour le sch\u00E9ma remote\:// URI.
remote-outbound-connection=La connexion sortantes distante pour le sch\u00E9ma implicite remote\:// URI.
remote-outbound-connection.add=Ajoute une connexion sortante bas\u00E9e sch\u00E9ma remote\:// URI 
remote-outbound-connection.remove=Supprime une connexion sortante bas\u00E9e sch\u00E9ma remote\:// URI 
remote-outbound-connection.name=Nom de la connexion sortante bas\u00E9e sch\u00E9ma remote\:// URI 
remote-outbound-connection.outbound-socket-binding-ref=Nom du outbound-socket-binding (liaison de socket sortante) qui sera utilis\u00E9e pour d\u00E9terminer l'adresse et le port de destination pour la connexion.
remote-outbound-connection.username=Le nom d'utilisateur qu'il vous faudra pour vous authentifier aupr\u00E8s du serveur distant.
remote-outbound-connection.security-realm=R\u00E9f\u00E9rence du domaine de s\u00E9curit\u00E9 \u00E0 utiliser pour obtenir le mot de passe et le SSL
remote-outbound-connection.property=Options XNIO qui seront utilis\u00E9es pendant la cr\u00E9ation de la connexion.
remoting.local-outbound-connection=Les connexions sortantes distantes pour le sch\u00E9ma local\:// URI.
local-outbound-connection=La connexion sortantes distante pour le sch\u00E9ma implicite local\:// URI.
local-outbound-connection.add=Ajoute une connexion sortante bas\u00E9e sch\u00E9ma local\:// URI 
local-outbound-connection.remove=Supprime une connexion sortante bas\u00E9e sch\u00E9ma local\:// URI 
local-outbound-connection.name=Nom de la connexion sortante bas\u00E9e sch\u00E9ma local\:// URI 
local-outbound-connection.outbound-socket-binding-ref=Nom du outbound-socket-binding (liaison de socket sortante) qui sera utilis\u00E9e pour d\u00E9terminer l'adresse et le port de destination pour la connexion.
local-outbound-connection.property=Les Options XNIO qui seront utilis\u00E9es lors de la cr\u00E9ation de la connexion.
sasl=L'\u00E9l\u00E9ment "sasl" contient la configuration de l'authentification SASL pour ce connecteur.
sasl.add=Ajoute la configuration d'authentification pour son connecteur
sasl.remove=Supprime la configuration d'authentification pour son connecteur
sasl.include-mechanisms=L'\u00E9l\u00E9ment imbriqu\u00E9 "include-mechanisms" contient une liste blanche de noms de m\u00E9canisme SASL autoris\u00E9s. Aucuns m\u00E9canismes de seront autoris\u00E9s s'ils ne sont pas pr\u00E9sent dans cette liste.
sasl.qop=L'\u00E9l\u00E9ment optionnel imbriqu\u00E9 "qop" contient une liste des valeurs de quality-of-protection qui vont dans un ordre d\u00E9croissant de pr\u00E9f\u00E9rence.
sasl.strength=L'\u00E9l\u00E9ment optionnel imbriqu\u00E9 "strength" contient une liste des valeurs de puissance cipher, qui vont dans un ordre d\u00E9croissant de pr\u00E9f\u00E9rence.
sasl.reuse-session=L'\u00E9l\u00E9ment bool\u00E9en optionnel imbriqu\u00E9 "reuse-session" indique si oui ou non le serveur doit tenter de r\u00E9utiliser les informations de session d\u00E9j\u00E0 authentifi\u00E9es. Le m\u00E9canisme devra ou non supporter un tel recyclage. D'autres facteurs risquent de l'en emp\u00EAcher.
sasl.server-auth=L'\u00E9l\u00E9ment bool\u00E9en optionnel imbriqu\u00E9 "server-auth" indique si le serveur doit tenter d'authentifier le client. Tous les m\u00E9canismes ne supportent pas forc\u00E9ment cette configuration.
sasl.sasl-policy=Indique la politique optionnelle \u00E0 utiliser pour limiter l'ensemble des m\u00E9canismes disponibles.
sasl.property=Propri\u00E9t\u00E9s pour configurer davantage sasl.
policy=La configuration de la politique.
policy.add=Ajoute la politique SASL.
policy.remove=Supprime la politique SASL.
policy.forward-secrecy=L'\u00E9l\u00E9ment facultatif de "forward-secrecy" imbriqu\u00E9e contient une valeur bool\u00E9enne qui sp\u00E9cifie si les m\u00E9canismes qui impl\u00E9mentent forward-secrecy entre les sessions sont n\u00E9cessaires. Forward-secrecy signifie que s'ins\u00E9rer dans une session ne fournira pas automatiquement des informations pour s'ins\u00E9rer dans des sessions futures.
policy.no-active=L'\u00E9l\u00E9ment imbriqu\u00E9 "no-active" contient une valeur bool\u00E9enne qui indique si les m\u00E9canismes susceptibles d'attaques actives (non-dictionary) sont permises. "false" pour autoriser et "true" pour interdire.
policy.no-anonymous=L'\u00E9l\u00E9ment imbriqu\u00E9 "no-anonymous" contient une valeur bool\u00E9enne qui indique si les m\u00E9canismes susceptibles d'accepter un login anonyme sont permises. "false" pour autoriser et "true" pour interdire.
policy.no-dictionary=L'\u00E9l\u00E9ment imbriqu\u00E9 "no-dictionary" contient une valeur bool\u00E9enne qui indique si les m\u00E9canismes susceptibles d'attaques passives sont permises. "false" pour autoriser et "true" pour interdire.
policy.no-plain-text=L'\u00E9l\u00E9ment imbriqu\u00E9 "no-plain-text" contient une valeur bool\u00E9enne qui indique si les m\u00E9canismes susceptibles d'attaques passives simples (c-a-d "PLAIN") ne sont pas permises. "false" pour autoriser et "true" pour interdire.
policy.pass-credentials=L'\u00E9l\u00E9ment imbriqu\u00E9 "pass-credentials" contient une valeur bool\u00E9enne qui indique si les m\u00E9canismes qui passent les informations d'authentification des clients sont permis.
property=Propri\u00E9t\u00E9s support\u00E9es par le fournisseur sous-jacent. Le nom de la propri\u00E9t\u00E9 est inf\u00E9r\u00E9 \u00E0 partir du dernier \u00E9l\u00E9ment de l'adresse de propri\u00E9t\u00E9s.
property.add=Ajoute une propri\u00E9t\u00E9.
property.remove=Supprime une propri\u00E9t\u00E9.
property.value=La valeur de la propri\u00E9t\u00E9.
