remoting=A configura\u00E7\u00E3o do sub-sistema Remoto.
remoting.add=Adiciona o sub-sistema Remoto.
remoting.remove=Remove o sub-sistema Remoto.
remoting.worker-read-threads=O n\u00FAmero de threads de leitra a serem criados para o trabalhador remoto.
remoting.worker-task-core-threads=O n\u00FAmero de threads principais para o pool do thread de trabalho remoto.
remoting.worker-task-keepalive=O n\u00FAmero de mil\u00E9simos de segundos para manter os threads da tarefa do trabalhador remoto n\u00E3o-principal. 
remoting.worker-task-limit=O n\u00FAmero m\u00E1ximo de tarefas do trabalhador remoto a serem permitidas antes da rejei\u00E7\u00E3o.
remoting.worker-task-max-threads=O n\u00FAmero m\u00E1ximo de threads para o pool do thread da tarefa do trabalhador remoto.
remoting.worker-write-threads=O n\u00FAmero de threads de grava\u00E7\u00E3o a serem criados para o trabalhador remoto.
remoting.connector=Os conectores remotos.
connector=A configura\u00E7\u00E3o do conector Remoto.
connector.add=Adiciona o conector Remoto.
connector.remove=Remove o conector remoto.
connector.socket-binding=O nome (ou nomes) do(s) binding(s) do soquete a serem anexados. 
connector.authentication-provider=O elemento "provedor de autentica\u00E7\u00E3o" cont\u00E9m o nome do provedor de autentica\u00E7\u00E3o para uso nas conex\u00F5es de entrada.
connector.security=A configura\u00E7\u00E3o de seguran\u00E7a para esse conector.
connector.property=Propriedades a serem configuradas futuramente ao conector.
remoting.outbound-connection=As conex\u00F5es de sa\u00EDda remotas.
outbound-connection=A conex\u00E3o de sa\u00EDda remota.
outbound-connection.add=Adiciona um URI b\u00E1sico baseado na conex\u00E3o de sa\u00EDda remota.
outbound-connection.remove=Remove a conex\u00E3o de sa\u00EDda remota baseada no URI gen\u00E9rico.
outbound-connection.name=O nome da conex\u00E3o de sa\u00EDda.
outbound-connection.uri=O URI de conex\u00E3o para a conex\u00E3o de sa\u00EDda.
outbound-connection.property=As Op\u00E7\u00F5es XNIO que ser\u00E3o usadas durante a cria\u00E7\u00E3o da conex\u00E3o.
remoting.remote-outbound-connection=As conex\u00F5es de sa\u00EDda remotas para o esquema remote\:// URI.
remote-outbound-connection=A conex\u00E3o de sa\u00EDda remota com o esquemaremote\:// URI impl\u00EDcito. 
remote-outbound-connection.add=Adiciona um esquema remote\:// URI baseado na conex\u00E3o de sa\u00EDda.
remote-outbound-connection.remove=Remove um esquema remote\:// URI baseado na conex\u00E3o de sa\u00EDda.
remote-outbound-connection.name=O nome do esquema remote\:// URI baseado na conex\u00E3o de sa\u00EDda.
remote-outbound-connection.outbound-socket-binding-ref=O nome do binding do soquete de sa\u00EDda que ser\u00E1 usado para determinar o endere\u00E7o de destino e a porta para a conex\u00E3o.
remote-outbound-connection.username=O nome do usu\u00E1rio para uso quando autenticando em rela\u00E7\u00E3o ao servidor remoto.
remote-outbound-connection.security-realm=A refer\u00EAncia ao realm de seguran\u00E7a a ser usado para obter a senha e a configura\u00E7\u00E3o SSL.
remote-outbound-connection.property=As Op\u00E7\u00F5es XNIO que ser\u00E3o usadas durante a cria\u00E7\u00E3o da conex\u00E3o.
remoting.local-outbound-connection=As conex\u00F5es de sa\u00EDda remotas para o esquema local.
local-outbound-connection=A conex\u00E3o de sa\u00EDda remota com o esquema local\:// URI impl\u00EDcito.
local-outbound-connection.add=Adiciona o esquema local\:// URI baseado na conex\u00E3o de sa\u00EDda.
local-outbound-connection.remove=Remove o esquema local\:// URI baseado na conex\u00E3o de sa\u00EDda.
local-outbound-connection.name=O nome do esquema local\:// URI baseado na conex\u00E3o de sa\u00EDda.
local-outbound-connection.outbound-socket-binding-ref=O nome do binding do soquete de sa\u00EDda que ser\u00E1 usado para determinar o endere\u00E7o de destino e a porta para a conex\u00E3o.
local-outbound-connection.property=As Op\u00E7\u00F5es XNIO que ser\u00E3o usadas durante a cria\u00E7\u00E3o da conex\u00E3o.
sasl=O elemento "sasl" cont\u00E9m a configura\u00E7\u00E3o da autentica\u00E7\u00E3o SASL para esse conector.
sasl.add=Adiciona a configura\u00E7\u00E3o da autentica\u00E7\u00E3o SASL para o pr\u00F3prio conector.
sasl.remove=Remove a configura\u00E7\u00E3o da autentica\u00E7\u00E3o SASL para o pr\u00F3prio conector.
sasl.include-mechanisms=O elemento "incluir mecanismos" cont\u00E9m uma lista de nomes do mecanismo SASL permitidos. N\u00E3o ser\u00E3o permitido os mecanismos ausentes desta lista. 
sasl.qop=O elemento "qop" opcional cont\u00E9m uma lista de valores de qualidade de prote\u00E7\u00E3o, em ordem decrescente.
sasl.strength=O elemento "potente" aninhado opcional cont\u00E9m a lista de valores potentes de criptografia, em ordem decrescente.
sasl.reuse-session=O elemento opcional boolean "re-utilizar a sess\u00E3o" aninhado especifica se \u00E9 que o servidor deve tentar reutilizar a informa\u00E7\u00E3o da sess\u00E3o autenticada anteriormente. O mecanismo pode ou n\u00E3o suportar tal re-utiliza\u00E7\u00E3o, al\u00E9m de outros fatores poderem prevenir isto tamb\u00E9m.
sasl.server-auth=O elemento opcional boolean "autenticar o servidor" aninhado especifica se \u00E9 que o servidor deve ser autenticado ao cliente. Nem todos os mecanismos podem suportar esta autentica\u00E7\u00E3o.
sasl.sasl-policy=Especifica a pol\u00EDtica opcional de uso para entendimento do conjunto dispon\u00EDvel de mecanismos.
sasl.property=As propriedades a configurarem futuramente o sasl.
policy=A configura\u00E7\u00E3o da pol\u00EDtica.
policy.add=Adiciona a pol\u00EDtica SASL.
policy.remove=Remove a pol\u00EDtica SASL.
policy.forward-secrecy=O elemento "enviar em segredo" aninhado cont\u00E9m um valor booliano que especifica se os mecanismos que implantam o envio secreto entre as sess\u00F5es s\u00E3o necess\u00E1rios. O envio secreto significa que invadir uma sess\u00E3o n\u00E3o fornecer\u00E1 automaticamente informa\u00E7\u00E3o para invas\u00E3o em sess\u00F5es futuras.
policy.no-active=O elemento "n\u00E3o-ativo" opcional cont\u00E9m um valor booliano que especifica se mecanismos suscet\u00EDveis \u00E0 ataques ativos (n\u00E3o-dicion\u00E1rio) n\u00E3o s\u00E3o permitidos. "Falso" para permiss\u00E3o e "verdadeiro" para rejeitar.
policy.no-anonymous=O elemento "n\u00E3o-an\u00F4nimo" aninhado cont\u00E9m um valor booliano que especifica se os mecanismos que aceitam os logon an\u00F4nimo s\u00E3o permitidos.
policy.no-dictionary=O elemento opcional "n\u00E3o-dicion\u00E1rio" aninhado cont\u00E9m um valor booliano que especifica se os mecanismos s\u00E3o suscet\u00EDveis aos ataques do dicion\u00E1rio passivo s\u00E3o permitidos. "Falso" para permiss\u00E3o, "verdadeiro" para rejei\u00E7\u00E3o.
policy.no-plain-text=O elemento opcional "sem texto plano" aninhado cont\u00E9m um valor booliano que especifica se \u00E9 que os mecanismos suscet\u00EDveis aos ataques passivos planos simples (ex.\: "PLANO") n\u00E3o s\u00E3o permitidos. "Falso" para permiss\u00E3o, "veradeiro" para rejei\u00E7\u00E3o.
policy.pass-credentials=O elemento opcional "passar credenciais" aninhado cont\u00E9m um valor booliano que especifica se os mecanismos que passam as credenciais ao cliente s\u00E3o requeridos.
property=As propriedades suportadas pelo provedor subjacente. O nome da propriedade \u00E9 inferido ao \u00FAltimo elemento do endere\u00E7o das propriedades.
property.add=Adiciona a propriedade.
property.remove=Remove a propriedade.
property.value=O valor da propriedade.
