remoting=La configuraci\u00F3n del sub-sistema remoto.
remoting.add=Agrega el sub-sistema remoto. 
remoting.remove=Borra el sub-sistema remoto. 
remoting.worker-read-threads=El n\u00FAmero de hilos que tiene a crear para el trabajador remoto.
remoting.worker-task-core-threads=El n\u00FAmero de hilos de n\u00FAcleo para el grupo de hilos de tareas de trabajador remoto.
remoting.worker-task-keepalive=El n\u00FAmero de mili-segundos para guardar los hilos vivos  de tareas de trabajador remoto que no est\u00E1n en el n\u00FAcleo.
remoting.worker-task-limit=El n\u00FAmero m\u00E1ximo de tareas de trabajador remoto a aceptar antes de rechazar. 
remoting.worker-task-max-threads=El n\u00FAmero m\u00E1ximo de hilos para grupos de hilos de tareas de trabajador remoto.
remoting.worker-write-threads=El n\u00FAmero de hilos de escritura a crear para el trabajador remoto.
remoting.connector=Los conectores remotos.
connector=La configuraci\u00F3n de un conector remoto.
connector.add=Agrega un conector remoto.
connector.remove=Borra un conector remoto.
connector.socket-binding=El nombre (o nombres)  de enlace(s) de sockets a conectar.
connector.authentication-provider=El elemento"authentication-provider" contiene el nombre del proveedor de autenticaci\u00F3n a usar para conexiones entrantes. 
connector.security=Configuraci\u00F3n de seguridad para un conector remoto.
connector.property=Propiedades para seguir configurando el conector.
remoting.outbound-connection=Conexiones salientes remotas.
outbound-connection=Conexi\u00F3n saliente remota.
outbound-connection.add=A\u00F1ade una conexi\u00F3n saliente remota  gen\u00E9rica basada  en URI. 
outbound-connection.remove=Borra una conexi\u00F3n saliente remota  gen\u00E9rica basada  en URI.
outbound-connection.name=Nombre de la conexi\u00F3n saliente.
outbound-connection.uri=La URI de conexi\u00F3n para la conexi\u00F3n saliente.
outbound-connection.property=Opciones XNIO que ser\u00E1n utilizadas durante la conexi\u00F3n.
remoting.remote-outbound-connection=Conexiones salientes remotas para remote\:// URI scheme.
remote-outbound-connection=Conexiones salientes remotas con un remote\:// URI scheme impl\u00EDcito.
remote-outbound-connection.add=A\u00F1ade un remote\:// URI scheme basado en conexi\u00F3n saliente. 
remote-outbound-connection.remove=Borra un remote\:// URI scheme basado en conexi\u00F3n saliente. 
remote-outbound-connection.name=Nombre de un remote\:// URI scheme basado en conexi\u00F3n saliente. 
remote-outbound-connection.outbound-socket-binding-ref=El nombre del enlace de socket saliente que se utilizar\u00E1 para determinar la direcci\u00F3n de destino y puerto para la conexi\u00F3n.
remote-outbound-connection.username=El nombre de usuario a utilizar con este servidor remoto.
remote-outbound-connection.security-realm=Referencia a los l\u00EDmites de seguridad a usar para obtener la contrase\u00F1a y configuraci\u00F3n SSL.
remote-outbound-connection.property=Opciones XNIO que ser\u00E1n utilizadas durante la conexi\u00F3n.
remoting.local-outbound-connection=Conexiones salientes remotas para local\:// URI scheme.
local-outbound-connection=Conexiones salientes remotas con un local\:// URI scheme impl\u00EDcito.
local-outbound-connection.add=A\u00F1ade un local\:// URI scheme basado en conexi\u00F3n saliente. 
local-outbound-connection.remove=Borra un local\:// URI scheme basado en conexi\u00F3n saliente. 
local-outbound-connection.name=Nombre de un local\:// URI scheme basado en conexi\u00F3n saliente. 
local-outbound-connection.outbound-socket-binding-ref=El nombre del enlace de socket saliente que se utilizar\u00E1 para determinar la direcci\u00F3n de destino y puerto para la conexi\u00F3n.
local-outbound-connection.property=Opciones XNIO que ser\u00E1n utilizadas durante la conexi\u00F3n.
sasl=El elemento "sasl" contiene configuraci\u00F3n de autenticaci\u00F3n SASL para este conector.
sasl.add=A\u00F1ade la configuraci\u00F3n de autenticaci\u00F3n SASL para este conector.
sasl.remove=Borra la configuraci\u00F3n de autenticaci\u00F3n SASL para este conector.
sasl.include-mechanisms=El elemento opcional anidado  "include-mechanisms" contiene una lista blanca de los nombres de mecanismos autorizados. No ser\u00E1 autorizado ning\u00FAn mecanismo que no este presente en la lista.
sasl.qop=El elemento opcional anidado "qop" contiene una lista de valores de protecci\u00F3n de cualidad, en orden descendente. 
sasl.strength=El elemento opcional anidado "strength" contiene una lista de valores de fortaleza de cifras, en orden de preferencia. 
sasl.reuse-session=El elemento opcional anidado  "reuse-sesion" especifica si el servidor debe intentar reutilizar o no la informaci\u00F3n de sesi\u00F3n autenticada previamente. El mecanismo puede o no soportar tal reutilizaci\u00F3n, y otros factores pueden evitarlo.
sasl.server-auth=El elemento opcional anidado del elemento boolean  "server-auth" especifica  si el servidor debe autenticar al cliente. No todos los mecanismos pueden soportar esta configuraci\u00F3n.
sasl.sasl-policy=Especifica una pol\u00EDtica opcional a usar para disminuir el conjunto de mecanismos disponibles. 
sasl.property=Propiedades para seguir configurando SASL.
policy=La configuraci\u00F3n de pol\u00EDtica.
policy.add=A\u00F1ade la pol\u00EDtica SASL.
policy.remove=Borra la pol\u00EDtica SASL.
policy.forward-secrecy=El elemento opcional anidado "forward-secrecy" contiene un valor boolean que especifica  si se requieren los mecanismos que implementan m\u00E1s secrecy. 'Forward secrecy' significa que al entrar a una sesi\u00F3n no  proporcionar\u00E1 informaci\u00F3n para ingresar a siguientes sesiones. 
policy.no-active=El elemento opcional anidado "no-active" contiene un valor boolean que especifica  si los mecanismos susceptibles a ataques activos (no de diccionario) no est\u00E1n permitidos.  "false" para permitir, "true" para negar. 
policy.no-anonymous=El elemento opcional anidado "no-anonymous" contiene un valor boolean que especifica  si los mecanismos que aceptan un ingreso an\u00F3nimo est\u00E1n permitidos.  "false" para permitir, "true" para negar. 
policy.no-dictionary=El elemento opcional anidado "no-dictionary" contiene un valor boolean que especifica  si los mecanismos susceptibles a ataques pasivos de diccionario est\u00E1n permitidos.  "false" para permitir, "true" para negar. 
policy.no-plain-text=El elemento opcional anidado "no-plain-text" contiene un valor boolean que especifica  si los mecanismos susceptibles a ataques pasivos en texto plano (por ejemplo, "PLAIN") no est\u00E1n permitidos.  "false" para permitir, "true" para negar. 
policy.pass-credentials=El elemento opcional anidado "pass-anonymous" contiene un valor boolean que especifica si se requieren o no los mecanismos que pasan credenciales de clientes. 
property=Propiedades soportadas por el proveedor subyacente. El nombre de propiedad se infiere del \u00FAltimo elemento de la direcci\u00F3n de propiedades.
property.add=A\u00F1ade una propiedad.
property.remove=Borra una propiedad.
property.value=El valor de la propiedad
