remoting=\u30EA\u30E2\u30FC\u30C6\u30A3\u30F3\u30B0\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u306E\u8A2D\u5B9A
remoting.add=\u30EA\u30E2\u30FC\u30C6\u30A3\u30F3\u30B0\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u306E\u8FFD\u52A0
remoting.remove=\u30EA\u30E2\u30FC\u30C6\u30A3\u30F3\u30B0\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u306E\u524A\u9664
remoting.worker-read-threads=\u30EA\u30E2\u30FC\u30C6\u30A3\u30F3\u30B0\u30EF\u30FC\u30AB\u30FC\u5411\u3051\u306B\u4F5C\u6210\u3055\u308C\u305F read \u30B9\u30EC\u30C3\u30C9\u6570
remoting.worker-task-core-threads=\u30EA\u30E2\u30FC\u30C6\u30A3\u30F3\u30B0\u30EF\u30FC\u30AB\u30FC\u30BF\u30B9\u30AF\u306E\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u306B\u5BFE\u3059\u308B\u30B3\u30A2\u30B9\u30EC\u30C3\u30C9\u6570
remoting.worker-task-keepalive=\u30B3\u30A2\u4EE5\u5916\u306E\u30EA\u30E2\u30FC\u30C6\u30A3\u30F3\u30B0\u30EF\u30FC\u30AB\u30FC\u30BF\u30B9\u30AF\u306E\u30B9\u30EC\u30C3\u30C9\u3092\u7DAD\u6301\u3059\u308B\u6642\u9593 (\u30DF\u30EA\u79D2)
remoting.worker-task-limit=\u62D2\u5426\u3055\u308C\u308B\u307E\u3067\u5229\u7528\u53EF\u80FD\u306A\u30EA\u30E2\u30FC\u30C6\u30A3\u30F3\u30B0\u30EF\u30FC\u30AB\u30FC\u30BF\u30B9\u30AF\u306E\u6700\u5927\u6570
remoting.worker-task-max-threads=\u30EA\u30E2\u30FC\u30C6\u30A3\u30F3\u30B0\u30EF\u30FC\u30AB\u30FC\u30BF\u30B9\u30AF\u306E\u30B9\u30EC\u30C3\u30C9\u30D7\u30FC\u30EB\u306B\u5BFE\u3059\u308B\u30B9\u30EC\u30C3\u30C9\u306E\u6700\u5927\u6570
remoting.worker-write-threads=\u30EA\u30E2\u30FC\u30C6\u30A3\u30F3\u30B0\u30EF\u30FC\u30AB\u30FC\u5411\u3051\u306B\u4F5C\u6210\u3059\u308B\u66F8\u304D\u8FBC\u307F\u30B9\u30EC\u30C3\u30C9\u6570
remoting.connector=\u30EA\u30E2\u30FC\u30C6\u30A3\u30F3\u30B0\u30B3\u30CD\u30AF\u30BF\u30FC
connector=\u30EA\u30E2\u30FC\u30C6\u30A3\u30F3\u30B0\u30B3\u30CD\u30AF\u30BF\u30FC\u306E\u8A2D\u5B9A
connector.add=\u30EA\u30E2\u30FC\u30C6\u30A3\u30F3\u30B0\u30B3\u30CD\u30AF\u30BF\u30FC\u306E\u8FFD\u52A0
connector.remove=\u30EA\u30E2\u30FC\u30C6\u30A3\u30F3\u30B0\u30B3\u30CD\u30AF\u30BF\u30FC\u306E\u524A\u9664
connector.socket-binding=\u63A5\u7D9A\u5148\u306E\u30BD\u30B1\u30C3\u30C8\u30D0\u30A4\u30F3\u30C7\u30A3\u30F3\u30B0\u540D (\u8907\u6570\u53EF)
connector.authentication-provider="authentication-provider" \u8981\u7D20\u306B\u306F\u3001\u53D7\u4FE1\u63A5\u7D9A\u306B\u5229\u7528\u3059\u308B\u8A8D\u8A3C\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306E\u540D\u524D\u304C\u542B\u307E\u308C\u3066\u3044\u307E\u3059\u3002
connector.security=\u3053\u306E\u30B3\u30CD\u30AF\u30BF\u30FC\u306E\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u8A2D\u5B9A
connector.property=\u30B3\u30CD\u30AF\u30BF\u30FC\u3092\u8A73\u7D30\u8A2D\u5B9A\u3059\u308B\u305F\u3081\u306E\u30D7\u30ED\u30D1\u30C6\u30A3
remoting.outbound-connection=\u30A2\u30A6\u30C8\u30D0\u30A6\u30F3\u30C9\u63A5\u7D9A\u306E\u30EA\u30E2\u30FC\u30C6\u30A3\u30F3\u30B0
outbound-connection=\u30A2\u30A6\u30C8\u30D0\u30A6\u30F3\u30C9\u63A5\u7D9A\u306E\u30EA\u30E2\u30FC\u30C6\u30A3\u30F3\u30B0
outbound-connection.add=\u6C4E\u7528 URI \u30D9\u30FC\u30B9\u306E\u30EA\u30E2\u30FC\u30C6\u30A3\u30F3\u30B0\u30A2\u30A6\u30C8\u30D0\u30A6\u30F3\u30C9\u63A5\u7D9A\u3092\u8FFD\u52A0
outbound-connection.remove=\u6C4E\u7528 URI \u30D9\u30FC\u30B9\u306E\u30EA\u30E2\u30FC\u30C6\u30A3\u30F3\u30B0\u30A2\u30A6\u30C8\u30D0\u30A6\u30F3\u30C9\u63A5\u7D9A\u3092\u524A\u9664
outbound-connection.name=\u30A2\u30A6\u30C8\u30D0\u30A6\u30F3\u30C9\u63A5\u7D9A\u540D
outbound-connection.uri=\u30A2\u30A6\u30C8\u30D0\u30A6\u30F3\u30C9\u63A5\u7D9A\u5411\u3051\u306E\u63A5\u7D9A URI
outbound-connection.property=\u63A5\u7D9A\u4F5C\u6210\u6642\u306B\u5229\u7528\u3059\u308B XNIO \u30AA\u30D7\u30B7\u30E7\u30F3
remoting.remote-outbound-connection=remote\:// URI scheme \u5411\u3051\u306E\u30EA\u30E2\u30FC\u30C6\u30A3\u30F3\u30B0\u30A2\u30A6\u30C8\u30D0\u30A6\u30F3\u30C9\u63A5\u7D9A
remote-outbound-connection=\u6697\u9ED9\u7684\u306A remote\:// URI scheme \u3092\u6301\u3064\u30EA\u30E2\u30FC\u30C6\u30A3\u30F3\u30B0\u30A2\u30A6\u30C8\u30D0\u30A6\u30F3\u30C9\u63A5\u7D9A
remote-outbound-connection.add=remote\:// URI scheme \u30D9\u30FC\u30B9\u306E\u30A2\u30A6\u30C8\u30D0\u30A6\u30F3\u30C9\u63A5\u7D9A\u3092\u8FFD\u52A0
remote-outbound-connection.remove=remote\:// URI scheme \u30D9\u30FC\u30B9\u306E\u30A2\u30A6\u30C8\u30D0\u30A6\u30F3\u30C9\u63A5\u7D9A\u3092\u524A\u9664
remote-outbound-connection.name=remote\:// URI scheme \u30D9\u30FC\u30B9\u306E\u30A2\u30A6\u30C8\u30D0\u30A6\u30F3\u30C9\u63A5\u7D9A\u306E\u540D\u524D
remote-outbound-connection.outbound-socket-binding-ref=outbound-socket-binding \u540D\u3067\u3001\u63A5\u7D9A\u306E\u3042\u3066\u5148\u30A2\u30C9\u30EC\u30B9\u3068\u30DD\u30FC\u30C8\u3092\u6C7A\u5B9A\u3059\u308B\u969B\u306B\u5229\u7528\u3057\u307E\u3059\u3002
remote-outbound-connection.username=\u30EA\u30E2\u30FC\u30C8\u30B5\u30FC\u30D0\u30FC\u3068\u8A8D\u8A3C\u3092\u884C\u3046\u969B\u306B\u5229\u7528\u3059\u308B\u30E6\u30FC\u30B6\u30FC\u540D
remote-outbound-connection.security-realm=\u30D1\u30B9\u30EF\u30FC\u30C9\u3068 SSL \u8A2D\u5B9A\u3092\u53D6\u5F97\u3059\u308B\u969B\u306B\u5229\u7528\u3059\u308B\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30EC\u30EB\u30E0\u3078\u306E\u53C2\u7167
remote-outbound-connection.property=\u63A5\u7D9A\u4F5C\u6210\u6642\u306B\u5229\u7528\u3059\u308B XNIO \u30AA\u30D7\u30B7\u30E7\u30F3
remoting.local-outbound-connection=local\:// URI scheme \u5411\u3051\u306E\u30EA\u30E2\u30FC\u30C6\u30A3\u30F3\u30B0\u30A2\u30A6\u30C8\u30D0\u30A6\u30F3\u30C9\u63A5\u7D9A
local-outbound-connection=\u6697\u9ED9\u7684\u306A local\:// URI scheme \u3092\u6301\u3064\u30EA\u30E2\u30FC\u30C6\u30A3\u30F3\u30B0\u30A2\u30A6\u30C8\u30D0\u30A6\u30F3\u30C9\u63A5\u7D9A
local-outbound-connection.add=local\:// URI scheme \u30D9\u30FC\u30B9\u306E\u30A2\u30A6\u30C8\u30D0\u30A6\u30F3\u30C9\u63A5\u7D9A\u3092\u8FFD\u52A0
local-outbound-connection.remove=local\:// URI scheme \u30D9\u30FC\u30B9\u306E\u30A2\u30A6\u30C8\u30D0\u30A6\u30F3\u30C9\u63A5\u7D9A\u3092\u524A\u9664
local-outbound-connection.name=local\:// URI scheme \u30D9\u30FC\u30B9\u306E\u30A2\u30A6\u30C8\u30D0\u30A6\u30F3\u30C9\u63A5\u7D9A\u306E\u540D\u524D
local-outbound-connection.outbound-socket-binding-ref=outbound-socket-binding \u540D\u3067\u3001\u63A5\u7D9A\u306E\u3042\u3066\u5148\u30A2\u30C9\u30EC\u30B9\u3068\u30DD\u30FC\u30C8\u3092\u6C7A\u5B9A\u3059\u308B\u969B\u306B\u5229\u7528\u3057\u307E\u3059\u3002
local-outbound-connection.property=\u63A5\u7D9A\u4F5C\u6210\u6642\u306B\u5229\u7528\u3059\u308B XNIO \u30AA\u30D7\u30B7\u30E7\u30F3
sasl="sasl" \u8981\u7D20\u306B\u306F\u3053\u306E\u30B3\u30CD\u30AF\u30BF\u30FC\u306B\u5BFE\u3059\u308B SASL \u8A8D\u8A3C\u8A2D\u5B9A\u304C\u542B\u307E\u308C\u3066\u3044\u307E\u3059\u3002
sasl.add=\u30B3\u30CD\u30AF\u30BF\u30FC\u306E SASL \u8A8D\u8A3C\u8A2D\u5B9A\u3092\u8FFD\u52A0
sasl.remove=\u30B3\u30CD\u30AF\u30BF\u30FC\u306E SASL \u8A8D\u8A3C\u8A2D\u5B9A\u3092\u524A\u9664
sasl.include-mechanisms=\u30AA\u30D7\u30B7\u30E7\u30F3\u306E\u30CD\u30B9\u30C8\u5316\u3055\u308C\u305F "include-mechanisms" \u8981\u7D20\u306B\u306F\u3001\u8A31\u53EF\u3055\u308C\u305F SASL \u30E1\u30AB\u30CB\u30BA\u30E0\u306E\u540D\u524D\u306E\u30DB\u30EF\u30A4\u30C8\u30EA\u30B9\u30C8\u304C\u542B\u307E\u308C\u3066\u3044\u307E\u3059\u3002\u3053\u306E\u4E00\u89A7\u306B\u5B58\u5728\u3057\u306A\u3044\u30E1\u30AB\u30CB\u30BA\u30E0\u306F\u8A31\u53EF\u3055\u308C\u307E\u305B\u3093\u3002
sasl.qop=\u30AA\u30D7\u30B7\u30E7\u30F3\u306E\u30CD\u30B9\u30C8\u5316\u3055\u308C\u305F "qop" \u8981\u7D20\u306B\u306F\u512A\u5148\u50BE\u5411\u306E\u9AD8\u3044\u3082\u306E\u304B\u3089\u9806\u306B\u4E26\u3079\u305F quality-of-protection \u5024\u306E\u4E00\u89A7\u304C\u542B\u307E\u308C\u307E\u3059\u3002
sasl.strength=\u30AA\u30D7\u30B7\u30E7\u30F3\u306E\u30CD\u30B9\u30C8\u5316\u3055\u308C\u305F "strength" \u8981\u7D20\u306B\u306F\u512A\u5148\u50BE\u5411\u306E\u9AD8\u3044\u3082\u306E\u304B\u3089\u9806\u306B\u4E26\u3079\u305F\u6697\u53F7\u5F37\u5EA6\u306E\u5024\u306E\u4E00\u89A7\u304C\u542B\u307E\u308C\u307E\u3059\u3002
sasl.reuse-session=\u30AA\u30D7\u30B7\u30E7\u30F3\u306E\u30CD\u30B9\u30C8\u5316\u3055\u308C\u305F "reuse-session" boolean \u8981\u7D20\u306F\u3001\u30B5\u30FC\u30D0\u30FC\u304C\u4EE5\u524D\u306B\u8A8D\u8A3C\u6E08\u307F\u306E\u30BB\u30C3\u30B7\u30E7\u30F3\u60C5\u5831\u3092\u518D\u5229\u7528\u3059\u3079\u304D\u304B\u3069\u3046\u304B\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002\u3053\u306E\u30E1\u30AB\u30CB\u30BA\u30E0\u306F\u3053\u306E\u3088\u3046\u306A\u518D\u5229\u7528\u3092\u30B5\u30DD\u30FC\u30C8\u3059\u308B\u5834\u5408\u3082\u305D\u3046\u3067\u306A\u3044\u5834\u5408\u3082\u3042\u308A\u3001\u4ED6\u306E\u8981\u56E0\u306B\u3088\u308A\u6A5F\u80FD\u3057\u306A\u3044\u5834\u5408\u3082\u3042\u308A\u307E\u3059\u3002
sasl.server-auth=\u30AA\u30D7\u30B7\u30E7\u30F3\u306E\u30CD\u30B9\u30C8\u5316\u3055\u308C\u305F "server-auth" boolean \u8981\u7D20\u306F\u3001\u30B5\u30FC\u30D0\u30FC\u304C\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u3078\u306E\u8A8D\u8A3C\u3092\u884C\u3046\u3079\u304D\u304B\u6307\u5B9A\u3057\u307E\u3059\u3002\u5168\u30E1\u30AB\u30CB\u30BA\u30E0\u304C\u3053\u306E\u8A2D\u5B9A\u306B\u5BFE\u5FDC\u3059\u308B\u308F\u3051\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3002
sasl.sasl-policy=\u5229\u7528\u53EF\u80FD\u306A\u30E1\u30AB\u30CB\u30BA\u30E0\u3092\u7D5E\u308A\u8FBC\u3080\u969B\u306B\u5229\u7528\u3059\u308B\u30AA\u30D7\u30B7\u30E7\u30F3\u306E\u30DD\u30EA\u30B7\u30FC\u3092\u6307\u5B9A\u3057\u307E\u3059\u3002
sasl.property=sasl \u3092\u8A73\u7D30\u8A2D\u5B9A\u3059\u308B\u305F\u3081\u306E\u30D7\u30ED\u30D1\u30C6\u30A3
policy=\u30DD\u30EA\u30B7\u30FC\u8A2D\u5B9A
policy.add=SASL \u30DD\u30EA\u30B7\u30FC\u306E\u8FFD\u52A0
policy.remove=SASL \u30DD\u30EA\u30B7\u30FC\u306E\u524A\u9664
policy.forward-secrecy=\u30AA\u30D7\u30B7\u30E7\u30F3\u306E\u30CD\u30B9\u30C8\u5316\u3055\u308C\u305F "forward-secrecy" \u8981\u7D20\u306B\u306F\u3001\u30BB\u30C3\u30B7\u30E7\u30F3\u9593\u306E forward secrecy \u3092\u5B9F\u88C5\u3059\u308B\u30E1\u30AB\u30CB\u30BA\u30E0\u3092\u5FC5\u8981\u3068\u3059\u308B\u304B\u5426\u304B\u3092\u6307\u5B9A\u3059\u308Bboolean \u5024\u304C\u542B\u307E\u308C\u3066\u3044\u307E\u3059\u3002Forward Secrecy \u3067\u306F\u30011\u3064\u306E\u30BB\u30C3\u30B7\u30E7\u30F3\u306B\u4FB5\u5165\u3057\u3066\u3082\u3001\u4ECA\u5F8C\u306E\u30BB\u30C3\u30B7\u30E7\u30F3\u306B\u3082\u4FB5\u5165\u3059\u308B\u305F\u3081\u306E\u60C5\u5831\u3092\u81EA\u52D5\u3067\u63D0\u4F9B\u3055\u308C\u308B\u308F\u3051\u3067\u306F\u3042\u308A\u307E\u305B\u3093\u3002
policy.no-active=\u30AA\u30D7\u30B7\u30E7\u30F3\u306E\u30CD\u30B9\u30C8\u5316\u3055\u308C\u305F "no-active" \u8981\u7D20\u306B\u306F\u3001\u80FD\u52D5\u653B\u6483 (\u8F9E\u66F8\u653B\u6483\u4EE5\u5916) \u306E\u5F71\u97FF\u3092\u53D7\u3051\u308B\u30E1\u30AB\u30CB\u30BA\u30E0\u3092\u8A31\u53EF\u3059\u308B\u304B\u3092\u6307\u5B9A\u3059\u308B boolean \u5024\u304C\u542B\u307E\u308C\u3066\u3044\u307E\u3059\u3002"false" \u306F\u8A31\u53EF\u3001"true"\u3000\u306F\u5374\u4E0B\u3067\u3059\u3002
policy.no-anonymous=\u30AA\u30D7\u30B7\u30E7\u30F3\u306E\u30CD\u30B9\u30C8\u5316\u3055\u308C\u305F "no-anonymous" \u8981\u7D20\u306B\u306F\u3001\u533F\u540D\u30ED\u30B0\u30A4\u30F3\u3092\u53D7\u3051\u5165\u308C\u308B\u30E1\u30AB\u30CB\u30BA\u30E0\u3092\u5229\u7528\u53EF\u80FD\u304B\u3069\u3046\u304B\u3092\u6307\u5B9A\u3059\u308B boolean \u5024\u304C\u542B\u307E\u308C\u3066\u3044\u307E\u3059\u3002"false" \u306F\u8A31\u53EF\u3001"true"\u3000\u306F\u5374\u4E0B\u3067\u3059\u3002
policy.no-dictionary=\u30AA\u30D7\u30B7\u30E7\u30F3\u306E\u30CD\u30B9\u30C8\u5316\u3055\u308C\u305F "no-dictionary" \u8981\u7D20\u306B\u306F\u3001\u53D7\u52D5\u8F9E\u66F8\u653B\u6483\u306E\u5F71\u97FF\u3092\u53D7\u3051\u308B\u30E1\u30AB\u30CB\u30BA\u30E0\u3092\u8A31\u53EF\u3059\u308B\u304B\u3092\u6307\u5B9A\u3059\u308B boolean \u5024\u304C\u542B\u307E\u308C\u3066\u3044\u307E\u3059\u3002"false" \u306F\u8A31\u53EF\u3001"true"\u3000\u306F\u5374\u4E0B\u3067\u3059\u3002
policy.no-plain-text=\u30AA\u30D7\u30B7\u30E7\u30F3\u306E\u30CD\u30B9\u30C8\u5316\u3055\u308C\u305F "no-plain-text" \u8981\u7D20\u306B\u306F\u3001\u5E73\u6587\u306E\u53D7\u52D5\u653B\u6483 (\u4F8B\uFF1A "PLAIN") \u306E\u5F71\u97FF\u3092\u53D7\u3051\u308B\u30E1\u30AB\u30CB\u30BA\u30E0\u3092\u8A31\u53EF\u3059\u308B\u304B\u3092\u6307\u5B9A\u3059\u308B boolean \u5024\u304C\u542B\u307E\u308C\u3066\u3044\u307E\u3059\u3002"false" \u306F\u8A31\u53EF\u3001"true"\u3000\u306F\u5374\u4E0B\u3067\u3059\u3002
policy.pass-credentials=\u30AA\u30D7\u30B7\u30E7\u30F3\u306E\u30CD\u30B9\u30C8\u5316\u3055\u308C\u305F "pass-credentials" \u8981\u7D20\u306B\u306F\u3001\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306E\u8A8D\u8A3C\u60C5\u5831\u3092\u6E21\u3059\u30E1\u30AB\u30CB\u30BA\u30E0\u304C\u5FC5\u8981\u304B\u3069\u3046\u304B\u6307\u5B9A\u3059\u308B boolean \u5024\u304C\u542B\u307E\u308C\u3066\u3044\u307E\u3059\u3002
property=\u57FA\u76E4\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u304C\u30B5\u30DD\u30FC\u30C8\u3059\u308B\u30D7\u30ED\u30D1\u30C6\u30A3\u3002\u30D7\u30ED\u30D1\u30C6\u30A3\u540D\u306F\u30D7\u30ED\u30D1\u30C6\u30A3\u30A2\u30C9\u30EC\u30B9\u306E\u6700\u5F8C\u306E\u8981\u7D20\u304B\u3089\u63A8\u6E2C\u3055\u308C\u307E\u3059\u3002
property.add=\u30D7\u30ED\u30D1\u30C6\u30A3\u306E\u8FFD\u52A0
property.remove=\u30D7\u30ED\u30D1\u30C6\u30A3\u306E\u524A\u9664
property.value=\u30D7\u30ED\u30D1\u30C6\u30A3\u5024
