remoting=Die Konfiguration des Remoting-Untersystems.
remoting.add=F\u00FCgt das Remoting-Untersystem hinzu.
remoting.remove=Entfernt das Remoting-Untersystem.
remoting.worker-read-threads=Die Anzahl von "read"-Threads zum Erstellen f\u00FCr den Remoting-Worker.
remoting.worker-task-core-threads=Die Anzahl von Core-Threads f\u00FCr den Remoting Worker-Task Thread-Pool.
remoting.worker-task-keepalive=Die Anzahl von Millisekunden, die nicht-Core Remoting Worker-Task-Threads aktiv gehalten werden.
remoting.worker-task-limit=Die maximale Anzahl der zul\u00E4ssigen Remoting Worker-Tasks, bevor abgelehnt wird.
remoting.worker-task-max-threads=Die maximale Anzahl von Threads f\u00FCr den Remoting Worker-Task Thread-Pool.
remoting.worker-write-threads=Die Anzahl der zu erstellenden "write"-Threads f\u00FCr den Remoting-Worker.
remoting.connector=Die Remoting-Connectors
connector=Die Konfiguration eines Remoting-Connectors.
connector.add=F\u00FCgt einen Remoting-Connector hinzu.
connector.remove=Entfernt einen Remoting-Connector.
connector.socket-binding=Der Name (oder die Namen) der Socket-Binding(s), mit denen verbunden werden soll. 
connector.authentication-provider=Das "authentication-provider" Element enth\u00E4lt den Namen des Authentifizierungs-Providers, der f\u00FCr eingehende Verbindungen zu verwenden ist.
connector.security=Konfiguration der Sicherheit f\u00FCr diesen Connector.
connector.property=Eigenschaften zur weiteren Konfiguration des Connectors. 
remoting.outbound-connection=Remoting ausgehender Verbindungen.
outbound-connection=Remoting ausgehender Verbindung.
outbound-connection.add=F\u00FCgt eine generische, URI-basierende ausgehende Remoting Verbindung hinzu.
outbound-connection.remove=Entfernt eine generische, URI-basierende ausgehende Remoting Verbindung.
outbound-connection.name=Name der ausgehenden Verbindung.
outbound-connection.uri=Die Verbindungs-URI f\u00FCr die ausgehende Verbindung.
outbound-connection.property=Die XNIO-Optionen, die bei der Erstellung der Verbindung verwendet werden.
remoting.remote-outbound-connection=Remoting ausgehender Verbindungen f\u00FCr remote\:// URI-Schema.
remote-outbound-connection=Remoting ausgehender Verbindung mit einem impliziten remote\:// URI-Schema.
remote-outbound-connection.add=F\u00FCgt eine auf remote\:// URI-Schema basierende ausgehende Verbindung hinzu.
remote-outbound-connection.remove=Entfernt eine auf remote\:// URI-Schema basierende ausgehende Verbindung.
remote-outbound-connection.name=Name der auf remote\:// URI-Schema basierenden ausgehenden Verbindung.
remote-outbound-connection.outbound-socket-binding-ref=Name des ausgehenden Socket-Bindings, das zur Bestimmung der Zieladresse und des Zielports f\u00FCr die Verbindung verwendet wird.
remote-outbound-connection.username=Der Benutzername zur Authentifizierung beim Remote-Server.
remote-outbound-connection.security-realm=Referenz zum Sicherheitsbereich, der zum Erhalt des Passworts und der SSL-Konfiguration verwendet werden soll.
remote-outbound-connection.property=Die XNIO-Optionen, die bei der Erstellung der Verbindung verwendet werden.
remoting.local-outbound-connection=Remoting ausgehender Verbindungen f\u00FCr local\:// URI-Schema.
local-outbound-connection=Remoting ausgehender Verbindung mit einem impliziten local\:// URI-Schema.
local-outbound-connection.add=F\u00FCgt eine auf local\:// URI-Schema basierende ausgehende Verbindung hinzu.
local-outbound-connection.remove=Entfernt eine auf local\:// URI-Schema basierende ausgehende Verbindung.
local-outbound-connection.name=Name der auf local\:// URI-Schema basierenden ausgehenden Verbindung.
local-outbound-connection.outbound-socket-binding-ref=Name des ausgehenden Socket-Bindings, das zur Bestimmung der Zieladresse und des Zielports f\u00FCr die Verbindung verwendet wird.
local-outbound-connection.property=Die XNIO-Optionen, die bei der Erstellung der Verbindung verwendet werden.
sasl=Das "sasl" Element enth\u00E4lt die SASL-Authentifizierungskonfiguration f\u00FCr diesen Connector.
sasl.add=F\u00FCgt die SASL-Authentifizierungskonfiguration f\u00FCr den Connector hinzu
sasl.remove=Entfernt die SASL-Authentifizierungskonfiguration f\u00FCr den Connector
sasl.include-mechanisms=Das optionale, verschachtelte "include-mechanisms" Element enth\u00E4lt eine Whitelist mit den Namen zul\u00E4ssiger SASL-Mechanismen. Ein Mechanismus, der nicht in dieser Liste aufgef\u00FChrt ist, wird nicht zugelassen.
sasl.qop=Das optionale, verschachtelte "qop" Element enth\u00E4lt eine Liste mit 'Quality-of-Protection' Werten, in absteigender Reihenfolge der Pr\u00E4ferenz.
sasl.strength=Das optionale, verschachtelte "strength" Element enth\u00E4lt eine Liste mit Cipher-St\u00E4rken Werten, in absteigender Reihenfolge der Pr\u00E4ferenz.
sasl.reuse-session=Das optionale, verschachtelte "reuse-session" Boolesche Element spezifiziert, ob der Server versuchen soll, vormals authentifizierte Session-Informationen erneut zu verwenden. Unter Umst\u00E4nden unterst\u00FCtzt der Mechanismus diese Wiederverwendung jedoch nicht, und auch andere Faktorn k\u00F6nnen diese Wiederverwendung verhindern.
sasl.server-auth=Das optionale, verschachtelte "server-auth" Boolesche Element spezifiziert, ob der Server sich beim Client authentifizieren soll. Nicht alle Mechanismen unterst\u00FCtzen diese Einstellung.
sasl.sasl-policy=Spezifiziert eine optionale Richtlinie, anhand derer die Reihe der verf\u00FCgbaren Mechanismen eingegrenzt wird.
sasl.property=Eigenschaften zur weiteren Konfiguration von sasl. 
policy=Die Richtlinienkonfiguration
policy.add=F\u00FCgt die SASL-Richtlinie hinzu.
policy.remove=Entfernt die SASL-Richtlinie.
policy.forward-secrecy=Das optionale, verschachtelte "forward-secrecy" Element enth\u00E4lt einen Booleschen Wert, der spezifiziert, ob Mechanismen zur Implementierung von Folgenlosigkeit zwischen Sessions erforderlich sind. Folgenlosigkeit bedeutet, dass aus einem erfolgreichen Einbruch in eine Session keine Informationen f\u00FCr nachfolgende Sessions abgeleitet werden k\u00F6nnen.
policy.no-active=Das optionale, verschachtelte "no-active" Element enth\u00E4lt einen Booleschen Wert, der spezifiziert, ob Mechanismen zul\u00E4ssig sind, die anf\u00E4llig f\u00FCr aktive Angriffe (keine W\u00F6rterbuchangriffe) sind. "false" um solche Mechanismen zuzulassen, "true" um sie zu verbieten.
policy.no-anonymous=Das optionale, verschachtelte "no-anonymous" Element enth\u00E4lt einen Booleschen Wert, der spezifiziert, ob Mechanismen zul\u00E4ssig sind, die anonyme Logins erlauben. "false" um solche Mechanismen zuzulassen, "true" um sie zu verbieten.
policy.no-dictionary=Das optionale, verschachtelte "no-dictionary" Element enth\u00E4lt einen Booleschen Wert, der spezifiziert, ob Mechanismen zul\u00E4ssig sind, die anf\u00E4llig f\u00FCr passive W\u00F6rterbuchangriffe sind. "false" um solche Mechanismen zuzulassen, "true" um sie zu verbieten.
policy.no-plain-text=Das optionale, verschachtelte "no-plain-text" Element enth\u00E4lt einen Booleschen Wert, der spezifiziert, ob Mechanismen zul\u00E4ssig sind, die anf\u00E4llig f\u00FCr einfache, passive Klartext-Angriffe (z.B. PLAIN) sind. "false" um solche Mechanismen zuzulassen, "true" um sie zu verbieten.
policy.pass-credentials=Das optionale, verschachtelte "pass-credentials" Element enth\u00E4lt einen Booleschen Wert, der spezifiziert, ob Mechanismen erforderlich sind, die Client-Berechtigungsnachweise \u00FCbergeben.
property=Die vom zugrunde liegenden Provider unterst\u00FCtzten Eigenschaften. Der Eigenschaftsname leitet sich vom letzten Element der Eigenschaftsadresse ab.
property.add=F\u00FCgt eine Eigenschaft hinzu.
property.remove=Entfernt eine Eigenschaft.
property.value=Der Eigenschaftswert. 
