security=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u306E\u8A2D\u5B9A
security.add=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u306E\u8FFD\u52A0
security.remove=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30B5\u30D6\u30B7\u30B9\u30C6\u30E0\u306E\u524A\u9664
security.deep-copy-subject-mode=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u304C\u884C\u3046\u30B5\u30D6\u30B8\u30A7\u30AF\u30C8\u306E\u30B3\u30D4\u30FC\u30E2\u30FC\u30C9\u3092\u3001\u30AF\u30ED\u30FC\u30F3\u5316\u53EF\u80FD\u3067\u3042\u308C\u3070\u30B5\u30D6\u30B8\u30A7\u30AF\u30C8\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u3084\u8A8D\u8A3C\u60C5\u5831\u3092\u30B3\u30D4\u30FC\u3059\u308B\u3068\u3044\u3046\u30C7\u30A3\u30FC\u30D7\u30B3\u30D4\u30FC\u306B\u8A2D\u5B9A\u3057\u307E\u3059\u3002\u30B5\u30D6\u30B8\u30A7\u30AF\u30C8\u306B\u5909\u66F4\u53EF\u80FD\u306A\u30B3\u30F3\u30C6\u30F3\u30C4\u304C\u542B\u307E\u308C\u3066\u3044\u308B\u5834\u5408\u306F true \u306B\u8A2D\u5B9A\u3057\u3066\u304F\u3060\u3055\u3044\u3002\u8907\u6570\u306E\u30B9\u30EC\u30C3\u30C9\u306B\u540C\u3058\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u304C\u3042\u308A\u3001\u30AD\u30E3\u30C3\u30B7\u30E5\u306E\u30D5\u30E9\u30C3\u30B7\u30E5\uFF0F\u30ED\u30B0\u30A2\u30A6\u30C8\u3059\u308B\u3068\u30B9\u30EC\u30C3\u30C9\u306B\u3042\u308B\u30B5\u30D6\u30B8\u30A7\u30AF\u30C8\u3092\u6D88\u53BB\u3059\u308B\u305F\u3081\u30B5\u30D6\u30B8\u30A7\u30AF\u30C8\u53C2\u7167\u304C\u4ED6\u306E\u30B9\u30EC\u30C3\u30C9\u306B\u5F71\u97FF\u3092\u4E0E\u3048\u3066\u3057\u307E\u3046\u5834\u5408\u306A\u3069\u3001\u5909\u66F4\u53EF\u80FD\u306A\u30B3\u30F3\u30C6\u30F3\u30C4\u306F\u58CA\u308C\u308B\u53EF\u80FD\u6027\u304C\u3042\u308A\u307E\u3059\u3002
security-domain-children=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30C9\u30E1\u30A4\u30F3
security-domain=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30C9\u30E1\u30A4\u30F3\u306E\u8A2D\u5B9A\u3002\u8A8D\u8A3C\u3001\u627F\u8A8D\u3001ACL\u3001\u30DE\u30C3\u30D4\u30F3\u30B0\u3001\u76E3\u67FB\u3001\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30C8\u30E9\u30B9\u30C8\u306F\u3053\u3053\u3067\u8A2D\u5B9A\u3055\u308C\u307E\u3059\u3002
security-domain.add=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30C9\u30E1\u30A4\u30F3\u306E\u8FFD\u52A0
security-domain.remove=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30C9\u30E1\u30A4\u30F3\u306E\u524A\u9664
security-domain.cache-type=\u30AD\u30E3\u30C3\u30B7\u30E5\u3092\u8FFD\u52A0\u3057\u8A8D\u8A3C\u78BA\u8A8D\u306B\u304B\u304B\u308B\u6642\u9593\u3092\u77ED\u7E2E\u3057\u307E\u3059\u3002\u8A31\u5BB9\u5024\u306F 'default' (\u30AD\u30E3\u30C3\u30B7\u30E5\u3068\u3057\u3066\u5358\u7D14\u306A\u30DE\u30C3\u30D7\u3092\u4F7F\u7528) \u3068 'infinispan' (infinispan \u30AD\u30E3\u30C3\u30B7\u30E5\u3092\u4F7F\u7528) \u3067\u3059\u3002
authentication=\u3053\u306E\u30C9\u30E1\u30A4\u30F3\u306E\u8A8D\u8A3C\u8A2D\u5B9A\u3002classic \u3042\u308B\u3044\u306F jaspi \u306E\u3044\u305A\u308C\u304B
authentication.classic=\u5F93\u6765\u306E\u8A8D\u8A3C\u8A2D\u5B9A\u3002\u4F7F\u7528\u3059\u308B\u30ED\u30B0\u30A4\u30F3\u30E2\u30B8\u30E5\u30FC\u30EB\u4E00\u89A7\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
authentication.classic.add=\u5F93\u6765\u306E\u8A8D\u8A3C\u8A2D\u5B9A\u3092\u8FFD\u52A0
authentication.classic.remove=\u5F93\u6765\u306E\u8A8D\u8A3C\u8A2D\u5B9A\u3092\u524A\u9664
authentication.classic.login-modules=\u8A8D\u8A3C\u30E2\u30B8\u30E5\u30FC\u30EB\u306E\u4E00\u89A7
authentication.classic.login-modules.code=\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u5316\u3059\u3079\u304D\u30E2\u30B8\u30E5\u30FC\u30EB\u306E\u30AF\u30E9\u30B9\u540D
authentication.classic.login-modules.flag=\u3053\u306E\u30D5\u30E9\u30B0\u306F\u3001\u30E2\u30B8\u30E5\u30FC\u30EB\u304C\u5168\u4F53\u7684\u306A\u624B\u9806\u306B\u3069\u306E\u3088\u3046\u306B\u53C2\u52A0\u3057\u3066\u3044\u304F\u304B\u5236\u5FA1\u3057\u307E\u3059\u3002\u8A31\u5BB9\u5024\u306Frequiste\u3001required\u3001sufficient\u3001option \u3067\u3059\u3002
authentication.classic.login-modules.module=\u30ED\u30B0\u30A4\u30F3\u30E2\u30B8\u30E5\u30FC\u30EB\u30B3\u30FC\u30C9\u304C\u7F6E\u304B\u308C\u3066\u3044\u308B JBoss Module \u306E\u540D\u524D
authentication.classic.login-modules.module-options=name/value \u30DA\u30A2\u3092\u542B\u3080\u30E2\u30B8\u30E5\u30FC\u30EB\u30AA\u30D7\u30B7\u30E7\u30F3\u306E\u4E00\u89A7
authentication.jaspi=JASPI \u8A8D\u8A3C\u8A2D\u5B9A
authorization=\u8A8D\u8A3C\u8A2D\u5B9A\u3002\u4F7F\u7528\u3059\u308B\u8A8D\u8A3C\u30DD\u30EA\u30B7\u30FC\u30E2\u30B8\u30E5\u30FC\u30EB\u4E00\u89A7\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
authorization.add=\u8A8D\u8A3C\u8A2D\u5B9A\u306E\u8FFD\u52A0
authorization.remove=\u8A8D\u8A3C\u8A2D\u5B9A\u306E\u524A\u9664
authorization.policy-modules=\u8A8D\u8A3C\u30E2\u30B8\u30E5\u30FC\u30EB\u306E\u4E00\u89A7
authorization.policy-modules.code=\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u5316\u3059\u3079\u304D\u30E2\u30B8\u30E5\u30FC\u30EB\u306E\u30AF\u30E9\u30B9\u540D
authorization.policy-modules.flag=\u3053\u306E\u30D5\u30E9\u30B0\u306F\u3001\u30E2\u30B8\u30E5\u30FC\u30EB\u304C\u5168\u4F53\u7684\u306A\u624B\u9806\u306B\u3069\u306E\u3088\u3046\u306B\u53C2\u52A0\u3057\u3066\u3044\u304F\u304B\u5236\u5FA1\u3057\u307E\u3059\u3002\u8A31\u5BB9\u5024\u306Frequiste\u3001required\u3001sufficient\u3001option \u3067\u3059\u3002
authorization.policy-modules.module=\u30DD\u30EA\u30B7\u30FC\u30E2\u30B8\u30E5\u30FC\u30EB\u30B3\u30FC\u30C9\u304C\u7F6E\u304B\u308C\u3066\u3044\u308B JBoss Module \u306E\u540D\u524D
authorization.policy-modules.module-options=name/value \u30DA\u30A2\u3092\u542B\u3080\u30E2\u30B8\u30E5\u30FC\u30EB\u30AA\u30D7\u30B7\u30E7\u30F3\u306E\u4E00\u89A7
mapping=\u30DE\u30C3\u30D4\u30F3\u30B0\u8A2D\u5B9A\u3002\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u3001\u30ED\u30FC\u30EB\u3001\u5C5E\u6027\u3001\u8A8D\u8A3C\u60C5\u5831\u306E\u30DE\u30C3\u30D4\u30F3\u30B0\u306B\u5229\u7528\u3059\u308B\u30DE\u30C3\u30D4\u30F3\u30B0\u30E2\u30B8\u30E5\u30FC\u30EB\u4E00\u89A7\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
mapping.add=\u30DE\u30C3\u30D4\u30F3\u30B0\u8A2D\u5B9A\u306E\u8FFD\u52A0
mapping.remove=\u30DE\u30C3\u30D4\u30F3\u30B0\u8A2D\u5B9A\u306E\u524A\u9664
mapping.mapping-modules=\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u3001\u30ED\u30FC\u30EB\u3001\u5C5E\u6027\u3001\u8A8D\u8A3C\u60C5\u5831\u306E\u30DE\u30C3\u30D4\u30F3\u30B0\u306B\u5229\u7528\u3059\u308B\u30DE\u30C3\u30D4\u30F3\u30B0\u30E2\u30B8\u30E5\u30FC\u30EB\u4E00\u89A7
mapping.mapping-modules.code=\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u5316\u3059\u3079\u304D\u30E2\u30B8\u30E5\u30FC\u30EB\u306E\u30AF\u30E9\u30B9\u540D
mapping.mapping-modules.type=\u3053\u306E\u30DE\u30C3\u30D4\u30F3\u30B0\u304C\u5B9F\u884C\u3059\u308B\u30DE\u30C3\u30D4\u30F3\u30B0\u578B\u3002\u8A31\u5BB9\u5024\u306F principal\u3001role\u3001attribute\u3001credential \u3068\u306A\u3063\u3066\u3044\u307E\u3059\u3002
mapping.mapping-modules.module-options=name/value \u30DA\u30A2\u3092\u542B\u3080\u30E2\u30B8\u30E5\u30FC\u30EB\u30AA\u30D7\u30B7\u30E7\u30F3\u306E\u4E00\u89A7
audit=\u76E3\u67FB\u8A2D\u5B9A\u3002\u4F7F\u7528\u3059\u308B\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u30E2\u30B8\u30E5\u30FC\u30EB\u4E00\u89A7\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
audit.add=\u76E3\u67FB\u8A2D\u5B9A\u306E\u8FFD\u52A0
audit.remove=\u76E3\u67FB\u8A2D\u5B9A\u306E\u524A\u9664
audit.provider-modules=\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u30E2\u30B8\u30E5\u30FC\u30EB\u306E\u4E00\u89A7
audit.provider-modules.code=\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u5316\u3059\u3079\u304D\u30E2\u30B8\u30E5\u30FC\u30EB\u306E\u30AF\u30E9\u30B9\u540D
audit.provider-modules.flag=\u3053\u306E\u30D5\u30E9\u30B0\u306F\u3001\u30E2\u30B8\u30E5\u30FC\u30EB\u304C\u5168\u4F53\u7684\u306A\u624B\u9806\u306B\u3069\u306E\u3088\u3046\u306B\u53C2\u52A0\u3057\u3066\u3044\u304F\u304B\u5236\u5FA1\u3057\u307E\u3059\u3002\u8A31\u5BB9\u5024\u306Frequiste\u3001required\u3001sufficient\u3001option \u3067\u3059\u3002
audit.provider-modules.module=\u76E3\u67FB\u30E2\u30B8\u30E5\u30FC\u30EB\u30B3\u30FC\u30C9\u304C\u7F6E\u304B\u308C\u3066\u3044\u308B JBoss Module \u306E\u540D\u524D
audit.provider-modules.module-options=name/value \u30DA\u30A2\u3092\u542B\u3080\u30E2\u30B8\u30E5\u30FC\u30EB\u30AA\u30D7\u30B7\u30E7\u30F3\u306E\u4E00\u89A7
authentication-jaspi=JASPI \u8A8D\u8A3C\u8A2D\u5B9A\u3002\u3053\u308C\u304B\u3001 'authentication' \u306E\u3044\u305A\u308C\u304B\u304C\u5B58\u5728\u3059\u308B\u5FC5\u8981\u304C\u3042\u308A\u307E\u3059\u304C\u3001\u4E21\u65B9\u540C\u6642\u306B\u8A2D\u5B9A\u3059\u308B\u3053\u3068\u306F\u3067\u304D\u307E\u305B\u3093\u3002
acl=\u30A2\u30AF\u30BB\u30B9\u5236\u5FA1\u30EA\u30B9\u30C8\u306E\u8A2D\u5B9A\u3002\u5229\u7528\u3059\u308B ACL \u30E2\u30B8\u30E5\u30FC\u30EB\u4E00\u89A7\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
acl.add=ACL \u8A2D\u5B9A\u306E\u8FFD\u52A0
acl.remove=ACL \u8A2D\u5B9A\u306E\u524A\u9664
acl.acl-modules=acl \u30E2\u30B8\u30E5\u30FC\u30EB\u306E\u4E00\u89A7
acl.acl-modules.code=\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u5316\u3059\u3079\u304D\u30E2\u30B8\u30E5\u30FC\u30EB\u306E\u30AF\u30E9\u30B9\u540D
acl.acl-modules.flag=\u3053\u306E\u30D5\u30E9\u30B0\u306F\u3001\u30E2\u30B8\u30E5\u30FC\u30EB\u304C\u5168\u4F53\u7684\u306A\u624B\u9806\u306B\u3069\u306E\u3088\u3046\u306B\u53C2\u52A0\u3057\u3066\u3044\u304F\u304B\u5236\u5FA1\u3057\u307E\u3059\u3002\u8A31\u5BB9\u5024\u306Frequiste\u3001required\u3001sufficient\u3001option \u3067\u3059\u3002
acl.acl-modules.module=\u76E3\u67FB\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u30E2\u30B8\u30E5\u30FC\u30EB\u30B3\u30FC\u30C9\u304C\u7F6E\u304B\u308C\u3066\u3044\u308B JBoss Module \u306E\u540D\u524D
acl.acl-modules.module-options=name/value \u30DA\u30A2\u3092\u542B\u3080\u30E2\u30B8\u30E5\u30FC\u30EB\u30AA\u30D7\u30B7\u30E7\u30F3\u306E\u4E00\u89A7
type=\u3053\u306E\u30E2\u30B8\u30E5\u30FC\u30EB\u304C\u5B9F\u884C\u3059\u308B\u30DE\u30C3\u30D4\u30F3\u30B0\u578B\u3002\u8A31\u5BB9\u5024\u306F principal\u3001role\u3001attribute\u3001credential \u3068\u306A\u3063\u3066\u3044\u307E\u3059\u3002
identity-trust=\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30C8\u30E9\u30B9\u30C8\u8A2D\u5B9A\u3002\u4F7F\u7528\u3059\u308B\u30C8\u30E9\u30B9\u30C8\u30E2\u30B8\u30E5\u30FC\u30EB\u4E00\u89A7\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
identity-trust.add=\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30C8\u30E9\u30B9\u30C8\u8A2D\u5B9A\u306E\u8FFD\u52A0
identity-trust.remove=\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30C8\u30E9\u30B9\u30C8\u8A2D\u5B9A\u306E\u524A\u9664
identity-trust.trust-modules=\u30C8\u30E9\u30B9\u30C8\u30E2\u30B8\u30E5\u30FC\u30EB\u306E\u4E00\u89A7
identity-trust.trust-modules.code=\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u5316\u3059\u3079\u304D\u30E2\u30B8\u30E5\u30FC\u30EB\u306E\u30AF\u30E9\u30B9\u540D
identity-trust.trust-modules.flag=\u3053\u306E\u30D5\u30E9\u30B0\u306F\u3001\u30E2\u30B8\u30E5\u30FC\u30EB\u304C\u5168\u4F53\u7684\u306A\u624B\u9806\u306B\u3069\u306E\u3088\u3046\u306B\u53C2\u52A0\u3057\u3066\u3044\u304F\u304B\u5236\u5FA1\u3057\u307E\u3059\u3002\u8A31\u5BB9\u5024\u306Frequiste\u3001required\u3001sufficient\u3001option \u3067\u3059\u3002
identity-trust.trust-modules.module=\u30A2\u30A4\u30C7\u30F3\u30C6\u30A3\u30C6\u30A3\u30C8\u30E9\u30B9\u30C8\u306E\u30E2\u30B8\u30E5\u30FC\u30EB\u30B3\u30FC\u30C9\u304C\u7F6E\u304B\u308C\u3066\u3044\u308B JBoss Module \u306E\u540D\u524D
identity-trust.trust-modules.module-options=name/value \u30DA\u30A2\u3092\u542B\u3080\u30E2\u30B8\u30E5\u30FC\u30EB\u30AA\u30D7\u30B7\u30E7\u30F3\u306E\u4E00\u89A7
login-module-stack=jaspi \u8A8D\u8A3C\u30E2\u30B8\u30E5\u30FC\u30EB\u306B\u3088\u308A\u5229\u7528\u3055\u308C\u308B "named" \u30ED\u30B0\u30A4\u30F3\u30E2\u30B8\u30E5\u30FC\u30EB\u306E\u4E00\u89A7
login-module-stack.add=\u540D\u524D\u3064\u304D\u306E\u30ED\u30B0\u30A4\u30F3\u30E2\u30B8\u30E5\u30FC\u30EB\u306E\u30B9\u30BF\u30C3\u30AF\u8A2D\u5B9A\u3092\u8FFD\u52A0
login-module-stack.remove=\u540D\u524D\u3064\u304D\u306E\u30ED\u30B0\u30A4\u30F3\u30E2\u30B8\u30E5\u30FC\u30EB\u306E\u30B9\u30BF\u30C3\u30AF\u8A2D\u5B9A\u3092\u524A\u9664
login-module-stack.login-modules=\u8A8D\u8A3C\u30E2\u30B8\u30E5\u30FC\u30EB\u306E\u4E00\u89A7
login-module-stack.login-modules.code=\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u5316\u3059\u3079\u304D\u30E2\u30B8\u30E5\u30FC\u30EB\u306E\u30AF\u30E9\u30B9\u540D
login-module-stack.login-modules.flag=\u3053\u306E\u30D5\u30E9\u30B0\u306F\u3001\u30E2\u30B8\u30E5\u30FC\u30EB\u304C\u5168\u4F53\u7684\u306A\u624B\u9806\u306B\u3069\u306E\u3088\u3046\u306B\u53C2\u52A0\u3057\u3066\u3044\u304F\u304B\u5236\u5FA1\u3057\u307E\u3059\u3002\u8A31\u5BB9\u5024\u306Frequiste\u3001required\u3001sufficient\u3001option \u3067\u3059\u3002
login-module-stack.login-modules.module=\u30ED\u30B0\u30A4\u30F3\u30E2\u30B8\u30E5\u30FC\u30EB\u304C\u7F6E\u304B\u308C\u3066\u3044\u308B JBoss Module \u306E\u540D\u524D
login-module-stack.login-modules.module-options=name/value \u30DA\u30A2\u3092\u542B\u3080\u30E2\u30B8\u30E5\u30FC\u30EB\u30AA\u30D7\u30B7\u30E7\u30F3\u306E\u4E00\u89A7
authentication.jaspi.add=JASPI \u8A8D\u8A3C\u8A2D\u5B9A\u306E\u8FFD\u52A0
authentication.jaspi.remove=JASPI \u8A8D\u8A3C\u8A2D\u5B9A\u306E\u524A\u9664
authentication.jaspi.auth-modules=\u4F7F\u7528\u4E88\u5B9A\u306E\u8A8D\u8A3C\u30E2\u30B8\u30E5\u30FC\u30EB\u4E00\u89A7
authentication.jaspi.auth-modules.code=\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u5316\u3059\u3079\u304D\u30E2\u30B8\u30E5\u30FC\u30EB\u306E\u30AF\u30E9\u30B9\u540D
authentication.jaspi.auth-modules.module=\u8A8D\u8A3C\u30E2\u30B8\u30E5\u30FC\u30EB\u30B3\u30FC\u30C9\u304C\u7F6E\u304B\u308C\u3066\u3044\u308B JBoss Module \u306E\u540D\u524D
authentication.jaspi.auth-modules.module-options=name/value \u30DA\u30A2\u3092\u542B\u3080\u30E2\u30B8\u30E5\u30FC\u30EB\u30AA\u30D7\u30B7\u30E7\u30F3\u306E\u4E00\u89A7
authentication.jaspi.auth-modules.login-module-stack-ref=\u540C\u3058\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30C9\u30E1\u30A4\u30F3\u306B\u4EE5\u524D\u306B\u8A2D\u5B9A\u3057\u305F\u30ED\u30B0\u30A4\u30F3\u30E2\u30B8\u30E5\u30FC\u30EB\u30B9\u30BF\u30C3\u30AF\u540D\u3078\u306E\u53C2\u7167
jsse=JSSE \u8A2D\u5B9A\u3002SSL \u8A2D\u5B9A\u306B\u5229\u7528\u53EF\u80FD\u306A\u30AD\u30FC\u30B9\u30C8\u30A2\u306B\u5BFE\u3059\u308B\u5C5E\u6027\u3092\u8A2D\u5B9A\u3057\u307E\u3059\u3002
jsse.add=JSSE \u8A2D\u5B9A\u306E\u8FFD\u52A0
jsse.remove=JSSE \u8A2D\u5B9A\u306E\u524A\u9664
jsse.truststore=JSSE \u30C8\u30E9\u30B9\u30C8\u30B9\u30C8\u30A2\u306E\u8A2D\u5B9A
jsse.truststore.password=\u30C8\u30E9\u30B9\u30C8\u30B9\u30C8\u30A2\u306E\u30D1\u30B9\u30EF\u30FC\u30C9\u3092\u8A2D\u5B9A\u3002\u3053\u308C\u304B\u3001'keystore-password' \u304C\u5B58\u5728\u3057\u3066\u3044\u306A\u3051\u308C\u3070\u306A\u308A\u307E\u305B\u3093\u3002\u3044\u305A\u308C\u304B\u304C\u306A\u3044\u5834\u5408\u306F\u3001\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30C9\u30E1\u30A4\u30F3\u306F\u4F7F\u3044\u9053\u304C\u3042\u308A\u307E\u305B\u3093\u3002
jsse.truststore.type=\u30C8\u30E9\u30B9\u30C8\u30B9\u30C8\u30A2\u306E\u578B\u3002\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u578B\u306F 'JKS' \u306B\u30C7\u30D5\u30A9\u30EB\u30C8\u8A2D\u5B9A\u3055\u308C\u307E\u3059\u3002
jsse.truststore.url=\u30C8\u30E9\u30B9\u30C8\u30B9\u30C8\u30A2\u306E URL
jsse.truststore.provider=\u30C8\u30E9\u30B9\u30C8\u30B9\u30C8\u30A2\u4F5C\u6210\u6642\u306B\u5229\u7528\u3059\u308B\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u30AF\u30E9\u30B9\u540D
jsse.truststore.provider-argument=\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u5316\u6642\u306B\u30C8\u30E9\u30B9\u30C8\u30B9\u30C8\u30A2\u306E\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u30B3\u30F3\u30B9\u30C8\u30E9\u30AF\u30BF\u30FC\u306B\u6E21\u3059\u6587\u5B57\u5217\u306E\u5F15\u6570
jsse.keystore=JSSE \u30AD\u30FC\u30B9\u30C8\u30A2\u306E\u8A2D\u5B9A
jsse.keystore.password=\u30C8\u30E9\u30B9\u30C8\u30B9\u30C8\u30A2\u306E\u30D1\u30B9\u30EF\u30FC\u30C9\u3092\u8A2D\u5B9A\u3002\u3053\u308C\u304B\u3001'truststore-password' \u304C\u5B58\u5728\u3057\u3066\u3044\u306A\u3051\u308C\u3070\u306A\u308A\u307E\u305B\u3093\u3002\u3044\u305A\u308C\u304B\u304C\u306A\u3044\u5834\u5408\u306F\u3001\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30C9\u30E1\u30A4\u30F3\u306F\u4F7F\u3044\u9053\u304C\u3042\u308A\u307E\u305B\u3093\u3002
jsse.keystore.type=\u30AD\u30FC\u30B9\u30C8\u30A2\u306E\u578B\u3002\u8A2D\u5B9A\u3055\u308C\u3066\u3044\u306A\u3044\u5834\u5408\u306F\u578B\u306F 'JKS' \u306B\u30C7\u30D5\u30A9\u30EB\u30C8\u8A2D\u5B9A\u3055\u308C\u307E\u3059\u3002
jsse.keystore.url=\u30AD\u30FC\u30B9\u30C8\u30A2\u306E URL
jsse.keystore.provider=KeyStore \u4F5C\u6210\u6642\u306B\u5229\u7528\u3059\u308B\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u306E\u30AF\u30E9\u30B9\u540D
jsse.keystore.provider-argument=\u30A4\u30F3\u30B9\u30BF\u30F3\u30B9\u5316\u6642\u306B\u30AD\u30FC\u30B9\u30C8\u30A2\u306E\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u30B3\u30F3\u30B9\u30C8\u30E9\u30AF\u30BF\u30FC\u306B\u6E21\u3059\u6587\u5B57\u5217\u306E\u5F15\u6570
jsse.key-manager=JSEE \u30AD\u30FC\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u30D5\u30A1\u30AF\u30C8\u30EA
jsse.key-manager.provider=KeyManagerFactory \u4F5C\u6210\u6642\u306B\u5229\u7528\u3059\u308B\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u30AF\u30E9\u30B9\u540D
jsse.key-manager.algorithm=KeyManagerFactory \u306E\u4F5C\u6210\u6642\u306B\u5229\u7528\u3059\u308B\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0
jsse.trust-manager=JSEE \u30C8\u30E9\u30B9\u30C8\u30B9\u30C8\u30A2\u30DE\u30CD\u30FC\u30B8\u30E3\u30FC\u30D5\u30A1\u30AF\u30C8\u30EA
jsse.trust-manager.provider=TrustManagerFactory \u4F5C\u6210\u6642\u306B\u5229\u7528\u3059\u308B\u30D7\u30ED\u30D0\u30A4\u30C0\u30FC\u30AF\u30E9\u30B9\u540D
jsse.trust-manager.algorithm=TrustManagerFactory \u306E\u4F5C\u6210\u6642\u306B\u5229\u7528\u3059\u308B\u30A2\u30EB\u30B4\u30EA\u30BA\u30E0
jsse.client-alias=KeyManager \u304C\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306E\u30A8\u30A4\u30EA\u30A2\u30B9\u3092\u9078\u629E\u3059\u308B\u969B\u306B\u5229\u7528\u3059\u308B\u63A8\u5968\u30A8\u30A4\u30EA\u30A2\u30B9
jsse.server-alias=KeyManager \u304C\u30B5\u30FC\u30D0\u30FC\u306E\u30A8\u30A4\u30EA\u30A2\u30B9\u3092\u9078\u629E\u3059\u308B\u969B\u306B\u5229\u7528\u3059\u308B\u63A8\u5968\u30A8\u30A4\u30EA\u30A2\u30B9
jsse.client-auth=\u30AF\u30E9\u30A4\u30A2\u30F3\u30C8\u306E\u8A3C\u660E\u66F8\u304C\u30B5\u30FC\u30D0\u30FC\u5074\u3067\u8A8D\u8A3C\u3055\u308C\u308B\u3079\u304D\u304B\u6307\u5B9A\u3059\u308B Boolean \u5C5E\u6027
jsse.service-auth-token=KeyStore \u304B\u3089 PrivateKeys \u3092\u30EA\u30C8\u30EA\u30FC\u30D6\u3059\u308B\u30C8\u30FC\u30AF\u30F3
jsse.cipher-suites=SSLSockets \u3092\u6709\u52B9\u306B\u3059\u308B\u6697\u53F7\u5316\u30B9\u30A4\u30FC\u30C8\u306E\u30B3\u30F3\u30DE\u533A\u5207\u308A\u30EA\u30B9\u30C8
jsse.protocols=SSLSockets \u3092\u6709\u52B9\u306B\u3059\u308B\u30D7\u30ED\u30C8\u30B3\u30EB\u306E\u30B3\u30F3\u30DE\u533A\u5207\u308A\u30EA\u30B9\u30C8
jsse.additional-properties=JSSE \u8A2D\u5B9A\u306B\u5FC5\u8981\u3068\u306A\u308B\u53EF\u80FD\u6027\u306E\u3042\u308B\u8FFD\u52A0\u30D7\u30ED\u30D1\u30C6\u30A3
list-cached-principals=\u3053\u306E\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30C9\u30E1\u30A4\u30F3\u5411\u3051\u306B\u8A8D\u8A3C\u30AD\u30E3\u30C3\u30B7\u30E5\u306B\u4FDD\u5B58\u3055\u308C\u308B\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u4E00\u89A7
flush-cache=\u3053\u306E\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30C9\u30E1\u30A4\u30F3\u5411\u3051\u306B\u8A8D\u8A3C\u30AD\u30E3\u30C3\u30B7\u30E5\u306B\u4FDD\u5B58\u3055\u308C\u3066\u3044\u308B\u30A8\u30F3\u30C8\u30EA\u3092\u524A\u9664\u3002\u30E6\u30FC\u30B6\u30FC\u540D\u3068\u30D7\u30EA\u30F3\u30B7\u30D1\u30EB\u306E\u5F15\u6570\u3092\u5024\u3068\u3057\u3066\u5229\u7528\u3059\u308B\u3053\u3068\u3067\u30A8\u30F3\u30C8\u30EA\u30921\u3064\u30D5\u30E9\u30C3\u30B7\u30E5\u3059\u308B\u3053\u3068\u304C\u3067\u304D\u307E\u3059\u3002\u5F15\u6570\u304C\u6F14\u7B97\u306B\u6E21\u3055\u308C\u306A\u3044\u5834\u5408\u306F\u3001\u5168\u30A8\u30F3\u30C8\u30EA\u304C\u30D5\u30E9\u30C3\u30B7\u30E5\u3055\u308C\u307E\u3059\u3002
vault=\u5C5E\u6027\u306E\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30DC\u30FC\u30EB\u30C8
vault.add=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30DC\u30FC\u30EB\u3068\u8A2D\u5B9A\u306E\u8FFD\u52A0
vault.remove=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30DC\u30FC\u30EB\u3068\u8A2D\u5B9A\u306E\u524A\u9664
vault.code=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30DC\u30FC\u30EB\u30C8\u5B9F\u88C5\u306E\u5B8C\u5168\u4FEE\u98FE\u540D
vault.options=\u30BB\u30AD\u30E5\u30EA\u30C6\u30A3\u30DC\u30FC\u30EB\u30C8\u306E\u30AA\u30D7\u30B7\u30E7\u30F3
