security=La configuraci\u00F3n del sub-sistema de seguridad.
security.add=Agrega el sub-sistema de seguridad.
security.remove=Borra el sub-sistema de seguridad.
security.deep-copy-subject-mode=Establece el modo de copia de los temas realizados por los administradores de seguridad para ser copias profundas que realizan copias de las credenciales y principales del tema si se pueden hacer clones de estos. Se debe establecer como verdadero si el tema incluye contenido mutable que se puede da\u00F1ar cuando m\u00FAltiples hilos tienen la misma identidad y el cach\u00E9 vac\u00EDa/cierra sesi\u00F3n limpiando el tema en los resultados de hilos en referencias de tema afectando los otros hilos.
security-domain-children=Los dominios de seguridad.
security-domain=Configura un dominio de seguridad. Aqu\u00ED se configura la autenticaci\u00F3n, autorizaci\u00F3n, ACL, mapeo, auditor\u00EDa y el almac\u00E9n de identidad.
security-domain.add=Agrega un dominio de seguridad.
security-domain.remove=Borra un dominio de seguridad.
security-domain.cache-type=Agrega un cach\u00E9 para agilizar los chequeos de autenticaci\u00F3n. Los valores permitidos son 'default' para usar un mapeo simple como el cache e 'infinispan' para usar un cach\u00E9 Infinispan.
authentication="Configuraci\u00F3n de la autenticaci\u00F3n para este dominio. Puede ser cl\u00E1sico o jaspi.
authentication.classic=Configuraci\u00F3n de autenticaci\u00F3n tradicional. Configura una lista de m\u00F3dulos de inicio de sesi\u00F3n a utilizar.
authentication.classic.add=Agrega una configuraci\u00F3n de autenticaci\u00F3n tradicional
authentication.classic.remove=Borra una configuraci\u00F3n de autenticaci\u00F3n tradicional
authentication.classic.login-modules=Lista de m\u00F3dulos de autenticaci\u00F3n
authentication.classic.login-modules.code=Nombre de la clase del m\u00F3dulo a instanciar.
authentication.classic.login-modules.flag=La etiqueta controla la manera en que el m\u00F3dulo participa en el procedimiento en general. Los valores permitidos son requisite, required, sufficient o optional.
authentication.classic.login-modules.module=Nombre del m\u00F3dulo JBoss en donde se encuentra el c\u00F3digo del m\u00F3dulo de inicio de sesi\u00F3n.
authentication.classic.login-modules.module-options=Lista de opciones del m\u00F3dulo que contienen un nombre/valor.
authentication.jaspi=Configuraci\u00F3n de autenticaci\u00F3n JASPI
authorization=Configuraci\u00F3n de la autorizaci\u00F3n. Configura una lista de m\u00F3dulos de pol\u00EDticas de autorizaci\u00F3n que se van a utilizar.
authorization.add=Agrega una configuraci\u00F3n de autorizaci\u00F3n
authorization.remove=Borra una configuraci\u00F3n de autorizaci\u00F3n
authorization.policy-modules=Lista de m\u00F3dulos de autorizaci\u00F3n
authorization.policy-modules.code=Nombre de la clase del m\u00F3dulo a instanciar.
authorization.policy-modules.flag=La etiqueta controla la manera en que el m\u00F3dulo participa en el procedimiento en general. Los valores permitidos son requisite, required, sufficient o optional.
authorization.policy-modules.module=Nombre del m\u00F3dulo JBoss en donde se encuentra el c\u00F3digo del m\u00F3dulo de la pol\u00EDtica.
authorization.policy-modules.module-options=Lista de opciones del m\u00F3dulo que contienen un nombre/valor.
mapping=Configuraci\u00F3n del mapeo. Configura una lista de m\u00F3dulos de mapeo a utilizarse para el mapeo principal, de roles, de atributos y credenciales.
mapping.add=Agrega una configuraci\u00F3n de mapeo.
mapping.remove=Borra una configuraci\u00F3n de mapeo.
mapping.mapping-modules=Lista de m\u00F3dulos que mapean informaci\u00F3n principal, de roles y credenciales
mapping.mapping-modules.code=Nombre de la clase del m\u00F3dulo a instanciar.
mapping.mapping-modules.type=Tipo de mapeo que este m\u00F3dulo realiza. Los valores son principal, role, attribute o credential.
mapping.mapping-modules.module-options=Lista de opciones del m\u00F3dulo que contienen un nombre/valor.
audit=Configuraci\u00F3n de auditor\u00EDa. Configura una lista de m\u00F3dulos proveedores que se van a utilizar.
audit.add=Agrega una configuraci\u00F3n de auditor\u00EDa.
audit.remove=Borra una configuraci\u00F3n de auditor\u00EDa.
audit.provider-modules=Lista de m\u00F3dulos proveedores
audit.provider-modules.code=Nombre de la clase del m\u00F3dulo a instanciar.
audit.provider-modules.flag=La etiqueta controla la manera en que el m\u00F3dulo participa en el procedimiento en general. Los valores permitidos son requisite, required, sufficient o optional.
audit.provider-modules.module=Nombre del m\u00F3dulo JBoss en donde se encuentra el c\u00F3digo del m\u00F3dulo proveedor de auditor\u00EDa.
audit.provider-modules.module-options=Lista de opciones del m\u00F3dulo que contienen un nombre/valor.
authentication-jaspi=Configuraci\u00F3n de autenticaci\u00F3n JASPI. Este o 'authentication' debe estar presente pero no ambos.
acl=Configuraci\u00F3n de la lista de control de acceso. Configura una lista de m\u00F3dulos ACL que se van a utilizar.
acl.add=Agrega una configuraci\u00F3n ACL.
acl.remove=Borra una configuraci\u00F3n ACL.
acl.acl-modules=Lista de m\u00F3dulos acl
acl.acl-modules.code=Nombre de la clase del m\u00F3dulo a instanciar.
acl.acl-modules.flag=La etiqueta controla la manera en que el m\u00F3dulo participa en el procedimiento en general. Los valores permitidos son requisite, required, sufficient o optional.
acl.acl-modules.module=Nombre del m\u00F3dulo JBoss en donde se encuentra el c\u00F3digo del m\u00F3dulo proveedor acl.
acl.acl-modules.module-options=Lista de opciones del m\u00F3dulo que contienen un nombre/valor.
type=Tipo de mapeo que este m\u00F3dulo realiza. Los valores son principal, role, attribute o credential.
identity-trust=Configuraci\u00F3n del almac\u00E9n de identidad. Configura una lista de m\u00F3dulos de confianza que se van a utilizar.
identity-trust.add=Agrega una configuraci\u00F3n del almac\u00E9n de identidad.
identity-trust.remove=Borra una configuraci\u00F3n del almac\u00E9n de identidad.
identity-trust.trust-modules=Lista de m\u00F3dulos de confianza
identity-trust.trust-modules.code=Nombre de la clase del m\u00F3dulo a instanciar.
identity-trust.trust-modules.flag=La etiqueta controla la manera en que el m\u00F3dulo participa en el procedimiento en general. Los valores permitidos son requisite, required, sufficient o optional.
identity-trust.trust-modules.module=Nombre del m\u00F3dulo JBoss en donde se encuentra el c\u00F3digo del m\u00F3dulo del almac\u00E9n de identidad.
identity-trust.trust-modules.module-options=Lista de opciones del m\u00F3dulo que contienen un nombre/valor.
login-module-stack=Lista de m\u00F3dulos de inicio de sesi\u00F3n "named" que los m\u00F3dulos de autenicaci\u00F3n jaspi utiliza.
login-module-stack.add=Agrega una configuraci\u00F3n nombrada de la pila del m\u00F3dulo de inicio de sesi\u00F3n.
login-module-stack.remove=Borra una configuraci\u00F3n nombrada de la pila del m\u00F3dulo de inicio de sesi\u00F3n.
login-module-stack.login-modules=Lista de m\u00F3dulos de autenticaci\u00F3n
login-module-stack.login-modules.code=Nombre de la clase del m\u00F3dulo a instanciar.
login-module-stack.login-modules.flag=La etiqueta controla la manera en que el m\u00F3dulo participa en el procedimiento en general. Los valores permitidos son requisite, required, sufficient o optional.
login-module-stack.login-modules.module=Nombre del m\u00F3dulo JBoss en donde se encuentra el m\u00F3dulo de inicio de sesi\u00F3n.
login-module-stack.login-modules.module-options=Lista de opciones del m\u00F3dulo que contienen un nombre/valor.
authentication.jaspi.add=Agrega una configuraci\u00F3n de autenticaci\u00F3n JASPI
authentication.jaspi.remove=Borra una configuraci\u00F3n de autenticaci\u00F3n JASPI
authentication.jaspi.auth-modules=Lista de m\u00F3dulos de autenticaci\u00F3n a utilizar.
authentication.jaspi.auth-modules.code=Nombre de la clase del m\u00F3dulo a instanciar.
authentication.jaspi.auth-modules.module=Nombre del m\u00F3dulo JBoss en donde se encuentra el c\u00F3digo del m\u00F3dulo de autenticaci\u00F3n.
authentication.jaspi.auth-modules.module-options=Lista de opciones del m\u00F3dulo que contienen un nombre/valor.
authentication.jaspi.auth-modules.login-module-stack-ref=Referencia a un nombre de pila del m\u00F3dulo de inicio de sesi\u00F3n previamente configurado en el mismo dominio de seguridad.
jsse=Configuraci\u00F3n JSSE. Configura atributos para almacenes de llaves que se pueden utilizar para establecer SSL.
jsse.add=Agrega una configuraci\u00F3n JSSE.
jsse.remove=Borra una configuraci\u00F3n JSSE.
jsse.truststore=Configura un almac\u00E9n de confianza JSSE
jsse.truststore.password=Establece la contrase\u00F1a del almac\u00E9n de confianza. Este o 'keystore-password' deben estar presente de otra manera el dominio de seguridad ser\u00E1 in\u00FAtil.
jsse.truststore.type=Tipo del almac\u00E9n de confianza. Si no est\u00E1 establecido entonces el tipo predeterminado es 'JKS'.
jsse.truststore.url=URL del almacenamiento de confianza.
jsse.truststore.provider=Nombre de la clase del proveedor a utilizar al crear el almac\u00E9n de confianza.
jsse.truststore.provider-argument=Argumento de cadena a pasar al constructor proveedor del almac\u00E9n de confiaza al instanciarlo.
jsse.keystore=Configura un almac\u00E9n de llaves JSSE
jsse.keystore.password=Establece la contrase\u00F1a del almac\u00E9n de llaves. Este o 'truststore-password' deben estar presente de otra manera el dominio de seguridad ser\u00E1 in\u00FAtil.
jsse.keystore.type=Tipo del almac\u00E9n de llaves. Si no est\u00E1 establecido entonces el tipo predeterminado es 'JKS'.
jsse.keystore.url=URL del almac\u00E9n de llaves.
jsse.keystore.provider=Nombre de la clase del proveedor a utilizar al crear el almac\u00E9n de llaves.
jsse.keystore.provider-argument=Argumento de cadena a pasar al constructor proveedor del almac\u00E9n de llaves al instanciarlo.
jsse.key-manager=F\u00E1brica administradora de llaves JSEE
jsse.key-manager.provider=Nombre de la clase del proveedor a utilizar al crear el KeyManagerFactory.
jsse.key-manager.algorithm=Algoritmo a utilizar al crear el KeyManagerFactory.
jsse.trust-manager=F\u00E1brica administradora de confianza JSEE
jsse.trust-manager.provider=Nombre de la clase del proveedor a utilizar al crear el TrustManagerFactory.
jsse.trust-manager.algorithm=Algoritmo a utilizar al crear el TrustManagerFactory.
jsse.client-alias=Alias preferido a utilizar cuando el KeyManager selecciona el alias cliente.
jsse.server-alias=Alias preferido a utilizar cuando el KeyManager selecciona el alias servidor.
jsse.client-auth=Atributo boolean para indicar si los certificados del cliente tambi\u00E9n se deben autenticar en el lado del servidor.
jsse.service-auth-token=Token para recuperar PrivateKeys del KeyStore.
jsse.cipher-suites=Lista de suites de cifras a habilitar en SSLSockets.
jsse.protocols=Lista de suites de protocolos a habilitar en SSLSockets.
jsse.additional-properties=Propiedades que pueden ser necesarios para configurar JSSE.
list-cached-principals=Lista los principales almacenados en el cach\u00E9 de autenticaci\u00F3n para este dominio de seguridad.
flush-cache=Borra entradas almacenadas en el cach\u00E9 de autenticaci\u00F3n para este dominio de seguridad. Una sola entrada se puede vaciar usando el argumento principal con el nombre de usuario como valor. Si no se pasa un argumento a la operaci\u00F3n entonces todas las entradas se vac\u00EDan.
vault=V\u00E1lvula de seguridad para los atributos.
vault.add=Agrega una configuraci\u00F3n de v\u00E1lvula de seguridad
vault.remove=Borra una configuraci\u00F3n de v\u00E1lvula de seguridad
vault.code=Nombre completamente calificado de la implementaci\u00F3n de la v\u00E1lvula de seguridad.
vault.options=Opciones de la v\u00E1lvula de seguridad.
