security=A configura\u00E7\u00E3o do sub-sistema de seguran\u00E7a.
security.add=Adiciona o sub-sistema de seguran\u00E7a.
security.remove=Remove o sub-sistema de seguran\u00E7a.
security.deep-copy-subject-mode=Determina o modo de c\u00F3pia dos assuntos realizados pelos gerenciadores de seguran\u00E7a a serem c\u00F3pias profundas que realizam c\u00F3pias dos principais ou dos credenciais, caso eles sejam clon\u00E1veis. Isto deve ser configurado para verdadeiro caos o assunto incluir o conte\u00FAdo mut\u00E1vel que pode ser corrompido quando os threads m\u00FAltiplios possuem a mesma identidade e o esvaziamento/encerramento do cache limpa o assunto em um thread, resulta nas refer\u00EAncias do assunto influenciando em outros threads.
security-domain-children=Os dom\u00EDnios de seguran\u00E7a.
security-domain=Configura um dom\u00EDnio de seguran\u00E7a. A autentica\u00E7\u00E3o, autoriza\u00E7\u00E3o, ACL, mapeamento, auditoria e confian\u00E7a de identidade s\u00E3o configurados aqui.
security-domain.add=Adiciona o dom\u00EDnio de seguran\u00E7a.
security-domain.remove=Remove o dom\u00EDnio de seguran\u00E7a.
security-domain.cache-type=Adiciona o cache para que as checagens de autentica\u00E7\u00E3o sejam mais r\u00E1pidas. Os valores permitidos s\u00E3o 'padr\u00E3o' para simples uso de mapa assim como o cache e o 'infinispan' para uso de um cache Infinispan.
authentication="A configura\u00E7\u00E3o da autentica\u00E7\u00E3o para esse dom\u00EDnio. Isto pose ser tanto cl\u00E1ssica ou jaspi."
authentication.classic=A configura\u00E7\u00E3o de autentica\u00E7\u00E3o tradicional. Isto configura uma lista de m\u00F3dulos de logon a serem usados.
authentication.classic.add=Adiciona uma configura\u00E7\u00E3o da autentica\u00E7\u00E3o tradicional
authentication.classic.remove=Remove uma configura\u00E7\u00E3o de autentica\u00E7\u00E3o tradicional
authentication.classic.login-modules=Lista os m\u00F3dulos de autentica\u00E7\u00E3o
authentication.classic.login-modules.code=O nome da classe do m\u00F3dulo a ser instanciado.
authentication.classic.login-modules.flag=O aviso controla como o m\u00F3dulo participa no procedimento em geral. Os valores permitidos s\u00E3o requisito, solicitado, suficiente ou opcional.
authentication.classic.login-modules.module=O nome do M\u00F3dulo JBoss onde o c\u00F3digo do m\u00F3dulo de logon est\u00E1 localizado.
authentication.classic.login-modules.module-options=A lista das op\u00E7\u00F5es do m\u00F3dulo contendo um par de nome/valor.
authentication.jaspi=A configura\u00E7\u00E3o de autentica\u00E7\u00E3o JASPI.
authorization=A configura\u00E7\u00E3o de autoriza\u00E7\u00E3o. Configura uma lista dos m\u00F3dulos de pol\u00EDtica de autoriza\u00E7\u00E3o.
authorization.add=Adiciona uma configura\u00E7\u00E3o de autoriza\u00E7\u00E3o
authorization.remove=Remove uma configura\u00E7\u00E3o de autoriza\u00E7\u00E3o
authorization.policy-modules=Lista os m\u00F3dulos de autoriza\u00E7\u00E3o
authorization.policy-modules.code=O nome da classe do m\u00F3dulo a ser instanciado
authorization.policy-modules.flag=O aviso controla como o m\u00F3dulo participa no procedimento em geral. Os valores permitidos s\u00E3o requisi\u00E7\u00E3o, solicita\u00E7\u00E3o, suficiente ou opcional.
authorization.policy-modules.module=O nome do M\u00F3dulo do JBoss onde o c\u00F3digo do m\u00F3dulo da pol\u00EDtica est\u00E1 localizado.
authorization.policy-modules.module-options=Lista as op\u00E7\u00F5es do m\u00F3dulo contendo o par nome/valor.
mapping=A configura\u00E7\u00E3o de mapeamento. Configura uma lista de m\u00F3dulos de mapeamentos a ser usados para o mapeamento principal, de fun\u00E7\u00E3o, atributo e credencial.
mapping.add=Adiciona a configura\u00E7\u00E3o de mapeamento.
mapping.remove=Remove a configura\u00E7\u00E3o de mapeamento.
mapping.mapping-modules=Lista os m\u00F3dulos que mapeiam a informa\u00E7\u00E3o do credencial, de fun\u00E7\u00E3o e principal
mapping.mapping-modules.code=O nome da classe do m\u00F3dulo a ser instanciado.
mapping.mapping-modules.type=Tipo de mapeamento que esse m\u00F3dulo executa. Os valores permitidos s\u00E3o principal, fun\u00E7\u00E3o, atributo ou credencial.
mapping.mapping-modules.module-options=Lista das op\u00E7\u00F5es de m\u00F3dulo contendo um par de nome/valor.
audit=Configura\u00E7\u00E3o de auditoria. Isto configura uma lista de m\u00F3dulos provedores a serem usados.
audit.add=Adiciona uma configura\u00E7\u00E3o de auditoria
audit.remove=Remove uma configura\u00E7\u00E3o de auditoria
audit.provider-modules=Lista os m\u00F3dulos do provedor
audit.provider-modules.code=O nome da classe do m\u00F3dulo a ser instanciado.
audit.provider-modules.flag=O aviso controla como o m\u00F3dulo participa no procedimento em geral. Os valores permitidos s\u00E3o requisito, solicita\u00E7\u00E3o, suficiente ou opcional.
audit.provider-modules.module=O nome do M\u00F3dulo do JBoss onde o c\u00F3digo do provedor de auditoria est\u00E1 localizado.
audit.provider-modules.module-options=Lista das op\u00E7\u00F5es do m\u00F3dulo contendo um par de nome/valor.
authentication-jaspi=A configura\u00E7\u00E3o da autentica\u00E7\u00E3o JASPI. Tanto esta ou a 'autentica\u00E7\u00E3o' devem estar presentes, por\u00E9m n\u00E3o ambas.
acl=A configura\u00E7\u00E3o da lista do controle de acesso. Isto configura uma lista de m\u00F3dulos a serem usados.
acl.add=Adiciona uma configura\u00E7\u00E3o ACL
acl.remove=Remove uma configura\u00E7\u00E3o ACL
acl.acl-modules=Lista os m\u00F3dulos acl
acl.acl-modules.code=O nome da classe do m\u00F3dulo a ser instanciado.
acl.acl-modules.flag=O aviso controla como o m\u00F3dulo participa no procedimento em geral. Os valores permitidos s\u00E3o requisito, solicita\u00E7\u00E3o, suficiente ou opcional. 
acl.acl-modules.module=O nome do M\u00F3dulo JBoss onde o c\u00F3digo do provedor acl est\u00E1 localizado. 
acl.acl-modules.module-options=Lista das op\u00E7\u00F5es do m\u00F3dulo contendo um par de nome/valor.
type=O tipo de mapeamento que esse m\u00F3dulo executa. Os valores permitidos s\u00E3o principal, fun\u00E7\u00E3o, atributo ou credencial. 
identity-trust=Configura\u00E7\u00E3o de confian\u00E7a de identidade. Configura uma lista de m\u00F3dulos a serem usados. 
identity-trust.add=Adiciona uma configura\u00E7\u00E3o de confian\u00E7a de identidade.
identity-trust.remove=Remove uma configura\u00E7\u00E3o de confian\u00E7a de identidade.
identity-trust.trust-modules=Lista os m\u00F3dulos de confian\u00E7a
identity-trust.trust-modules.code=O nome da classe do m\u00F3dulo a ser instanciado.
identity-trust.trust-modules.flag=O aviso controla como o m\u00F3dulo participa no procedimento em geral. Os valores permitidos s\u00E3o requisito, solicita\u00E7\u00E3o, suficiente ou opcional.
identity-trust.trust-modules.module=O nome do M\u00F3dulo do JBoss onde o c\u00F3digo de confian\u00E7a da identidade est\u00E1 localizado.
identity-trust.trust-modules.module-options=Lista as op\u00E7\u00F5es do m\u00F3dulo contendo o par de nome/valor.
login-module-stack=Lista dos m\u00F3dulos de logon "nomeados" que s\u00E3o usados pelos m\u00F3dulos de autentica\u00E7\u00E3o jaspi.
login-module-stack.add=Adiciona a configura\u00E7\u00E3o de pilha do m\u00F3dulo de logon.
login-module-stack.remove=Remove uma configura\u00E7\u00E3o de pilha do m\u00F3dulo de logon nomeado
login-module-stack.login-modules=Lista os m\u00F3dulos de autentica\u00E7\u00E3o
login-module-stack.login-modules.code=O nome da classe do m\u00F3dulo a ser instanciado.
login-module-stack.login-modules.flag=O aviso controla como o m\u00F3dulo participa no procedimento em geral. Os valores permitidos s\u00E3o requisito, solicita\u00E7\u00E3o, suficiente ou opcional.
login-module-stack.login-modules.module=O nome do M\u00F3dulo do JBoss onde o m\u00F3dulo do logon est\u00E1 localizado.
login-module-stack.login-modules.module-options=Lista as op\u00E7\u00F5es do m\u00F3dulo contendo um par de nome/valor.
authentication.jaspi.add=Adiciona a configura\u00E7\u00E3o de autentica\u00E7\u00E3o JASPI
authentication.jaspi.remove=Remove a configura\u00E7\u00E3o de autentica\u00E7\u00E3o JASPI
authentication.jaspi.auth-modules=Lista os m\u00F3dulos de autentica\u00E7\u00E3o a serem usados.
authentication.jaspi.auth-modules.code=O nome da classe do m\u00F3dulo a ser instanciado.
authentication.jaspi.auth-modules.module=O nome do M\u00F3dulo do JBoss onde o c\u00F3digo de autoriza\u00E7\u00E3o est\u00E1 localizado.
authentication.jaspi.auth-modules.module-options=Lista as op\u00E7\u00F5es do m\u00F3dulo contendo o par de nome/valor.
authentication.jaspi.auth-modules.login-module-stack-ref=Refer\u00EAncia ao nome da pilha do m\u00F3dulo de logon anteriormente configurado no mesmo dom\u00EDnio de seguran\u00E7a.
jsse=A configura\u00E7\u00E3o JSSE. Isto configura os atributos para os keystores que podem ser usados para montagem do SSL.
jsse.add=Adiciona a configura\u00E7\u00E3o JSSE
jsse.remove=Remove a configura\u00E7\u00E3o do JSSE.
jsse.truststore=Configura um armazenamento de confian\u00E7a JSSE
jsse.truststore.password=Determina a senha do truststore. Tanto isto quanto a 'senha keystore' devem estar presentes, do contr\u00E1rio o dom\u00EDnio de seguran\u00E7a ser\u00E1 in\u00FAtil.
jsse.truststore.type=O tipo de truststore. O padr\u00E3o ser\u00E1 'JKS', caso n\u00E3o determinado.
jsse.truststore.url=O URL do truststore.
jsse.truststore.provider=O nome da classe provedora a ser usada quando criando o truststore.
jsse.truststore.provider-argument=O argumento a ser passado ao construtor Provedor do truststore no ato de sua instala\u00E7\u00E3o.
jsse.keystore=Configura o armazenamento de chave JSSE
jsse.keystore.password=Determina a senha do keystore. Tanto isto ou a 'senha truststore' deve estar presente. Do contr\u00E1rio, o dom\u00EDnio de seguran\u00E7a ser\u00E1 in\u00FAtil.
jsse.keystore.type=O tipo de keystore. O padr\u00E3o do tipo ser\u00E1 'JKS', caso n\u00E3o determinado.
jsse.keystore.url=O URL do keystore.
jsse.keystore.provider=O nome da classe do provedor a ser usado quando criando o KeyStore.
jsse.keystore.provider-argument=O argumento de sequ\u00EAncia a ser passado ao construtor do Provedor do keystore quando instanciando-o.
jsse.key-manager=Cria\u00E7\u00E3o do Gerenciador da Chave JSEE
jsse.key-manager.provider=O nome da classe do provedor a ser usado quando criando o KeyManagerFactory.
jsse.key-manager.algorithm=O algoritmo a ser usado na cria\u00E7\u00E3o do KeyManagerFactory.
jsse.trust-manager=Cria\u00E7\u00E3o do Gerenciador de Confian\u00E7a JSSE
jsse.trust-manager.provider=O nome da classe do Provedor a ser usado na cria\u00E7\u00E3o do TrustManagerFactory.
jsse.trust-manager.algorithm=O algoritmo a ser usado na cria\u00E7\u00E3o do TrustManagerFactory.
jsse.client-alias=O alias de uso preferido quando o KeyManager escolhe o alias do cliente. 
jsse.server-alias=O alias preferido para uso quando o KeyManager escolhe o alias do servidor.
jsse.client-auth=O atributo booliano para indicar se os certificados do cliente devem ser autenticados ao lado do servidor.
jsse.service-auth-token=O token para restaura\u00E7\u00E3o dos PrivateKeys a partir do KeyStore.
jsse.cipher-suites=Lista de v\u00EDrgula separada das su\u00EDtes de criptografia a ativarem os SSLSockets.
jsse.protocols=Lista de v\u00EDrgula separada dos protocolos a ativarem os SSLSockets.
jsse.additional-properties=As propriedades adicionais que podem ser necess\u00E1rias para configura\u00E7\u00E3o do JSSE.
list-cached-principals=Lista os principais armazenados no cache de autentica\u00E7\u00E3o para esse dom\u00EDnio de seguran\u00E7a.
flush-cache=Remove as entradas armazenadas no cache de autentica\u00E7\u00E3o para este dom\u00EDnio de seguran\u00E7a. Uma entrada \u00FAnica pode ser esvaziada pelo uso do argumento principal com o nome do usu\u00E1rio como valor. Caso nenhum argumento seja passado \u00E0 opera\u00E7\u00E3o, todas as entradas ser\u00E3o esvaziadas.
vault=O Cofre de Seguran\u00E7a para os atributos.
vault.add=Adiciona a configura\u00E7\u00E3o cofre de seguran\u00E7a
vault.remove=Remove uma configura\u00E7\u00E3o cofre de seguran\u00E7a
vault.code=O Nome inteiramente qualificado da Implementa\u00E7\u00E3o Cofre de Seguran\u00E7a
vault.options=Op\u00E7\u00F5es Cofre de Seguran\u00E7a.
