security=La configuration du sous-syst\u00E8me de s\u00E9curit\u00E9.
security.add=Ajoute le sous-syst\u00E8me s\u00E9curit\u00E9.
security.remove=Supprime le sous-syst\u00E8me s\u00E9curit\u00E9.
security.deep-copy-subject-mode=D\u00E9finit le mode de copie des sujets cr\u00E9\u00E9s par les gestionnaires de s\u00E9curit\u00E9 pour \u00EAtre des copies profondes qui font des copies des informations d'identification et sur les principaux si elles sont cl\u00F4nables. Doit \u00EAtre d\u00E9finie \u00E0 true si l'objet inclut un contenu mutable qui puisse \u00EAtre corrompu lorsque plusieurs threads ont la m\u00EAme identit\u00E9 et quand le cache vidage/deconnexion qui supprime le sujet dans un thread aboutit \u00E0 ce que les r\u00E9f\u00E9rences de sujets affectent d'autres threads.
security-domain-children=Les domaines de s\u00E9curit\u00E9.
security-domain=Configure un domaine de s\u00E9curit\u00E9. L'authentification, l'autorisation, ACL, le mappage, le trust d'identit\u00E9 et auditing sont configur\u00E9s ici.
security-domain.add=Ajoute un domaine de s\u00E9curit\u00E9
security-domain.remove=Supprime un domaine de s\u00E9curit\u00E9
security-domain.cache-type=Ajoute un cache pour am\u00E9liorer la rapidit\u00E9 des v\u00E9rifications d'authentification. Les valeurs autoris\u00E9es sont 'default' pour utiliser un mappage simple et 'infinispan' pour utiliser un cache Infinispan.
authentication=Configuration de l'authentification pour ce domaine. Peut \u00EAtre classic ou jaspi.
authentication.classic=Configuration d'authentification traditionnelle. Configure une liste de modules de connexion \u00E0 utiliser.
authentication.classic.add=Ajoute une configuration d'authentification traditionnelle
authentication.classic.remove=Supprime une configuration d'authentification traditionnelle
authentication.classic.login-modules=Liste des modules d'authentification
authentication.classic.login-modules.code=Nom de la classe du module \u00E0 instancier.
authentication.classic.login-modules.flag=\ Le drapeau contr\u00F4le comment le module participe \u00E0 la proc\u00E9dure dans son ensemble. Les valeurs permises sont obligatoires, requises, suffisantes ou optionnelles.
authentication.classic.login-modules.module=Nom du module JBoss o\u00F9 se situe le code du module de connexion.
authentication.classic.login-modules.module-options=Liste des options de module qui contiennent la paire nom/valeur.
authentication.jaspi=Configuration de l'authentification JASPI.
authorization=Configuration de l'autorisation. Configure une liste de modules de politique d'autorisation \u00E0 utiliser.
authorization.add=Ajoute une configuration d'autorisation
authorization.remove=Supprime une configuration d'autorisation
authorization.policy-modules=Liste des modules d'autorisation
authorization.policy-modules.code=Nom de la classe du module \u00E0 instancier.
authorization.policy-modules.flag=\ Le drapeau contr\u00F4le comment le module participe \u00E0 la proc\u00E9dure dans son ensemble. Les valeurs permises sont obligatoires, requises, suffisantes ou optionnelles.
authorization.policy-modules.module=Nom du module JBoss o\u00F9 se situe le code du module de connexion.
authorization.policy-modules.module-options=Liste des options de module qui contiennent la paire nom/valeur.
mapping=Configuration de mappage. Configure une liste de modules de mappage des identifiants, du principal, du r\u00F4le et des attributs.
mapping.add=Ajouter une configuration de mappage.
mapping.remove=Supprime la configuration de mappage.
mapping.mapping-modules=Liste de modules qui mappent les informations d'authentification, de principal et de r\u00F4le
mapping.mapping-modules.code=Nom de classe du module \u00E0 instancier.
mapping.mapping-modules.type=Type de mappage que ce module effectue. Les valeurs autoris\u00E9es sont principal, r\u00F4le, attribut ou authentification.
mapping.mapping-modules.module-options=Liste des options de module qui contiennent la paire nom/valeur.
audit=Configuration d'auditing. Configure une liste de modules de fournisseur \u00E0 utiliser.
audit.add=Ajoute une configuration d'auditing
audit.remove=Supprime une configuration d'audiding
audit.provider-modules=Liste des modules de fournisseur
audit.provider-modules.code=Nom de classe du module \u00E0 instancier.
audit.provider-modules.flag=\ Le drapeau contr\u00F4le comment le module participe \u00E0 la proc\u00E9dure dans son ensemble. Les valeurs permises sont obligatoires, requises, suffisantes ou optionnelles.
audit.provider-modules.module=Nom du module JBoss o\u00F9 se situe le code du module du fournisseur d'auditing.
audit.provider-modules.module-options=Liste des options de module qui contiennent une paire nom/valeur.
authentication-jaspi=Configuration de l'authentification JASPI. Soit ceci ou 'athentification' doivent \u00EAtre pr\u00E9sents, mais pas les deux.
acl=Configuration de la liste de contr\u00F4le d'acc\u00E8s. Configure une liste des modules ACL \u00E0 utiliser.
acl.add=Ajoute une configuration ACL
acl.remove=Supprime une configuration ACL
acl.acl-modules=Liste des modules acl
acl.acl-modules.code=Nom de classe du module \u00E0 instancier.
acl.acl-modules.flag=Le drapeau contr\u00F4le comment le module participe \u00E0 la proc\u00E9dure dans son ensemble. Les valeurs permises sont obligatoires, requises, suffisantes ou optionnelles.
acl.acl-modules.module=Nom du module JBoss o\u00F9 se situe le code du module du fournisseur acl.
acl.acl-modules.module-options=Liste des options de module qui contiennent une paire nom/valeur.
type=Type de mappage que ce module effectue. Les valeurs autoris\u00E9es sont principal, r\u00F4le, attribut ou authentification.
identity-trust=Configuration du trust d'identit\u00E9. Configure une liste des modules trust \u00E0 utiliser.
identity-trust.add=Ajoute une configuration de trust d'identit\u00E9.
identity-trust.remove=Supprime une configuration de trust d'identit\u00E9.
identity-trust.trust-modules=Liste des modules trust
identity-trust.trust-modules.code=Nom de classe du module \u00E0 instancier.
identity-trust.trust-modules.flag=Le drapeau contr\u00F4le comment le module participe \u00E0 la proc\u00E9dure dans son ensemble. Les valeurs permises sont obligatoires, requises, suffisantes ou optionnelles.
identity-trust.trust-modules.module=Nom du module JBoss o\u00F9 se situe le code du module de trust d'identit\u00E9.
identity-trust.trust-modules.module-options=Liste des options de module qui contiennent la paire nom/valeur.
login-module-stack=Une liste des modules de login "nomm\u00E9s" qui sont utilis\u00E9s par les modules d'authentification jaspi.
login-module-stack.add=Ajoute une configuration de pile de modules de connexion
login-module-stack.remove=Supprime une configuration de pile de modules de connexion
login-module-stack.login-modules=Liste des modules d'authentification
login-module-stack.login-modules.code=Nom de la classe du module \u00E0 instancier.
login-module-stack.login-modules.flag=Le drapeau contr\u00F4le comment le module participe \u00E0 la proc\u00E9dure dans son ensemble. Les valeurs permises sont obligatoires, requises, suffisantes ou optionnelles.
login-module-stack.login-modules.module=Nom du module JBoss o\u00F9 se situe le code du module de connexion.
login-module-stack.login-modules.module-options=Liste des options de module qui contiennent la paire nom/valeur.
authentication.jaspi.add=Ajoute une configuration de l'authentification JASPI.
authentication.jaspi.remove=Supprime une configuration de l'authentification JASPI.
authentication.jaspi.auth-modules=Liste des modules d'authentification \u00E0 utiliser.
authentication.jaspi.auth-modules.code=Nom de classe du module \u00E0 instancier.
authentication.jaspi.auth-modules.module=Nom du module JBoss o\u00F9 se situe le code du module d'auth.
authentication.jaspi.auth-modules.module-options=Liste des options de module qui contiennent la paire nom/valeur.
authentication.jaspi.auth-modules.login-module-stack-ref=R\u00E9f\u00E9rence \u00E0 un nom de pile de modules de login d\u00E9j\u00E0 configur\u00E9 dans le domaine de s\u00E9curit\u00E9.
jsse=Configuration JSSE. Configure des attributs pour les keystores qui peuvent \u00EAtre utilis\u00E9s pour installer SSL.
jsse.add=Ajoute une configuration JSSE
jsse.remove=Supprime une configuration JSSE
jsse.truststore=Configure un trust store JSSE
jsse.truststore.password=D\u00E9finit le mot de passe du truststore. Soit ceci, soit 'keystore-password' doit \u00EAtre pr\u00E9sent, sinon le domaine de s\u00E9curit\u00E9 ne sera pas utile.
jsse.truststore.type=Type de truststore. Si non d\u00E9fini, la valeur par d\u00E9faut sera 'JKS'
jsse.truststore.url=URL du trustore
jsse.truststore.provider=Nom de la classe du fournisseur \u00E0 utiliser quand on cr\u00E9e un truststore.
jsse.truststore.provider-argument=Argument de cha\u00EEne \u00E0 passer au constructeur du fournisseur du truststore quand on l'instancie.
jsse.keystore=Configure un keystore JSSE
jsse.keystore.password=D\u00E9finit le mot de passe du keystore. Soit ceci, soit 'truststore-password' doit \u00EAtre pr\u00E9sent, sinon le domaine de s\u00E9curit\u00E9 ne sera pas utile.
jsse.keystore.type=Type de keystore. Si non d\u00E9fini, le type aura comme valeur par d\u00E9faut 'JKS'.
jsse.keystore.url=URL du keystore.
jsse.keystore.provider=Nom de classe du fournisseur \u00E0 utiliser quand on cr\u00E9e le KeyStore.
jsse.keystore.provider-argument=Argument de cha\u00EEne \u00E0 passer au constructeur du fournisseur du keystore quand on l'instancie.
jsse.key-manager=Fabrique JSEE Key Manager
jsse.key-manager.provider=Nom de classe de fournisseur \u00E0 utiliser quand on cr\u00E9e la KeyManagerFactory.
jsse.key-manager.algorithm=L'algorithme \u00E0 utiliser quand on cr\u00E9e le KeyManagerFactory.
jsse.trust-manager=Fabrique JSEE Trust Manager
jsse.trust-manager.provider=Nom de classe de fournisseur \u00E0 utiliser quand on cr\u00E9e la TrustManagerFactory.
jsse.trust-manager.algorithm=L'algorithme \u00E0 utiliser quand on cr\u00E9e la TrustManagerFactory.
jsse.client-alias=Alias pr\u00E9f\u00E9r\u00E9 \u00E0 utiliser quand le KeyManager choisit l'alias du client.
jsse.server-alias=Alias pr\u00E9f\u00E9r\u00E9 \u00E0 utiliser quand le KeyManager choisit l'alias du serveur.
jsse.client-auth=Attribut bool\u00E9en \u00E0 indiquer si les certificats du client doivent \u00E9galement \u00EAtre authentifi\u00E9s du c\u00F4t\u00E9 serveur.
jsse.service-auth-token=Token pour retirer les PrivateKeys du KeyStore.
jsse.cipher-suites=Liste s\u00E9par\u00E9e par de virgules de suites cipher qui autorisent les SSLSockets.
jsse.protocols=Liste s\u00E9par\u00E9e par de virgules de protocoles qui autorisent les SSLSockets.
jsse.additional-properties=Propri\u00E9t\u00E9s suppl\u00E9mentaires qui sont sans doute n\u00E9cessaires pour configurer JSSE.
list-cached-principals=Liste les principaux stock\u00E9s dans le cache d'authentification pour ce domaine de s\u00E9curit\u00E9.
flush-cache=Supprimer des entr\u00E9es stock\u00E9es dans le cache d'authentification pour ce domaine de la s\u00E9curit\u00E9. Une entr\u00E9e simple peut \u00EAtre vid\u00E9e en utilisant l'argument principal avec le nom d'utilisateur comme valeur. Si aucun argument n'est pass\u00E9 \u00E0 l'op\u00E9ration, toutes les entr\u00E9es seront vid\u00E9es.
vault=Security Vault pour les attributs.
vault.add=Ajoute une configuration de Security Vault
vault.remove=Supprime une configuration de Security Vault
vault.code=Nom complet de l'impl\u00E9mentation du Security Vault.
vault.options=Options du Security Vault.
