web=A configura\u00E7\u00E3o do sub-sistema do jboss.web.
web.add=A opera\u00E7\u00E3o adicionando o sub-sistema da web.
web.default-virtual-server=O servidor virtual padr\u00E3o do recipiente da web.
web.instance-id=Determina o identificador para essa inst\u00E2ncia do servidor.
web.native=Adiciona o ouvinte da inicializa\u00E7\u00E3o nativa ao recipiente da web.
web.remove=A opera\u00E7\u00E3o removendo o sub-sistema da web.
web.container=A configura\u00E7\u00E3o do recipiente comum.
web.container.add=Adiciona o recipiente da web 
web.container.remove=Remove o recipiente da web
web.container.welcome-file=Uma declara\u00E7\u00E3o do arquivo de boas vindas.
web.container.welcome-file.welcome-file=Uma declara\u00E7\u00E3o de boas vindas.
web.container.mime-mapping=Uma defini\u00E7\u00E3o do mime-mapping.
web.container.mime-mapping.mime-mapping=Uma defini\u00E7\u00E3o do mime-mapping.
web.container.mime-mapping.add-mime=Adiciona o tipo do mime.
web.container.mime-mapping.add-mime.name=O nome do mime-mapping.
web.container.mime-mapping.add-mime.value=O valor do mime-mapping.
web.container.mime-mapping.remove-mime=Remove o tipo do mime
web.container.mime-mapping.remove-mime.name=O nome do mime-mapping.
web.configuration.welcome-file=Uma declara\u00E7\u00E3o de boas vindas.
web.configuration=A configura\u00E7\u00E3o do recipiente da web comum.
web.configuration.container=A sub-configura\u00E7\u00E3o do recipiente da web de gerenciamento do arquivo de boas vindas e do mime-mapping.
web.configuration.static=A configura\u00E7\u00E3o do servi\u00E7o dos arquivos de estat\u00EDsticas.
web.configuration.static.add=Adiciona a configura\u00E7\u00E3o de estat\u00EDstica
web.configuration.static.remove=Remove a configura\u00E7\u00E3o de estat\u00EDstica
web.configuration.static.listings=Ativa as listagens da pasta.
web.configuration.static.sendfile=Ativa o sendfile caso poss\u00EDvel, para arquivos maiores que o tamanho byte espec\u00EDfico.
web.configuration.static.file-encoding=For\u00E7a a codifica\u00E7\u00E3o do arquivo.
web.configuration.static.read-only=Permite a grava\u00E7\u00E3o dos m\u00E9todos HTTP (INSERIR, DELETAR).
web.configuration.static.webdav=Ativa a funcionalidade WebDAV.
web.configuration.static.secret=Segredo para as opera\u00E7\u00F5es de bloqueamento WebDAV.
web.configuration.static.max-depth=A recurs\u00E3o para PROPFIND.
web.configuration.static.disabled=Destiva o mapeamento Servlet padr\u00E3o.
web.configuration.jsp.add=Adiciona a configura\u00E7\u00E3o do recipiente JSP.
web.configuration.jsp.remove=Remove a configura\u00E7\u00E3o do recipiente JSP.
web.configuration.jsp=A configura\u00E7\u00E3o do recipiente JSP.
web.configuration.jsp.development=Ativa o modo de desenvolvimento, que gera mais informa\u00E7\u00E3o quando um erro ocorrer.
web.configuration.jsp.disabled=Ativa o recipiente JSP.
web.configuration.jsp.keep-generated=Mant\u00E9m os Servlets gerados.
web.configuration.jsp.trim-spaces=Corta alguns espa\u00E7os do Servlet gerado.
web.configuration.jsp.tag-pooling=Ativa o pooling da etiqueta.
web.configuration.jsp.mapped-file=Mapeia a fonte JSP.
web.configuration.jsp.check-interval=Checa o intervalo para atualiza\u00E7\u00F5es JSP usando um thread de fundo.
web.configuration.jsp.modification-test-interval=A quantia m\u00EDnima de tempo entre dois testes para atualiza\u00E7\u00F5es, em segundos.
web.configuration.jsp.recompile-on-fail=Tenta novamente as compila\u00E7\u00F5es JSO com falha em cada solicita\u00E7\u00E3o.
web.configuration.jsp.smap=Ativa o SMAP.
web.configuration.jsp.dump-smap=Grava os dados SMAP a um arquivo.
web.configuration.jsp.generate-strings-as-char-arrays=Gera as constantes da Sequ\u00EAncia como arrays char.
web.configuration.jsp.error-on-use-bean-invalid-class-attribute=Ativa erros quando usando uma classe ruim no useBean.
web.configuration.jsp.scratch-dir=Especifica um diret\u00F3rio de trabalho diferente.
web.configuration.jsp.source-vm=O n\u00EDvel VM da fonte para compila\u00E7\u00E3o.
web.configuration.jsp.target-vm=O n\u00EDvel VM do destino para compila\u00E7\u00E3o.
web.configuration.jsp.java-encoding=Especifica a codifica\u00E7\u00E3o usada para fontes do Java.
web.configuration.jsp.x-powered-by=Ativa a propaganda da m\u00E1quina JSP no x-powered-by.
web.configuration.jsp.display-source-fragment=Quando um erro do per\u00EDodo de rodagem ocorre, h\u00E1 uma tentativa em exibir o fragmento da fonte JSP correspondente.
web.connector=Um conector da web.
web.connector.add=Adiciona um novo conector da web.
web.connector.remove=Remove um conector da web existente.
web.connector.name=Um nome \u00FAnico para o conector.
web.connector.protocol=O protocolo do conector.
web.connector.scheme=O esquema do conector da web.
web.connector.socket-binding=A refer\u00EAncia do socket-binding do conector, esse conector deve ser vinculado.
web.connector.enabled=Define se \u00E9 que o conector deve ser iniciado na inicializa\u00E7\u00E3o. 
web.connector.executor=O nome do executor que deve ser usado para os threads de processamento desse conector. Caso indefinido, ele padroniza para o uso de um pool interno.
web.connector.enable-lookups=Ativa as observa\u00E7\u00F5es DNS para o API do Servlet.
web.connector.proxy-name=O nome do host que ser\u00E1 usado quando enviando uma redire\u00E7\u00E3o. O valor padr\u00E3o \u00E9 nulo.
web.connector.proxy-port=A porta que ser\u00E1 usada quando enviando uma redire\u00E7\u00E3o.
web.connector.max-post-size=O tamanho m\u00E1ximo em bytes de uma solicita\u00E7\u00E3o de ENVIO que pode ser pesquisada pelo recipiente.
web.connector.max-save-post-size=O tamanho m\u00E1ximo em bytes que uma solicita\u00E7\u00E3o de ENVIO que ser\u00E1 salva durante certos esquemas de autentica\u00E7\u00E3o.
web.connector.secure=Indica se o conte\u00FAdo enviado ou recebido pelo conector \u00E9 enviado a partir da perspectiva do usu\u00E1rio.
web.connector.redirect-port=A porta para redirecionamento a um conector de seguran\u00E7a.
web.connector.max-connections=Quantia das conex\u00F5es atuais que podem ser processadas pelo conector com um desempenho otimizado.
web.connector.virtual-server=A lista de servidores virtuais que podem ser acessados atrav\u00E9s desse conector. O padr\u00E3o \u00E9 permitir todos os servidores virtuais.
web.connector.bytesSent=O n\u00FAmero de bites enviados pelo conector.
web.connector.bytesReceived=O n\u00FAmero de bites recebidos pelo conector (dados ENVIADOS).
web.connector.processingTime=O per\u00EDodo de processamento usado pelo conector. Em mil\u00E9simos de segundos.
web.connector.errorCount=O n\u00FAmero de erros que ocorrem quando processando solicita\u00E7\u00F5es pelo conector.
web.connector.maxTime=O per\u00EDodo m\u00E1ximo usado para processar solicita\u00E7\u00F5es.
web.connector.requestCount=O n\u00FAmero de solicita\u00E7\u00F5es processadas pelo conector.
web.connector.configuration=V\u00E1rias configura\u00E7\u00F5es adicionais
web.connector.ssl=A configura\u00E7\u00E3o SSL do conector.
web.connector.ssl.add=Adiciona a configura\u00E7\u00E3o SSL do conector.
web.connector.ssl.remove=Remove a configura\u00E7\u00E3o SSL do conector.
web.connector.ssl.name=O nome da configura\u00E7\u00E3o.
web.connector.ssl.key-alias=O alias da chave.
web.connector.ssl.password=Senha.
web.connector.ssl.certificate-key-file=O arquivo da chave para o certificado.
web.connector.ssl.cipher-suite=A su\u00EDte de criptografia permitida.
web.connector.ssl.protocol=Os protocolos SSL que est\u00E3o ativados.
web.connector.ssl.verify-client=Ativa a verifica\u00E7\u00E3o do certificado do cliente.
web.connector.ssl.verify-depth=Limita a aninhamento do certificado.
web.connector.ssl.certificate-file=Arquivo do certificado do servidor.
web.connector.ssl.ca-certificate-file=Autoridade do certificado.
web.connector.ssl.ca-certificate-password=Senha do certificado.
web.connector.ssl.ca-revocation-url=Lista de revoca\u00E7\u00E3o de autoridade de certificado.
web.connector.ssl.session-cache-size=Cache de sess\u00E3o SSL.
web.connector.ssl.session-timeout=Intervalo de cache de sess\u00E3o SSL.
web.connector.ssl.truststore-type=Tipo do truststore, existem v\u00E1rios tipos de keystores dispon\u00EDveis, incluindo "PKCS12" e "JKS" do Sun.
web.connector.ssl.keystore-type=Tipo de keystore, existem v\u00E1rios tipos de keystores dispon\u00EDveis, incluindo "PKCS12" e "JKS" do Sun.
web.virtual-server=Um host virtual.
web.virtual-server.add=Adiciona um novo servidor virtual.
web.virtual-server.remove=Remove um servidor virtual existente
web.virtual-server.name=Um nome de host virtual \u00FAnico
web.virtual-server.alias=Os aliases do servidor virtual
web.virtual-server.alias.alias=O alias do servidor virtual
web.virtual-server.default-web-module=O nome da implanta\u00E7\u00E3o do m\u00F3dulo da web que ser\u00E1 mapeado como o webapp da raiz.
web.virtual-server.enable-welcome-root=Se \u00E9 que o diret\u00F3rio de boas vindas vinculado \u00E9 usado como o contexto web da raiz.
web.virtual-server.configuration=configura\u00E7\u00E3o do servidor virtual
web.virtual-server.access-log=A configura\u00E7\u00E3o do log de acesso para esse servidor virtual.
web.virtual-server.access-log.add=Adiciona acesso \u00E0 configura\u00E7\u00E3o de log para esse servidor virtual.
web.virtual-server.access-log.remove=Remove o acesso da configura\u00E7\u00E3o de log deste servidor. 
web.virtual-server.access-log.pattern=O acesso padr\u00E3o de log.
web.virtual-server.access-log.resolve-hosts=Resolu\u00E7\u00E3o do host.
web.virtual-server.access-log.extended=Ativa o padr\u00E3o estendido, com maiores op\u00E7\u00F5es.
web.virtual-server.access-log.prefix=O prefixo para o nome do arquivo de log.
web.virtual-server.access-log.rotate=Roteia o log de acesso diariamente.
web.virtual-server.access-log.setting=Configura\u00E7\u00F5es para acesso ao log
web.virtual-server.access-log.directory=A localiza\u00E7\u00E3o para acesso ao registro de log.
web.virtual-server.access-log.directory.add=Adiciona o diret\u00F3rio
web.virtual-server.access-log.directory.remove=Remove o diret\u00F3rio
web.virtual-server.access-log.directory.path=O caminho da pasta relativa.
web.virtual-server.access-log.directory.relative-to=A pasta do caminho \u00E9 relativo.
web.virtual-server.rewrite=A lista das regras de regrava\u00E7\u00E3o que ser\u00E3o processadas em ordem no URL ou no vhost especificado na solicita\u00E7\u00E3o. 
web.virtual-server.rewrite.add=Adiciona a regra \u00E0 lista das regras de regrava\u00E7\u00E3o.
web.virtual-server.rewrite.remove=Remove a regra da lista das regras de regrava\u00E7\u00E3o.
web.virtual-server.rewrite.pattern=O padr\u00E3o que ser\u00E1 combinado.
web.virtual-server.rewrite.substitution=A sequ\u00EAncia que substituir\u00E1 o URL original ou o vhost.
web.virtual-server.rewrite.flags=Avisos de op\u00E7\u00E3o para a regra de regrava\u00E7\u00E3o.
web.virtual-server.rewrite.condition=A lista de condi\u00E7\u00F5es que esta regra precisa para combinar com o objetivo de que a regrava\u00E7\u00E3o aconte\u00E7a.
web.virtual-server.rewrite.condition.add=Adiciona uma condi\u00E7\u00E3o \u00E0 lista de condi\u00E7\u00F5es da regra.
web.virtual-server.rewrite.condition.remove=Remove uma condi\u00E7\u00E3o da lista de condi\u00E7\u00F5es da regra.
web.virtual-server.rewrite.condition.test=Padr\u00E3o do teste para a condi\u00E7\u00E3o.
web.virtual-server.rewrite.condition.pattern=O padr\u00E3o para combina\u00E7\u00E3o.
web.virtual-server.rewrite.condition.flags=Avisos de op\u00E7\u00F5es para essa condi\u00E7\u00E3o.
web.virtual-server.sso=A configura\u00E7\u00E3o SSO para esse servidor virtual.
web.virtual-server.sso.add=Adiciona a configura\u00E7\u00E3o SSP para esse servidor.
web.virtual-server.sso.remove=Apaga a configura\u00E7\u00E3o SSO do servidor virtual.
web.virtual-server.sso.cache-container=Ativa o SSO com cluster usando o recipiente do cache com cluster especificado.
web.virtual-server.sso.cache-name=O nome do cache em uso no recipiente do cache.
web.virtual-server.sso.domain=O dom\u00EDnio da cookie que ser\u00E1 usado.
web.virtual-server.sso.reauthenticate=Ativa a reautentica\u00E7\u00E3o com o realm quando usando o SSO.
web.deployment=Os recursos do per\u00EDodo de rodagem expostos pelos componentes da web na implanta\u00E7\u00E3o.
web.servlet=Os recursos do per\u00EDodo de rodagem expostos pelos componentes na implanta\u00E7\u00E3o.
web.deployment.servlet=A informa\u00E7\u00E3o do per\u00EDodo de rodagem sobre os servlets na implanta\u00E7\u00E3o.
web.deployment.servlet.load-time=Per\u00EDodo de carregamento
web.deployment.servlet.maxTime=O per\u00EDodo de processamento m\u00E1ximo de uma solicita\u00E7\u00E3o
web.deployment.servlet.min-time=O per\u00EDodo de processamento m\u00EDnimo de uma solicita\u00E7\u00E3o
web.deployment.servlet.processingTime=O per\u00EDodo de execu\u00E7\u00E3o total do m\u00E9todo do servi\u00E7o do servlet
web.deployment.servlet.requestCount=O n\u00FAmero de solicita\u00E7\u00F5es processadas por esse servlet
